[{"version_id":"815326212","version_name":"1.0.4630","version_date":"2015-12-15 21:57:34.000 +0800","version_description":"- Fixed a critical bug with subscription process"},{"version_id":"815868639","version_name":"1.0.4752","version_date":"2016-02-23 05:01:08.000 +0800","version_description":"- Fixes for various minor uncommon bugs.<br>- New writer, Felicity Banks, winner of the 2015 Windhammer Prize for interactive fiction, has joined the team!<br><br>If you're enjoying Choices, please consider leaving us a rating and/or review on the App Store. If you've rated or reviewed us in the past, we would love it if you would consider resubmitting it, as ratings are reset with each new update. Thank you very much for your support. We really appreciated it!"},{"version_id":"817634197","version_name":"1.0.5349","version_date":"2016-06-04 07:07:07.000 +0800","version_description":"- Fix for the book update bug<br>- A major update is coming to Choices very soon, with a brand new story!"},{"version_id":"817654873","version_name":"2.0.5419","version_date":"2016-06-16 20:50:22.000 +0800","version_description":"- CHOICES is now a Hub app for multiple stories, with a new adventure coming in Fall 2016! More to follow...<br>- Fixed bug in Apple Watch, and lowered required Watch OS version to 2.0, if using Moti on Apple Watch<br><br>If you're enjoying Choices, please consider leaving us a rating and/or review on the App Store. If you've rated or reviewed us in the past, we would love it if you would consider resubmitting it, as ratings are reset with each new update. Thank you very much for your support. We really appreciated it!"},{"version_id":"818051940","version_name":"2.0.5636","version_date":"2016-07-12 02:23:36.000 +0800","version_description":"**New**<br>- Optimized the app for lower end devices, which should fix the launch crashes<br>- Optimized Apple Watch companion Moti app - animations are now silky smooth<br>- Fixed many of the random crashes on both iPhone and Apple Watch<br><br>**Previous update**<br>- CHOICES is now a Hub app for multiple stories, with a new adventure coming in Fall 2016! More to follow...<br>- Fixed bug in Apple Watch, and lowered required Watch OS version to 2.0, if using Moti on Apple Watch"},{"version_id":"818632855","version_name":"2.0.6059","version_date":"2016-08-31 01:01:41.000 +0800","version_description":"INTRODUCING A BRAND NEW ADVENTURE: And Their Souls Were Eaten!<br><br>You have a gift. With your gift, the dead are never truly gone.<br><br>But what if there is a dark side to your gift? What if there are those who can pervert your talent, and alter the balance of life and death?<br><br>Travel across a steampunk 1830s Europe, where metal is magical, giving powers to those who wear it. Learn more about your ancient gift and what it means for you, your family, and humanity. Uncover the nefarious plot to destroy all life... and fight against time to stop your enemy from destroying everything you hold dear."},{"version_id":"818871665","version_name":"2.0.6145","version_date":"2016-09-16 06:05:08.000 +0800","version_description":"NEW<br>- Tapping on push notifications will now launch the relevant story automatically.<br>- Ability to turn automated Cloud Sync (with iCloud) on or off from \"Main Menu &gt; Options &gt; Cloud Save Settings\". It is set to \"on\" by default.<br>- Some under-the-hood optimizations.<br><br>Did you enjoy CHOICES? Please consider leaving us a rating or review, even if you have already done so in the previous version. Every little bit helps. Thank you and I hope you continue to enjoy CHOICES!"},{"version_id":"822794970","version_name":"3.0.6940","version_date":"2017-07-08 05:43:36.000 +0800","version_description":"Large, juicy update with lots of bug fixes and shiny things!<br>- Main Menu interface revamped... for the better<br>- Cloud saves are now a lot more stable and intuitive to use (tip: if you turn auto-sync off, you can use this as a save slot...)<br>- Play the game for free with free choice tickets every 3 hours and with video ads!<br>- ADVENTURE 3 is only a week from launch!"},{"version_id":"822840286","version_name":"3.0.6956","version_date":"2017-07-15 03:41:02.000 +0800","version_description":"ADVENTURE 3 is now launched, Choices: And Their Heroes Were Lost:<br><br>You wake up in a dirty prison cell with no memory of who you are. And, you're not alone. Who are the other prisoners? What are they to you? Are they your allies... or enemies?<br><br>Will you escape? Try to find out who you are? Why did the people who captured you steal your memories—instead of just killing you? Travel the world as you uncover the details of a past that holds many secrets, and a future that is in peril.<br><br>----<br><br>PREVIOUS UPDATE:<br>Large, juicy update with lots of bug fixes and shiny things!<br>- Main Menu interface revamped... for the better<br>- Cloud saves are now a lot more stable and intuitive to use (tip: if you turn auto-sync off, you can use this as a save slot...)<br>- Play the game for free with free choice tickets every 3 hours and with video ads!"},{"version_id":"822994867","version_name":"3.1.6970","version_date":"2017-07-26 01:40:31.000 +0800","version_description":"ADVENTURE 2 is now complete! To celebrate, we added a new feature:<br>- Players can now rewind the story one ARC at a time, from \"Settings -&gt; Save / Load\"<br><br>PREVIOUS UPDATE<br>- ADVENTURE 3, \"Choices: And Their Heroes Were Lost\" is launched!!<br>- Updates and bug fixes to cloud saves and settings panel, and added a choice ticket system supported by video ads for non-subscribers<br><br>If you enjoyed CHOICES, please consider leaving us a review or rating! Every little bit helps."},{"version_id":"825335868","version_name":"3.2.7128","version_date":"2017-12-18 00:39:52.000 +0800","version_description":"- ARC 5, Week 1 of And Their Heroes Were Lost released<br>- Dramatically improved first load time of each story<br>- Shinier icon<br><br>p.s. existing players may experience a one-time 4-5 seconds of \"migration\" when you load a story in this update<br><br>Please send us an email at choices@tinmangames.com.au if you still encounter issues... we're very keen on ironing out these issues over the next few updates!"},{"version_id":"830759478","version_name":"4.0.8002","version_date":"","version_description":""},{"version_id":"838254467","version_name":"4.0.8005","version_date":"","version_description":""},{"version_id":"843029149","version_name":"4.1.8113","version_date":"","version_description":""}]