[{"version_id":"812860248","version_name":"1.0","version_date":"2015-11-05 23:01:02.000 +0800","version_description":""},{"version_id":"816931912","version_name":"1.1","version_date":"2016-04-02 18:56:28.000 +0800","version_description":"- iPad support<br>- Auto-correct and auto-capitalization<br>- CAPS LOCK<br>- Fixes landscape mode for iPhone<br>- Improved speed and results<br><br>Comments and feedback to hello@hemingboard.com<br><br>\"Never pontificate. Always pun-tificate.\"<br>-Ernest's Hemingboard"},{"version_id":"816978436","version_name":"1.2","version_date":"2016-04-14 06:10:08.000 +0800","version_description":"Big performance and bug fixes in this version, as well as:<br>- iPad Pro support<br>- iPad split keyboard support<br>- UI polish for both iPhone and iPad<br>- Improved auto-capitalization<br><br>Other Improvements:<br>- Don't autocapitalize URL fields<br>- Faster keyboard loading<br>- Correct size for \"zoomed\" apps<br>- Better Hemingboard word replacement<br>- Fixed iPad share button<br><br>Tell us your bugs, new feature requests, and terrible puns at:<br>hello@hemingboard.com"},{"version_id":"817082733","version_name":"1.3","version_date":"2016-04-21 15:03:32.000 +0800","version_description":"- Added \".\" shortcut (double tap space)<br>- Screen for \"No Results\"<br>- Keyboards for Twitter/Instagram, URLs, and E-mail<br><br>*We're finalizing better bluetooth keyboard compatibility and will deliver it in the next version!*<br><br>Got a terrific suggestion or terrible pun?<br>Send them to hello@hemingboard.com."},{"version_id":"817146086","version_name":"1.4","version_date":"2016-04-25 23:57:45.000 +0800","version_description":"\"If Apple designed a literary Swiss Army knife, it would be Hemingboard.\"<br>- maxcboston<br><br>Thanks to your most stellar reviews,<br>We're happy to bring you Character Previews,<br>And did we mention, QuickType is here!<br>History will remember two: you and Shakespeare.<br><br>Other Updates:<br>- \"Minimize Mode\" for Bluetooth and Smart Keyboard users <br>- iPad Pro settings button fix<br>- Deleting an uppercase character now enables shift (thanks Jorg!)<br>- Autocorrect on word with punctuation in front of it now replaces it correctly<br><br>We'll continue to improve the QuickType/Predictive with forthcoming updates.<br><br>Send us your terrific ideas or terrible puns at hello@hemingboard.com"},{"version_id":"817279851","version_name":"1.5","version_date":"2016-05-15 21:24:11.000 +0800","version_description":"We're proud to deliver an outstanding update to the smartest keyboard for iPhone and iPad.<br>NEW: Force Touch to move cursor<br>NEW: Tap and hold a Hemingboard result for definitions<br>PERFORMANCE: 700% faster QuickType and Predictive (seriously!)<br>NEW: Rearrange Result Types (Rhymes before Puns, etc)<br>NEW: Learn your words by tapping on it in QuickType<br>NEW: Don’t autocorrect names of friends and contacts<br>ENHANCEMENT: Larger result text for iPads<br>NEW: Hold “Globe” button for settings<br>ENHANCEMENT: Disable QuickType for email and URL fields<br>ENHANCEMENT: Hide Hemingboard button on email and URL fields<br>ENHANCEMENT: Faster, more responsive typing<br>ENHANCEMENT: Dramatically better autocorrect on contractions (I’ll, She’s, Where’s, etc)<br>ENHANCEMENT: Hyphenated words search<br>ENHANCEMENT: Refreshed main app (check it out!) and onboarding<br>BUGFIX: No longer attempts to autocorrect on address fields<br>BUGFIX: Twitter/Instagram fields should have autocorrect<br>BUGFIX: Auto-capitalization in Facebook Messenger<br>BUGFIX: Tapping return should reset auto-capitalization<br>BUGFIX: Tapping return should reset QuickType suggestions<br>BUGFIX: Should auto-capitalize when moving cursor to a blank line<br>BUGFIX: Should auto-capitalize on starting a sentence with double quotes<br>BUGFIX: Should unshift after using QuickType as first word<br>BUGFIX: Eliminate duplicate results<br>OTHER: New, sleeker icon<br>OTHER: Less Jarring “back” button<br><br>Our new features, enhancements, and fixes are not possible without your feedback -- thank you.<br>Keep writing us at hello@hemingboard.com!"},{"version_id":"817409685","version_name":"1.6","version_date":"2016-05-24 20:08:04.000 +0800","version_description":"Adds rhymes, puns, and synonyms to your keyboard with Hemingboard. <br><br>- NEW: Dark keyboard mode<br>- ENHANCEMENT: Always show QuickType bar when QuickType is enabled<br>- ENHANCEMENT: Detect when text cursor is not on a word<br>- BUGFIX: Sometimes a word would fail to be detected on Pages for iPad"},{"version_id":"817655541","version_name":"1.7","version_date":"2016-06-07 16:31:38.000 +0800","version_description":"- Significantly Faster Typing<br>- Dark Keyboard - Settings Toggle<br>- Refreshed Interface for Definitions<br>- Autocorrect &amp; autocapitalization Improvements"},{"version_id":"817696101","version_name":"1.8","version_date":"2016-06-10 17:58:23.000 +0800","version_description":"- ENHANCEMENT: Hold backspace longer to delete words<br>- ENHANCEMENT: Darker background on dark theme’s QuickType<br>- ENHANCEMENT: More responsive QuickType<br>- BUGFIX: QuickType wasn't resetting when text was cleared"},{"version_id":"817885854","version_name":"1.9","version_date":"2016-06-27 23:22:27.000 +0800","version_description":"- NEW FEATURE: Rhymes are separated out into “Top Rhymes” and “Rhymes” - easily see the best rhymes<br>- NEW FEATURE: Definitions in your language. If your device is Korean, Japanese, or Chinese, you’ll see definitions in your native language. More languages coming soon.<br>- ENHANCEMENT: Rhymes - Removed obscure words for easier browsing<br>- ENHANCEMENT: Rhymes - Dramatically better rhyme detection<br>- BUGFIX: Keyboard would sometimes switch back to stock keyboard<br><br>Other Changes<br>- BUGFIX: Show instructions for Smart Keyboard on iPad Pro 9.7”<br>- BUGFIX: iPhone 6+ keys were a bit different from the stock keyboard<br>- BUGFIX: Number and symbol keys background colors were wrong<br>- BUGFIX: QuickType - better word recognition"},{"version_id":"817960939","version_name":"2.0","version_date":"2016-06-30 23:44:02.000 +0800","version_description":"- NEW FEATURE: Rhymes are separated out into “Top Rhymes” and “Rhymes” - easily see the best rhymes<br>- NEW FEATURE: Definitions in your language. If your device is Korean, Japanese, or Chinese, you’ll see definitions in your native language. More languages coming soon.<br>- ENHANCEMENT: Rhymes - Removed obscure words for easier browsing<br>- ENHANCEMENT: Rhymes - Dramatically better rhyme detection<br>- BUGFIX: Keyboard would sometimes switch back to stock keyboard<br>- BUGFIX: QuickType would sometimes not work<br><br>Other Changes<br>- BUGFIX: Show instructions for Smart Keyboard on iPad Pro 9.7”<br>- BUGFIX: iPhone 6+ keys were a bit different from the stock keyboard<br>- BUGFIX: Number and symbol keys background colors were wrong<br>- BUGFIX: QuickType - better word recognition"},{"version_id":"818161096","version_name":"2.1","version_date":"2016-07-19 22:02:33.000 +0800","version_description":"- NEW: Antonyms - The same Hemingboard results you love, now with antonyms.<br>- NEW: Dark Theme Results - When Dark Theme is activated, results now have a dark theme.<br>- ENHANCEMENT: More Synonyms - Enhanced synonym results for thousands of words.<br>- ENHANCEMENT: Safe for Schools - Explicit and curse words are now filtered out from results.<br><br>hello@hemingboard.com"},{"version_id":"818315027","version_name":"2.2","version_date":"2016-08-17 00:57:58.000 +0800","version_description":"NEW FEATURE: Accents &amp; Diacritical Marks. Tap and hold a letter to activate<br>ENHANCEMENT: Force Touch to move cursor now fades the keyboard out<br>ENHANCEMENT: More antonyms, remove duplicates<br>FIX: Fixed lowercase key sizes and positions<br>FIX: Fixed a bug where a key may not register after exiting force touch<br>FIX: Fixed a bug where double spacing after exclamation mark added a period <br><br>COMING SOON: Support for new languages<br><br>Feedback - hello@hemingboard.com"},{"version_id":"825522782","version_name":"2.2","version_date":"2016-08-17 00:57:58.000 +0800","version_description":"NEW FEATURE: Accents &amp; Diacritical Marks. Tap and hold a letter to activate<br>ENHANCEMENT: Force Touch to move cursor now fades the keyboard out<br>ENHANCEMENT: More antonyms, remove duplicates<br>FIX: Fixed lowercase key sizes and positions<br>FIX: Fixed a bug where a key may not register after exiting force touch<br>FIX: Fixed a bug where double spacing after exclamation mark added a period <br><br>COMING SOON: Support for new languages<br><br>Feedback - hello@hemingboard.com"},{"version_id":"825522784","version_name":"2.3","version_date":"2018-06-08 19:12:24.000 +0800","version_description":"This app has been updated by Apple to use the latest Apple signing certificate.<br><br>Thanks for using Hemingboard! We update our app regularly for you to enjoy our features and improvements!<br><br>What’s New:<br><br>• Updated icons<br>• Minor UI Fixes"}]