[{"version_id":"815406275","version_name":"1.0.2","version_date":"2015-12-18 01:39:59.000 +0800","version_description":"- Redesigned recommend screen.<br>- Ability to search for friends in the friends list.<br>- See your friends' reviews on their seen list.<br><br>App Store reviews are very helpful to us. If you think Reelgood is real good, please leave us a review!"},{"version_id":"816084227","version_name":"1.1","version_date":"2016-01-21 03:49:59.000 +0800","version_description":"- Leave movie reviews from discover screen.<br>- New big shiny buttons.<br><br>App Store reviews are very helpful to us. If you think Reelgood is real good, please leave us a review!"},{"version_id":"816300676","version_name":"1.2","version_date":"2016-02-03 03:29:59.000 +0800","version_description":"- Easier to invite friends to Reelgood.<br>- Easier to share movies with friends.<br><br>App Store reviews are very helpful to us. If you think Reelgood is real good, please leave us a review!"},{"version_id":"816385000","version_name":"1.3","version_date":"2016-02-10 23:56:06.000 +0800","version_description":"- Tap to watch movies on your phone<br>- Pricing to buy or rent movies<br><br>App Store reviews are very helpful to us. If you think Reelgood is real good, please leave us a review!"},{"version_id":"816460250","version_name":"1.4","version_date":"2016-03-02 16:34:06.000 +0800","version_description":"- Like your friends' reviews<br>- Swipe left to change movies on your watchlist<br>- New design throughout the app<br><br>App Store reviews are very helpful to us. If you think Reelgood is real good, please leave us a review!"},{"version_id":"816740651","version_name":"1.5","version_date":"2016-03-22 23:57:41.000 +0800","version_description":"Improvements for Streaming Sources<br>Improvements for Accessibility"},{"version_id":"817337723","version_name":"2.0","version_date":"","version_description":""},{"version_id":"817364223","version_name":"2.0.2","version_date":"2016-05-12 14:03:16.000 +0800","version_description":"Just in time for summer... an epic saga written through user feedback. The unlikely love story between design and development and the feel-good-hit sure to please the whole family. Starring \"Tickey\" as the dancing loading animator, you and your friends as the dashing protagonists, and the whole Reelgood community as a delightful cast of extras. Anticipated by many and sure to be loved by all... Reelgood V2: The Sequel <br><br>Now with community reviews and activity, a new crowd-pleasing interface, and even better movies backed by better personalization. Reelgood just got Reelbetter."},{"version_id":"817451000","version_name":"2.1","version_date":"2016-05-28 00:04:56.000 +0800","version_description":"The follow up to the pre-summer blockbuster that left critics and audiences begging for more. Reelgood V2.1 is here and features a star studded cast of new features: <br>- improved review liking right from user profiles and community feeds<br>- smoother new user experience<br>- the ability to filter your watchlist by theaters and coming soon<br><br>Let us know what you think at feedback@reelgoodapp.com"},{"version_id":"817617823","version_name":"2.2","version_date":"2016-06-03 18:32:21.000 +0800","version_description":"\"Life moves pretty fast... If you don't stop and look around every once in awhile, you might miss it\" - Ferris Bueller<br><br>Well said Ferris, we here at Reelgood couldn't agree more. Sometimes our versions move pretty fast, glad you're taking a look around. New for V2.2, we celebrate the people who don't say the lines. Those who set the scene, coach the characters, and make things happen. We loved the Cast, time to meet the Crew.<br><br>New for 2.2:<br>- Directors and Producers have been added to the crew section of every movie<br>- Ability to search by Director and Producer"},{"version_id":"817879456","version_name":"2.3","version_date":"2016-06-25 16:41:32.000 +0800","version_description":"A not so long time ago in a galaxy not particularly far, far away.... in fact, more like today, and in the exact same galaxy as you, a new version was born. So, what's in v2.3 for you?<br><br>- movies will automatically clear from discover as you mark them<br>- quickly recommend any movie to your friends (on and off Reelgood)<br>- discover great movies with the new friend profile \"picks\" section<br>- new splash screen, now with 100% more name!"},{"version_id":"818357829","version_name":"2.4.1","version_date":"2016-08-09 01:44:03.000 +0800","version_description":"We can neither confirm, nor deny that there was a bug in the last version.<br> - The Reelgood Press Secretary"},{"version_id":"818401012","version_name":"2.4.2","version_date":"","version_description":""},{"version_id":"818759405","version_name":"2.5","version_date":"2016-09-08 23:51:27.000 +0800","version_description":"Don't want to tell the world what you thought about a movie you saw? Maybe you've forgotten whether you liked it or not... Maybe it's no one else's business that you loved Sharknado 3... No matter what the reason, you can now easily turn off the auto review feature with one quick toggle. There, that's better, isn't it?"},{"version_id":"820105445","version_name":"2.5.1","version_date":"2017-01-20 19:02:57.000 +0800","version_description":"New year. New App. Well, not quite.<br>New in 2.5.1 are a couple of small interface updates, better filter functionality and, yes, a few bug fixes. <br>All in all, it's still the same great app, we'll leave the major transformations up to those people you see out running on New Years Day."},{"version_id":"821350918","version_name":"2.5.2","version_date":"2017-04-01 20:45:00.000 +0800","version_description":"Uh-oh... did your app crash? This fix is our way of saying sorry. No one has been fired yet, but rest assured they've been severely reprimanded on your behalf."},{"version_id":"823234688","version_name":"3.0","version_date":"2017-09-06 19:55:56.000 +0800","version_description":"What's new? Maybe asking what isn't new is a better question... but let's do this:<br><br>- An all new interface personalized to your streaming needs<br>- Addition of free sources with access to hundreds of free movies and thousands of free TV episodes from MTV, CBS, FOX, Crackle and more!<br>- TV shows? Yea, we do that now too.<br>- Tracking. We tell you what to watch next so you never have to think again... at least about shows and movies.<br>- Better search! Wrong spelling, we've got yew... (see what we did there?)<br><br>And a whole lot more..."},{"version_id":"823611643","version_name":"3.0.1","version_date":"","version_description":""},{"version_id":"823836022","version_name":"4.1","version_date":"2018-12-17 22:39:35.000 +0800","version_description":"If a movie you want to see comes to a service you have and you don't have push notifications, does anybody hear it? Well that's a riddle for the past, since this Reelgood update includes push notifications for all your watch next updates. Also lots of good new tracking tools to help you keep up to date on all your movies and shows.<br><br>All of what's new:<br>- Push notifications for movies added to your services<br>- Push notifications for new episodes of shows you're tracking<br>- Can \"bulk\" update your tracking position after bingeing multiple episodes<br>- Quickly add movies and shows to your watch next right from the posters<br>- Easily go back to the previous episode on watch next<br>- Added a setting to make the watch next your home tab<br>- Next air date added to show pages to see when they return<br>- Fix for filtering \"episodes not on services\" to filter all unavailable to stream episodes out of your watch next<br>- Air dates added to individual episodes<br>- Bug fix for shows with lots of episodes causing slow-downs and crashes<br>- Bug fix for long want-to-see and seen lists"},{"version_id":"823836022","version_name":"4.1.1","version_date":"2019-06-28 19:10:00.000 +0800","version_description":"Notice anything different about us? Well, besides the changes below, we're Webby Award Winners for Best Entertainment App of the Year!<br><br>So here's what's new for our victory lap version:<br>- New feedback system for reporting when data needs updating<br>- Addition of Reelgood scores (a score that combines metrics from IMDb, Rotten Tomatoes, popularity and more to help you find great content!)<br>- Bug fix for when free movies would show as \"not available\" in your watchlist (sorry!)<br>- Better sorting for cast and crew on shows and movies<br>- Episode titles added to watch next"},{"version_id":"823836022","version_name":"3.0.2","version_date":"2017-10-07 00:14:12.000 +0800","version_description":"Lots of small updates from the last version! We've added longer episode descriptions, better integrations for people who also use the app at reelgood.com and fixed a nasty little bug that was causing some shows to not track properly."},{"version_id":"825668814","version_name":"3.0.3","version_date":"2018-06-18 21:12:09.000 +0800","version_description":"Just a small update for the summer season:<br>- Sign in or up with Google for quicker access to your tracked shows and want to see movies<br>- Pull! See? It refreshed your list!<br>- Lot's of little fixes: No more blank episode images, less duplication, and greater stability."},{"version_id":"827596295","version_name":"3.0.4","version_date":"2018-06-21 07:32:52.000 +0800","version_description":"Stability update for iOS 12!"},{"version_id":"828376348","version_name":"4.0","version_date":"2018-10-05 18:25:42.000 +0800","version_description":"4.0! Thank you to our beta testers and other Reelgood-ers for all the feedback that has help us build our best version yet. Lots of new stuff in here so let's get to it:<br><br>- addition of some 50+ streaming services for the most complete streaming library available<br>- personalized \"Because you watched...\" recommendations across all your services<br>- sorting and filtering options, including by Rotten Tomatoes and IMDb scores<br>- see what's new this month on Netflix, Hulu, HBO, Prime Video and more!<br>- search and browse by cast &amp; crew member<br>- curated collections like 2018 Emmy Nominees, IMDb's Top 250 Movies, &amp; hundreds more!<br>- email notifications for when movies and shows you're interested in are added your services (push notifications coming next week!)<br>- new UI for easier search, discovery, and tracking of all your favorite shows &amp; movies across all your services <br>- Reelgood roulette for when you want to see something random on your services (hint: shake your phone on the discover screen)<br>- better support for iPad, and iPhone X screen sizes and gestures<br><br>Lot's of new stuff so be sure to tell us what you think: support@reelgood.com or hit the feedback button in the app."},{"version_id":"828916214","version_name":"4.1","version_date":"2018-12-17 22:39:35.000 +0800","version_description":"If a movie you want to see comes to a service you have and you don't have push notifications, does anybody hear it? Well that's a riddle for the past, since this Reelgood update includes push notifications for all your watch next updates. Also lots of good new tracking tools to help you keep up to date on all your movies and shows.<br><br>All of what's new:<br>- Push notifications for movies added to your services<br>- Push notifications for new episodes of shows you're tracking<br>- Can \"bulk\" update your tracking position after bingeing multiple episodes<br>- Quickly add movies and shows to your watch next right from the posters<br>- Easily go back to the previous episode on watch next<br>- Added a setting to make the watch next your home tab<br>- Next air date added to show pages to see when they return<br>- Fix for filtering \"episodes not on services\" to filter all unavailable to stream episodes out of your watch next<br>- Air dates added to individual episodes<br>- Bug fix for shows with lots of episodes causing slow-downs and crashes<br>- Bug fix for long want-to-see and seen lists"},{"version_id":"831616864","version_name":"4.1.1","version_date":"2019-06-28 19:10:00.000 +0800","version_description":"Notice anything different about us? Well, besides the changes below, we're Webby Award Winners for Best Entertainment App of the Year!<br><br>So here's what's new for our victory lap version:<br>- New feedback system for reporting when data needs updating<br>- Addition of Reelgood scores (a score that combines metrics from IMDb, Rotten Tomatoes, popularity and more to help you find great content!)<br>- Bug fix for when free movies would show as \"not available\" in your watchlist (sorry!)<br>- Better sorting for cast and crew on shows and movies<br>- Episode titles added to watch next"},{"version_id":"831857072","version_name":"4.1.2","version_date":"2019-07-02 21:34:10.000 +0800","version_description":"*Facepalm* That last version was not our best: some users on older iOS versions were experiencing a crash on launch, while others had a \"ghost\" login that requires you to close the app for your watchlist to load after updating the app. So here is the promised stability update for iOS 11 and below! A million apologies from the Reelgood team."},{"version_id":"832146028","version_name":"4.1.3","version_date":"2019-07-30 12:09:20.000 +0800","version_description":"New services! We've added IMDb TV to the Free Services Bundle as well as The Criterion Channel &amp; Kanopy to subscribed services list.&nbsp;We've also fixed a small bug that improves our understanding of your in app feedback. So we're all ears for any improvements or errors you might find. Now back to your regularly scheduled programming, wherever you want to watch it."},{"version_id":"834754990","version_name":"4.1.4","version_date":"2020-02-18 17:54:20.000 +0800","version_description":"A bit of that newness for all for all of you:<br>- Now when you finish a show in your watch next section it won't disappear immediately, but inform you of the next episode date and then clear when you pull to refresh or on your next session<br>- We've made roulette easier to access from the discover screen and you no longer have to shake your device to spin for a new bit of randomness<br>- Fixed some UI bugs that came along with dark mode and the release of iOS 13<br>- Lastly, migrated to our new API for improved performance and to take advantage of some new features coming soon!"},{"version_id":"835637985","version_name":"4.2","version_date":"2020-04-22 22:54:42.000 +0800","version_description":"Have a Roku? Then this version of Reelgood was made just for you.<br><br>This is the first version to include the Reelgood Remote for Roku. With it you can:<br>- Use the built in remote interface to control your&nbsp;Roku: play, pause, adjust the volume, and more.<br>- Just be sure your iPhone or iPad is connected to the same network as your Roku TV or device and Reelgood will give you the option to use the remote for your Roku.<br><br>Don't have a Roku? More devices coming soon. Let us know what to build next! Email: support@reelgood.com"},{"version_id":"835783821","version_name":"4.2.1","version_date":"2020-05-29 15:15:20.000 +0800","version_description":"-&nbsp;Support for HBOMax!<br>- Added ability to manually connect to your Roku by entering its IP address<br>- Fixes for device discovery issues associated with certain Roku setups"},{"version_id":"836601861","version_name":"4.3","version_date":"2020-07-10 16:04:41.000 +0800","version_description":"A few new features to make streaming easier:<br>- series/show level availability listings<br>- easily select all your installed streaming services<br>- new listings for popular actors and directors to explore their best movies and shows<br>- best of listings for each service you use<br><br>And we've just added support for streaming services in the U.K. Including Netflix, Prime Video, AppleTV+, NOWtv and more!"},{"version_id":"836801603","version_name":"4.3.1","version_date":"2020-07-13 20:01:31.000 +0800","version_description":"A quick bug fix and we're back! Sorry about any crashes."},{"version_id":"837304465","version_name":"4.3.2","version_date":"2020-09-02 00:45:24.000 +0800","version_description":"Let us know if you love, like, or dislike this new release because user ratings are here. Now you can review all your favorite shows and movies to help improved your recommendations. Also, sick of seeing a show or movie in your listings? Hit that dislike button and we'll hide it. For-ev-er.<br><br>Full list of updates:<br>- Apple Sign in now supported<br>- New action sheets and details pages for you to rate your shows and movies<br>- More filter options on roulette<br>- Removal of Rotten Tomatoes scores (so sorry about this one! Rotten Tomatoes no longer allows us to use their scores)<br>- Added \"seen all\" button to TV shows to make marking things easier<br>- Fixed a bug for our UK mates that was making some shows and movies show as available to stream when they were not"},{"version_id":"837625838","version_name":"4.3.3","version_date":"2020-10-14 18:09:52.000 +0800","version_description":"Bug fixes and performance improvements.<br>Fixes a crash some users are experiencing on launch."},{"version_id":"838215153","version_name":"4.4","version_date":"2020-11-12 21:19:25.000 +0800","version_description":"Just in time for holiday bickering movie and TV season, our most wonderful update of the year:<br>• Able to connect to Roku, Android TV, Fire TV and LG Smart TVs<br>• New built in remote control for LG Smart TVs (webOS)<br>• Easier to play on a streaming service or TV of choice<br>• Trailers for shows and movies can be accessed more quickly<br>• New tv show and movie pages using a more intuitive design and immersive background artwork"},{"version_id":"839117456","version_name":"4.4.1","version_date":"2020-11-14 20:47:49.000 +0800","version_description":"Just in time for holiday bickering movie and TV season, our most wonderful update of the year:<br>• Able to connect to Roku, Android TV, Fire TV and LG Smart TVs<br>• New built in remote control for LG Smart TVs (webOS)<br>• Easier to play on a streaming service or TV of choice<br>• Trailers for shows and movies can be accessed more quickly<br>• New tv show and movie pages using a more intuitive design and immersive background artwork"},{"version_id":"839691707","version_name":"4.4.2","version_date":"2021-02-10 21:19:18.000 +0800","version_description":"• Our crack developer team has made some snappy new elements for a smoother experience<br>• Updated app review flow to help people let us know what they think"},{"version_id":"840455770","version_name":"4.4.3","version_date":"2021-02-12 00:52:35.000 +0800","version_description":"• Our crack developer team has made some snappy new elements for a smoother experience<br>• Updated app review flow to help people let us know what they think"},{"version_id":"840473290","version_name":"4.4.4","version_date":"2021-02-13 23:29:34.000 +0800","version_description":"• Our crack developer team has made some snappy new elements for a smoother experience<br>• Updated app review flow to help people let us know what they think<br>• Fixed an issue which causes Play On TV to Rokus to flash the TV"},{"version_id":"840695824","version_name":"4.5","version_date":"2021-03-20 12:30:16.000 +0800","version_description":"Swipe with friends!<br><br>Arguing over what to watch is sooo 2020. Use Reelgood’s “Swipe with Friends” to match on a movie or show everyone wants to see.<br><br>1. Share the link with your fellow deciders<br>2. Set some filters for what to swipe through<br>3. Swipe through recommendations<br>4. Get alerted when your group matches on something everyone wants to see"},{"version_id":"842471265","version_name":"4.5.1","version_date":"2021-06-08 17:49:41.000 +0800","version_description":"\"Swipe with Friends\" is now \"Search Party\" and it's still the best way to find what to watch with a group.&nbsp;<br>This release also includes a series of performance upgrades and bug fixes from your friendly neighborhood development team.&nbsp;<br>Stream on!"}]