[{"version_id":"815442078","version_name":"1.0.3","version_date":"","version_description":""},{"version_id":"815769324","version_name":"1.0.5","version_date":"","version_description":""},{"version_id":"816170206","version_name":"1.1.1","version_date":"","version_description":""},{"version_id":"816423198","version_name":"1.1.2","version_date":"","version_description":""},{"version_id":"816586272","version_name":"1.2.0","version_date":"","version_description":""},{"version_id":"816692731","version_name":"1.2.1","version_date":"","version_description":""},{"version_id":"817199398","version_name":"1.2.2","version_date":"","version_description":""},{"version_id":"817736359","version_name":"1.2.3","version_date":"","version_description":""},{"version_id":"817864124","version_name":"1.2.4","version_date":"","version_description":""},{"version_id":"818570789","version_name":"1.3.1","version_date":"","version_description":""},{"version_id":"818813476","version_name":"1.3.3","version_date":"","version_description":""},{"version_id":"819747037","version_name":"1.4.1","version_date":"","version_description":""},{"version_id":"819849339","version_name":"1.4.2","version_date":"2016-11-23 19:00:56.000 +0800","version_description":"- Hot fix for HS100/110 (FR) French model issue"},{"version_id":"820004547","version_name":"1.4.3","version_date":"2016-12-05 17:40:50.000 +0800","version_description":"- Hot fix to resolve iOS 10 crashes for select users"},{"version_id":"821415893","version_name":"1.7.4","version_date":"2017-03-23 01:40:36.000 +0800","version_description":"New products and integration coming soon. Stay tuned!  Also fixed various bugs and improved reliability."},{"version_id":"821584997","version_name":"1.7.5","version_date":"2017-04-03 21:43:05.000 +0800","version_description":"1. Added support for Google Assistant!  Visit Add section of Works with Kasa for instruction. <br>2. Added support for Smart Router SR20. Complete with smart actions and sensor support! <br>3. Added support for Smart Range Extender RE270/370. <br>4. Various minor bug fixes."},{"version_id":"822137073","version_name":"1.7.7","version_date":"2017-05-17 00:22:29.000 +0800","version_description":"You can now control scenes with Nest Home and Away! To get started, tap the Add button on your device list and visit the Works with Kasa section."},{"version_id":"822647000","version_name":"1.7.8","version_date":"2017-06-22 19:05:07.000 +0800","version_description":"We have enhanced Kasa account credential encryption on users smart phone.<br><br>Device control via local network now restricts access to devices within a user's account.  Users having trouble controlling devices across multiple Kasa accounts in a home can contact kasa.support@tp-link.com for additional support."},{"version_id":"822919978","version_name":"1.7.9","version_date":"2017-07-17 20:47:22.000 +0800","version_description":"1.7.9 release includes enhancements for offline device deletion, Scene synchronization optimization, information dialog for skipping account creation, and bug fixes."},{"version_id":"823248982","version_name":"1.7.10","version_date":"2017-08-10 22:06:07.000 +0800","version_description":"1.7.10 release includes a hotfix to prevent display of non-Kasa TP-Link product families"},{"version_id":"823361780","version_name":"1.8.1","version_date":"2017-08-22 00:16:45.000 +0800","version_description":"1.8.1 release includes support for Kasa IP Camera KC120, and Flood Light LB200/230"},{"version_id":"823428803","version_name":"1.8.2","version_date":"2017-08-25 18:50:18.000 +0800","version_description":"1.8 release includes support for Kasa IP Camera KC120, Flood Light LB200/230, and enhanced light bulb interface.  1.8.2 ​is a hot​fix ​to ​resolve ​crash ​when editing Scenes with Light Bulb."},{"version_id":"823681421","version_name":"1.9.0","version_date":"2017-09-18 22:03:44.000 +0800","version_description":"1.9.0 release includes new features on Camera schedule, Camera tab, Smart Router client labeling, Smart Router Z-Bulb support, and Localization for German, French, and Spanish. Also includes bug fixes on the light bulb brightness schedule, incorrect bulb picker showing, and more."},{"version_id":"824142733","version_name":"1.9.3","version_date":"2017-10-26 19:03:30.000 +0800","version_description":"1.9.3 is a minor release that enhances ​data encryption, fixes various bugs, and adds Japanese support. <br>1.9 includes new features for scheduling your Kasa Cam, introduces the Camera tab, lets you assign a nickname to devices connected to your Smart Home Router, and gives SR20 support for Z-Wave and ZigBee Smart Bulbs."},{"version_id":"824426279","version_name":"1.10.2","version_date":"2017-11-16 19:28:29.000 +0800","version_description":"1.10 includes new feature on Kasa Cam delete clips, three-way switch HS210 support, and various bug fixes."},{"version_id":"825367387","version_name":"1.10.4","version_date":"2017-12-19 05:28:54.000 +0800","version_description":"1.10.4 added new features such as Camera pinch to zoom, IFTTT on boarding, and many other enhancements. 1.10 overall also includes new features for Camera delete clips, support for three-way switch HS210,  and various bug fixes."},{"version_id":"825712718","version_name":"1.11.0","version_date":"2018-01-23 19:31:36.000 +0800","version_description":"1.11.0 is a minor release with various enhancements and bug fixes"},{"version_id":"825793675","version_name":"1.11.1","version_date":"2018-01-29 00:17:09.000 +0800","version_description":"1.11.1 is a hotfix for Camera/3-Way Switch on boarding issue and missing add/edit bulb schedule for old firmware. 1.11 overall is a maintenance release with various enhancements and bug fixes."},{"version_id":"826025224","version_name":"2.3.1","version_date":"2018-07-25 18:23:25.000 +0800","version_description":"2.3.1 enhances the Kasa Cam experience. You can now easily filter your activity history by camera or a specific time range and you now have greater control over activity zones with zones that support full polygonal (non-rectangular) arrangements. We’ve also enhanced the clip playback experience and made it easier to review clips in serial. This release also includes minor fixes for KL110 and KL130 Smart Bulbs in Japan, and adds support for new hardware versions of Smart Plug Lite (HS103). As always, we’ve thrown in some bug fixes for good measure."},{"version_id":"826025224","version_name":"2.13.0","version_date":"2019-06-21 01:08:47.000 +0800","version_description":"At the end of this month, we will begin to roll out Smart Actions, a new feature that will help you get more out of your existing Kasa devices. With Smart Actions, you'll be able to use your Kasa Cams as motion sensors for your Smart Lights, you'll be able to use Smart Switches to control other Kasa devices and you'll be able to schedule scenes and configure auto-off timers. This first release will be made available in stages based on the products in your home. <br>In addition, we've made it easier to see when new promotional and discovery content is available from the sidebar.<br>Of course, there’s a handful of bug fixes in this release, as well."},{"version_id":"826025224","version_name":"2.15.0","version_date":"2019-08-27 02:07:31.000 +0800","version_description":"Happy August! This version of Kasa has some important changes.<br>* We've removed support for Works with Nest as Google is ending the Works with Nest program in August.<br>* You can now setup a single HS210 Smart Switch instead of a pair for three-way lights.<br>* You can now control your Kasa devices from Samsung SmartThings. Just connect your accounts in the Kasa app.<br>* You can now schedule camera notifications to start on one day and end the following day<br>* This version of Kasa removes support for iOS 9."},{"version_id":"826025224","version_name":"1.12.0","version_date":"2018-02-21 02:08:30.000 +0800","version_description":"1.12 is a major release that includes support for Smart Plug Lite HS103, iPhone X, various enhancements and bug fixes."},{"version_id":"826307569","version_name":"2.0.0","version_date":"2018-03-16 01:34:04.000 +0800","version_description":"2.0.0 is a major release that adds support for our Smart Dimmer Light Switch (HS220), Smart Plug Mini (HS105) for Japan, various enhancements, and bug fixes."},{"version_id":"826393131","version_name":"2.0.1","version_date":"2018-03-22 23:16:28.000 +0800","version_description":"2.0.1 is a hotfix to resolve crash and incorrect display on energy statistics, device name sync issue, and more.  2.0 overall is a major release that adds support for our Smart Dimmer Light Switch (HS220), Smart Plug Mini HS105 for Japan, various enhancements, and bug fixes."},{"version_id":"826428887","version_name":"2.0.2","version_date":"2018-03-24 15:46:47.000 +0800","version_description":"2.0.2 is a hotfix to resolve dimmable switch onboarding issue at set Device Name page.  2.0 overall is a major release that adds support for our Smart Dimmer Light Switch (HS220), Smart Plug Mini HS105 for Japan, various enhancements, and bug fixes."},{"version_id":"826770326","version_name":"2.0.4","version_date":"2018-04-23 22:38:25.000 +0800","version_description":"2.0.4 is a minor release that fixes many bugs and updated our German, French, Spanish, and Japanese localization to date"},{"version_id":"827254099","version_name":"2.1.2","version_date":"2018-05-23 23:36:46.000 +0800","version_description":"2.1.2 is a major release that updated Kasa Terms of Use and Privacy Policy, added support for Outdoor Camera KC200, Dual Plug HS107, Smart Bulb KL series, Smart Plug HS100(UK) 2.1, various enhancements, and bug fixes."},{"version_id":"827627191","version_name":"2.2.0","version_date":"2018-06-22 17:58:10.000 +0800","version_description":"2.2.0 is a maintenance release that adds support for remote control over iOS 11.4.1 and 12, KL120(US) and HS100(UK) v2.1 enhancements, text updates, and various enhancements and bug fixes."},{"version_id":"827960161","version_name":"2.3.1","version_date":"2018-07-25 18:23:25.000 +0800","version_description":"2.3.1 enhances the Kasa Cam experience. You can now easily filter your activity history by camera or a specific time range and you now have greater control over activity zones with zones that support full polygonal (non-rectangular) arrangements. We’ve also enhanced the clip playback experience and made it easier to review clips in serial. This release also includes minor fixes for KL110 and KL130 Smart Bulbs in Japan, and adds support for new hardware versions of Smart Plug Lite (HS103). As always, we’ve thrown in some bug fixes for good measure."},{"version_id":"828182164","version_name":"2.4.0","version_date":"2018-08-10 22:04:32.000 +0800","version_description":"2.4.0 is a minor release that enhances the KC120 onboarding experience and improves the speed of Kasa Cam video streaming when on the same Wi-Fi network. Not to disappoint, we’ve thrown in some bug fixes for good measure."},{"version_id":"828653964","version_name":"2.5.0","version_date":"2018-09-20 23:44:59.000 +0800","version_description":"With Kasa 2.5.0 and a Kasa Cam, you can now manually record clips when streaming live video. Customers in Europe now have support for the latest Kasa Smart Bulbs (KL110, KL120 and KL130). And the United Kingdom now has access to Kasa Cam (KC120). As expected, we’ve included a smattering of bug fixes and minor enhancements to this release, too."},{"version_id":"829023772","version_name":"2.6.0","version_date":"2018-10-23 22:28:53.000 +0800","version_description":"With Kasa 2.6.0, we’ve added a long-requested feature: widgets! Now, you can control your favorite Kasa devices and scenes from the Today View on your iPhone, iPad or iPod touch. Get started by visiting the Today View and selecting the Kasa Devices or Kasa Scenes widget from the list of available widgets. We’ve also made some visual updates including rolling out or new logo. Less exciting but still worthwhile updates include expanded time zone support, an updated bug tracking and analytics platform, additional localization for new products and features, and, as usual, bug fixes."},{"version_id":"829334537","version_name":"2.7.0","version_date":"2018-11-20 00:53:20.000 +0800","version_description":"Kasa 2.7.0 launches Kasa Grouping, letting you control your smart plugs, switches and bulbs together in perfect unison. Mix and match device types in groups, set brightness or change colors for everything at once. And we're also debuting a new, refined interface to control groups with legendary Kasa simplicity. We've also enhanced the setup process for most smart plugs and the Smart Switch, added a way to review current Kasa promotions from the sidebar and, of course, plenty of bug fixes."},{"version_id":"829433581","version_name":"2.7.1","version_date":"2018-11-30 17:25:53.000 +0800","version_description":"Minor bug fixes."},{"version_id":"829968722","version_name":"2.8.0","version_date":"2019-01-16 20:52:44.000 +0800","version_description":"Happy New Year from the entire Kasa team! We're starting January off with an update that brings support for two brand new devices just announced at CES 2019: the Kasa Smart Wi-Fi Power Outlet and the Kasa Smart Wi-Fi Outdoor Plug. In addition to our usual bug fixes, we've improved the overall performance of the Device List and added a widget that lets you view your camera's recent activity from the Today View."},{"version_id":"830433526","version_name":"2.9.0","version_date":"2019-02-27 17:45:27.000 +0800","version_description":"Maintenance releases can be rather boring so we've tried to include some pizzaz along with lots of under-the-hood updates for Kasa 2.9.0.<br><br>Customers in the European Union can now enjoy outdoor monitoring of their home with Kasa Cam Outdoor (KC200) and anyone with our popular smart plugs (HS100, 103, 105 and 110) and smart switches (HS200) will notice some visual updates the next time they control their devices.<br><br>We've also made major improvements when adding new smart bulbs; you may only add a device once in a while, but these changes should ensure new device success.<br><br>Other enhancements include fixes that make removing devices more reliable and we've improved Wi-Fi selection to ensure you don't accidentally try to use an incompatible Wi-Fi network."},{"version_id":"830575864","version_name":"2.10.0","version_date":"2019-03-20 18:05:02.000 +0800","version_description":"Announced at CES, this release of Kasa includes support for the new Kasa Spot camera. With support for KC100, we've added some enhancements to make reviewing recent clip history a little easier; you'll now see the past three hours of recent activity beneath the live stream. Scroll left and right to go back in time or tap a clip to review it. Clip history behind three hours is still available in Activity Center.<br><br>We've also made some improvements to how we handle push notifications in Kasa. There's a new Notifications option in the sidebar or you can configure notifications per-camera from camera settings, whichever way you prefer.<br><br>There's some other bug fixes included and some underlying development updates to make sure we are supporting the latest and greatest iOS releases."},{"version_id":"831005659","version_name":"2.11.0","version_date":"2019-04-18 21:02:23.000 +0800","version_description":"This version of Kasa primarily focuses on updates and enhancements to the Kasa Smart bulbs. For our customers outside of North America, you can now setup and enjoy Kasa Smart Bulbs with a bayonet (B22) base. <br><br>We've also brought the grouping interface to individual smart bulbs so it's now easier to set the brightness, color and color temperature (including the oft requested % and K). In addition, you can now access your presets as five shortcuts along the top of the screen for one-tap recall.<br><br>Please note that, when creating a scene or a schedule, we've replaced the previous \"blind\" picker with an option to grab the current configuration from your smart bulb; set your bulb to the desired brightness+color first and then create your scene or schedule.<br><br>The Kasa app now supports setup of 29 different products and services so we've redesigned the Add wizard to make it easier to find the device or service you're looking for.<br><br>Last but not least, there's the usual crop of bug fixes."},{"version_id":"831230754","version_name":"2.12.0","version_date":"2019-05-08 22:39:46.000 +0800","version_description":"While many of our release notes feature a small tome of content, this release focuses more on bug fixes.<br><br>Kasa Spot support has been added for customers outside of North America. For Kasa Cam users, you can now share clips from the app without the need to download. When you tap share, you'll be given a link that be sent through your favorite social media or even viewed on the web.<br><br>And for iPad users, we've added basic support for iPad. We'll be doing more in the coming releases to enhance the iPad experience."},{"version_id":"831679287","version_name":"2.13.0","version_date":"2019-06-21 01:08:47.000 +0800","version_description":"At the end of this month, we will begin to roll out Smart Actions, a new feature that will help you get more out of your existing Kasa devices. With Smart Actions, you'll be able to use your Kasa Cams as motion sensors for your Smart Lights, you'll be able to use Smart Switches to control other Kasa devices and you'll be able to schedule scenes and configure auto-off timers. This first release will be made available in stages based on the products in your home. <br>In addition, we've made it easier to see when new promotional and discovery content is available from the sidebar.<br>Of course, there’s a handful of bug fixes in this release, as well."},{"version_id":"831941052","version_name":"2.14.0","version_date":"2019-07-25 18:10:25.000 +0800","version_description":"This version of Kasa is primarily a maintenance release that addresses issues with the app unexpectedly quitting, issues with Today View widgets and multiple visual anomalies. In addition, Kasa Spot Pan Tilt users can now configure activity zones for their different viewpoints."},{"version_id":"832517109","version_name":"2.15.0","version_date":"2019-08-27 02:07:31.000 +0800","version_description":"Happy August! This version of Kasa has some important changes.<br>* We've removed support for Works with Nest as Google is ending the Works with Nest program in August.<br>* You can now setup a single HS210 Smart Switch instead of a pair for three-way lights.<br>* You can now control your Kasa devices from Samsung SmartThings. Just connect your accounts in the Kasa app.<br>* You can now schedule camera notifications to start on one day and end the following day<br>* This version of Kasa removes support for iOS 9."},{"version_id":"833044109","version_name":"2.16.0","version_date":"2019-10-07 22:06:26.000 +0800","version_description":"This version of the Kasa app mainly adds support for the new Kasa Smart Light Strip.<br><br>You can add and configure your KL430 Smart Light Strip<br>You can select between 10 different lighting effects including: Bubbling Cauldron, Candle Flicker, Haunted Mansion, Icicle, Lightning, Ocean, Rainbow, Raindrop, Spring and Valentines<br>As part of Amazon's Designed for Humans initiative, linking accounts between Kasa and Amazon devices is now easier and can be done from the Kasa app<br>We are continuing to troubleshoot issues adding Kasa devices for users who upgraded from iOS 12 to iOS 13. If you receive a \"no Wi-Fi\" error while attempting to add a device, please try restarting your iPhone. If the issue persists, please contact Kasa Support at https://www.tp-link.com/us/about-us/contact/"},{"version_id":"833538512","version_name":"2.17.0","version_date":"2019-11-12 02:35:25.000 +0800","version_description":"October has been a busy month at Kasa; we've added support for a slew of new products as well as some long requested features!<br><br>Major Bug Fixes<br>• Users on iOS 13 should be able to add devices without issue now. Please contact support if you continue to experience issues.<br><br>New Features<br>• You can now include offsets when scheduling with sunrise and sunset<br>• You can now include fade-on and fade-off speed when scheduling dimmable devices<br>• Be sure to check for firmware updates to enable the new scheduling features (Side Menu &gt; Settings &gt; Firmware Update)<br>• Even more customers should have access to Smart Actions now<br>• Kasa Cam customers who subscribe to Plus and Premium plans will now see snapshots of detected motion in their push notifications<br>• Plus and Premium subscribers also now have access to Video Summary to get a quick synopsis of everything your camera has recorded in the past 24 hours<br><br>New Products<br>• We've added support for the Kasa Smart Wire-Free Camera (KC300) and the Kasa Smart Power Strip (KP303)"},{"version_id":"833936912","version_name":"2.18.0","version_date":"2019-12-17 03:28:17.000 +0800","version_description":"This version of the Kasa app mainly focuses on bug fixes and made improvements to Smart Plug's setup flow. For our Smart Light Strip product, we added support for several new lighting effects in preparation for the upcoming holidays, Christmas and New Year. So stay tuned for that!"},{"version_id":"834436220","version_name":"2.19.0","version_date":"2020-01-22 00:29:53.000 +0800","version_description":"This version of the Kasa app primarily contains bug fixes.<br><br>* Added support for KP105 in the UK along with Amazon Certified for Humans to make setup and installation seamless for customers with Amazon Echo devices."},{"version_id":"834637424","version_name":"2.20.0","version_date":"2020-03-23 23:09:16.000 +0800","version_description":"There’s a bunch of updates for this release of Kasa<br>    - We’ve redesigned Kasa Care to make it both less expensive and an overall better value<br>    - We’ve added support for two new Kasa Cameras: KC105 and KC115<br>    - New for KC105 and KC115 is 24/7 recording with Micro SD cards. Record everything for days, regardless of motion detection and without a cloud subscription<br>    - Dimmer Switch (HS220) now has access to enhanced sunrise and sunset schedules with offsets and fade rates<br>    - You can now customize the colors and speeds of lighting effects for Kasa Smart Light Strip (KL430)<br>    - We’ve enhanced the messaging about location services, when we need it and why<br>Many new feature require a quick firmware update. Be sure to check for updates by going to the Sidebar &gt; Settings."},{"version_id":"835757767","version_name":"2.21.0","version_date":"2020-05-01 18:05:34.000 +0800","version_description":"This version of Kasa is primarily a maintenance release with bug fixes but there are some notable changes.<br>- Customers with cameras will be guided through the process of setting up activity zones to ensure only relevant activity is recorded<br>- We've added support for Siri Shortcuts for devices and scenes so you can control your Kasa devices from Siri (even using HomePod). Download the Shortcuts app to get started."},{"version_id":"835829847","version_name":"2.21.1","version_date":"2020-05-08 01:46:30.000 +0800","version_description":"2.21.1 is a hotfix to resolve a crash issue.  2.21.0 overall is a major release that adds the following notable changes.<br>- Customers with cameras will be guided through the process of setting up activity zones to ensure only relevant activity is recorded<br>- We've added support for Siri Shortcuts for devices and scenes so you can control your Kasa devices from Siri (even using HomePod). Download the Shortcuts app to get started."},{"version_id":"836264538","version_name":"2.22","version_date":"2020-06-16 17:40:22.000 +0800","version_description":"In addition to the usual collection of bug fixes, this release of Kasa adds Color Painting for the Kasa Smart Light Strip. To get started, tap Effects and then Add Color Painting to fully control the color of each individual segment on your light strip."},{"version_id":"836551415","version_name":"2.23","version_date":"2020-07-09 21:03:50.000 +0800","version_description":"With this release of Kasa, we've added support for Person Detection on Kasa Smart Spot Cameras (KC105 and KC115).<br><br>We've also made it possible to share promotions that appear in the Discover section of the app drawer; just tap the share button to tell friends and family."},{"version_id":"837185249","version_name":"2.24","version_date":"2020-08-02 17:40:51.000 +0800","version_description":"For Light Strip customers, you can now save your color painting effects as presets and use them in schedules.<br><br>We've been working to improve the Kasa Cam video and audio experience and we've changed codecs. As a result, this update is a mandatory update for all Kasa customers.<br><br>We've also added support for a variety of hardware revisions of existing Kasa devices."},{"version_id":"837535061","version_name":"2.25.0","version_date":"2020-08-28 05:51:43.000 +0800","version_description":"This version of the Kasa app primarily contains bug fixes.<br>- Added support for Kasa Camera EC60/EC70, US version only.<br>- Added support for Kasa Smart Plug Mini with Energy Monitoring KP115, US version only.<br>- Added support for Kasa Smart Plug KP105, French version."},{"version_id":"837977210","version_name":"2.26.0","version_date":"2020-09-28 07:08:24.000 +0800","version_description":"This version of the Kasa app primarily contains bug fixes.<br>-&nbsp;Added support for local network privacy permissions for iOS 14. iOS 14 users will need to grant local network permissions to Kasa app in order to set up new devices or use local control.<br>- Added support for Kasa Smart Plug with Energy Monitoring KP115, UK, EU and AU version.<br>- Added support for Kasa Smart Bulb, KL125, US version only.<br>- Added support for Kasa Camera KC400/KC410S, US version only."},{"version_id":"838153968","version_name":"2.26.1","version_date":"2020-10-10 23:20:51.000 +0800","version_description":"This version mainly contains bug fixes."},{"version_id":"838426953","version_name":"2.27.0","version_date":"2020-10-30 03:43:58.000 +0800","version_description":"This version mainly contains bug fixes."},{"version_id":"839768778","version_name":"2.28.1","version_date":"2020-12-23 01:44:44.000 +0800","version_description":"This version mainly contains bug fixes."},{"version_id":"839922803","version_name":"2.28.2","version_date":"2021-01-07 07:45:42.000 +0800","version_description":"This version mainly contains bug fixes."},{"version_id":"840137584","version_name":"2.28.3","version_date":"2021-01-25 10:00:40.000 +0800","version_description":"This version mainly contains bug fixes."},{"version_id":"840550006","version_name":"2.29.0","version_date":"2021-02-23 09:21:06.000 +0800","version_description":"This version contains mainly bug fixes."},{"version_id":"840800849","version_name":"2.29.1","version_date":"2021-03-09 01:58:06.000 +0800","version_description":"- Fixed some bugs and improved the stability."},{"version_id":"841134251","version_name":"2.30.0","version_date":"2021-03-30 21:49:35.000 +0800","version_description":"- Fixed some bugs and improved the stability."},{"version_id":"842106249","version_name":"2.31.2","version_date":"2021-06-02 00:48:42.000 +0800","version_description":"-Fixed some bugs and improved the stability."},{"version_id":"842474612","version_name":"2.31.3","version_date":"2021-06-09 03:29:10.000 +0800","version_description":"-Fixed some bugs and improved the stability."},{"version_id":"842899684","version_name":"2.33.2","version_date":"2021-07-05 05:59:58.000 +0800","version_description":"-Fixed some issues<br>- Optimized the functions for KS220"},{"version_id":"843311883","version_name":"2.33.3","version_date":"2021-08-02 00:45:13.000 +0800","version_description":"-Fixed some bugs<br>-KC420WS function optimization"}]