[{"version_id":"815921101","version_name":"1.2","version_date":"2016-01-14 22:48:53.000 +0800","version_description":"All about the Laax Open 18-24/01/2016"},{"version_id":"818022225","version_name":"2.2.0","version_date":"2016-07-08 20:19:52.000 +0800","version_description":"This update brings you seamless transport “Near Me” without the bug which was causing errors when looking for your transport in Flims Laax Falera. Now all on mountain transport is ignored in the Transport section in order to present you the next outgoing post bus or Flims Laax Falera Shuttle connections. In this version the age groups for lift ticket purchases have been corrected and 6 year olds can use the lifts free of charge! Lastly, opening times of the ticket offices have been corrected, should you be looking for assistance when here."},{"version_id":"818604295","version_name":"2.2.4","version_date":"2016-08-24 05:58:01.000 +0800","version_description":"In this version we have upgraded the Login process allowing you to use your Facebook credentials for an even faster Login. Additionally under Settings you can log off at anytime now. We have also updated the opening times to make sure you can catch the right lifts and gondolas in Flims, Laax and Falera this fall/autumn season. Lastly, we have made minor changes to make sure you are notified even faster about the pizza you ordered via our mobile ordering function. We wish you awesome hikes, culinary highlights and great times in Flims, Laax and Falera."},{"version_id":"819414920","version_name":"3.0.0","version_date":"2016-10-28 06:54:03.000 +0800","version_description":"With the winter season around the corner LAAX INSIDE launches in the winter look. Completely re-engineered to fit the winter guests’ needs and filled to the brim with features to make days in the snow in Flims Laax Falera easier than ever before. Your stay in the ski resort of LAAX just got even better! \n\n- Pre-Season Ticket Sale: Profit from the Eco pre-sale prices and lock in the best offers for the coming season. If you appreciate the priority granted by Blueline, make sure to get your tickets now as the availability for the holidays is limited. \n- Add-Ons: book a reserved parking space or freshly prepared rental equipment for an unmemorable day on the snow in our mountains.  \n- «MyStory»: Connect your Keycard with the app, track your performance, earn badges for your achievements and collect INSIDE points to redeem unique rewards. Relieve the story of your season. \n- Live Feed: Your day in LAAX. See your daily activities and get the latest INSIDE news from us.\n- Live Information: The set of live features include real time webcams, weather forecasts, snow reports and lift and slope status and much more. INSIDE provides more live information than ever before.  \n\nWe wish you an awesome start into the winter season!"},{"version_id":"819514171","version_name":"3.0.1","version_date":"2016-10-29 18:52:21.000 +0800","version_description":"With the winter season around the corner LAAX INSIDE launches in the winter look with the new winter icon. \nPre-Season Ticket Sale: Profit from the pre-sale prices and lock in the best offers for the coming season. If you appreciate the priority granted by Blueline, make sure to get your tickets now as the availability for the holidays is limited. \nAdd-Ons: book a reserved parking space or freshly prepared rental equipment for an unmemorable day on the snow in our mountains.  \n«MyStory»: Connect your Keycard with the app, track your performance, earn badges for your achievements and collect INSIDE points to redeem unique rewards. Relieve the story of your season. \nLive Feed: Your day in LAAX. See your daily activities and get the latest INSIDE news from us.\nLive Information: The set of live features include real time webcams, weather forecasts, snow reports and lift and slope status and much more. INSIDE provides more live information than ever before.  \n\nWe wish you an awesome start into the winter season!\nWith the winter season around the corner LAAX INSIDE launches in the winter look.\nPre-Season Ticket Sale: Profit from the pre-sale prices and lock in the best offers for the coming season. If you appreciate the priority granted by Blueline, make sure to get your tickets now as the availability for the holidays is limited. \nAdd-Ons: book a reserved parking space or freshly prepared rental equipment for an unmemorable day on the snow in our mountains.  \n«MyStory»: Connect your Keycard with the app, track your performance, earn badges for your achievements and collect INSIDE points to redeem unique rewards. Relieve the story of your season. \nLive Feed: Your day in LAAX. See your daily activities and get the latest INSIDE news from us.\nLive Information: The set of live features include real time webcams, weather forecasts, snow reports and lift and slope status and much more. INSIDE provides more live information than ever before.  \n\nWe wish you an awesome start into the winter season!\n\nFixes: \n- Adding keycards via the live feed. \n- New Icon\n- Onboarding Fix MyStory"},{"version_id":"819795311","version_name":"3.0.2","version_date":"2016-11-22 10:45:12.000 +0800","version_description":"In this version you will find everything you need for a successful start into the preseason: \n- MyStory is now showing the correct stats for your ski day. (Data from the first weekend of the season is imported retroactively)\n- Full iOS 10 compatibility and optimization\n- Extended angle of visibility on select roundshot webcams\n- More intuitive date picker for liftticket bookings\n- Various Bug Fixes\nThe purchase of lift tickets for the current season started last weekend. Problems with the 01- cards have been rectified and booking are possible for your ski or snowboard outing in Flims LAAX Falera. We wish you plenty of powder and a lot of sunshine in the pre-season."},{"version_id":"820045557","version_name":"3.0.3","version_date":"2016-12-08 15:34:38.000 +0800","version_description":"In this version you'll find updates and new features for an exciting stay in Flims/Laax/Falera.\n\nNew features:\n-  An easy to use table reservation making sure you and your friends get to your table without any stress. Participating restaurants are Camino, Casa Veglia, Capalari, Nooba and Tegia Larnags.\n-  An SOS feature in case you ever get in trouble on the mountain. Connect with and immediately inform our SOS team of your location.\n\nUpdates:\n-  We added a new \"Snowpark Ticket\" for those of you who stay close to rails and kickers.\n-  New and exciting badges for your story to share with friends and family.\n-  Finding just the right restaurant for you will now be easier as we reworked the restaurants listing with new search, sort and filter functions.\n-  Various bug fixes\n\nWe wish you plenty of powder and a lot of sunshine for your adventure in the snow."},{"version_id":"820266212","version_name":"3.1.0","version_date":"2016-12-23 18:42:57.000 +0800","version_description":"For even more fun in LAAX we've got a new INSIDE LAAX version for you right before Christmas. \n- Leaderboards: Compete with other LAAX guests and friends in our three new Leaderboards for vertical meters, ski days and number of lifts used. Ranking on the Leaderboards will also get you some of our new INSIDE Points as well. \n- \"LAAX LOVES YOU\": The new loyalty program is live. Collect points and get yourself some sweet rewards and services from our INSIDE Rewards Shop. Stay tuned as we the items available will always be changing, just to make sure you don’t get bored.\n- Special Items Shop: Forgot your Christmas tree or to book a room for the weekend? We've got you covered! With our new special items shop, you'll find temporary LAAX offers that will help you out of exactly those situations.\nFurthermore, we’ve included some bug fixes to make our app even more user-friendly. \nEnough reading, go have fun in the snow and with our INSIDE app."},{"version_id":"820385383","version_name":"3.1.1","version_date":"2017-01-06 19:58:21.000 +0800","version_description":"We made a few mistakes! This version fixes several minor bugs that have been discovered over the last week.\n\n- Updates to your live feed to show you badges earned, loyalty points collected and on-mountain performance\n- Fixes to the leaderboards to correct issues with incorrect rankings. Don't worry. Your points are safe with us and we'll give you loyalty points for rankings if applicable to you.\n- Update of the slope map so that you're always up to date.\n\nHave fun in LAAX!"},{"version_id":"820443613","version_name":"3.1.3","version_date":"2017-01-23 22:24:40.000 +0800","version_description":"We've been working hard on some new and exciting features!\n\n- Custom Leaderboards for you and your friends. Build public and private leaderboards to see how you stack up against your family and friends.\n- Additional “LAAX OPEN” badges. Did you already get them?\n- We’ve added a feedback feature to hear what you think about our app or LAAX in general. A huge thanks for all your effort to help us improve our beloved LAAX!\n- We've taken your feedback to improve the Live Transport feature. There is now a clear differentiation between Postauto and the free FLF Shuttles. We've also simplified the bus directions to make it easier to figure out which bus to catch.\n- We fixed some bugs within Leaderboards and Live Feed. Double notifications and missing rankings should now be a thing from the past.\n\nWe hope you enjoy the new features and improvements. Now get out there and make the most of the amazing conditions on the mountain!!"},{"version_id":"820856925","version_name":"3.1.4","version_date":"2017-02-08 23:53:27.000 +0800","version_description":"Don't reinvent the wheel was the motto for this version of our app. That's why we switched our map to Google Maps.\nWe hope that this makes our app an even better helper around LAAX and you'll find everything you need in no time.\nAdditionally, we fixed some minor bugs and improved content within the app.\nHave fun in LAAX and enjoy the snow!"},{"version_id":"821197832","version_name":"3.1.5","version_date":"2017-03-11 06:52:37.000 +0800","version_description":"It's time for some new features:\n- An in-depth timeline view of your on mountain performance. See how many points and which badges you've collected over time as well as your leaderboard rankings.\n- Stay safe! Now you're always up-to-date with the new avalanche risk feature within our snow report.\n- New rewards to use your loyalty points on.\n- Points for leaderboard rankings are now shown within the actual leaderboards. So keep on riding to claim those points!\n- Improved offline-functionality (snow report, lift status as well as transactions) and additional pull-to-refresh feature for transport, transactions and reservations.\nNow get up on the mountain and have some fun riding. If you like what we did, we'd appreciate a rating in the app store. Thanks!"},{"version_id":"821607002","version_name":"3.1.8","version_date":"2017-04-10 16:34:27.000 +0800","version_description":"Spring has arrived and so has a new feature within our Premium section. This is what we have for you with this new version:\n- Predict the future and earn INSIDE points for the best guess. Try to estimate how many people will be on the mountain in the next few days - only available within our Premium section!\n- General usability improvements and bug fixes.\nHave fun guessing and get yourself some more points."},{"version_id":"822416078","version_name":"4.0.0","version_date":"2017-06-07 22:32:37.000 +0800","version_description":"Are you ready for summer? \nThe INSIDE LAAX summer update brings you all you need for an adventure filled summer in Flims Laax Falera. \nCompletely re-designed, including insider activity guides and the new  Explorer Points with approximately 100 \"Check-In\" locations will turn your summer into a pure outdoor adventure. Here are the Highlights of INSIDE LAAX 4.0:\n\nEXPLORER POINTS (XPs):\nFrom the Caumasee over the UNESCO World Heritage to the historical via ferrata Pinut – 100 \"Check-In\" locations were assembled to provide you a list of adventures and must-sees for the summer of 2017. Once you get close enough, you can check yourself in and mark this adventure as \"done\". With each \"Check-In\" you collect XPs, which bring you from one level to the next. So hike, bike and swim yourself from a \"Tourist\" up to a \"Local Legend\". \n\nINTERACTIVE MAP:\nThe completely re-designed outdoor map makes sure you keep your orientation on every expedition. \n\nTRANSPORT:\nWith the new interactive transport feature, you'll find your next bus or train easier than ever before.\n\nSHOP:\nNo matter if its lift tickets or an entry to the Caumasee – In the new shop you can get your tickets within seconds. \n\nEXPLORER LIVE:\nWeather, webcams , opening hours and lake temperatures. Here you'll find all the live information you need to help you complete that next adventure.\n\nGASTRO:\nFind restaurants near you, book a table or order take away. All this is possible within Gastro. \n\nME:\nAll about YOU! You can see your profile, your history of activities from winter as well as from summer, the amount of collected XPs and INSIDE reward points.\n\nWe wish you an adventure filled summer! So, put on your hiking and biking gear and enjoy the natural beauty of Flims Laax Falera – over 100 \"Check-Ins\" are waiting to be explored!"},{"version_id":"822474482","version_name":"4.0.2","version_date":"2017-06-10 16:17:16.000 +0800","version_description":"We’ve done some bug fixes to make your outdoor summer experience in Flims Laax Falera even better.\nIn this version you'll find some more “Check-In” locations around Flims Laax Falera so you can explore even more of the Local’s favorite hidden spots of the area. Additionally to XPs you also earn INSIDE Points with every “Check-In” you do. Easily redeem the INSIDE Points in the Reward shop for merchandise or other good offers.\n\nThe map runs now even smoother and highlights such as the UNESCO World Heritage Area or the Caumasee can be easily found due it’s \n\nNow enjoy your outdoor summer in the Swiss Alps."},{"version_id":"822653225","version_name":"4.0.5","version_date":"2017-06-24 14:30:45.000 +0800","version_description":"Are you ready for an outdoor adventure? If so, you’re going to enjoy this major update for sure! \n\n+++Check-ins+++: We have added even more “Check-in” locations around Flims Laax Falera which are waiting to be discovered. \n+ You now have the opportunity to check-in to a location multiple times. \n+ The new check-in panel makes finding and checking in at locations close to you even easier. Go and collect all the “Check-ins” in Flims Laax Falera.\n+ If you buy your Caumasee entry ticket with your INSIDE Reward points, the ticket is directly added to your account. Don’t lose any time at the ticket box office and dive straight into the cristal clear water. \n+ The map was further improved, runs more smoothly and shows you more details. \n+ Tokens (vouchers) are now even easier to redeem.\n+ The date issues in the calendar and the transport function are now fixed so you won’t miss any highlight of the Swiss alps anymore. \n+ A credit card scanner was implemented so you do not have to dial in the numbers manually.\n\nA few other basic bug fixes makes this version of INSIDE LAAX run smoother than any version before. Enjoy your summer in the Swiss Alps and advance from a \"Tourist\" to a \"Local Legend\"."},{"version_id":"823020693","version_name":"4.1.0","version_date":"2017-07-28 15:44:07.000 +0800","version_description":"This is the first major update since the initial release of the new INSIDE LAAX Summer version, and with it comes some awesome new features and improvements:\n- Badges are back. Which do you have already?\n- Check-in and claim your spot at the top of the leaderboards\n- Use your INSIDE points and redeem them for a drink or meal within mobile ordering\n- Several new Check-ins have been added! Do you have them already?\n- Bug fixes within Gastro and usability improvement\n\nHave fun exploring and we hope you enjoy the new features!"},{"version_id":"828073167","version_name":"5.4.0","version_date":"2018-08-04 21:35:17.000 +0800","version_description":"Introducing ‘Daily Check-Ins’ (and a whole load of under-the-hood improvements)!"},{"version_id":"828165258","version_name":"5.4.1","version_date":"2018-08-10 01:51:00.000 +0800","version_description":"Just some bug fixes to keep everything running smoothly — including a fix for an issue that may have prevented you from placing a restaurant reservation. Apologies if you were affected by that!"},{"version_id":"828276439","version_name":"5.4.2","version_date":"2018-08-20 23:33:50.000 +0800","version_description":"Bike and hike after 14:45 with the new After-Work ticket, available exclusively via the app.\n\nBike the whole day for a special price – every Wednesday with the Happy Midweek Ticket."},{"version_id":"828550225","version_name":"5.4.3","version_date":"2018-09-13 04:34:57.000 +0800","version_description":"– Book your ticket for the PostBus Shuttle between Laax, Val Vau, and Nagens – no need to carry cash\n– Learn about the history of Swiss aerial cableways at Das Gelbe Haus in Flims – book your ticket via the app today!\n– You can also now check out who’s on top of the Leaderboards for Check-Ins and Explorer Points"},{"version_id":"828648203","version_name":"6.0.0","version_date":"2018-10-10 16:33:20.000 +0800","version_description":"Critical updates in preparation for Winter 2018/19"},{"version_id":"829116973","version_name":"7.0.1","version_date":"2018-11-01 04:38:21.000 +0800","version_description":"INSIDE LAAX is ready for winter!"},{"version_id":"829324877","version_name":"7.5.0","version_date":"2019-01-19 21:29:36.000 +0800","version_description":"With this release, we continue with our vision to make your stay in Flims-Laax-Falera ever simpler. As always, we’ve been working on performance and bug fixing under the hood.\n\nIf you have any questions, shoot us an email at insidelaax@laax.com!"},{"version_id":"830088068","version_name":"7.6.0","version_date":"2019-01-31 03:06:20.000 +0800","version_description":"We’ve got an update for you with new tickets and fixes.\n\n– Enjoy the mountain at night and get your night skiing and sledging tickets now on the app.\n– We have a new baby in our e-Shuttle family, now with 4 seats available.\n– We fixed our Blueline Upgrade to be available to all tickets except Flex (Wahlweise).\n– Additionally we fixed some minor bugs to make your experience as smooth as possible.\n\nEnjoy INSIDE LAAX and have a great time outside!"},{"version_id":"830162435","version_name":"7.6.1","version_date":"2019-02-01 23:34:57.000 +0800","version_description":"– We’ve added info about the Nightliner, LAAX School, and LAAX Homes.\n– Half-Day Tickets weren’t working in the last version – they’re fixed now.\n\nEnjoy INSIDE LAAX and have a great time on the mountain!"},{"version_id":"830222616","version_name":"7.6.2","version_date":"2019-02-09 21:14:40.000 +0800","version_description":"We just have a few bug fixes for you with this update.\n\nEnjoy INSIDE LAAX and have a great time on the slopes!"},{"version_id":"830485047","version_name":"7.7.0","version_date":"2019-03-07 17:24:36.000 +0800","version_description":"In this release we bring you new and improved convenience for more carefree experiences on the mountain in the summer and winter. \n\nThe new topcard feature, just in time to the start of the presale, allows you to automatically renew your topcard from now on in-app! Existing customers can renew their summer 2019 and winter 2019/2020 topcards now and make sure you have the LAAX experience secured for the coming year with zero hassle. New registrations without a photograph in the system need to still be done at the liftticket counters. \nIf you have ever been left without a parking spot in the best location right next to the lift and would like to avoid this - inisde LAAX Parking is for you. Now you can see how many of the exclusive parking spots are still available to loyal customers in the parking garage at Laax Base Station. \n\nWe look forward to see you for some spring shredding soon!"},{"version_id":"830838978","version_name":"7.7.1","version_date":"2019-04-03 18:51:44.000 +0800","version_description":"This update brings a new feature that allows you to favourite the restaurants you love most. There are also some special new badges on the way. Under the hood improvements as always."},{"version_id":"830994479","version_name":"7.8.0","version_date":"2019-04-17 05:07:51.000 +0800","version_description":"This release brings you a preview of the rentals shop that will be available next winter. You can also now buy a LAAX Time voucher, to give the gift of time on the slopes next season."},{"version_id":"831358933","version_name":"7.9.0","version_date":"2019-05-24 14:03:49.000 +0800","version_description":"INSIDE LAAX is ready for summer!"},{"version_id":"836838853","version_name":"10.0.27","version_date":"2020-07-15 22:19:59.000 +0800","version_description":"Happy summer holidays! This is new within Inside Laax:\r\n\r\n- Countdown for free spots at Lake Cauma - make sure you have yours\r\n- Mobile Ordering Status Updates now in Explore for your active orders\r\n- Several small changes under the hood\r\n\r\nEnjoy your summer in Flims Laax Falera\r"},{"version_id":"836863647","version_name":"10.0.28","version_date":"2020-07-16 20:12:34.000 +0800","version_description":"Happy summer holidays! This is new within Inside Laax:\r\n\r\n- Countdown for free spots at Lake Cauma - make sure you have yours\r\n- Mobile Ordering Status Updates now in Explore for your active orders\r\n- Several small changes under the hood\r\n\r\nEnjoy your summer in Flims Laax Falera\r"},{"version_id":"837047594","version_name":"10.0.29","version_date":"2020-07-29 17:49:46.000 +0800","version_description":"Happy summer holidays! This is new within INSIDE LAAX:\r\n\r\n- Several small changes under the hood\r\n\r\nEnjoy your summer in Flims Laax Falera"},{"version_id":"837330854","version_name":"10.0.30","version_date":"2020-08-13 16:57:24.000 +0800","version_description":"It's hot outside! INSIDE LAAX has cool new stuff for you:\r\n\r\n- Reduced trails within biking and hiking to provide a better overview\r\n- Directions for Points of Interest on Google Maps got fixed\r\n- Shop Checkout with a free-product token is now possible without adding a credit card\r\n- Several small changes under the hood\r\n\r\nEnjoy your summer in Flims Laax Falera"},{"version_id":"837521228","version_name":"10.0.31","version_date":"2020-08-26 21:05:09.000 +0800","version_description":"You can find the following changes in the new version:\r\n\r\n- If a restaurant has temporarily closed their mobile ordering, you will be notified.\r\n- Managing your payment methods in your profile is easier.\r\n- Content is crucial - we improved content management to deliver the most accuarte content to you\r\n- Several small changes under the hood\r\n\r\nEnjoy your summer in Flims Laax Falera"},{"version_id":"837697928","version_name":"10.0.32","version_date":"2020-09-11 01:20:06.000 +0800","version_description":"You can find the following changes in the new version:\n\n- If you added a payment method at checkout you can now manage it in your profile.\n- Push messages open exactly where you want to go\n- More informative error messages, if something goes wrong\n- Several small fixes to improve your experience\n\nEnjoy your time in Flims Laax Falera!"},{"version_id":"837914626","version_name":"10.0.33","version_date":"2020-09-29 14:50:34.000 +0800","version_description":"With this version we're releasing smaller fixes and improvements.\r\nEnjoy your time in Flims Laax Falera!"},{"version_id":"838126442","version_name":"10.0.34","version_date":"2020-10-17 03:41:20.000 +0800","version_description":"With this version we're releasing smaller fixes and improvements.\r\n\r\n- We now clear your table number and comment input after each mobile order\r\n- We introduced an 'order now' and 'book a table' button on search results\r\n- We redesigned and moved the map view button to the center on search results\r\n\r\nEnjoy your time in Flims Laax Falera!"},{"version_id":"838253452","version_name":"10.0.35","version_date":"2020-10-28 00:59:17.000 +0800","version_description":"This is a bigger one! With this version, we're preparing for winter already. Are you excited for the snowy season too?\r\n\r\n- Winter Live is back: check the slope and lift status, get the latest weather report and access to all webcams on the mountain.\r\n- We removed the LAAX ID, for now, check-ins - if required - are handled with other apps\r\n- The improved payment flow makes it easier for you to check out\r\n- You can see the allergenes of each product in the mobile ordering menus\r\n- We redesigned and moved the map view button to the center of the search results.\r\n- As well as many smaller fixes and improvements\r\n\r\nGet ready for winter. Enjoy your time in Flims Laax Falera!"},{"version_id":"838506705","version_name":"10.0.36","version_date":"2020-11-11 23:30:43.000 +0800","version_description":"Winter is coming! And we continue to prepare the app for the cold time of the year.\r\n\r\n- TWINT: Pay tickets and mobile orders now easily using TWINT!\r\n- PLAY: is ready to go. Are you ready to climb leaderboard ranks?\r\n- LIVE: We made Q-Alert webcams available to everyone. Q-Alert webcams show queues at lift stations. This makes it easier to avoid waiting times and crowds.\r\n- Many smaller fixes and improvements\r\n\r\nEnjoy your time in Flims Laax Falera!"},{"version_id":"840439174","version_name":"10.0.43","version_date":"2021-02-11 22:16:32.000 +0800","version_description":"Welcome to winter holidays. This is our updates:\n\n- See more on our improved webcam detail view\n- Some smaller improvements and bug fixes\n\nStay safe and we're wishing you nice winter holidays."}]