[{"version_id":"813469640","version_name":"1.0.1","version_date":"2015-09-21 18:54:55.000 +0800","version_description":""},{"version_id":"813469641","version_name":"1.0.2","version_date":"2015-10-01 15:57:45.000 +0800","version_description":"Thank you so much for helping Sleep++ get off to such a strong start!  I really appreciate all the feedback and am working hard at making the app even better.<br><br>This update is smaller bug fix update while I work on a few bigger features for v1.1.  It includes:<br><br>- Makes it clearer within the app if motion tracking permission was allowed by the user.<br>- Allows you to delete nights from the iPhone app (Swipe on the row you want to remove)<br><br>If you have a minute to leave a review in the App Store I would really appreciate it.  It really helps get the word out about the app. <br><br>—Dave"},{"version_id":"816297983","version_name":"2.0","version_date":"2016-02-11 10:56:23.000 +0800","version_description":"Building on the initial success of Sleep++ I'm delighted to announce Sleep++ 2.0. This update is centered around major improvements to the sleep analysis engine, making it far better at helping you understand your sleep.<br><br> - The sleep analysis algorithm has been completely overhauled to allow for more fine grained sleep-type characterization.  It can now accurately differentiate between deep sleep, light sleep, restlessness and wakefulness.  These algorithmic improvements greatly increase the usefulness of the data collected.<br>- The HealthKit support for the app has been greatly improved beyond the the basic data previously collected.  Detailed analysis of your night is now saved in Health for further use.<br>- A night detail screen now provides for more clear explanation of the quality of each night, telling you when you slept well and when you were restless.<br>- You can now trim nights from the detail screen, useful for when you forget to stop the sleep analysis when you wake up in the morning. <br>- The app now more fully supports time zone changes letting you get a more consistent view of your sleep as you travel.<br><br>I hope you enjoy the update, thank you so much for all your support."},{"version_id":"817364924","version_name":"2.0.1","version_date":"2016-05-17 13:34:55.000 +0800","version_description":"This update is all about fixing little bugs and issues."},{"version_id":"817434781","version_name":"2.0.2","version_date":"2016-05-19 13:30:37.000 +0800","version_description":"I was finally able to track down and fix a lingering bug where nights recorded on your Apple Watch were not being correctly transferred back to your iPhone.  The missing nights should reappear after you have installed this update and then opened the Apple Watch app."},{"version_id":"818797055","version_name":"2.1","version_date":"2016-09-13 17:53:17.000 +0800","version_description":"This update brings support for watchOS 3 and iOS 10!  This allows me to make several substantial improvements to the app including:<br>- Dramatically increased night analysis time.  Should now typically take only a few seconds to process.<br>- Faster startup and activation <br>- More consistent complication updating<br>- Share the details of your last night's sleep in iMessage with our new iMessage app."},{"version_id":"819340837","version_name":"2.1.1","version_date":"2016-10-18 13:15:15.000 +0800","version_description":"Thanks for all the feedback and support for the watchOS 3 update. This update is all about cleaning up a few lingering bugs in Sleep++.  These include:<br>- Fixes to the way times are shown in Germany<br>- Fix handling of 24 hour times<br>- Fix an issue where deleted nights get restored<br>- Fix the last night duration shown in the modular complication <br>- as well as a handful of more minor bug fixes.<br><br>Thank you for all your feedback and support.  If you have a minute to leave a review for Sleep++ in the App Store, I'd really appreciate it.  It really helps!<br><br>—Dave"},{"version_id":"821609585","version_name":"2.1.2","version_date":"2017-04-05 16:27:08.000 +0800","version_description":"With this update I squashed a few bugs that needed attention, while I work on a bigger update that brings better sleep analysis tools.  These updates include:<br>- Reducing the occurrences of the \"Not Authorized\" error<br>- Fix a bug that was preventing the sleep data from being loaded into the Health app<br>- Fix a bug with the layout of the night display on the Apple Watch<br><br>Thanks for all your feedback and support of Sleep++."},{"version_id":"824263887","version_name":"2.2","version_date":"2017-11-06 17:17:24.000 +0800","version_description":"This update:<br> - Adds support for the iPhone X<br> - Updated visual design<br> - Enhanced support and help documentation to get you sleeping quicker."},{"version_id":"826206413","version_name":"3.0","version_date":"2018-03-20 09:01:08.000 +0800","version_description":"I'm delighted to introduce Sleep++ version 3.0, with Automatic Sleep Tracking!  This has been by far my biggest feature request since I started working on Sleep++.  Now all you have to do is wear your Apple Watch while you sleep and Sleep++ will take care of the rest.  No need to start/stop your sleep each night.  <br><br>My goal is to provide every Apple Watch owner with a free automatic sleep tracker that is simple and clear to understand.  For each night you get a straightforward report of how long you slept and how restful you were during the night.  <br><br>Additionally:<br> - you can now set a bedtime reminder to help you build a more consistent sleep schedule<br> - get a notification with a summary of your previous night's sleep each morning (automatic mode)<br> - set a nightly sleep goal and Sleep++ helps show you how consistently you are reaching it<br><br>I hope you enjoy the update.  If you see any mis-categorized automatic nights please let me know so that I can tweak and improve the algorithm going forward.  Thanks!<br><br>  —Dave"},{"version_id":"826386438","version_name":"3.0.1","version_date":"2018-03-21 17:48:50.000 +0800","version_description":"This is quick bug fix update for version 3.0.  It includes: fixes for Health data saving, displays nights that start after midnight as belonging to the day before, and VoiceOver improvements.<br>-------<br>I'm delighted to introduce Sleep++ version 3.0, with Automatic Sleep Tracking!  This has been by far my biggest feature request since I started working on Sleep++.  Now all you have to do is wear your Apple Watch while you sleep and Sleep++ will take care of the rest.  No need to start/stop your sleep each night.  <br><br>My goal is to provide every Apple Watch owner with a free automatic sleep tracker that is simple and clear to understand.  For each night you get a straightforward report of how long you slept and how restful you were during the night.  <br><br>Additionally:<br> - you can now set a bedtime reminder to help you build a more consistent sleep schedule<br> - get a notification with a summary of your previous night's sleep each morning (automatic mode)<br> - set a nightly sleep goal and Sleep++ helps show you how consistently you are reaching it<br><br>I hope you enjoy the update.  If you see any mis-categorized automatic nights please let me know so that I can tweak and improve the algorithm going forward.  Thanks!<br><br>  —Dave"},{"version_id":"826485560","version_name":"3.0.2","version_date":"2018-03-29 09:32:56.000 +0800","version_description":"Thank you all for the great response to 3.0.  I really appreciate all the support you've shown.  This little update fixes an issue where deleted nights could reappear, clarifies the use of the Apple Watch app, and prevents a bug that caused extremely long nights to be created. <br>    —Dave<br><br>--- New in v3.0 ---<br><br>I'm delighted to introduce Sleep++ version 3.0, with Automatic Sleep Tracking!  This has been by far my biggest feature request since I started working on Sleep++.  Now all you have to do is wear your Apple Watch while you sleep and Sleep++ will take care of the rest.  No need to start/stop your sleep each night.  <br><br>My goal is to provide every Apple Watch owner with a free automatic sleep tracker that is simple and clear to understand.  For each night you get a straightforward report of how long you slept and how restful you were during the night.  <br><br>Additionally:<br> - you can now set a bedtime reminder to help you build a more consistent sleep schedule<br> - get a notification with a summary of your previous night's sleep each morning (automatic mode)<br> - set a nightly sleep goal and Sleep++ helps show you how consistently you are reaching it"},{"version_id":"826637103","version_name":"3.0.3","version_date":"2018-04-11 18:48:04.000 +0800","version_description":"Quick bug fix update to fix an issue where automatic nights weren't being correctly saved to the Health app and better handling of authorization issues in the Apple Watch app."},{"version_id":"826707919","version_name":"3.0.4","version_date":"2018-04-17 19:00:53.000 +0800","version_description":"Whoops, it looks like the last update included a bug in the processing of manual nights.  This update fixes the bug.  Your previously recorded nights should process the next time you open up the Apple Watch app.  I'm so sorry for the trouble.<br> —Dave"},{"version_id":"827253151","version_name":"3.0.5","version_date":"2018-06-28 05:41:02.000 +0800","version_description":"This update now allows you to manually extend an automatic night beyond its detected start and end times.  In previous versions you could only shorten nights.  This should allow you to fix any situations where the automatic night analysis system misjudged the beginning or end of your night's sleep.  To do this, hit 'Adjust Night' once you have selected a night. <br><br>This update also addresses a rare bug relating to duplicate automatic nights being created."},{"version_id":"827887506","version_name":"3.1","version_date":"2018-07-17 10:21:35.000 +0800","version_description":"This update includes:<br> - A new Widget for quickly checking your last night's sleep details<br> - Improvements to Morning Sleep Summary notifications<br> - Clearer explanations of what might be causing permission based issues with automatic tracking"},{"version_id":"828600965","version_name":"3.2","version_date":"2018-09-17 10:37:30.000 +0800","version_description":"This update is all about making sure that Sleep++ looks great on all iPhone and Apple Watches.<br><br>Additionally, it includes support for new complication types.<br><br>Enjoy!"},{"version_id":"828694364","version_name":"3.2.1","version_date":"2018-09-24 20:13:41.000 +0800","version_description":"Quick bug fix update to address a situation where some settings switches couldn't be changed on certain devices."},{"version_id":"833614486","version_name":"4.0","version_date":"2019-11-19 15:48:26.000 +0800","version_description":"I'm delighted to announce the next major update to Sleep++! This update is primarily focused around helping you make sense of your sleep data, to you make better sleep choices each night.<br><br>New Trends area:<br>- Typical Night Graph: Visualizes when you typically go to bed and rise in the morning, both overall and per day of the week<br>- Sleep Duration Score: Shows you how well you've been doing at reaching your nightly sleep goal recently<br>- Bedtime Consistency Score: Shows how consistently you are getting to bed each night<br><br>It also includes:<br>- The ability to export your sleep data as a CSV table file<br>- The ability to manually record a missing night, or to use the app without an Apple Watch as a simple sleep diary<br>-  Improved night editing"},{"version_id":"833709340","version_name":"4.0.1","version_date":"2019-11-22 10:47:23.000 +0800","version_description":"Quick bug fix to address a situation that could result in an app crash.  Sorry about that!"},{"version_id":"833971979","version_name":"4.0.2","version_date":"2019-12-12 15:10:47.000 +0800","version_description":"Fixes for trend explanations and graph axis labels."},{"version_id":"835349768","version_name":"4.0.3","version_date":"2020-03-31 23:01:13.000 +0800","version_description":"Fix for a situation that would prevent the Morning Sleep Summary from being delivered."},{"version_id":"835906382","version_name":"4.0.4","version_date":"2020-05-11 20:47:39.000 +0800","version_description":"- Includes a fix for a crash that could occur during export"},{"version_id":"836463239","version_name":"4.1","version_date":"2020-06-18 15:54:18.000 +0800","version_description":"- Performance and Battery Life improvements<br>- Fix VoiceOver for adjusting the start/end times of nights"},{"version_id":"837803900","version_name":"4.2","version_date":"2020-09-16 20:19:29.000 +0800","version_description":"- Incorporates the new system sleep tracking capabilities to improve automatic sleep tracking accuracy<br>- Adds a Sleeping Heart Rate trend graph showing your average heart rate during periods of good sleep<br>- Adds a Nightly trend graph showing your sleep/wake times over time<br>- Adds a home screen widget"},{"version_id":"838048474","version_name":"4.2.1","version_date":"2020-10-01 21:53:41.000 +0800","version_description":"Small bugfix update to fix a capitalization error and a situation where times were shown incorrectly."},{"version_id":"838330916","version_name":"4.3","version_date":"2020-10-22 13:13:20.000 +0800","version_description":"This update adds a Blood Oxygen graph to the Trends area, showing your recent measurements on compatible Apple Watches."},{"version_id":"838449526","version_name":"4.3.1","version_date":"2021-02-02 09:01:38.000 +0800","version_description":"Minor layout and compatibility fixes."},{"version_id":"840370021","version_name":"4.3.2","version_date":"2021-02-06 09:13:16.000 +0800","version_description":"Adds a new Sleep Goal Widget"},{"version_id":"840437105","version_name":"4.3.3","version_date":"2021-02-12 12:09:25.000 +0800","version_description":"- Improves sleep analysis method to avoid unexpected changes when trimming nights<br>- Improvements to explanations of Automatic Sleep Tracking"},{"version_id":"842300279","version_name":"4.3.4","version_date":"2021-05-21 11:19:25.000 +0800","version_description":"- Addresses an issue where trimmed nights were not shown correctly in Trends<br>- Addresses an issue where the previous night's data was not shown correctly in Trends<br>- Corrects display of Sleeping Heart Rate after night data is updated"},{"version_id":"842667352","version_name":"4.3.5","version_date":"2021-06-15 18:56:05.000 +0800","version_description":"Minor bug fix update."}]