[{"version_id":"815857542","version_name":"0.2.0","version_date":"2016-01-14 08:15:11.000 +0800","version_description":"Découvrez les nouveautés à venir dans la prochaine version de l'application"},{"version_id":"816618921","version_name":"1.0","version_date":"2016-03-29 08:14:50.000 +0800","version_description":"Plusieurs nouveautés au programme de cette mise à jour :<br><br>- Le client retrouve automatiquement sa ou ses cartes détenues<br>- Paylib, le nouveau service de paiement sur internet simple et sécurisé<br>- La personnalisation des fonctionnalités de la carte avec l’augmentation temporaire des plafonds carte (sous réserve d’éligibilité) et l’activation/désactivation des paiements à distance<br>- La visualisation de l’encours débit différé et des opérations associées.<br><br>N’hésitez pas à nous contacter sur la boîte support pour tout problème ou suggestion d’amélioration."},{"version_id":"817348247","version_name":"1.1","version_date":"2016-05-30 08:38:03.000 +0800","version_description":"Corrections et améliorations diverses."},{"version_id":"817788432","version_name":"2.0","version_date":"2016-07-07 08:12:36.000 +0800","version_description":"Dans cette nouvelle mise à jour :<br>- Activation/désactivation des fonctionnalités de paiement carte à l’étranger<br>- Détail de vos opérations cartes à débit immédiat <br>- Enregistrement de vos cartes de fidélité dématérialisées de vos boutiques préférées <br>- Affichage de l’encours pour les cartes à débit différé<br>- Autres corrections et améliorations diverses"},{"version_id":"819164786","version_name":"2.1","version_date":"2016-12-12 08:47:59.000 +0800","version_description":"1 - Recevoir et paramétrer des notifications<br>2 - Naviguer plus facilement entre l’application « Ma Banque » et « Ma Carte »<br>3 - S’inscrire dans l’application « Ma Carte » en réutilisant son profil existant « Ma Banque »"},{"version_id":"823832597","version_name":"4.0","version_date":"2018-03-05 08:53:32.000 +0800","version_description":"Diverses améliorations d’ergonomie et d’interface."},{"version_id":"823832597","version_name":"2.2","version_date":"2017-10-19 08:48:58.000 +0800","version_description":"Correctif sur la fonctionnalité Paylib en iOS 11."},{"version_id":"825787266","version_name":"4.0","version_date":"2018-03-05 08:53:32.000 +0800","version_description":"Diverses améliorations d’ergonomie et d’interface."},{"version_id":"826477451","version_name":"4.1","version_date":"2018-04-23 08:01:55.000 +0800","version_description":"Améliorations  fonctionnelles.<br><br>Vous utilisez l’application Ma Carte et nous en vous remercions vivement.<br>Nous effectuons régulièrement des mises à jour pour vous garantir une expérience optimale.  Cette version comporte un certain nombre de correctifs qui visent à  améliorer la fiabilité de l’application.<br>Aussi, ne tardez pas à l’installer !"},{"version_id":"828910647","version_name":"5.0","version_date":"2018-11-07 08:17:14.000 +0800","version_description":"Votre expérience de paiement Paylib s’enrichit sur l’application Ma Carte<br><br>- Payez vos amis en un seul geste depuis votre mobile, il vous suffit d’avoir le numéro de mobile de votre bénéficiaire, qu’il soit client Crédit Agricole ou pas<br>- La mise à jour quotidienne  de votre application devient manuelle, pour davantage de confort au moment du paiement, c’est vous qui décidez quand vous souhaitez rafraîchir vos données<br>- Porteurs d’une carte EKO, retrouvez le visuel de votre carte dans votre Application Ma Carte !"},{"version_id":"829522346","version_name":"5.1","version_date":"2018-12-10 13:52:14.000 +0800","version_description":"« Vous utilisez l’application Ma Carte et nous en vous remercions vivement.<br><br>Nous effectuons régulièrement des mises à jour pour vous garantir une expérience optimale. Cette nouvelle version comporte un certain nombre de correctifs qui vont améliorer la fiabilité de l’application. Profitez-bien de votre nouvelle application ! »"},{"version_id":"830907657","version_name":"6.0","version_date":"2019-04-29 07:41:43.000 +0800","version_description":"Nous effectuons régulièrement des mises à jour pour vous garantir une expérience optimale. <br>Dorénavant vos amis reçoivent l’argent en quelques secondes grâce au paiement instantané s’ils ont déjà activé Paylib entre Amis !"},{"version_id":"840455286","version_name":"7.0.3","version_date":"2021-03-02 08:36:07.000 +0800","version_description":"Découvrez la nouvelle application Paiement mobile !<br>Profitez d’une toute nouvelle expérience de paiement, plus fluide et fiable pour régler vos achats sur internet et rembourser vos proches d’un simple geste avec votre mobile. <br>Accédez à la gestion des options de vos cartes depuis la rubrique paramètres disponible sur la page d’accueil."},{"version_id":"840959974","version_name":"7.0.7","version_date":"2021-03-19 11:21:48.000 +0800","version_description":"Cette version inclut des corrections de bugs et des améliorations de performances."}]