[{"version_id":"816339778","version_name":"1.0.4","version_date":"2016-02-09 15:30:29.000 +0800","version_description":""},{"version_id":"816498039","version_name":"1.0.8","version_date":"2016-02-24 10:08:23.000 +0800","version_description":"- Manual screen rotate button added. Tap the rotate icon on the title screen to rotate the screen.<br>- Bug where a portion of the effects do not work after the last boss battle now fixed.<br>- BGM during the ending sequence now synced with the video.<br>- Text regarding available space necessary edited. (No changes made to space requirements.)<br>- Bug where the app crashes on some devices when summoning now fixed. (includes events)<br>- Bug where Vivi's \"Reflectx2\" ability causes Magic Stones to deplete and abilities to disappear now fixed. (In the case of Magic Stones, up to the maximum limit will be restored. Please note that this will cause all equipped abilities to be unequipped.)<br>- Other bugs fixed."},{"version_id":"816645181","version_name":"1.0.9","version_date":"2016-03-11 03:04:07.000 +0800","version_description":"- Bug where certain options cause the Magic Stone stat growth bonus to be reset now fixed.<br>- Bug where the max level Magic Stone booster induces no stat growth bonus now fixed. (Equipment bonuses do not apply.)<br>- Virtual game pad now responds beyond the in-game screen.<br>- Other bugs fixed."},{"version_id":"816966361","version_name":"1.1.3","version_date":"2016-04-11 00:31:49.000 +0800","version_description":"- We have corrected the amount of Magic Stones that transfer from Marcus to Eiko when she joins the party.<br>(The amount of Magic Stones in games where Eiko has already joined the party will also be corrected based on level. However, the amount of Magic Stones that transfer from Marcus in future may vary. New games and games where Eiko was added to the party only after the update should function normally. Thank you for your patience.)<br>- We have fixed the bug where disembarking from a Chocobo or airship can cause Zidane to disappear and players to be unable to progress in the game. Please update affected games to the newest version to fix the bug.<br>- Other minor bugs fixed."},{"version_id":"817417230","version_name":"1.2.0","version_date":"2016-05-18 09:52:19.000 +0800","version_description":"-The bug where certain devices cannot access the Cloud save function has been fixed.<br>-The bug where disembarking from certain modes of transportation causes Zidane to disappear and players to be unable to progress in the game has been fixed.<br>-Other minor bugs fixed."},{"version_id":"817779748","version_name":"1.3.3","version_date":"","version_description":""},{"version_id":"818151922","version_name":"1.3.5","version_date":"2016-07-19 09:25:01.000 +0800","version_description":"Below are the details of the revision.<br>・The problems that forced termination when used summoned beast at some battle scenes.<br>・Others, some detailed wrong text."},{"version_id":"821100001","version_name":"1.4.9","version_date":"2017-03-03 01:25:54.000 +0800","version_description":"-Minor bugs fixed."}]