[{"version_id":"815464004","version_name":"1.8.81","version_date":"2016-01-05 23:23:07.000 +0800","version_description":"1、新增粉丝互动关注功能，第一时间把握短线操盘手观点动态。逆命、狗蛋、King神、律动天成、或渊、A股民老村长、波段之子全都在换手率短线炒股神器App等你！快快快来翻牌吧！\n2、修复完善了2个来自用户提交的bug，升级优化了3个来自用户反馈的高优先级建议。"},{"version_id":"815928059","version_name":"1.8.82","version_date":"2016-01-26 03:41:53.000 +0800","version_description":"1、新增实时3日、5日个股主力资金净流入追踪，支持日K线主力资金量化历史动向查询。\n2、新增自定义K线除复权设置，同时支持均线自由定义1-250K任意周期及颜色！\n3、优化自选股添加后个股状态，支持从多个组合中选择任意一个或特定几个组合取消相应组合内的自选股。\n4、2016年元月期间，新增签约入驻77家近三年复合年化收益150%+国内顶级短线操盘手自媒体，免费提供短线股市走势预测，准准准到爆！帮助短线股友及时规避大盘风险，挖掘更多妖股获取短线超额收益！就是这么666666！张重、吉利、郭施亮、余岳桐、汪海、西瓜槽股、孥孥的大树、加戈、向大侠论剑、幽兰行天下、lefthand、牛没落、dq951163、事件驱动李、弦舞者、擒龙作手、湖南人、浑水摸金、此岸即彼岸、三分之一自旋、小凯、淡然的炒、夜行神龙、A快枪阻击手、老钱庄、坐镇华尔街、老夫子看盘、宋弛寻牛记、牛犇犇、元小弟、光哥说事、控盘居士、短线刀客888、霸气波段王等一大波短线神盘感大师全都在换手率短线炒股神器App等你！快快快来翻牌吧！\n5、修复完善了1个来自用户提交的bug，升级优化了5个来自用户反馈的高优先级建议。"},{"version_id":"816374154","version_name":"1.8.83","version_date":"2016-02-16 03:11:19.000 +0800","version_description":"1、2016金猴到来！值此新春佳节之际，换手率短线炒股神器App自媒体大师向全国各地的股友拜年啦！逆命、张重、吉利、擒龙作手、西瓜槽股 、hemong海、菌主、君子、了时休去、律动天成、向大侠论剑、lefthand、A 股民老村长、弦舞者、狙杀涨停、老钱庄、淡然的炒、加戈、三分 之一自旋、A快枪狙击手、老夫子看盘、坐镇华尔街、破坏点交易战法、事件驱动李、狗蛋、牛没落、A股老牛、量化之父、宋驰寻牛记、余岳桐 、或渊、夜行神龙、我是风调、幽兰行天下、坡心哥、小黑解盘、智典投资、短线刀客888、小凯、修罗、股票协会、控盘居士、郭施亮、梵天 沙、卜算子、老牛犇犇、孥孥的大树、让票子越飞越高、此岸即彼岸、向上飞扬、光哥说事、汪海、股宗林、素谋、小猪爱上牛、我的名字叫西 旗、湖南人、张春林、股欲腾飞、霸气波段王、路人_宇、饕餮、欧阳熹等众多短线操盘手大师恭祝换手率股友2016猴年大發發發發發發發！一 年好运随春到！四季彩云滚滚来！万事如意！阖家幸福！\n2、新增独家研发免费实时主力资金量化地图！国内首款独家免费以地图模式实时量化主力资金进攻方向炒股App，零时差云同步分析沪深交易所 深度行情报价，以交易时间内个股实时资金量化大数据为基础，可视化呈现当日、3日、5日大盘、概念、行业、地区等多个复合维度主力（机构 、私募、游资）进攻方向的股票地图关系链。全面支持概念、行业、地区对应板块中所有个股关系链进一步主力流入流出数据实时查询，轻松识 别个股主力抢筹行为，地图面积越大代表主力资金流入越大，地图红绿颜色深浅代表涨跌幅大小！免费迅速帮助股友们发现最强势板块中最强势 个股，与主力共舞，实现短线操作利润最大化！\n3、新增自媒体大师文章实时精准消息推送功能，当自媒体大师盘中发布操盘文章后，系统会第一时间发送消息至关注该自媒体大师的粉丝，让 粉丝及时了解该大师关于大盘及个股买卖点的最新操作指导！还能帮助粉丝们跟着大师提前潜伏涨停板哟！\n4、优化自媒体板块细节功能，新增自媒体大师昵称查询，粉丝能够快速定位找到自己心爱的自媒体大师！新增“我关注的自媒体”选项，粉丝 可以一键实现只看自己所关注的自媒体大师文章内容。\n5、修复完善了2个来自用户提交的bug，升级优化了7个来自用户反馈的高优先级建议。"},{"version_id":"816569281","version_name":"1.8.84","version_date":"2016-03-04 01:30:21.000 +0800","version_description":"1、新增App全界面截图分享功能，股友们能够第一时间把赚钱策略分享给好友！\n2、新增自选股模块自定义编辑排序功能，可轻松调整自选股板块中任意个股的顺序！\n3、修复完善了2个来自用户提交的bug，升级优化了3个来自用户反馈的高优先级建议。"},{"version_id":"816806980","version_name":"1.8.85","version_date":"2016-03-29 21:21:31.000 +0800","version_description":"1、新增实时资金量化个股近5日每日主力主被动买卖饼图数据、每日主力净流入数据、每日换手率DDX数据，支持个股近5日每日机构、大户、中户、散户各自买卖总股份、占比、均手、均价全盘回测！\n2、新增换手率模块涨停基因排序，用户可根据当日个股换手率并结合涨停基因一键轻松选出涨停预期个股！涨幅榜新增5分钟涨速、量比、委比等排序字段，便于短线股友盘感瞬间买卖点！\n3、新增我的设置栏目自定义消息推送选项，支持用户全局关闭消息推送，避免信息大爆炸时代造成的用户打扰。\n4、新增个股分时页面多股对比保存功能，支持全部K线指标周期设置及指标排序自定义，支持全部榜单列表个股畅快连续翻页查看！\n5、三月期间，新增签约入驻66家近三年复合年化收益150%+短线操盘手自媒体，免费提供短线股市走势预测，准准准到爆！帮助短线股友及时规避大盘风险，挖掘更多妖股获取短期超额收益。 \n6、修复完善了2个来自用户提交的bug，升级优化了9个来自用户反馈的高优先级建议。"},{"version_id":"817328473","version_name":"1.8.86","version_date":"2016-05-12 00:49:05.000 +0800","version_description":"1、证券交易火爆上线！免费换手率用户专属VIP挂单通道：国内首款独家免费开放开放亿元私募挂单通道炒股App，第一时间抢筹一字板涨停，唯快不破！还在羡慕那些成交量极低，只有别人家买到，你却挂单排队买不到的一字板涨停吗？换手率短线炒股神器App专属VIP通道助您深夜提前快人一步挂单抢筹一字板涨停！提前杀入，妥妥地！\n2、新增实时资金量化个股每日换手率DDY，同时增加支持实时资金量化全部个股换手率DDX、DDY排序！\n3、新增多空博弈量化，实时展现多方势能、空方势能分时量化争夺线，精准盘感把握分时买卖点！\n4、新增B股实时资金流向量化，根据B股交易规律，量身定制B股机构、大户、中户、散户交易行为，轻松识别B股主力资金！\n5、新增日K线CCI顺势指标，判断短线超买超卖，决胜暴涨暴跌行情！同时增加日K线SKDJ慢速随机指标，进一步盘感个股短线趋势！\n6、喂？您好！请问一下我怎样才能和换手率短线炒股神器App短线自媒体操盘手交流呢？赶快更新这个版本就可以实时交流啦！7x24小时自媒体大师互动直播间疯狂到来！独家百度开放云LSS技术支持万人同时在线！你想要的，全都有！\n7、修复完善了2个来自用户提交的bug，升级优化了11个来自用户反馈的高优先级建议。"},{"version_id":"817401490","version_name":"1.8.87","version_date":"2016-05-14 22:31:17.000 +0800","version_description":"1、两天前刚上线的自媒体大师万人实时互动直播间火爆程度大大超乎我们的想象！紧急优化了部分用户订阅非常多位自媒体大师直播间时出现的瞬时高 并发卡卡卡卡卡现象，请各位股友火速更新这个新版本，保证不卡！保证不卡！保证不卡！保证不卡！保证不卡！重要的事情说3遍，最最最最最重要的 事情说5遍！如果再卡，请打我，往死里打！老板说，微信群最大人数500人，QQ群最大人数2000人，你们竟然敢搞10000人直播？是谁给你们的勇气！我 们说，是用户！很多股友说几千人直播没有刷屏的快感，股神就该万人敬仰！我们痴迷于做突破技术极限的事，冲冲冲冲冲！不难做的事情，就不需要我 们做了！活着，就要改变世界，对不对！\n2、修复完善了2个来自用户提交的bug，升级优化了2个来自用户反馈的高优先级建议。"},{"version_id":"817907653","version_name":"1.8.88","version_date":"2016-06-27 11:13:26.000 +0800","version_description":"1、新增个股融资融券标识，标的个股每日同步上海证券交易所及深圳证券交易所数据；同时新增个股沪股通标识，分为沪股通（买卖双向）、沪股通（只可卖），标的个股每日同步香港交易所数据。\n2、新增日K线成交量周期自定义设置，随心所欲盘感最佳短线量能周期！同时新增日K线个股历史换手率数据，深度跟踪主力控盘率及资金筹码成本！\n3、自媒体操盘手直播间红包打赏火爆上线！逆命、张重、大工、三分之一自旋、吉利、止战之殇、狙杀涨停、女神点点、擒龙作手、菌主、海神、数据之王Lefthand、或渊、小厂长CJ、龙虎短线、索罗神、兰心蕙质569、A 股民老村长、雕爷、西瓜槽股、自我实现、律动天成、时冲、顽石投资分析、股票红小兵、好奇的朱先生、大自然法则、我的名字叫西旗、让票子越飞越高、宇辉战舰、郭施亮等众多超神级短线大师你来翻牌！与此同时，本次直播间服务全面优化升级，纳秒级响应，极致极速极爽！\n4、GoGoGo AleAleAle！2016欧洲杯冠军珍藏版头像狂欢上线！法国、英格兰、德国、西班牙、意大利、威尔士、克罗地亚、北爱尔兰、冰岛、爱尔兰、瑞士、斯洛伐克、葡萄牙、波兰、匈牙利、比利时，这个盛夏，谁将决胜711法兰西之夜？听你的！\n5、修复完善了1个来自用户提交的bug，升级优化了18个来自用户反馈的高优先级建议。"},{"version_id":"818336171","version_name":"1.8.89","version_date":"2016-08-03 03:16:16.000 +0800","version_description":"1、涨停强度功能全面疯狂升级！国内顶尖短线涨停板敢死队绝密打板技术量化！独家支持全部沪深个股历史涨停封板成功率排序，为盘感具体个股当日能否成功封住涨停板提供强力大数据分析信心支持！全网首家实时展现当日全部涨停板个股、昨日全部涨停板个股、当日全部涨停板打开个股、昨日全部涨停板打开个股全部板块具体个股数量及最新实时表现！\n2、新增分级基金行情报价，包含分级基金A与分级基金B全部行情，震荡市场中最有钱途的当属逆帅最爱的分级B！短线分级基金穿越牛熊，超暴利！\n3、新增潜伏日历，提前展现未来30天全部可能被游资爆炒的热点概念题材及龙头妖股！短线就是炒预期！索罗神教你提前潜伏超预期！潜伏的魅力在哪里？当韭菜们看到利好出现当天冲动买入时，我们已经获利30%+疯狂出货了，这就是快鱼吃慢鱼的市场！你想要做一辈子韭菜，还是和我们一起割韭菜？\n4、自选股功能深度拓展！增加今日主力净买额、换手率DDX、换手率DDY、三日主力净买额、五日主力净买额、近3日涨幅、近5日涨幅、近一年涨停封板成功率、近一年涨停、近一年触碰涨停、涨停基因等全部特色指标自定义自由任意排序！\n5、新增VIP铁粉勋章，自媒体操盘手铁杆粉丝可通过自由打赏或分享喜爱的操盘手任意文章等方式随机爆出VIP铁粉勋章！VIP铁粉勋章可以在获得后的72小时内免费阅读相应自媒体操盘手的全部限量版VIP铁粉福利文章！快快快！VIP铁粉勋章等你来爆爆爆爆爆爆！\n6、修复完善了2个来自用户提交的bug，升级优化了15个来自用户反馈的高优先级建议。"},{"version_id":"818780926","version_name":"1.8.90","version_date":"2016-09-08 02:58:11.000 +0800","version_description":"1、涨停强度功能持续升级！本次涨停强度新增爆炒热度功能，更大视野更全角度感知短线市场顶尖一线游资每日实时参与激情度，爆炒热度由换手率短线炒股神器App游资涨停板敢死队研究院提供实时核心独家主力量化大数据分析，实时刷新，绝对良心作品，每日短线实时涨停打板必看！同时涨停强度列表拓展升级为今日/昨日涨停板、涨停打开、跌停板、跌停打开全维度板块！\n2、新增个股五日红绿分时连看！助力每一位换手率股友神盘感养成！全网首家独创五日红绿分时图，结合多空博弈、主力实时资金量化打造无敌超神必杀技！红绿分时配合多空博弈帮助股友洞悉每日涨跌背后最本质的万有多空势能引力！红绿分时配合主力实时资金量化帮助股友全新理解每日主力资金对股价的强力拉动！\n3、新增主力实时资金量化近5日每日分时、资金流向、多空博弈、MACD独立分时组合图查询！用户能够清晰回看个股每日具体主力操盘细节动作，盘感近期个股主力操盘风格，提升对短期股价走势预测的准确性！\n4、新增超短线高频1分钟K线，提升超短线隔夜尾盘T+0选股能力！新增用户自定义设置分时主力资金量化中的机构、大户、中户、散户代表线颜色！\n5、新增自媒体操盘手直播间短线独家板块！自媒体操盘手能够7*24实时更新短线独家个股，粉丝们第一时间轻松通过直播间跟踪操盘手神操作，我们先定一个小目标，比如先抓他几个妖王之王、暴涨牛股、连续涨停板！\n6、修复完善了1个来自用户提交的bug，升级优化了19个来自用户反馈的高优先级建议。"},{"version_id":"819124638","version_name":"1.8.91","version_date":"2016-10-06 12:41:57.000 +0800","version_description":"1、热烈庆祝换手率短线炒股神器App上线一周年，每一位独一无二的你构成了梦幻的我们，感恩有你，我想大声说，我爱你！如果非要在这份爱上加一个期限，我希望是.......一万年！\n2、新增操盘手自媒体大师每日多空看盘！2000多位换手率短线操盘手自媒体大师为您免费提前预测大盘涨跌，明日多方阵营有谁谁谁谁谁，空方阵营又有谁谁谁谁谁？明日操盘手自媒体大师看涨占比，看跌占比？这些数据全部统统有！吉利女神、逆命股神、海神、大工老师、擒龙作手、索罗神、张重老师、申万宏源土豪金、三分之一自旋、自我实现、天一投资、好奇的朱先生、龙虎短线、一言九鼎、小厂长CJ等史上最强短线操盘手大师组队PK！谁和谁将并肩作战，谁又和谁将针锋相对？劲！到！爆！谁才是最最最最最最最强的短线控盘大师？您看！\n3、新增个股分时走势实时主力资金量化数据技术指标区域参数自定义顺序设置，随心所欲调换您最爱的短线操盘技术指标参数！指标第一区默认包含：分时量、资金量化、分时额，指标第二区默认包含：MACD、资金流向、多空博弈！每一款技术指标都支持跨区域任意设置默认优先展示顺序位置，就是这么任性！就是这么自由！我们是属于您的私人定制！\n4、全新完美极致适配iOS 10系统，让您感受史上最流畅短线操盘体验，换手率短线炒股神器App视觉体验与最新iPhone7钢琴黑爆款被誉为大师级绝配！快来撩大师！\n5、修复完善了1个来自用户提交的bug，升级优化了17个来自用户反馈的高优先级建议。"},{"version_id":"819739526","version_name":"1.8.92","version_date":"2016-11-16 02:33:23.000 +0800","version_description":"1、爱一只涨停板需要理由吗？需要吗？不需要吗？需要吗？般若波罗蜜！般若波罗蜜！2016年度最大手机炒股App创新诞生！换手率短线炒股神器App全球首家免费开放【超级盘口】功能！09:15:00-15:00:00实时大数据超级盘口毫秒级刷新回看每一笔交易！从开盘到收盘，尽情亲吻每一秒主力细腻的盘口挂单，与涨停板龙虎榜席位游资并肩作战！从前直到现在，爱还在！\n2、新增个股日K线换手率DDX、换手率DDY指标从1990年起全部26年历史大数据，全方位追踪主力流入流出资金变动以及主力扫货出货筹码力度！新增个股1分钟K线、5分钟K线、15分钟K线、30分钟K线、60分钟K线等全部短线K线周期实时主力资金净流入金额，第一时间完美控盘日内T+0！\n3、新增自选股实时多空博弈个股板块，实时动态查看自选股中哪些个股主力多头占优、哪些空头占优！自选股中增加多空博弈实时主力量化大数据为日内T+0短线操盘提供更深维度决策！自选股多空博弈指标红线上穿绿线时，有机会提前潜伏抄底当日涨停板！自选股多空博弈指标绿线上穿红线时，以防万一提前躲避当日暴跌个股！\n4、新增个股K线样式设置，可自由选择默认传统经典版K线、华尔街梦幻红版K线两种款式，我的梦幻红，股票一定红红红红红红红红红！新增个股分时坐标系设置，从默认自由上帝视角坐标系到统一全部涨停板坐标系，怎么盘感好就怎么来！万一用了涨停板坐标系股票就天天涨停板了呢？梦想还是要有的，万一涨停了呢？这是属于您的时代！我们是永远属于您的私人定制！永远！\n5、修复完善了1个来自用户提交的bug，升级优化了26个来自用户反馈的高优先级建议。"},{"version_id":"820370392","version_name":"1.8.93","version_date":"2017-01-03 01:01:26.000 +0800","version_description":"1、换手率短线炒股神器App超神级必杀技“涨停板多空博弈”全面强化升级，由国内一线顶尖龙虎榜席位游资亲自操盘，新增游资多空+捉妖系数+控盘盘感，三大实时个股分时走势预测指标，与多空博弈强强组合使用，将全面大幅度提升你的捉妖潜伏涨停板成功率！同时新增全部个股实时多空博弈六种AI图形识别：多头一路领先、多头上穿空头、多空反复多上、空头一路压制、空头上穿多头、多空反复空上，助您最快时间找到启动点暴涨妖股，提前大概率躲避暴跌风险股！\n2、新增免费VIP机构版全部个股实时资金量化，国内首家公开一线顶尖龙虎榜席位游资短线盘口交易语言，最详细解析机构、超大、大户、大中、中户、散户六大对手盘的炒股App，实时毫秒级量化大数据分析短线私募游资主力交易行为，让对倒、拆单、诱多、诱空、吸筹、出货无处遁形！我们27年磨一剑，专注短线交易！\n3、新增苹果风白色版，一键换肤，自由改变华尔街黑金版默认风格！就像白玫瑰与红玫瑰，你会选哪个？得不到的永远在骚动，我要稳稳的幸福！\n4、新增K线BBI、ENE、EXPMA三大自定义短线操盘必备系统，让您在传统K线均线之外拥有更多元化超神级K线系统，BBI一线定天下！ENE三轨捉大妖！EXPMA金叉看牛熊！\n5、新增K线DMA、ROC两大短线技术指标，DMA指标专业判断短线个股顶、底背离，DMA+MACD+TRIX三巨头组合使用更神准！ROC指标专业衡量短线妖股变动率，潜伏黑马神指标！同时新增K线技术指标隐藏，可以自由隐藏N个不常用的指标，瞬间提升短线操盘效率！\n6、2016年全年，新增签约入驻7267家近三年复合年化收益150%+短线操盘手自媒体，免费提供短线股市走势预测，准准准到爆！帮助短线股友及时规避大盘风险，挖掘更多妖股获取短期超额收益！\n7、修复完善了1个来自用户提交的bug，升级优化了17个来自用户反馈的高优先级建议。"},{"version_id":"820805302","version_name":"1.8.94","version_date":"2017-02-07 14:39:33.000 +0800","version_description":"1、2017金鸡报囍！值此新春佳节之际，换手率短线炒股神器App自媒体大师向全国各地的股友拜年啦！逆命、张重、吉利女神、狗蛋、花荣、擒龙作手、或渊、郭施亮、三分之一自旋、大工、cufe大投机家、hemong海、好奇的朱先生、lesliesay、潜伏君老索、小厂子CJ、imammon、龙虎短线、克洛泽、自我实现、只做真龙、好运2017、宇辉战舰、纵横飞扬、饮马天涯、两天一只涨停板、君子、律动天成、破坏点交易战法、量化之父、修罗、黑马M8、天道酬勤-股道至简、万单成名、虎帅、卡尔王子、桔 梗、捉妖团长、老王爱抄底、大自然法则、股票协会、梵天沙、池边鳄、牛散二十年、老司机、老沈讲股、鄂宜板王、维氏小股、股语有魂、老牛操盘、股市辰星、暴风财富、AA股老韭菜、胡说股道、青猫先生。、一手烟、笑说天下-流浪者、大R、老谭擒牛、易十六、雀神、老李降妖股、老李经、主升浪股票池、狙击军团、江海洪潮-壬辰、涨停板实战、波浪万、凤凰吟、殷晨翔股市行情预测、A股东尼、次新猎人、超短实盘神手、一休哥丿 ​​​、买卖点、神秀、捉妖战队、纳什、陈天说股、狮大拿、股市一篇红、股市风云录、俺的乖乖、孔明看市、春风化雨-寅风、不涨停，涨不停、牛郎、专注多空20年、股市财神爷、股哥传说JACK、灵魂画师、我的名字叫西旗、路人_宇、饕餮、九天 揽月、A趋势为王等众多短线操盘手大师恭祝换手率股友2017鸡年大發發發發發發發發發發發發發發發發發！一帆风顺年年好！万事如意步步高！吉星高照！身体健康！阖家幸福！\n2、新增独家重量级功能个股K线主力筹码，实时展现个股主力成本筹码分布图！主力收盘获利、当前位置获利、平均成本、90%筹码集中成本区及集中度、70%筹码集中成本区及集中度全部统统都有！实时展现全部短线必备周期主力买入成本，包含近5日主力买入成本、近10日主力买入成本、近20日主力买入成本、近30日主力买入成本、近60日主力买入成本，知己知彼，百战不殆！对主力筹码成本了解有多深，对个股未来走势预测就有多神！\n3、新增个股分时图指标BBD，BBD又称多空趋势，即\"大单+机构\"买卖的净差，反映了大资金的成交方向和力度，正数，代表了资金在流入；而负数，表示资金的流出，是衡量大盘的重要指标。在微观个股中，除BBD外，换手率短线炒股神器App独家引入了更加有参考意义的\"通吃率和大单强度\"指标，BBD/实时成交量即为通吃率，数值越大越好！大单强度则反应了BBD介入力度，数值越大力度越强！\n4、新增个股分时图指标今昨量比，实时通过今日与昨日同一时刻累计成交量的对比，感受主力游资的实时个股控盘力度！\n5、新增首家支持个股分时图、K线图指标第三区域，同一屏幕内最多可同时支持排列3个技术指标，在个股多指标共振的多空买卖决策中具有超神级作用！每个指标区域的默认首选指标您都可以按照自己的炒股习惯任意自由设置，就是这么随心所欲！我们是永远属于您的私人定制！永远！\n6、新增实时股东，每日实时更新最新个股股东人数变化，第一时间发现人均持股数暴涨个股，人均持股数暴涨代表个股筹码更加集中，主力控盘力度更强！\n7、新增次新捉妖，每日实时展示上市至今连续涨停板的次新股，包含当日实时打开、当日成功回封、当日继续一字涨停板这三大类型，2017年随着次新股的日益增多，次新股将不再是同涨同跌，次新股年年岁岁有妖气，2017年次新股板块必将诞生新的一批妖王之王！2017次新捉妖，你值得拥有！\n8、新增独家游资涨停板敢死队倾情奉献每日开盘必杀神技，集合竞价！真正的炒股从每天09:15:00就正式开始了！09:15:00~09:24:59实时展示集合竞价全部游资涨停板试盘个股、游资跌停板试盘个股，09:25:00开盘集合竞价多空实时提前预测全部个股开盘5分钟内涨跌！每天全面助力你提前赢在集合竞价起跑线！\n9、修复完善了2个来自用户提交的bug，升级优化了7个来自用户反馈的高优先级建议。"},{"version_id":"821700342","version_name":"1.8.95","version_date":"2017-04-21 02:36:45.000 +0800","version_description":"1、Ai A! Ai A! Ai A! Ai 已来！换手率短线炒股神器App独家研发全球首款短线龙虎榜席位游资专用AI人工智能图形量化实时多空博弈推送提醒系统火爆上线！助您每天第一时间实时接收全部自选股票游资多空博弈红绿线上穿金叉提醒！提前潜伏涨停板！躲避暴跌！最新AI人工智能图形量化实时多空博弈推送提醒系统可灵活自由支持添加任意股票的AI实时提醒！这一次你真正与国内一线顶尖短线龙虎榜席位游资并肩作战！一起干妖股！一起吃大肉！\n\n2、昨日重现！神盘感养成！个股历史日K分时图大数据重现！新增沪深全部3177只A股日K线历史分时走势图，实时毫秒级查看个股自上市以来每天股价走势，时间、空间、周期、股性、盘感融为一体！真正的量化大数据AI图形识别分析！历史不会简单的重复，但历史总是惊人的相似！你能看到多远的过去，你就能看到多远的未来！\n\n3、新增短线独家大盘指标大盘风向，实时辅助判断当日大盘冷暖，提前把握最强大盘风口，每日大盘游资风向、机构风向尽在掌控！同时新增短线独家大盘指标强弱系数，无视主力震荡诱多诱空表演，透过现象看本质，揭秘短线大盘日内交易超级主力筹码流动趋势！\n\n4、免费超级盘口全面疯狂升级！超级盘口集合竞价升级版独家支持个股集竞多空预测，09:25:00第一时间发现当日最强涨停板潜力妖股！在超级盘口集合竞价区域总共有五种AI图形量化形态，具体为①集合竞价涨停板试盘+集合竞价看多展示为紫底红线！这是当日个股最强的集合竞价形态！很多当日游资抢筹封涨停板的股票都来源于此！②集合竞价看多展示为红线！③集合竞价多空混战展示为白线！④集合竞价看空展示为绿线！⑤集合竞价跌停板试盘+集合竞价看空展示为绿底黑线！这是当日个股最弱的集合竞价形态！出现这样的形态时建议保持谨慎观望！告诉你一个大秘密，个股超级盘口集合竞价多空预测结合实时游资多空博弈使用，瞬间提升10000倍火力！\n\n5、新增自选板块个股短线特色指标排序，包含游资多空博弈、集合竞价多空、游资多空桃心、捉妖系数、控盘盘感、BBD、大单强度、通吃率，短线擒龙捉妖，十八般武艺样样精通！\n\n6、新增个股分时图底部功能按钮顺序自定义设置，可自由排序对比、同列、K分、五日、分时、日K、1分、5分、15分、30分、60分、周K、月K任何按钮顺序！同时新增个股五日图技术指标顺序自定义设置，包含游资多空、分时量、资金量化、捉妖系数、BBD、分时额、多空博弈、MACD！真正找到属于您的最佳手机操盘感觉！这是属于您的时代！我们是永远属于您的私人定制！永远！\n\n7、新增国内一线顶尖短线龙虎榜席位游资内部专用涨停强度之爆炒热度核心数据昨日涨停板个股今日表现！包含昨日全部涨停板、自然涨停板、一字涨停板今日实时走势表现，昨日涨停板板块今日走势分时图可自定义选择算数平均线+加权平均线、算数平均线、加权平均线的任意一种，同时K线图也可选择连续累计算数平均、连续累计加权平均、非连续累计算数平均、非连续累计加权平均的任意一种！同时新增每日全部涨停板个股实时涨停原因揭秘！第一时间感知市场最热最火最妖的股票群体表现！看游资最强风口！投机之王Jesse Lauriston Livermore传授的追随领头羊战术精髓在于，他集中研究有限数目的股票群体，集中研究其中的领涨股，就像我们现在每天专注于研究每日涨停板的股票群体一样！股票市场的新时代已经到来！新时代给明智、勤奋、胜任的投资者和投机者带来了更大的机遇！\n\n8、新增大盘实时直播，众多国内一线顶尖短线龙虎榜席位游资天才级操盘手为您实时直播每日大盘关键点位领涨领跌板块个股，快速领悟盘感最牛暴涨题材板块龙头大妖股！\n\n9、新增K线ARBR、LON、SRDM、SAR、MTM五大短线盘感级指标！ARBR指标专业展示多空双方日内实力较量行为学，通过分析历史股价实时反应当前短线市场人气与意愿！LON指标专业测量近期资金动向未来趋势，长短结合，威力十足！SRDM指标专业反映动向速度比率，与KDJ结合短炒极佳！SAR指标专业预测个股超短技术指标反转，俗称抛物线指标，对预测个股短线多空转换临界点有奇效！MTM指标专业研究股价在波动过程中各种加速、惯性以及由静到动或由动转静的价格与供求量的关系！该5种K线指标与现有的19种短线指标组合使用，千变万化，充满梦幻想象力！\n\n10、修复完善了1个来自用户提交的bug，升级优化了9个来自用户反馈的高优先级建议。"},{"version_id":"822002756","version_name":"1.8.96","version_date":"2017-06-03 01:43:35.000 +0800","version_description":"1、Ai A! Ai A! Ai A! Ai实时选股火爆上线！换手率短线炒股神器App独家研发全球首款短线龙虎榜席位游资专用AI实时选股正式向全体换手率股友共享开放！换手率短线炒股神器App特色指标、技术指标、基本面指标三大维度，17种核心指标，今日DDX、累计DDX、今日DDY、累计DDY、多空博弈、桃心、捉妖系数、控盘盘感、最新价、今昨均线、今日涨幅、累计涨幅、今日K线、今日均线、换手率、流通市值、总市值，累计131,071种指标基础组合，自由衍生无数种数据梦幻组合！通过AI实时与大盘个股走势同步大数据智能学习成长，助您毫秒级实时一键选出自己最想要的暴涨潜力股！这一次你真正站在了国内一线顶尖龙虎榜席位游资的肩膀上挖掘大妖股！注定吃大肉！\n\n2、新增K线CR短线多空量能中间意愿指标，著名诺贝尔经济学奖获得者Robert J. Shiller对股市的看法中阐述，了解促使市场变化的因素是非常困难的，因为一些重要市场事件发生的时间往往与它的诱发因素发生的时间并不完全同步，诱发因素的变化通常体现为一种中期趋势，因此，当公众注意到这种变化时，它已经发生了很长一段时间！短线超神级指标CR正完美解决了这个问题，通过波动最为剧烈的CR线，与波动较为平缓的A线、B线、C线、D线组合运用，超神！CR线在C、D线上方运行为强势市场，CR线在C、D线下方运行为弱势市场，当CR线与A、B、C、D四条线交汇在一点时，如果CR线一举上穿A、B、C、D四线，此时出现漂亮的短线金叉，积极做多！当股价大幅度暴跌，但CR值没有创新低，说明短线超卖严重，底背离，短线有抄底机会！当股价大幅度暴涨，但是CR值没有创新高，顶背离！通过对CR指标的成熟运用，能够在公众注意到变化时，提前在股价发生底背离或顶背离时做出相应的策略，实现利润最大化！\n\n3、新增K线CYR市场强弱指标，强者恒强！强者恒强！强者恒强！重要的事情说三遍！如何快速找到市场中最强势的妖王之王？CYR指标帮你轻松识别自选板块中的个股强弱，第一时间找到有妖气的短线强势股！\n\n4、新增实时股东最新发布时间属性，该属性与最新披露更新至日期属性组合使用爆发力倍增！数据发布时间在股票买卖决策中至关重要，我们都知道，对于短线交易者来说应该在出现某个看多信号的第一时间买入，如果错过第一时间，可能股价已经大幅度上涨，而促使股价拉升的基本因素并没有变化，有追高的风险！实时股东最新发布时间正是用于查看股东人数更新数据发布时间的精准日期，例如某股票的股东人数最新披露更新至当月17日，此数据最新发布时间是当月25日，今天是当月25日，那么今天就是第一时间！我们一目了然！\n\n5、新增集合竞价5分钟涨速，集合竞价充满梦幻奥秘！5分钟涨速普遍运用于很多榜单中，但在09:15:00到09:24:59的集合竞价这10分钟内，5分钟涨速指标特别重要！集合竞价看多或集合竞价看空，往往在集合竞价的后5分钟决定，特别是对于在集合竞价期间出现过涨停板试盘的个股，5分钟涨速能够在集合竞价最后30秒快速帮你挖掘集合竞价最后时刻游资真正抢筹的集合竞价大妖股！\n\n6、喂？您好！现在的7x24小时自媒体大师互动直播间我觉得非常棒！不过有的时候，比如盘中还有晚上复盘的时候，我想要更高级的实时视频直播，请问一下我什么时候能看到换手率短线炒股神器App短线自媒体操盘手们实时视频直播呢？就是现在！换手率短线炒股神器App实时视频直播疯狂火爆上线！火速更新这个版本，与国内一线顶尖龙虎榜席位游资操盘手们实时视频直播互动！！我们同时拥有\"阿里云+百度云+腾讯云\"三重保障，支持亿万级用户同时在线！你想要的，全都有！ \n\n7、修复完善了1个来自用户提交的bug，升级优化了17个来自用户反馈的高优先级建议。"},{"version_id":"822598441","version_name":"1.8.97","version_date":"2017-06-26 21:09:20.000 +0800","version_description":"1、Ai A! Ai A! Ai A! Ai实时选股持续疯狂升级！本次新增涨停板数及换手率历史新高新低两大特色指标，通过自定义近多少个交易日内出现多少个涨停板，第一时间挖掘涨停板股性最妖的妖王之王！所谓天量天价地量地价，本次我们独家支持自定义选择近多少个交易日换手率创历史新高新低，帮助您真正大数据发现换手率的大秘密！同时支持自定义保存属于您自己的独门AI选股策略，实时更新展现您策略的最新个股标的！\n\n2、新增个股分时图指标大单净额，通过大单净额及大单净量两个维度，实时最精准量化大数据分析展现主力游资买卖情况，随时随地轻松跟上游资节奏！\n\n3、新增大盘五日连看短线独家特色指标大盘风向、强弱系数，在单日分时图的大盘风向、强弱系数推出后受到了大量换手率股友的热情追捧！本次我们特别升级了推出了五日连看，用于连续观察大盘近五个交易日游资与机构买卖方向，判断超级主力筹码流动的连续性，更好地盘感短线大盘的多空趋势！\n\n4、新增消息推送历史查看，短线交易的核心是重要信息的获取与理解！即使在您工作特别忙的时候，错过了重要消息也能够通过消息推送历史查看功能一一回看！\n\n5、全面优化换手率短线炒股神器App自媒体操盘手7x24小时实时视频直播，支持亿万级用户同时在线，这把保证在海量用户同时超级高并发状态下也不卡！！！！！！！\n\n6、修复完善了1个来自用户提交的bug，升级优化了9个来自用户反馈的高优先级建议。"},{"version_id":"823034788","version_name":"1.8.98","version_date":"2017-08-08 12:13:29.000 +0800","version_description":"1、Ai A! Ai A! Ai A! Ai实时选股持续疯狂疯狂升级！本次新增实时今昨成交量对比、个股股东户数变化、个股人均持股数变化三大特色指标，通过自定义个股实时任意时刻的今昨成交量大小对比，根据量价先行原理提前挖掘涨停板潜力大妖股！通过自定义连续周期内个股股东户数增加减少或人均持股数增加减少，提前发现主力长期持续高度控盘个股！\n\n2、新增大盘OA指数，实时展现上证大盘OA指数、深证大盘OA指数、创业板OA指数、中小板OA指数，OA指数又称为平均股价指数，是指当天沪市、深市、创业板、中小板对应的全部个股平均股票价格，通过观察对比当天OA指数的涨跌与当天大盘指数的涨跌能够判断当天主力操盘对大小盘股的偏重程度，根据主力偏好实时调整大盘蓝筹股及中小创的仓位，做到既赚指数又赚钱！\n\n3、新增大盘分时图右滑展现实时主力资金量化免费VIP机构版，实时展现上证指数、深证指数、创业板指、中小板指这四类主流大盘指数对应的机构、超大户、大户、大中户、中户、散户这六种博弈资金实时主动买卖及被动买卖详细分布，通过连续对大盘机构版资金流向的观察分析，提前把握大盘短期趋势同时预判大盘走势的临界点！\n\n4、新增个股分时图展现集合竞价模式，换手率短线炒股神器App27年磨一剑，专注短线交易！这次我们为全体换手率股友们继续带来了集合竞价模式的惊喜！独家支持用户自定义打开分时图模式下展现当天个股集合竞价走势状态！通过AI实时集合竞价图形多空识别及实时主力量化游资多空博弈分析，第一时间在09:25:00开盘时刻展现个股集合竞价看多、集合竞价看空、集合竞价混战三种预测，在09:25:00集合竞价开盘时刻对应展示的分时图走势线颜色分别为红色代表集合竞价看多、绿色代表集合竞价看空、白色代表集合竞价混战、紫底红色代表集合竞价期间出现过涨停板试盘动作且集合竞价开盘看多、绿底黑色代表集合竞价期间出现过跌停板试盘动作且集合竞价开盘看空这五种集合竞价个股走势多空预测状态！\n\n5、新增个股全部板块实时涨幅，包括所属行业板块实时涨幅、所属概念板块实时涨幅、所属地区板块实时涨幅，助您第一时间找到龙头个股对应的全部板块，挖掘最强板块最强关联潜力个股！例如妖王之王方大炭素从属于非金属矿物制品业、预盈预增、石墨烯、融资融券、新材料、核能核电、沪股通、上证180、中证500、2025规划、证金持股、甘肃板块等，通过对比全部板块涨幅，轻松找到最强板块石墨烯及预盈预增概念关联潜力妖股！\n\n6、新增全部用户自选板块个股实时股东人数变化提醒功能，用户能够自定义选择打开此消息推送提醒系统，当自选板块中的任意一只个股股东人数发生变化时，能够实时第一时间收到消息推送提醒！如何在启动点提前发现有妖气的个股？如果个股股东人数短期内大幅度下降，代表筹码集中度大幅度提高，主力可能已经高度布局，在股价暂未大幅度上涨时，对应的自选板块个股短期值得重点关注，未来很可能有妖气！\n\n7、修复完善了1个来自用户提交的bug，升级优化了17个来自用户反馈的高优先级建议。"},{"version_id":"823708387","version_name":"1.8.99","version_date":"2017-09-23 13:41:53.000 +0800","version_description":"1、Ai A! Ai A! Ai A! Ai实时选股持续疯狂疯狂疯狂升级！本次新增AI实时热门妖股板块预测，基于AI进行实时海量数据相似因子抽象多维聚类分析，真正将AI运用到短线实时盘中交易机会挖掘，帮助用户第一时间更快发现最热板块中妖气指数最高的妖王之王！用户能够自定义选择属于任意一个热门板块或同时属于N个热门板块的个股，结合现有的AI实时选股特色指标、技术指标及基本面指标，潜伏涨停板妖股能力瞬间暴涨一万倍！\n\n2、新增香港券商可交易A股标的，最极致展现全部沪股通香港券商可买可卖标的、沪股通香港券商只可卖标的、深股通香港券商可买可卖标的，深股通香港券商只可卖标的这四种类型，换手率短线炒股神器App游资涨停板敢死队研究院持续一年多的时间实战沪股通、深股通，获得了非常非常多的宝贵交易经验，目前每日沪深A股成交金额前十的最热门个股大多都是沪股通或深股通标的，同时每日涨停板个股也有很多沪股通深股通标的，短线交易的本质是市场主流资金不约而同形成的合力！当沪深及香港资金在某一只标的上形成合力，该标的更容易走妖也更容易爆发持续性暴涨行情，沪深及香港资金的合力有没有成名作？非常多！近期宇宙龙头暴涨大妖王方大炭素就是沪股通标的，2017一战成名！\n\n3、涨停强度功能盘感升级！本次涨停强度新增实时展现当日全部涨停板打开个股触碰涨停板深度原因揭秘，助力短线打板客预判个股日内回封可能性！同时支持实时查看昨日全部涨停板打开个股触碰涨停板原因，特别是在早盘09:15:00-09:24:59集合竞价阶段结合集合竞价图形识别以及技术面资金面盘感昨日炸板个股今日是否有反包机会！同时新增全部涨停板、涨停打开、跌停板及跌停打开个股融资融券、沪股通及深股通标识，进一步增强对个股在全市场短线资金潜在吸引力博弈方面的盘感！\n\n4、新增全部板块搜索功能，全面支持搜索任意板块分时图及历史K线图，实时展现对应板块龙头股妖气指数排行榜，拥有实时对比个股分时走势图与整个板块分时走势图能力，瞬间发现对应板块中逆势走强的个股，强者恒强！\n\n5、新增国债逆回购实时收益率行情展现，每月月底可能都会出现一次超高年化收益率的国债逆回购机会，接近于无风险套利！金钱永不眠，打开换手率短线炒股神器App任意搜索GC001、GC002、GC003、GC004、GC007、GC014、GC028、GC091、Ｒ-001、Ｒ-002、Ｒ-003、Ｒ-004、Ｒ-007、Ｒ-014、Ｒ-028、Ｒ-091进入证券交易页面，全面支持中信证券、东莞证券、第一创业证券、新时代证券、国泰君安、光大证券、兴业证券、西南证券、恒泰证券、万联证券、华西证券、中山证券等12家战略合作伙伴一键实时购买国债逆回购！国债逆回购不同周期不同收益率，总有一款适合您！\n\n6、新增AI实时盘中最强热点板块推送！这一次我们将AI运用到短线交易本身，通过AI的自我学习与进化能力，实时抽象同一时刻拉升个股最大相似特征，分钟级展现盘中领涨热点板块，我们定义当热点板块中有三只或以上的龙头股盘口产生持续扫货式买入，此热点即升级为最强热点，此时AI会第一时间将这个最强热点推送给用户，大幅度提升短线操盘效率及盘感！\n\n7、修复完善了2个来自用户提交的bug，升级优化了19个来自用户反馈的高优先级建议。"},{"version_id":"824728610","version_name":"1.9.00","version_date":"2017-12-02 13:05:52.000 +0800","version_description":"1、Ai A! Ai A! Ai A! Ai实时选股持续疯狂疯狂疯狂疯狂升级！本次新增2018高转送板块AI潜力值、2018ST摘帽板块AI潜力值、涨停基因、涨停封板成功率等特色指标！涨停基因代表了每只股票在专业打板游资心目中的宠爱程度，涨停板都有记忆，在近段时间有涨停板的个股，未来可能会再度爆发！涨停封板成功率主要用于衡量一只股票封涨停板的稳定程度，成功率越高越值得盘中打板！请你大声告诉我：每年年底必炒的板块是什么？高转送！ST摘帽！那么如何在这么多股票中，提前挖掘到2018年高转送潜力值高的股票呢？Ai A! Ai A! Ai A! Ai! 看游资专用人工智能AI高转送大师自动计算的2018高转送板块AI潜力值，AI Deep Learning汇总了全部沪深A股每股未分配利润、每股资本公积金、历史高送转次数、上市时间、总股本、最新股价等多重高送转AI基因！怎样的ST股具备摘帽潜力？AI Deep Learning汇总了全部ST股每股盈利、每股净资产、近两年盈利状况、主营业务发展状况、近1年个股公告等多重ST摘帽AI基因！换手率短线炒股神器App痴迷于自主独立研发更新AI系统，换手率AI仅供国内一线顶尖龙虎榜席位游资及换手率短线炒股神器App用户使用！友情提示：人工智能AI仅供参考，不对投资者构成任何投资建议！股市有风险，入市需谨慎！2018年想要和换手率短线炒股神器App一起探索更多AI？请访问我们的AI大师实验室www.2018.ai\n\n2、新增香港券商可交易A股标的当日整体实时可用额度，包含沪股通额度、深股通额度、港股通（沪）额度、港股通（深）额度，从更高视角盘感资金流动方向，香港券商可交易的沪股通、深股通标的跑赢大盘的概率相对更高！\n\n3、AI实时集合竞价火爆升级！国内一线顶尖神盘感龙虎榜席位游资联合开发全球首款短线龙虎榜席位游资专用AI人工智能图形量化实时集合竞价系统！从09:15:00开始AI实时图形识别+AI实时集合竞价买卖盘口大数据分析，在09:15:00~09:24:59期间每秒实时更新展现AI集合竞价游资多空实力，助您在集合竞09:25:00开盘价出现之前，提前10分钟大幅度领先赢在集合竞价起跑线！同时升级版集合竞价全面支持您自由选择AI调用任意自选板块组合，在09:15:00~09:24:59有限的时间内最大限度助您缩小目标选择范围！大幅度提升成功率！\n\n4、新增个股全部历史成交详细数据，能够支持查看个股自上市以来每一天的开盘价、最高价、最低价、收盘价、涨幅、振幅、总手、成交金额、换手率、主力资金净流入金额、换手率DDX、换手率DDY等核心数据！\n\n5、新增次新捉妖及暴涨牛股列表中个股所属行业、所属地区、所属板块这三项属性！助您第一时间发现属性最稀缺的大妖股！稀缺的才是最容易暴涨的！稀缺性是预测妖股的唯一属性！\n\n6、新增AI实时短线节奏大师大盘直播历史回看！同时支持一键实时查看龙头股、龙二、龙三等个股的分时图！\n\n7、涨停强度全面升级！在全部涨停板数量，全部涨停板成功率基础上增加实时自然涨停板成功率及今昨数量对比，实时一字涨停板成功率及今昨数量对比！同时增加涨停板详细类型曲线，主要有实时自然涨停板数、实时一字涨停板数、实时涨停炸板数，通过对比自然板与一字板及炸板数量，盘感整个游资节奏与大盘温暖程度！\n\n8、新增实时股东全部个股的股东人数每一期数据及历史披露时间、发布时间，更具连续性地盘感目标个股的股东变化情况，轻松潜伏股东数连续N期下降且比例大幅度降低的高控盘妖股！\n\n9、新增日K线特色指标多空博弈，个股日K线多空博弈从个股分时图必杀技多空博弈指标衍生而来，通过对比日K线近期连续N个交易日收盘时多方空方势能强弱，提前发现游资踪迹！\n\n10、什么样的人生是十全十美的人生？改变世界？又或是专注一件小而美的事？我想专注一件小而美的事对我来说就是一件幸福开心的事！他们对我说目前别的软件这个字段的数据都错了，就算你把我们的数据改对了，有用户会觉得你是对的吗？我没有回答，我修正了全部A股中有B股或有H股或同时有B+H股的对应股票总市值，例如：\n①某只在上交所上市的股票有A+B股，则该股以人民币计算的总市值=A股总市值+B股总市值=A股实时股价*A股最新总股本+B股实时股价*B股最新总股本*实时美元汇率！\n②某只在深交所上市的股票有A+B股，则该股以人民币计算的总市值=A股总市值+B股总市值=A股实时股价*A股最新总股本+B股实时股价*B股最新总股本*实时港币汇率！\n③某只在沪、深交易所上市的股票有A+H股，则该股以人民币计算的总市值=A股总市值+H股总市值=A股实时股价*A股最新总股本+H股实时股价*H股最新总股本*实时港币汇率！\n④某只在深交易所上市的股票有A+B+H股，则该股以人民币计算的总市值=A股总市值+B股总市值+H股总市值=A股实时股价*A股最新总股本+B股实时股价*B股最新总股本*实时港币汇率+H股实时股价*H股最新总股本*实时港币汇率！\n为何你要修正这个整个行业现在都存在的小问题？\n数据，对于我来说，一点都不能错！\n请原谅，我是一名理工科男生！\n\n11、全面性感适配iPhone X！100%完美兼容iOS11！修复完善了2个来自用户提交的bug，升级优化了22个来自用户反馈的高优先级建议。"},{"version_id":"825401561","version_name":"1.9.01","version_date":"2017-12-23 11:03:42.000 +0800","version_description":"1、Ai A! Ai A! Ai A! Ai实时选股持续疯狂疯狂疯狂疯狂疯狂升级！本次新增大单净量、大单净额、量比三大短线特色指标，自由定义大单净量、大单净额范围，从大到小排序并配合涨幅等指标提前潜伏短线强势妖股，妖股如何第一时间发现？国内一线顶尖龙虎榜席位游资看量比！正所谓量价先行，从方大炭素到药石科技再到贵州燃气，我们可以看到每一只超级大妖股的崛起，都是从量比的短期剧烈变化开始的，量比堪称短线盘口最佳语言！2018年想要和换手率短线炒股神器App一起探索更多AI？请访问我们的AI大师实验室www.2018.ai\n\n2、新增香港券商可交易A股标的实时资金量化外盘和内盘数据，外盘反应买方主动的意愿，内盘反应卖方主动的意愿，通过外盘和内盘数据比较，实时判断香港券商可交易A股标的对应个股的资金博弈！\n\n3、新增大盘分时走势图对应的实时个股涨跌家数及实时个股涨跌停家数这两项短线特色指标，通过实时观察涨跌家数及涨跌停家数，第一时间把握大盘当日上涨的个股覆盖度及大盘短线上涨的可持续性，如果大盘指数上涨，个股上涨家数及涨停板家数同步增加并且下跌家数及跌停板家数同步减少，这样的走势会比较健康，此时顺势而为持股待涨是较好的策略！如果大盘指数上涨，个股上涨家数及涨停板家数不增反减并且下跌家数及跌停板家数反向增加，这样的走势俗称赚了指数没赚钱，此时手中的个股可以考虑做T！\n\n4、新增涨停强度全部历史日期涨停板数据回看，全面支持大数据回测历史上任意一天当日全部涨停板个股、全部自然涨停板个股、全部一字涨停板个股、全部涨停板打开个股，以及对于个股当日封涨停板原因！该功能主要的特色在于短线挖掘历史同一日涨停板个股群体涨停记忆，当历史某只大妖股今日盘中突然拉涨停，可以最快速度查询到历史上与该妖股同一天涨停板的其他个股，历史涨停记忆有很强的妖股跟风效应！\n\n5、新增实时股东在全部个股中一键自动过滤次新股功能，次新股在上市后短期实时股东往往变化特别大，在判断个股筹码集中度时，我们选择过滤次新股后的结果会更加精致和实用！\n\n6、新增ETF、LOF、QDII三种类型基金对应的全部基金行情数据，全局视野观察ETF基金、LOF基金、QDII基金、分级基金行情，发现潜在交易机会！\n\n7、修复完善了2个来自用户提交的bug，升级优化了18个来自用户反馈的高优先级建议。"},{"version_id":"825677747","version_name":"1.9.02","version_date":"2018-01-19 15:54:54.000 +0800","version_description":"1、Ai A! Ai A! Ai A! Ai实时选股持续疯狂疯狂疯狂疯狂疯狂疯狂升级！本次新增2018香港券商可交易A股标的，根据近两年多的历史回测数据来看，如果是香港券商可交易的A股沪股通或深股通标的，平均上涨概率将会大于普通A股，因此您在香港券商可交易A股标的范围内运用AI选股条件组合，将会更大幅度提高您的成功率！短线交易，资金为王！2018年我们与香港券商并肩作战！2018年想要和换手率短线炒股神器App一起探索更多AI？请访问我们的AI大师实验室www.2018.ai\n\n2、新增香港券商可交易A股标的实时5分钟涨速，挖掘大蓝筹暴涨行情香港券商资金快速抢筹的A股标的！\n\n3、新增全部沪深A股5分钟超神榜，实时支持查询5分钟涨速榜、5分钟换手率DDX涨速榜、5分钟换手率DDY涨速榜、5分钟捉妖系数涨速榜、5分钟通吃率涨速榜，天下武功唯快不破，短线交易5分钟超神！\n\n4、AI实时集合竞价新增横屏版集合竞价期间走势图放大功能，09:15:00~09:24:59期间实时观看AI集合竞价多空主力争夺更激情！更刺激！换手率短线炒股神器App独家AI集合竞价多空助您与国内一线顶尖龙虎榜席位游资在同一起跑线并肩作战！\n\n5、新增全部沪深A股2017年报预披露时间，轻松助您一键找到自选板块个股年报预披露日期，在年报披露前规划提前潜伏您看涨的年报预增利好个股，2018年A股慢牛行情，业绩为王！\n\n6、新增AI图形识别批量导入自选股，只需截取含有股票代码的图片并上传至换手率短线炒股神器App，我们的AI会立即自动识别图中的股票并快速导入到您的自选股组合！一个字评价，帅！\n\n7、修复完善了1个来自用户提交的bug，升级优化了19个来自用户反馈的高优先级建议。"},{"version_id":"825990701","version_name":"1.9.03","version_date":"2018-02-15 15:38:23.000 +0800","version_description":"1、2018金狗旺财！值此新春佳节之际，换手率短线炒股神器App自媒体大师向全国各地的股友拜年啦！逆命、张重、吉利女神、狗蛋、股社区、沐阳1、郭施亮、短剑客、虎帅、万单成名、只做真龙、好运2017、轩哥说股、三分之一自旋、大工、复利狼鹰、欣然先生、海洋521战法、光明宫、子弋、稳稳的超短线、股语有魂、索巴神、海哥看盘捉妖、炒股先锋、涨停牛哥、股市大亨、趋势交易的奶爸、私募打板敢死队、超短擒龙、稳中求进、牵牛客、天道酬勤-股道至简、短线屠龙、牛郎、卡尔王子、兰心蕙质569、上官飞燕猛男涨停板上跳芭蕾、沛然有雨、自我实现牛股低吸、星城扳歌、快乐家园579、时空牛、腾龙诀、狮大拿、张春林、甲第、股道绅士、买卖点、短线交易总结、智选股、牛股阻击手、我股飞扬、神秀、一战封神、短线操盘手666、妖股纵横、涨停牛魔王、A股龙、跳动的红k线、一招龍哥、谈股论金888、Charlie的话匣子、长爵居士、imammon、laoduo、股坛永恒金刚手、二当家的侃股票、苏丞相、神机决策、妖王战舰、一休丿、股王金来、整板涨停神、帝释天股市博弈、鹰眼看市、股票红小兵、老韭菜涨停俱乐部、妖股刺客、秒懂大盘、鸿飞看盘、趋势兔、克洛泽、股市先知、寻龙点金、宽客交易、A股东尼、涨不停的精彩股事、万里丛中一点红、扬航起帆、涨停牛股敢死队、职业短线炒手、涨停神话、冷锋、缠龙、上善若水-翻倍黑马王子、诡道股手、Maroom508、小厂长CJ、千股牛猫、黑马天尊、妖股龙头股、桃哥养牛股、短线刀客888、夜行神龙、孤独作手复盘、如是如是、财富金帝、刀锋1980、股场剑客、汪海、股场作手、顶峰投资张明一、春秋泽、谷大、A股搏击者、申万宏源土豪金、殷晨翔股市行情预测、聂问、龙翔路五哥、腾飞起航日志、淘金猎人-低吸撸板一条龙军团长、老铁擒牛、复几把盘、踏江立潮、股舞于心、骑牛看熊、北大柠檬、A股名扬、大自然法则、池边鳄、股票协会、涨停猎人、黑马公主518战法、91作手、两天一只涨停板、子剑战股海、916、A股民老村长、左右互搏、飞雪看盘、股市长风、散户20年、趋势价值投机、狙击牛股、林荫门生、中原股侠、涨停密码、掘金龙虎、俺的乖乖、股域雷神、云海一峰、A股涨停王、朝阳淘金、罗神抓妖记、股三戒、黑马传奇、浪波万、沙沙复盘、行鱼复盘、爱心说、酷酷的燕十三、量化之父、菜鸟直播间、修罗、我的名字叫西旗、路人_宇、饕餮、擒龙2018、超级短线王等众多短线操盘手大师恭祝换手率股友2018狗年大發發發發發發發發發發發發發發發發發！福旺财旺运气旺！家兴人兴事业兴！万事如意！身体健康！阖家幸福！\n\n2、Ai A! Ai A! Ai A! Ai实时选股持续疯狂疯狂疯狂疯狂疯狂疯狂疯狂升级！本次新增操盘视角打分系统实时盘中选股，分值为0~5分，分数越大越好，5分为最佳！主要用于挖掘每日09:15:00~15:00:00盘中每个时段主力游资资金状态表现增强的个股，越临近收盘参考意义越强！2018年我们ALL IN AI量化！2018年我们要用热爱将AI量化发挥到极致！2018年想要和换手率短线炒股神器App一起探索更多AI？请访问我们的AI大师实验室www.2018.ai\n\n3、2018，香港！新增香港券商全部可交易港股标的搜索系统，独家AI分析展现了每一只港股的流动性高低及短线可容纳资金规模，帮助用户提前预防港股中的超级小盘股流动性系统风险，利润是风险控制的产物！\n\n4、新增独家免费开放国内一线涨停板敢死队游资专用涨停板操盘指标，涨停强度爆炒热度中昨日涨停板今日表现，日K线走势图指标历史每日涨停板数量对应第二天表现！包含全部涨停板、自然涨停板、一字涨停板，主要用于AI量化投资及每日对大盘冷暖的盘感，涨停板数量是衡量市场的最佳答案，配合涨停板表现日K线走势图研究特别梦幻！一句话概述这个指标的精髓，别人贪婪我恐惧，别人恐惧我贪婪！该指标目前市场最强盘感那波涨停板游资内部专用！好东西，不多说，师傅领进门，修行靠个人！\n\n5、新增个股分时图操盘视角特色指标，按照09:25|09:35|09:45|10:00|10:30|13:00|14:00这七个日内关键操盘时间点，对每一段节点内个股主力游资资金状态增强或减弱表现进行打分，分值为0~5分，分数越大越好，5分为最佳！无论个股处于上涨状态还是下跌状态，都能够通过当前时段与前一时段的资金状态对比，发现日内出现顶背离或底背离的个股，轻松助力日内个股逃顶和抄底！\n\n6、新增个股分时图游资视角资金量化特色指标，本次游资视角资金量化指标为主力资金量化指标的AI升级版，运用AI智能拆单预测系统，首次尝试AI智能合并相似轨迹手法资金，全面细致展现机构、超大、大户、大中、中户、散户六个资金细分维度的实时资金净流入曲线，从游资视角更细致更精准看到真正主力资金流入的个股！该指标我们将永久免费向国内一线龙虎榜席位游资及全体换手率短线炒股神器App用户开放！\n\n7、修复完善了2个来自用户提交的bug，升级优化了18个来自用户反馈的高优先级建议。"},{"version_id":"826488523","version_name":"1.9.04","version_date":"2018-04-03 14:41:56.000 +0800","version_description":"1、2018，香港！新增全部港股实时免费行情，包含恒生指数、国企指数、红筹指数、港股新股首日开盘行情、港股主板行情、港股创业板行情、港股权证行情！\n\n2、Ai A! Ai A! Ai A! Ai实时选股持续疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂升级！本次新增AI选股支持实时调用任意一个或多个自选板块，新增大师级指标“三剑合一”一键轻松挖掘值得潜伏的标的，新增游资专用个股盘中买卖多空状态判断指标主动率，新增AI选股列表可排序字段5分钟主力资金净流入、5分钟换手率DDX、5分钟换手率DDY、5分钟捉妖系数、5分钟通吃率，升级拓展支持同时保存多个AI选股组合历史条件，未来随心所欲调用！2018年想要和换手率短线炒股神器App一起探索更多AI？请访问我们的AI大师实验室www.2018.ai\n\n3、新增实时主力资金量化分钟级主力资金净流入个股榜单，包含近5分钟主力资金净流入个股榜单、近15分钟主力资金净流入个股榜单、近30分钟主力资金净流入个股榜单、近60分钟主力资金净流入个股榜单，同时支持实时查询当天09:25:00~15:00:00任意时间段主力资金净流入个股榜单，更细致维度满足大仓位资金对超短线日内交易的需求！\n\n4、涨停强度火爆升级，独家免费开放国内一线涨停板敢死队游资专用涨停板操盘指标，每日最强涨停板风口！实时AI自动学习展现当日全部涨停板个股中包含最多涨停板数量的题材概念板块，同时展现最强板块中的最强龙头股！涨停板最强风口详细包含板块实时主力资金净流入、板块启动时间、板块一字涨停板数量、板块自然涨停板数量，最强风口领头羊、龙二、龙三！我们必须集中注意力研究当日行情最突出的那些股票！涨停板就是当日行情最突出的那些股票！如果你不能从领头的活跃股票上赢得利润，也就不能在整个股票市场赢得利润！正如女神们的衣服、帽子以及珠宝的时尚总是随着时间推移而变化，股票市场也会不断抛弃过去的领头羊，新领头羊将取代旧领头羊的位置！短线交易你需要时刻保持涨停板盘感！\n\n5、新增每日复牌股昨日复牌股、今日复牌股、明日复牌股，同时支持查询历史任意交易日的全部复牌股，通过持续一段时间对复牌股板块的记录研究，大幅度提升复牌股板块盘感！\n\n6、新增次新捉妖自定义设置首次涨停板打开次新股实时消息推送提醒！\n\n7、新增独家免费开放AI集合竞价游资版功能，最劲爆隔夜消息面驱动题材股全揭秘！在当日09:15:00~09:24:59集合竞价期间实时提前汇总展现前一个交易日盘后15:00:01~当日09:14:59盘前全部最劲爆隔夜消息个股！同时拥有换手率短线炒股神器App游资版最劲爆隔夜消息面加独家AI集合竞价数据技术面是怎样的快感？两个字，无极！\n\n8、新增5分钟超神近5分钟主力资金净流入涨速榜，第一时间发现主力资金瞬间大幅度流入且涨幅较低的潜力标的！\n\n9、新增个股涨停基因全部历史每次涨停板原因揭秘，实时展现每只个股当日及历史任意交易日涨停板或触及涨停板详细原因！涨停板题材的真正高度来源于对涨停原因的理解合力盘感！\n\n10、修复完善了2个来自用户提交的bug，升级优化了27个来自用户反馈的高优先级建议。"},{"version_id":"827201067","version_name":"1.9.05","version_date":"2018-05-21 03:01:50.000 +0800","version_description":"1、2018，香港！新增全部港股09:00:00~09:19:59期间AI实时集合竞价游资多空，具体为AI实时集合竞价看多、AI实时集合竞价混战及AI实时集合竞价看空这三种类型，全球首家独创由国内一线顶尖龙虎榜席位游资将A股AI集合竞价深度学习量化模型成功训练并运用于港股实战，大幅度提升港股集合竞价期间个股走势预判成功率，AI港股实时集合竞价游资多空在手，特别有利于完成超神级港股短线日内T+0操作，2018换手率短线炒股神器App独家AI助您港股一战成名！\n\n2、Ai A! Ai A! Ai A! Ai实时选股持续疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂升级！本次新增AI选股最劲爆隔夜题材股热门板块，结合AI实时集合竞价游资多空使用，爆发力十足！2018年想要和换手率短线炒股神器App一起探索更多AI？请访问我们的AI大师实验室www.2018.ai\n\n3、新增AI今日掘金功能，基于每日实时重磅突发利好信息第一时间AI自动学习关联最匹配受益板块，并自动挖掘该板块最强龙头股！AI今日掘金为超短线交易者量身定制！\n\n4、个股分时图火爆升级，独家免费展现近24小时对应个股全部最重磅信息，包括个股重磅公告、个股重磅突发新闻、个股实时涨停原因揭秘、个股触碰涨停原因揭秘、个股龙虎榜、个股实时股东人数变化及个股互动平台最新回答，短线交易核心是个股技术面与主力资金面以及消息面的三剑合一！\n\n5、新增K线图季线与年线，更长时空，一览众山小！\n\n6、新增K线特色指标PSY及MFI，短线神盘感操盘必备指标PSY俗称心理线，是研究股民对股市涨跌产生心理波动的情绪指标，炒股需要懂一些心理学，股票的买卖决策往往都是从心理决策到行为操作，行为金融学鼻祖著名诺贝尔经济学奖获得者Robert J. Shiller教授的行为金融学理论近些年风靡全球，对A股及港股短线交易有很强的指导价值，PSY指标主要从向上趋势、向下趋势及无趋势这三个方面预测短线股价走势！本次升级的短线神盘感操盘必备的另一大指标MFI俗称资金流向指标，MFI主要用于发现股价的反转，MFI连续两次向上交叉其平均线时，视为金叉，底部反转坚定看多！\n\n7、新增每日临时停牌股列表及历史至今处于停牌状态个股查询列表，包含停牌日期、停牌公告及停牌原因概述、累计停牌日期、停牌前一个交易日涨幅及停牌期前连续涨停板数量！同时能够一键轻松设置自己关心的停牌股复牌消息推送通知！\n\n8、新增AI涨停预测功能，基于每日昨夜今晨午间多个时段的利好公告以及上一个交易日15:00:00收盘后至最新一个交易日09:15:00开盘前重大新闻AI自动学习关联最有机会暴涨板块，并自动挖掘该板块最有涨停板潜质妖股！AI涨停预测为热爱潜伏涨停板的换手率股友们量身定制！\n\n9、28年磨一剑，专注短线交易！经过26个日日夜夜的专注AI研发，我们成功地运用AI技术将国内一线顶尖龙虎榜席位游资内部专用涨停板次日走势预测必杀技！AI相似分时图！研发上线！研发上线！研发上线！热烈庆祝换手率短线炒股神器App全球首家原创独家研发的AI相似分时图火爆上线！我们承诺永久免费开放AI相似分时图功能给全体长期以来支持我们的换手率股友们！28年磨一剑，专注短线交易！我们独家AI汇总了从1990年起至2018年今天全部个股海量历史每日分时图，运用AI大数据相似人工智能图形识别技术，免费为您找到每天全部涨停板个股、龙虎榜个股及您的自选板块个股中AI相似度匹配最高的个股历史分时图及次日走势！换手率短线炒股神器App的AI相似分时图功能，目前市场中仅此一家！仅此一家！仅此一家！2018年以来每个新版本我们都独家研发了至少1个AI短线特色量化指标，换手率短线炒股神器App的AI技术实力遥遥领先！赶紧火速免费升级最新版！用换手率App独家AI相似分时图这一神器干涨停板！\n\n10、修复完善了2个来自用户提交的bug，升级优化了29个来自用户反馈的高优先级建议。"},{"version_id":"827591439","version_name":"1.9.06","version_date":"2018-06-20 05:16:33.000 +0800","version_description":"1、2018，香港！新增小米创始人雷军先生顺为资本唯一战略投资香港持牌券商利弗莫尔证券A股港股证券交易，利弗莫尔证券专注A股港股T+0短线交易，A股港股都是万2.5超低佣金，最低每笔3港币，无平台使用费！利弗莫尔证券港股IPO打新股全部一万年永久0手续费！利弗莫尔证券交易小米股票一万年永久免佣金！利弗莫尔证券香港证监会正规持牌券商法团（中央编號：BJN764），在小米雷军先生基金投资的唯一香港持牌券商免费申购小米新股，一生一次的机会，注定运气不会太差！请和我们一起，永远相信美好的事情即将发生！\n\n2、Ai A! Ai A! Ai A! Ai实时选股持续疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂升级！本次新增AI选股全部港股个股，实时AI自由定义高流动股性活跃港股！2018年想要和换手率短线炒股神器App一起探索更多AI？请访问我们的AI大师实验室www.2018.ai\n\n3、国内一线龙虎榜席位游资火爆AI升级深度龙虎榜，换手率短线炒股神器App全球首家原创独家新增龙虎榜席位组合AI化学反应值！龙虎榜席位AI化学反应值用于反应当日龙虎榜上榜个股买一至买五全部龙虎榜席位组合状态，AI化学反应值越高代表该上榜个股第二个交易日冲高的幅度可能就越高！什么是最强的AI化学反应？我们来梦幻一个近20年AI化学反应最强的NBA全明星组合，C: YAO，PF: O'NEAL，SF: BRYANT，SG: McGRADY，PG: IVERSON！那么现在哪些龙虎榜席位组合起来会有像NBA全明星这样强大的AI化学反应呢？立即更新最新版换手率短线炒股神器App即可每天免费挖掘最强AI化学反应龙虎榜席位组合！\n\n4、新增日K线低位涨停板红箭头标注，我们按照国内一线龙虎榜席位游资对低位涨停板的量化算法定义，AI系统自动用红箭头标注出来，第一时间挖掘低位启动点涨停板妖股！\n\n5、新增K线纵向坐标系，通过斐波那契数列衍生绘制而成，方便用户查看空间距离今日较远的连续K线状态，如前20日的K线到最近的情况，为中期均线近期走势及变化提供参考与预估！\n\n6、修复完善了2个来自用户提交的bug，升级优化了19个来自用户反馈的高优先级建议。"},{"version_id":"828211152","version_name":"1.9.07","version_date":"2018-08-20 11:47:11.000 +0800","version_description":"1、2018，香港！新增100%港股中新股秘籍！目前港股打新股持续火爆，港股打新股不需要市值，近一个月平均一手中签率约55%，最主要火爆的原因是申购港股新股达到一定金额，就能100%中签一手新股！港股打新股特色：①港股打新股不需要市值，有现金就能打！②港股打新股超高中签率，近一个月平均一手中签率约55%!③港股新股上市首日不设置涨跌幅限制，T+0交易！④港股打新股一般几千港币就能申购一手，参与门槛较低！⑤港股打新股只需需有香港券商账户就能参与，利弗莫尔证券打新永久0手续费！\n\n2、Ai A! Ai A! Ai A! Ai实时选股持续疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂升级！本次新增AI选股港股特色指标，用户能够自定义一系列技术指标参数组合实时找到想要的自选板块股，港股有一些长期缺乏成交量流动性较低的个股，通过AI实时选股就能够轻松地将这些个股直接过滤，例如我们可以设置这样一个AI实时选股组合条件“港股主板+今日实时涨幅大于5.00%+今日实时股价在1.500港币到10.000港币之间+近5个交易日日均成交金额大于500万港币+今日实时总市值大于5亿港币+近3年无合股或供股+近5个交易日换手率创新高+近22个交易日股价创新高+今日实时主力控盘盘感大于5+今日实时日K线为阳线+今日实时累计成交量大于昨日此刻累计成交量+上市时间大于1年+今日实时市盈率小于30+今日实时市净率小于5+利弗莫尔最小阻力线方向看多”，这个选股条件中包含了对港股个股流动性、基本面及短线趋势方向等多重维度的思考选择，2018年想要和换手率短线炒股神器App一起探索更多AI？请访问我们的AI大师实验室www.2018.ai\n\n3、新增沪深A股VS香港H股实时AH同股涨幅对比功能，通过排序A股5分钟涨速及AH同股实时涨幅距离值，第一时间挖掘A股刚刚拉升涨停板时刻同股对应滞涨港股机会！\n\n4、新增港股爆炒新股功能，主要展现首日上市不设置涨跌幅的全部港股新股及近一年上市的全部港股次新股，新增港股上市新股AI稀缺性数值及AI火爆程度数值属性，主要从近期大盘恒指表现、个股发行市盈率、个股所属行业、行业平均市盈率、总市值、发行价、超额认购倍数、IPO保荐人、IPO承销商、隔夜暗盘涨幅等属性，通过AI量化大数据分析计算提前挖掘可能存在上市首日爆炒机会的港股新股！\n\n5、火爆新增港股IPO新股近5年AI回测重要数据！包括近5年全部港股IPO新股历史招股说明书文档，近5年全部港股IPO新股稳中一手所需全部申购资金，帮助客户能够根据历史相同行业个股情况提前预判热门IPO新股100%稳中一手所需全部申购资金，近5年全部港股IPO新股首日开盘价卖出、首日收盘价卖出、首日开盘高于发行价则收盘卖出及开盘不高于发行价则开盘价卖出、首日开盘高于发行价则开盘价卖出及开盘不高于发行价则收盘价卖出等多种AI回测策略收益率曲线对比！换手率短线炒股神器App战略合作伙伴利弗莫尔证券港股打新股永久0手续费，连续5年专业AI量化研究港股打新股市场，利弗莫尔证券目标将港股打新股这个客户最有机会赚钱的模式做到极致极致最极致！\n\n6、火爆新增每日新发行港股IPO新股消息推送提醒，第一时间知道每天每只新股开始及截止申购日期，更高效率统筹规划短线证券交易资金，更早时间提前转入港币加码特别火爆的港股IPO新股！\n\n7、新增港股程序化交易个股AI识别，从个股日均振幅、个股股价稳定性及对应K线周期最大回撤数值、近一年近一个月近一周个股日均成交金额稳定性、个股流动性可容纳资金范围、个股所属行业、个股总市值等属性，通过AI自动识别挖掘具备程序化交易操作空间的港股！\n\n8、新增港股认购认沽牛熊证正股标的列表，第一时间T+0证券交易买卖涨跌幅较大的正股标的对应认购认沽牛熊证！谨慎提醒，港股认购认沽牛熊证仅适合至少有7年以上股龄的专业投资者参与，总体资金仓位配置严格保持在5%以下较为安全，千万不可超仓位配置！\n\n9、新增港股新股暗盘之王，实时展现正在申购新股超额认购倍数，AI实时回测2014至2018五年历史相似超额认购倍数对应上市首日涨幅及一手中签率，更有利于帮助用户决策港股打新股仓位策略！实时展现港股即将上市新股所有暗盘平均涨幅！\n\n10、修复完善了1个来自用户提交的bug，升级优化了19个来自用户反馈的高优先级建议。"},{"version_id":"828771562","version_name":"1.9.08","version_date":"2018-10-05 22:45:44.000 +0800","version_description":"1、2018，香港！新增利弗莫尔证券A股沪深股通全部标的AI智能证券交易系统，独家融入利弗莫尔本人百年独门股票大作手操盘绝技，利弗莫尔最小阻力线战法、利弗莫尔领头羊（等于A股涨停板）战法、利弗莫尔6点趋势转向战法、利弗莫尔独门定义次级回升 | 自然回升 | 上升趋势 | 下降趋势 | 自然回撤 | 次级回撤六类个股短线趋势交易战法、利弗莫尔关键点战法、利弗莫尔22条证券交易心法等，拥有利弗莫尔证券A股AI智能证券交易系统，犹如利弗莫尔本人灵魂附体，您的A股证券交易盘感瞬间大幅度暴涨！\n\n2、Ai A! Ai A! Ai A! Ai实时选股持续疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂升级！本次新增港股IPO新股近5年AI选股及AI回测重要数据！包括近5年全部港股IPO新股相似超额认购倍数表现、近5年每一家保荐人所对应的全部港股IPO新股首日上市表现、近5年每一家承销商所对应的全部港股IPO新股首日上市表现、近5年全部港股IPO新股综合平均回测首日最佳卖出时间范围及每年平均首日最佳卖出时间范围、从近5年全部港股IPO新股超额申购金额倍数与超额人数倍数历史关系AI衍生提前预测对应新股超额申购人数倍数，深度AI挖掘超额申购人数倍数与首日开盘涨跌幅度相关性！2018年想要和换手率短线炒股神器App一起探索更多AI？请访问我们的AI大师实验室www.2018.ai\n\n3、新增利弗莫尔证券A股AI智能证券交易系统AI涨停打板神器！多家一线龙虎榜席位游资十多年涨停打板经验精髓结合利弗莫尔证券免费VIP券商席位快速通道以及强大的AI证券交易算法，用户无需盯盘，只需在盘前提前定制个股涨停板打板策略，即可轻松盘中AI自动打板，例如，用户可以自定义某一只股票或一揽子股票，在当天或未来某一天或未来持续一段时间内，盘中涨幅大于+9.8%的第一瞬间，AI自动程序化按照当日涨停板价格挂单买入用户提前定义的股数！同时用户也可以自定义AI自动涨停板扫板，例如，用户可以自定义某只可能涨停板的个股，在当天触碰到涨停板价格后，当涨停板价格盘口卖单成交一定百分比或一定数量股数的第一瞬间，AI自动程序化按照当日涨停板价格扫货！当然，有些换手率股友认为最稳妥的涨停板追板方式可能是需要极快手速的涨停板排板，有了利弗莫尔证券AI自动涨停板排板，您的AI手速肯定超神，用户可以提前自定义某只可能涨停板的个股，当天首次触碰涨停板且当涨停板价格盘口卖单全部都被扫货买入的第一瞬间，AI自动程序化按照当日涨停板价格第一时间排队买入！从涨停板打板到扫板到排板，利弗莫尔证券首家创新实现了A股AI涨停板一条龙服务，是真正属于您的A股AI涨停打板神器！风险提醒：涨停板属于A股市场中高风险高收益品种，用户需要根据自己的风险偏好谨慎参与！股市有风险，入市需谨慎！\n\n4、新增利弗莫尔证券A股AI智能证券交易系统AI长期潜伏单！用户可以自定义按照一定的价格或一定的涨跌幅比例对N只个股，设置未来N天内连续挂单有效，利弗莫尔证券AI系统会在每天晚上能够开始挂单的第一瞬间为用户自动挂单隔夜单！应用场景有，例如，用户可以按照未来每日涨停板价格或者比涨停板价格低0.01元的价格，不需要用户每天自己计算不同的涨停板价格，AI自动按照用户的语义设定长期潜伏挂单卖出某只股票，这样在未来某个交易日个股冲涨停板的瞬间，用户的长期潜伏单可能就会第一时间卖出成交，同时用户也可以利用长期潜伏单捡漏买入盘中瞬间砸跌停的个股，此处的定义为瞬间砸跌停，而并不是缓慢跌停，用户可以通过利弗莫尔证券AI长期潜伏单挂单按照跌停板价格或者比跌停板高0.01元的价格，未来长期潜伏买入约定股数的个股，并且用户可以设置当最近一笔Level-2逐笔成交跌幅大于-7%或当日最低价跌幅大于-7%时自动取消当日该单型挂单，这样就能够大概率保证AI自动潜伏买入的个股为盘中瞬间单针探底的个股，而非缓慢下跌的个股，为用户短线T+1交易留足利润空间！\n\n5、新增2018中报高送转个股板块，包括中报公告高送转的全部个股具体高送转股数、高送转公告时间、高送转除权时间，每年十月都会迎来中报高送转填权行情爆发期，每只个股的高送转除权时间往往是高送转填权行情爆发的最重要时间窗口，非常值得关注！\n\n6、新增实时主力资金量化历史机构主动买卖、被动买卖资金量化饼图数据，可免费查看回测全部沪深A股历史上任意一天的实时主力资金量化饼图数据！\n\n7、新增每日AI智能复盘，每日盘后AI自动汇总复盘每日个股活跃程度脉络、涨停强度、涨停看点、最强风口、盘面异动、涨跌统计、市场情绪题材等一线龙虎榜席位游资每日复盘必备特色数据指标！\n\n8、新增港股认购认沽证+牛熊证+供股权证分时走势图页面上方风险提示，包括最后交易日期、行权价、回收价等重要信息！\n\n9、新增全部港股中可能存在高风险的个股标签，具体高风险类型有①全部供股权证②全部距离最后交易日在15个交易日之内的认购认沽证③近10个交易日累计成交金额在100万港币以内的全部港股+认购认沽证+牛熊证④近三年合股及供股累计次数>1次的正股⑤近一年单日盘中股价出现-50%以上跌幅的闪崩个股！特别感谢战略合作伙伴利弗莫尔证券独家个股[高风险]标签算法支持！\n\n10、修复完善了1个来自用户提交的bug，升级优化了21个来自用户反馈的高优先级建议。"},{"version_id":"829368068","version_name":"1.9.09","version_date":"2018-11-24 14:47:53.000 +0800","version_description":"1、2018，香港！新增利弗莫尔证券A股AI智能证券交易系统利弗莫尔关键点战法，用户可以自定义当日有效或一段时间内有效的关键点，这个关键点可以是一个具体的价格又或是N日平均线的价格又或是当日距离集合竞价开盘价某个幅度的价格，利弗莫尔关键点任意由你自由定义！当股价突破或者下跌超过该关键点，AI自动按照客户之前预设的指令，会对相应的头寸进行买入或卖出操作！\n\n2、Ai A! Ai A! Ai A! Ai实时选股持续疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂升级！本次新增AI动态条件自选板块功能，一键关联利弗莫尔证券A股AI智能证券交易系统，轻松实现AI选股到AI智能证券交易的直线对接，比快更快！2018年想要和换手率短线炒股神器App一起探索更多AI？请访问我们的AI大师实验室www.2018.ai\n\n3、新增利弗莫尔证券A股沪深股通游资涨停板，实时盘中展现沪深港三地资金共同合力封涨停板妖股，AI根据历史相似手法实时免费盘中预测可能出现的龙虎榜游资席位，同时增加全部游资涨停板个股每日龙虎榜化学反应数值，化学反应数值越大，代表游资涨停板个股次日盘中冲高的幅度可能就越大！\n\n4、新增利弗莫尔证券A股AI智能证券交易系统AI实时选股集合竞价版，用户可以提前对自选板块的个股预设一系列的集合竞价期间AI实时选股条件，当A股集合竞价在09:15:00~09:24:59某一时刻触发该条件时，AI自动按照客户之前预设的指令，买入对应仓位比例设定的集合竞价一揽子个股，通过利弗莫尔证券为客户提供的免费专属VIP游资挂单通道，利弗莫尔证券A股集合竞价AI从实时计算到获得标的到完成挂单整个过程仅需0.017毫秒，真正极速极致的证券交易！\n\n5、火爆新增港股IPO新股近5年AI回测重要数据！包括近5年全部港股IPO新股公开配售金额及国际配售金额、公开配售及国际配售占比、公开配售甲乙组中签情况、IPO定价较IPO招股价区间、近5年全部港股IPO新股首日集合竞价开盘第一笔成交金额占公开配售金额比例，AI自动从配售发行系列数据这个非基本面维度，挖掘近5年全部港股IPO新股中与当前开奖新股最相似个股，包括与当前新股相似公开配售金额及相似公开配售国际配售比及相似超额认购倍数及相似一手中签率及相似总市值，并对最相似个股首日走势进行历史重现，有利于利弗莫尔证券股友们更容易对当前个股首日上市走势进行一个提前预测！\n\n6、新增利弗莫尔证券港股ETF榜单，近期ETF特别火爆，盈富基金、安硕A50、华夏沪深300、南方A50、恒指ETF、南方MSCI，总有一款ETF您喜欢！\n\n7、新增利弗莫尔证券A股AI智能证券交易系统实时动态涨停板打开个股列表，通过利弗莫尔证券A股AI智能证券交易系统涨停板回封个股条件单设置，助您瞬间极速打板霸气回封涨停板个股！\n\n8、新增2019AI高送转潜力板块，正元智慧一战成妖，一举成为2018至2019首只高转送大妖股，AI根据公司每股净资产、每股公积金、每股未分配利润、公司2018年报预盈披露、公司历史高送转情况等多重因素，AI自动识别归类2019高送转潜力板块！\n\n9、新增2019AIST摘帽潜力板块，AI根据公司的每股净资产、公司2018年报预盈披露、公司2018每季度盈利情况及主营业务盈利稳定性等多重因素，AI自动识别归类2019ST摘帽潜力板块！\n\n10、修复完善了2个来自用户提交的bug，升级优化了19个来自用户反馈的高优先级建议。"},{"version_id":"829423803","version_name":"1.9.10","version_date":"2018-11-30 10:20:32.000 +0800","version_description":"1、升级2019AI高送转潜力板块，根据最新2018年11月23日，上海证券交易所正式发布的《上海证券交易所上市公司高送转信息披露指引》，升级AI自动识别2019高送转潜力板块基础属性，主要根据三条高送转原则自动AI计算①上市公司披露高送转方案的，其最近两年同期净利润应当持续增长，且每股送转比例不得高于上市公司最近两年同期净利润的复合增长率。上市公司在报告期内实施再融资、并购重组导致净资产有较大变化的，每股送转比例可以不受前款规定的限制，但不得高于上市公司报告期末净资产较之于期初净资产的增长率。上市公司最近两年净利润持续增长且最近3年每股收益均不低于1元，上市公司认为确有必要提出高送转方案的，每股送转比例可以不受前两款规定的限制，但应当充分披露高送转方案的主要考虑及其合理性，向投资者揭示风险，且其送转后每股收益不得低于0.5元。②上市公司送转股方案提出的最近一个报告期净利润或预计净利润为负值、净利润同比下降50%以上、或者送转后每股收益低于0.2元的，不得披露高送转方案。③上市公司提议股东、控股股东及其一致行动人、董事、监事及高级管理人员（以下简称相关股东）在前3个月存在减持情形或者后3个月存在减持计划的，公司不得披露高送转方案。\n\n2、修复完善了1个来自用户提交的bug，升级优化了2个来自用户反馈的高优先级建议。"},{"version_id":"829742366","version_name":"1.9.11","version_date":"2018-12-28 09:22:17.000 +0800","version_description":"1、2019，香港！火爆新增香港IPO新股近5年AI回测重要数据！新增利弗莫尔证券全新定义的一个港股打新股概念指标，港股打新股超额认购人数倍数！港股打新股超额认购人数倍数区别与以往的港股打新股超额认购金额倍数，由于金额可能会因为少数大户、机构的偏好而产生偏差，但人数却代表了市场人气，是非常真实而接地气的存在！主要以A股涨停板市场情绪思维梦幻定义每一只港股新股在公开配售市场中普通投资者的申购情绪热度！同时升级训练AI提前预测个股超额认购金额倍数算法精准程度，2019年换手率短线炒股神器App战略合作伙伴利弗莫尔证券AI港股打新股会持续升级，努力帮助用户大幅度提升港股打新股赚钱概率！2019AI量化港股打新股的时代已经到来，更多AI选股策略，请访问我们换手率短线炒股神器App与利弗莫尔证券战略合作的AI大师实验室www.2019.ai\n\n2、Ai A! Ai A! Ai A! Ai实时选股持续疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂升级！本次新增AI基本面选股几大重要因素①每股净资产②毛利率③股价④每股资本公积金⑤每股收益⑥每股未分配利润⑦市场商誉数值，以上因素组合起来威力强大，具体AI选股时总市值低于50亿的个股更有潜力，同时记得公司要有一定商誉，有商誉说明公司有资本运作能力，但商誉太高也不太好，这点需要注意，我们按照AI基本面选股这几项因素的重要程度做一个排序，在市净率超低时，高每股净资产>高毛利率＞超跌股价＞高每股资本公积金＞高每股收益＞有一定商誉！特别感谢：邢者猎场大师，对AI选股基本面方向的长期战略指导！\n\n3、新增利弗莫尔证券AI港股打新股日历，包括首日开始申购的新股基本面及特色稀缺性概述、全部正在申购中的新股列表、最后1天申购的新股提醒、新股中签公布日期、未中签返款日期以及新股首日上市日期，帮助全体利弗莫尔证券客户从上帝视角更高效更极致统筹安排港股打新股资金！\n\n4、火爆升级利弗莫尔证券A股沪深股通游资涨停板，实时展现揭秘当日全部游资涨停板个股涨停原因，同时升级增加游资涨停板列表，包括今日涨停板个股、今日涨停板打开个股、今日实时首次接近冲击涨停板个股、今日技术面形态AI识别存在日K反包机会个股、昨日涨停板个股，如果上榜了龙虎榜同时标签龙虎榜化学反应、昨日涨停板打开个股、近一个月出现过涨停板个股！\n\n5、修复完善了2个来自用户提交的bug，升级优化了19个来自用户反馈的高优先级建议。"},{"version_id":"829846025","version_name":"1.9.12","version_date":"2019-01-07 09:05:19.000 +0800","version_description":"1、红红火火喜迎2019年新春行情！恭喜发财！大吉大利！2019年火爆新增最新沪深交易所全部上市公司年报预披露日期列表，用户能够按照A股上市公司首次年报预约披露日期进行排序，每年在年报披露日期的前一周左右时间，是潜伏可能存在高送转预期个股的好机会！年报预披露日期是市场短线游资机构特别关注的一个指标，关注年报披露日期能够帮助用户提前躲避可能存在被ST的风险个股或可能存在被暂停上市的风险个股，当个股可能存在风险时，用户应该在年报披露日期的前一个交易日提前选择观望，华尔街之王杰西·劳伦斯顿·利弗莫尔说过，“当我看见一个危险信号的时候，我不跟它争执，我躲开！几天以后，如果一切看起来还不错，我就再回来！”与此同时，对于预期符合ST摘帽条件的个股，每年在年报披露日期的前一个月左右时间，也是潜伏ST摘帽股的最佳机会！2019年恭祝全体换手率短线炒股神器App股友们在2019年高送转个股和2019年ST摘帽个股操作双囍临门！\n\n2、2019，香港！2019年火爆新增利弗莫尔证券港股打新股杰西·劳伦斯顿·利弗莫尔、本杰明·格雷厄姆、沃伦·巴菲特、查理·芒格、乔治·索罗斯、威廉·欧奈尔、詹姆斯·西蒙斯这7位全球顶级投资大师毕生投资策略演化的港股打新股AI深度学习进化机器人！这7位投资大师理念精髓生成的7位AI机器人能够根据利弗莫尔证券客户初始选择的自身风险偏好自动对每一只港股新股申购策略及申购手数进行自动AI推荐，真正实现AI千人千面，为每一位客户都量身定制！大师AI会根据自身推荐的港股新股申购策略并结合新股实际首日上市开盘盈亏表现持续复盘升级AI策略，在相应风险级别偏好范围内持续提升收益率，同时，客户能够增加让大师AI自动Deep Learning客户的操作，随着AI实战学习经验值的增加，AI本身将会持续升级成长进化变得更强更适合市场，AI将会与客户成为一个整体，帮助客户持续提高赚钱概率！当你想做一件事情的时候，Follow Your Heart，热爱是最大的动力！立即行动！我们与大家长期在一起并肩作战！2019AI量化港股打新股的时代已经到来，更多AI选股策略，请访问我们换手率短线炒股神器App与利弗莫尔证券战略合作的AI大师实验室www.2019.ai\n\n3、火爆升级利弗莫尔证券A股沪深股通证券交易个股日K线个性化展现，以客户系统为中心，在个股日K线千人千面展现每位客户自己的最新成本线、客户历史日期全部买卖操作标注、做T标注、个股历史日期全部客户备注、个股历史重要公告、个股历史涨停板原因等！\n\n3、新增利弗莫尔证券AI港股打新股日历，包括首日开始申购的新股基本面及特色稀缺性概述、全部正在申购中的新股列表、最后1天申购的新股提醒、新股中签公布日期、未中签返款日期以及新股首日上市日期，帮助全体利弗莫尔证券客户从上帝视角更高效更极致统筹安排港股打新股资金！\n\n4、新增利弗莫尔证券A股沪深股通每日AI集合竞价最强涨停板免费预测，通过AI短线技术面驱动策略结合实时AI集合竞价动态分析，在09:15:00~09:24:59期间实时AI计算，在09:25:00开盘之前，AI提前预测展现当日最有可能冲击涨停板的1只A股沪深股通标的！当然也存在当日没有任何满足AI条件的标的，AI纪律第一！特别提醒：AI预测仅供参考，不作为投资决策依据，证券交易需要个人独立思考，股市有风险，入市需谨慎！\n\n5、修复完善了2个来自用户提交的bug，升级优化了19个来自用户反馈的高优先级建议。"},{"version_id":"830178541","version_name":"1.9.13","version_date":"2019-04-19 10:23:19.000 +0800","version_description":"1、2019猪年大吉！值此新春佳节来临之际，吉利、股社区、小学弟、天道酬勤-股道至简、卡尔王子、万单成名、谈股论金888、沙沙复盘、索巴神、涨停板上跳芭蕾、短剑客、复利狼鹰、沐阳1、龙翔路五哥、崔总擒牛、诡道股手、自我实现牛股低吸、只做真龙、好运2017、虎帅、或渊、腾龙诀、海哥看盘捉妖、A股猎手、轩哥说股、兰心蕙质569、沛然有雨、私募打板敢死队、校 长、天生骄傲、股语有魂、靖哥股海论道、短线交易总结、趋势交易的奶爸、雷恩镇杰哥、股市一姐、涨停趋势、老沈讲股、涨停伏击一哥、尾盘擒牛、神秀、罗神抓妖记、妖股刺客、欧奈尔CANSLIM俱乐部、只买强势股、快乐家园579、海洋521战法、次新股为王、智选股、黑马公主518战法、稳中求进、子弋、牵牛客、只玩庄家、征服大神、利荣、青猫先生、股市先知、金酒抓牛涨停、只干龙头、好运来8、一战封神、山东大牛、中原股侠、短线宝哥、妖股纵横、稳稳的超短线、漫游的鱼、歪缠正道论股、短线操盘手666、复利的力量、狙击牛股、股市擒龙、腾飞起航日志、苏丞相、妖股猎手、掘金龙虎、股坛永恒金刚手、黑马传奇、六藏取经、小厂长CJ、擒龙2018、A股涨停王、俺的乖乖、鲲鹏一跃、红股摆渡人、游侠、行鱼复盘、超级短线王、孤独作手复盘、股域雷神、涨停密码、雪帝青鸿、投机天苑、大牛龙头、金牌操盘手、明灯看盘、长爵居士、心安阳升、复几把盘、神机决策、殷晨翔股市行情预测、鸿飞看盘、左右互搏、涨涨辉、老牛追牛、超短擒牛、大愚和尚陈亮、超短擒龙、股海大作手、金牛论股、冷静寻牛股、鸟叔看盘2018、夜行神龙、刀锋1980、玩转涨停板、晨风（透过K线看本质）、A股龙、A股名扬、赢家操盘、浪波万_主升浪、稳赢主升浪、涨停挖掘机、北京红竹、短线刀客888、元左、Hacse.、涨停神话、神雕股侠、涨不停的精彩股市、趋势兔、打板逻辑拆解66、趋势价值投机、时空牛、小游资八戒、汪海、职业短线炒手、阿空是自己的男神、逐梦家、小顾早盘、超短线老虎、宽客交易、小铁牛、稳操胜券V、郭施亮、叶飞倚天摘星、股票协会、股三戒、老刘传说、T14傻帽教授、缠龙、点将台、量化之父、菜鸟直播间、修罗、我的名字叫西旗、路人_宇、饕餮、股道的卢、嘟嘟稳健实盘等众多短线操盘手大师恭祝全体换手率股友们2019年猪年大發發發發發發發發發發發發發發發發發發發！一帆风顺吉星到！万事如意福临门！诸事大吉！团团圆圆！恭喜发财！财运亨通！牛气冲天！身体健康！阖家幸福！\n\n2、新增神盘感社区每日个股提前涨停板神预测，人人都是涨停板神盘感！用户可以通过神盘感社区提前自由预测每日可能出现涨停板的个股，神盘感社区支持每一位用户复盘回看历史自己全部神盘感预测炒股成长日志，用户通过长期坚持预测涨停板个股，持续锻炼提升盘感，真正神盘感属于勤奋的你！\n\n3、2019年短线交易需要紧密结合个股财务基本面专业深度数据，以市场为导师，尊重市场，敬畏市场，知己知彼，百战百胜！新增每日最新个股市场商誉更新数值、板块个股市场商誉均值、板块个股市场商誉排名以及AI相似市场商誉数值公司一键发现！\n\n4、新增利弗莫尔证券A股融资融券个股每日融资买入及卖出金额排行榜，新增融资融券个股沪深股通龙虎榜席位每日买入及卖出榜单，同时实时更新增加最新加入沪股通或深股通标的A股名单，从资金角度专注挖掘阶段趋势牛股，通过研究沪深港三地最活跃的资金手法，提前潜伏最具短线爆发力的妖股！\n\n5、修复完善了2个来自用户提交的bug，升级优化了19个来自用户反馈的高优先级建议。"},{"version_id":"831290690","version_name":"1.9.14","version_date":"2019-05-31 23:07:23.000 +0800","version_description":"1、我们有一个梦想，做灵魂级产品，做用户们喜爱的产品！29年磨一剑，专注短线交易！换手率短线炒股神器App新版火爆升级免费Level-2行情，让专注痴迷短线交易的股友们免费实时看到专业极致的Level-2行情，Level-2行情支持免费Level-2千档盘口、逐笔Level-2成交、逐笔Level-2委托明细、委托筹码深度图、买卖大单自定义等免费专业短线Level-2行情指标！换手率短线炒股神器App新版免费Level-2行情，为短线交易痴迷者们量身定制，你值得拥有！\n\n2、2019，香港！新增利弗莫尔证券自主研发港股新股暗盘交易，这一次，利弗莫尔证券全新定义香港新股暗盘交易，暗盘交易时间为港股新股上市前一个交易16:15:00~19:00:00，这梦想不眠不休！\n\n3、Ai A! Ai A! Ai A! Ai实时选股持续疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂升级！本次升级AI今日均线选股，支持最新价、最高价、最低价、自定义价格等单个或多重指标参数，同时支持自定义任意周期的单条或双条均线对比！新增AI选股基本面指标股息率，全部沪深A股以2018年年报派息数据对应股息率为标准，支持AI按照股息率指标选出符合巴菲特价值投资理念的个股标的！\n\n4、新增自选股列表个股所属板块功能，每日实时展现自选股列表个股所属每日涨幅最大的板块，点击对应板块名称展现全部个股所属板块！同时新增自选股列表个股股息率指标，2019年最新短线交易趋势中个股定期派息能力越来越重要，股息率不但是长期价值投资核心指标，更是短线交易的重要参考。\n\n5、新增升级涨停强度模块短线涨停板打板必备功能，每日实时冲击涨停板个股列表，展现当日全部涨幅大于+8.00%以上可能首次冲击涨停板个股，实时AI自动刷新，第一时间将涨停板潜力个股展现在视野中，助力涨停板打板提前准备，大幅度提升手速！\n\n6、新增涨停预测模块明日AI反包个股预测，AI明日反包股为AI自动根据日K线及分钟级K线图形态计算提前预测明日可能反包的个股，每天14:30~14:59更新列表，AI自动展现明日可能有机会短线反包的个股！AI反包股预测功能永久免费，主要运用AI计算机对每日重磅信息及K线数据自动进行海量大数据文本语义情绪分析及关联挖掘，AI反包股预测结果仅供参考，不对投资者构成任何投资建议！股市有风险，投资需谨慎！\n\n7、新增个股分时图秒级时间展现系统设置，助力专业短线证券交易用户在09:15:00~09:19:59及09:20:00~09:25:00、09:30:00~11:30:00、13:00:00~14:56:59及14:57:00~14:59:59及15:00:00基准把握每一个秒级操作时间点！同时分时图数据栏目更多选项中增加了个股最新股息率指标，便于实时查看每只A股2018年年报最新股息率！\n\n8、新增日K线换手率指标，实时展现个股历史日K换手率，以量能柱形式展现，当日阳线显示红色、当日阴线显示绿色，量能柱高低代表换手率大小。升级日K线主力资金指标，在主力资金净流入基础上增加主动流入和被动流入详细主力资金数据，并支持查看全部历史日K线主力资金主动流入和被动流入数据。\n\n9、新增沪深A股行情榜单任意属性字段自定义排序，包括热门行业、板块、涨幅榜、跌幅榜、振幅榜、换手率榜、5分钟涨速榜、量比榜、成交额榜等榜单的涨幅、最新价、涨跌、总手、现手、换手率、5分钟涨速、量比、委比、振幅、开盘、昨收、最高、最低、买一档、卖一档、市盈率、市净率、总市值、流通市值、每股收益、每股净资产全部属性字段。\n\n10、修复完善了2个来自用户提交的bug，升级优化了17个来自用户反馈的高优先级建议。"},{"version_id":"831748366","version_name":"1.9.15","version_date":"2019-06-30 10:20:25.000 +0800","version_description":"1、换手率短线炒股神器App持续火爆升级游资级免费Level-2功能，新增实时毫秒级极速刷新动态沪深A股全部档位买卖盘口量能价位分布图，包括实时价格和盘口深度，从图形上能够一目了然纵观个股盘中实时关键点位压力和支撑以及涨停板阻力线大小！换手率短线炒股神器App新版免费Level-2行情，为短线交易痴迷者们量身定制，你值得拥有！\n\n2、2019，香港！您关心的，才是我们关心的！您的利弗莫尔证券持仓，是我们重点服务的对象！在登录授权利弗莫尔证券账户状态下，新增自选股我的利弗莫尔证券当前持仓更多详细数据，包括持仓成本价、浮盈幅度、浮盈金额、最新持仓数量，同时新增我的当前持仓全部个股股价成本价等关键点位AI盘中实时消息推送提醒！\n\n3、Ai A! Ai A! Ai A! Ai实时选股持续疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂升级！本次新增AI选股历史条件实时调用，我们定义未来的自选股是实时动态的自选股，是用户通过AI自定义条件的实时自选股动态组合，我们是首家创新支持AI动态自选板块股的产品！新增近N个交易日突破历史新高或新低全部个股AI查询，同时新增搜索自定义任意周期范围内对应涨幅区间的AI实时选股组合！\n\n4、新增涨停强度功能中游资涨停打板必备神器市场情绪，我们每天都应该集中力量研究市场领头羊，A股市场每天涨停板个股就是值得我们非常非常认真研究的对象，每天实时观察整个市场最强的涨停板个股市场情绪有利于帮助您更好地预测手中个股的短线情绪趋势，市场情绪包括当日市场最高高度即最高涨停板连板个股、实时市场一字涨停板数、自然涨停板数、炸板数、连板数、首板数、二连板、三连板、三连板以上等市场情绪实时AI统计数据！\n\n5、新增A股上市公司互动平台问答关键词AI搜索功能，由我们来自百度的顶尖搜索天才工程师设计，支持实时搜索包括提问、回答、已回复、未回复等多重维度复合逻辑的AI关键词检索，例如您可以搜索“科创板”、“5G”、“华为”、“华为合作”、“小米”、“高送转”、“无人驾驶”等任意您心中的AI关键词！\n\n6、每天的比赛，从09:15:00就开始了！新增沪指、深指、创指在09:15:00~09:24:59集合竞价期间实时动态表现，助力短线换手率股友们能够在09:25:00开盘之前提前感知当日大盘市场情绪！\n\n7、2019年短线交易迎来与个股价值投资结合的新时代，近一年很多短线暴涨妖股都是拥有良好基本面支撑和持续高增长潜力预期的个股，拥抱变化！本次新增个股股票估值模块，在个股分时图行情页面，向右滑动即可免费查询，股票估值包括个股市盈率PE-TTM最大值、最小值、平均值、危险值、机会值、中位值等，个股市净率PB最大值、最小值、平均值、危险值、机会值、中位值等，同时包含A股市场市盈率平均分布、市场历史市盈率、市场历史市净率等。\n8、新增暴涨牛股升级支持查询历史任意日期的暴涨个股回测复盘，同时支持自定义过滤暴涨牛股一字涨停板次新股！\n\n9、新增支持利弗莫尔证券创新功能全部港股个股及认购认沽牛熊证每日实时潜在流动性数据，在每只个股的行情数据页面点击更多即可查询，一句话概述，可能当天成交金额为0的个股，流动性不一定差，如何判断流动性好坏，请看利弗莫尔证券个股潜在流动性数据指标，这是创新，更是天赋，有如天才杰西·利弗莫尔灵魂附体！\n\n10、修复完善了2个来自用户提交的bug，升级优化了26个来自用户反馈的高优先级建议。"},{"version_id":"831900777","version_name":"1.9.16","version_date":"2019-07-08 08:47:17.000 +0800","version_description":"1、2019年换手率短线炒股神器App战略合作伙伴利弗莫尔证券引爆AI港股打新股！利弗莫尔证券同时拥有顶尖AI证券交易实力和一线龙虎榜席位游资证券交易盘感，利弗莫尔证券将AI赋能给每一位利弗莫尔证券客户，本次新增AI实时选股港股打新股选股，支持利弗莫尔证券客户AI自定义港股新股所属行业、上市板块、年份包括从2014年至2019年近6年全部港股新股上市数据、首日开盘涨幅、首日收盘涨幅、累计涨幅、一手申购资金、一手中签率、超额认购倍数、公开配售占比、公开配售中签人数、募集总金额、绿鞋机制、发行价、保荐人、承销商等全部详细AI智能港股打新股量化交易维度数据，立即升级体验最新版AI实时选股，利弗莫尔证券客户港股打新股胜人一筹！\n\n2、新增A股沪深股通全部个股每日实时整体A股沪深股通香港券商净流入资金数据分时图以及每日实时全部A股沪深股通个股主力资金净流入金额排行榜！\n\n3、新增升级牛熊证双重风险警示提醒，在原有的牛熊证风险提示基础上，增加了对回收价在5%以内的超高风险牛熊证在证券交易时关于“如果未来打破收回价牛熊证将直接归0！”的双重二度风险警示提醒！同时在列表中将超高风险的牛熊证距回收价数据标记成为绿色！请您深刻记住，利润是风险控制的产物，想要在这个市场赚到钱，首先需要活下来！\n\n4、新增支持战略合作伙伴利弗莫尔证券交易每日日结单及每月月结单客户自定义下载保存至手机本地，便于客户未来进行个人长期累计操作逐笔复盘！\n\n5、修复完善了2个来自用户提交的bug，升级优化了17个来自用户反馈的高优先级建议。"},{"version_id":"832395679","version_name":"1.9.17","version_date":"2019-09-11 09:47:37.000 +0800","version_description":"1、Ai A! Ai A! Ai A! Ai实时选股持续疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂疯狂升级！火爆新增AI实时选股港股衍生品选股大师级指标，未来任意日期正股衍生品隐藏波动率，我们战略合作伙伴利弗莫尔证券全球首家创新定义未来对应日期正股隐藏波动率指标，AI Deep Learning发现了影响正股股价波动最重要的五大基于日期事件驱动的关键点因子，助利弗莫尔证券客户们提前挖掘有机会上演10倍暴涨传说的港股衍生品！新增AI实时选股，历史存在首日涨停板个股查询，客户可以自定义一定日期范围内出现过首个涨停板的个股，直接通过AI实时选股就能看到并且展现对应个股首板涨停原因揭秘！同时新增连续涨停板个股查询，客户同样可以自定义AI实时选股一定时间范围内出现连续N~X个涨停板的个股！更多AI选股策略，请访问我们换手率短线炒股神器App与利弗莫尔证券战略合作的AI大师实验室www.2019.ai2、新增集合竞价期间实时全部个股虚拟振幅榜、潜在成交额榜、潜在量比榜、潜在换手率榜、虚拟5分钟涨速榜，助力用户在09:15:00~09:24:59提前看到整个市场当天最具爆发潜力的游资板块标的！3、新增每日龙虎榜复盘栏目，以不同营业部组合产生不同化学反应为核心理念，根据营业部擅长风格与对应个股属性全新匹配，包括首板个股、连续涨停板个股、历史妖股、沪深股通香港券商可交易标的个股等，结合每日更新的每家营业部最新状态值组成的化学反应值，第一时间助力用户挖掘第二天有机会出现连续涨停板的龙虎榜标的！4、短线交易，毫秒必争！新增毫秒级实时分时图计时功能，在证券交易时间段，个股分时图左上角实时展现毫秒级时间，帮助用户提升证券交易委托及撤单精准度，例如09:19:45.27，这就是新的时间格式，用户能够看到实时毫秒级时间展现，精准在09:15:00~09:19:59期间进行对应的证券交易委托及撤单操作，同时用户还能够在09:25:00开盘之前，例如09:24:51.35，提前挂单抢筹集合竞价妖股，毫秒级时间展现有利于用户提升证券交易盘感！5、修复完善了1个来自用户提交的bug，升级优化了21个来自用户反馈的高优先级建议。"},{"version_id":"833447616","version_name":"1.9.18","version_date":"2019-11-26 11:55:44.000 +0800","version_description":"1、紫霞在你心目中是不是一个惊叹号！还是一个句号。你脑袋里是不是充满了问号呢？爱一个人需要理由吗？需要吗，不需要吗，需要吗，一生所爱，战略合作伙伴利弗莫尔证券全球首家创新研发专注证券交易本身的天才API紫霞梦幻账户，紫霞梦幻账户适合想要坚定长期投资港股又没有太多时间的股友们，拥有紫霞梦幻账户，您能够通过API直接进行证券交易，加速您的财富增值，LIVERMORE API，让您和您的家人拥有更美好的人生！什么是紫霞梦幻账户？至尊宝一生所爱！或我应该相信是缘份！\n\n2、适配iOS13，修复完善了2个来自客户提交的bug，升级优化了21个来自客户反馈的证券交易高优先级建议。"},{"version_id":"834001034","version_name":"1.9.19","version_date":"2019-12-15 21:02:16.000 +0800","version_description":"1、新增指标分时之巅\n\n2、修复完善了3个来自客户提交的bug，升级优化了9个来自客户反馈的证券交易高优先级建议。"},{"version_id":"834231413","version_name":"1.9.20","version_date":"2020-01-08 13:15:52.000 +0800","version_description":"1、2020鼠年大吉！值此新春佳节来临之际，吉利、股社区、小学弟、天道酬勤-股道至简、卡尔王子、万单成名、谈股论金888、沙沙复盘、索巴神、涨停板上跳芭蕾、短剑客、复利狼鹰、沐阳1、龙翔路五哥、崔总擒牛、诡道股手、自我实现牛股低吸、只做真龙、好运2017、虎帅、或渊、腾龙诀、海哥看盘捉妖、A股猎手、轩哥说股、兰心蕙质569、沛然有雨、私募打板敢死队、校 长、天生骄傲、股语有魂、靖哥股海论道、短线交易总结、趋势交易的奶爸、雷恩镇杰哥、股市一姐、涨停趋势、老沈讲股、涨停伏击一哥、尾盘擒牛、神秀、罗神抓妖记、妖股刺客、欧奈尔CANSLIM俱乐部、只买强势股、快乐家园579、海洋521战法、次新股为王、智选股、黑马公主518战法、稳中求进、子弋、牵牛客、只玩庄家、征服大神、利荣、青猫先生、股市先知、金酒抓牛涨停、只干龙头、好运来8、一战封神、山东大牛、中原股侠、短线宝哥、妖股纵横、稳稳的超短线、漫游的鱼、歪缠正道论股、短线操盘手666、复利的力量、狙击牛股、股市擒龙、腾飞起航日志、苏丞相、妖股猎手、掘金龙虎、股坛永恒金刚手、黑马传奇、六藏取经、小厂长CJ、擒龙2018、A股涨停王、俺的乖乖、鲲鹏一跃、红股摆渡人、游侠、行鱼复盘、超级短线王、孤独作手复盘、股域雷神、涨停密码、雪帝青鸿、投机天苑、大牛龙头、金牌操盘手、明灯看盘、长爵居士、心安阳升、复几把盘、神机决策、殷晨翔股市行情预测、鸿飞看盘、左右互搏、涨涨辉、老牛追牛、超短擒牛、大愚和尚陈亮、超短擒龙、股海大作手、金牛论股、冷静寻牛股、鸟叔看盘2018、夜行神龙、刀锋1980、玩转涨停板、晨风（透过K线看本质）、A股龙、A股名扬、赢家操盘、浪波万_主升浪、稳赢主升浪、涨停挖掘机、北京红竹、短线刀客888、元左、Hacse.、涨停神话、神雕股侠、涨不停的精彩股市、趋势兔、打板逻辑拆解66、趋势价值投机、时空牛、小游资八戒、汪海、职业短线炒手、阿空是自己的男神、逐梦家、小顾早盘、超短线老虎、宽客交易、小铁牛、稳操胜券V、郭施亮、叶飞倚天摘星、股票协会、股三戒、老刘传说、T14傻帽教授、缠龙、点将台、量化之父、菜鸟直播间、修罗、我的名字叫西旗、路人_宇、饕餮、股道的卢、嘟嘟稳健实盘等众多短线操盘手大师恭祝全体换手率股友们2020年鼠年大發發發發發發發發發發發發發發發發發發發！一帆风顺吉星到！万事如意福临门！诸事大吉！团团圆圆！恭喜发财！财运亨通！牛气冲天！身体健康！阖家幸福！\n\n2、涨停强度、最强风口、暴涨牛股、自选股、五分钟超神、选股列表、AI高转送增加成交额字段！\n\n3、增加新指标江恩阻力和多方发力新指标！\n\n4、修复完善了3个来自用户提交的bug，升级优化了10个来自用户反馈的高优先级建议。"},{"version_id":"834380668","version_name":"1.9.21","version_date":"2020-01-22 11:39:35.000 +0800","version_description":"1、2020鼠年大吉！值此新春佳节来临之际，吉利、股社区、逆命、天道酬勤-股道至简、卡尔王子、一言九鼎、或渊、淡然的炒、汪海、欧奈尔CANSLIM俱乐部、海哥看盘捉妖、前行投资者、漫游的鱼、自我实现牛股低吸、亿神、立命、妖股纵横、小厂长CJ、我股飞扬、克洛泽、短线操盘手666、炒股先锋、九天 揽月、Never say、涨停牛魔王、复利狼鹰、龙虎短线、股市大亨、殷晨翔金融行情预测、神秀、A股东尼、饮马天涯、秒懂大盘、哈登、冷静寻牛股、天一投资、波段十年、校  长、擒牛女神、鸿飞看盘、Charlie的话匣子、金股探、桔 梗、玩转涨停板、左右互搏、超短线打板、冷 锋、二分之一、航哥看盘、林荫门生、子剑战股海、私募打板敢死队、K线上跳舞、稳健上涨老司机、桃哥养牛股、黑马传奇、买卖点、股语有魂、北大柠檬、涨停猎物、次新股为王、老吴擒牛股、利荣、虎帅、老李降妖股、老韭菜涨停俱乐部、万单成名、A股名扬、欣然先生、钻淘金股、龙头战法、一招龍哥、枪哥擒牛、妖王战舰、狙击牛股、股市奇侠、股域雷神、北京红竹、涨停密码、狮大拿、7哥巡山组、主升浪股票池、稳中求进、涨停猎人、股王金来、无为看盘、帝释天股市博弈、骑牛看熊、A 股民老村长、老沈讲股、一休丿、子弋、股坛永恒金刚手、中原股侠、财富金帝、大浪淘金-降龙、一战封神、股典量化、智选股、超级短线王、掘金龙虎、佛山无影脚黄狮虎、主升浪寻龙、涨不停的精彩股市、苏丞相、寻龙点金、冰点股事、牛股大师兄、短线交易总结、稳稳的超短线、只玩庄家、骑士逻辑低吸、百年壹人、整板涨停神、擒龙2018、牛股阻击手、Roy R、刀锋1980、龙翔路五哥、妖股刺客、牵牛客、涨停神话、短线屠龙、跳动的红k线、涨停趋势、时空牛、量化交易女孩、妖股龙头股、股海大作手、职业短线炒手、西北小蛮牛、股海小米、短线宝哥、赢家交易策略、祥云2019、黑马天尊、牛娃复盘、内涵财经社、海洋521战法、A股龙、A股队长、股市先知、黑马公主、趋势价值投机、稳赢主升浪、只干龙头、乐豪、老牛追牛、股市擒龙、小猴论市、三分之一自旋题材挖掘机、股侠老梁、神雕股侠、六藏取经、低吸涨停俱乐部、牛股侠盗、A股猎手、黑马私木、强哥竞价、只买强势股、超短擒牛、股海老炮儿、靖哥股海论道、股市一姐、大牛龙头、好运来8、至尊天下、寻龙日记、雪帝青鸿、江湖行者、超短线—潜伏王、尾盘擒牛、超短王者、赵哥掘金、牛城顺势、黑海夺金、牛股笔记、龙头战法168、量化之父、菜鸟直播间、我的名字叫西旗、路人_宇、饕餮、复利的力量、缠图等众多短线操盘手大师恭祝全体换手率股友们2020年鼠年大發發發發發發發發發發發發發發發發發發發發！一帆风顺年年好！万事如意步步高！五福临门！团团圆圆！恭喜发财！红红火火！财运亨通！牛气冲天！牛市起航！身体健康！阖家幸福！\n\n2、支持指标区域放大！\n\n3、修复完善了2个来自用户提交的bug，升级优化了6个来自用户反馈的高优先级建议。"},{"version_id":"834933762","version_name":"1.9.22","version_date":"2020-03-13 09:26:52.000 +0800","version_description":"1、A股行情分时图新增指标纵横四海，DDC1。\n\n2、指标分时之巅展示做更新。\n\n3、Level2逐笔成交新增时间轴功能。\n\n4、升级优化了3个来自用户反馈的高优先级建议。"},{"version_id":"835475527","version_name":"1.9.23","version_date":"2020-04-10 10:31:37.000 +0800","version_description":"1.港股和可转债支持分时之巅指标\n\n2.行情页面新增“富时中国A50指数入口”\n\n3.换手率第三方登录支持苹果登录\n\n4.完成IOS13适配\n\n5.升级优化了2个来自用户反馈的高优先级建议"},{"version_id":"835519860","version_name":"1.9.24","version_date":"2020-04-15 08:58:23.000 +0800","version_description":"1.港股和可转债支持分时之巅指标\n\n2.行情页面新增“富时中国A50指数入口”\n\n3.换手率第三方登录支持苹果登录\n\n4.完成IOS13适配\n\n5.升级优化了2个来自用户反馈的高优先级建议"},{"version_id":"835771198","version_name":"1.9.25","version_date":"2020-05-13 09:21:11.000 +0800","version_description":"1、A股行情5日数据新增指标分时之巅\n\n2、首页新增【游资秘籍】，跟着大神学炒股，总有一款课程属于你，快去看看吧\n\n3、修复完善了2个来自用户提交的bug，升级优化了3个来自用户反馈的高优先级建议"},{"version_id":"836302572","version_name":"1.9.26","version_date":"2020-06-07 10:08:27.000 +0800","version_description":"1、新增指标“分时辅助系统”瞬时决策\n\n2、AI实时选股大师指标中新增“分时之巅”\n\n3、修复完善了1个来自用户提交的bug，升级优化了2个来自用户反馈的高优先级建议"},{"version_id":"836710767","version_name":"1.9.27","version_date":"2020-07-07 08:24:27.000 +0800","version_description":"1、新增“每日精选公告”，从海量的公告中筛选确定性最高的个股，多角度把握最具操作性的个股机会。帮助投资者提前挖掘到投资机会！\n\n2、新增“游资分时图”，采用数据分析技术，对分时图进行涂色，给您更加直观的行情体验。\n\n3、新增“逆周期强势股”，通过大数据分析，深度挖掘实时强势个股。\n\n4、优化直播间功能。\n\n5、新用户新增操盘手推荐入口，方便用户直接关注到近一周火爆状态一线龙虎榜游资席位。\n\n6、升级优化了3个来自用户反馈的高优先级建议。"},{"version_id":"837205585","version_name":"1.9.28","version_date":"2020-08-05 21:06:18.000 +0800","version_description":"1、新增“游资封单力度”，为您实时统计80万股以上大单列表。\n2、优化“AI相似分时图”列表，运用AI大数据相似人工智能图形试别技术，为您找到每天全部涨停板个股、龙虎榜个股及您自选板块个股中AI相似度匹配最高的个股历史分时图及次日走势！\n3、股票概况中，持股列表新增持股、持股比例、仓位判断字段，方便您更清晰的掌握股东持股变化。\n4、修复完善了2个来自客户提交的bug，优化了3个来自客户反馈的高优先级建议。"},{"version_id":"837792118","version_name":"1.9.29","version_date":"2020-09-18 16:19:06.000 +0800","version_description":"1、新增“科创50”大盘指数入口。\n\n2、\"AI实时选股\"分时之巅中新增4个筛选指标，按需筛选您心仪股票。\n\n3、将自媒体/头条的短文章的分享做成图片分享样式，以便您能更直观地分享好文章，好讯息。\n\n4、升级优化了3个来自用户反馈的高优先级建议。"},{"version_id":"838170840","version_name":"1.9.30","version_date":"2020-10-27 09:41:36.000 +0800","version_description":"1、适配iOS系统，提升版本稳定性和使用体验。\n\n2、升级优化了1个来自用户反馈的高优先级建议。"},{"version_id":"838456265","version_name":"1.9.31","version_date":"2020-11-02 16:55:27.000 +0800","version_description":"1、适配iOS14系统，提升版本稳定性和使用体验。\n\n2、升级优化了1个来自用户反馈的高优先级建议。"},{"version_id":"839793812","version_name":"1.9.32","version_date":"2020-12-29 10:05:21.000 +0800","version_description":"1、新增分时之巅E21指标，综合数理统计、概率论、交易心理学，通过大数据运算，极大提高您的投资成功率！\n\n2、新增头条的标签分类，重大要闻一览无余！\n\n3、修复完善了2个客户提交的bug，升级优化了2个来自客户反馈的高优先级建议。"},{"version_id":"840399094","version_name":"1.9.33","version_date":"2021-02-10 10:11:16.000 +0800","version_description":"1、2021牛年大吉！值此新春佳节来临之际，股社区、吉利、逆命、沙沙复盘、卡尔王子、涨停板上跳芭蕾、开心股场、只买强势股、天道酬勤-股道至简、私募打板敢死队、万单成名、狮大拿、青猫先生、崔总擒牛V5、投机之道、尘世梦游、轩哥说股、只做真龙、张重、一言九鼎、索大、红龙看盘、妖股刺客、靖哥股海论道、主升的秘密、炒股先锋、张春林、laoduo、短剑客、漫游的鱼、骑牛抓妖、秒懂大盘、兰心蕙质569、天生骄傲、稳中求进、日久。、雪豹007、尾盘擒牛、股道绅士、谈股论金888、涨停伏击一哥、强哥竞价、超短世界、时空牛、涨停趋势、大牛龙头、孤独作手复盘、股海牛魔王、股市大亨、明灯看盘、股市一姐、黑马天尊、余岳桐、狙击牛股、股语有魂、金股探、律动天成、超短王者、小猴论市、一招龍哥、腾龙诀、雪帝青鸿、趋势搏击、沛然有雨、菲特大叔、板爷捉妖、妖股纵横、至尊天下、起涨第一板、A 股民老村长、归来de恪、骑牛看熊、头铁将军、冷 锋、牛郎、红股摆渡人、股市先知、复利的力量、淡然的炒、大愚和尚陈亮、北大柠檬、潜伏老君、超级短线王、龙头欢乐哥、元左、涨停新王、稳操胜券V、逻辑投资老严、心安阳升、跳动的红k线、点点龙、金牛侠、整板涨停神、海哥看盘捉妖、稳健上涨老司机、lesliesay、财富金帝、超短阿牛、校 长、涨停剑客、殷晨翔金融行情预测、枪哥擒牛、六藏取经、玩转涨停板、股王金来、路人_宇、饕餮、量化之父、菜鸟直播间、修罗、我的名字叫西旗等众多短线操盘手大师恭祝全体换手率股友们2021年牛年大發發發發發發發發發發發發發發發發發發發發發！万事如意展宏图！心想事成兴伟业！五福临门！诸事大吉！团团圆圆！恭喜发财！财运亨通！牛气冲天！牛年大吉！身体健康！阖家幸福！\n\n2、修复完善了2个来自用户提交的bug，升级优化了21个来自用户反馈的高优先级建议。"},{"version_id":"840812444","version_name":"1.9.34","version_date":"2021-03-17 09:10:49.000 +0800","version_description":"1、新增美股行情，支持美股证券交易；\n\n2、修复完善了1个客户提交的bug，升级优化了3个高优先级建议"},{"version_id":"841479113","version_name":"1.9.35","version_date":"2021-04-19 09:08:28.000 +0800","version_description":"1、增加温度计功能，智能计算主要指数市场热度；\n\n2、增加上市公司画像功能，从财务角度精算上市公司财务质量；\n\n3、华尔街行情页面优化，板块分类，更清晰的反映各版块的行情；\n\n4、升级优化了4个高优先级建议"},{"version_id":"842022163","version_name":"1.9.36","version_date":"2021-05-06 19:25:01.000 +0800","version_description":"1、升级优化了2个来自用户反馈的高优先级建议"},{"version_id":"842483568","version_name":"1.9.37","version_date":"2021-06-07 19:54:37.000 +0800","version_description":"1、港股增加衍生品之王功能入口，今昨数据对比，更直观的展示正股与衍生品的走势；\n\n2、地域板块新增深圳板块，为您提供更多的地域板块数据；\n\n3、升级优化了5个高优先级建议。"},{"version_id":"843065480","version_name":"1.9.38","version_date":"2021-07-22 16:56:31.000 +0800","version_description":"1、港股新增分红派息功能入口，清楚地展示相应股东的投资回报；\n\n2、修复完善了1个来自客户提交的bug，升级优化了3个高优先级建议。"},{"version_id":"843290419","version_name":"1.9.39","version_date":"2021-07-28 14:43:25.000 +0800","version_description":"1、修复了线上指标异常的bug"},{"version_id":"844055467","version_name":"1.9.40","version_date":"2021-09-11 23:24:06.000 +0800","version_description":"1、新增中距比、全栈系数指标，综合数理统计、概率论，通过大数据运算，极大地提高您的投资成功率！\n\n2、修复完善了1个来自用户提交的bug，升级优化了2个来自用户反馈的高优先级建议"},{"version_id":"845176763","version_name":"1.9.41","version_date":"2021-11-07 11:23:50.000 +0800","version_description":"1、修复了部分来自用户的高优先级建议"},{"version_id":"845211281","version_name":"1.9.42","version_date":"2021-11-09 10:05:26.000 +0800","version_description":"1、升级优化了6个高优先级建议"},{"version_id":"845253633","version_name":"1.9.43","version_date":"2021-11-11 09:54:21.000 +0800","version_description":"1、升级优化了5个高优先级建议"},{"version_id":"845273469","version_name":"1.9.44","version_date":"2021-11-12 09:22:31.000 +0800","version_description":"1、升级优化了1个高优先级建议"},{"version_id":"845442801","version_name":"1.9.45","version_date":"2021-11-21 12:35:20.000 +0800","version_description":"1、升级优化了3个高优先级建议"},{"version_id":"846280953","version_name":"1.9.46","version_date":"2021-12-30 09:08:02.000 +0800","version_description":"1、新增2022年新版免费特色量化数据指标\n\n2、升级优化了5个来自用户反馈的高优先级建议"},{"version_id":"846748951","version_name":"1.9.47","version_date":"2022-01-25 21:56:17.000 +0800","version_description":"1、2022虎年大吉！值此新春佳节来临之际，恭祝全体换手率股友及家人们2022虎年大吉大利！阖家幸福！平平安安！健健康康！团团圆圆！五福临门！万事如意！\n\n2、新增沪深股通更多历史数据详情研究！\n\n3、新增首日上市新股展示功能，每天A股新股数据一目了然！\n\n4、新增免费特色量化数据指标！\n\n5、修复完善了1个来自用户提交的bug，升级优化了2个来自用户反馈的高优先级建议！"},{"version_id":"847513062","version_name":"1.9.48","version_date":"2022-03-09 18:04:28.000 +0800","version_description":"1、升级优化了3个来自用户反馈的高优先级建议！"}]