[{"version_id":"816112761","version_name":"2.0.0","version_date":"2016-01-22 00:23:56.000 +0800","version_description":"1Wallet has got a new look! We have envisaged the app starting from zero in order to enhance its performance and approachability and we hope you will like it. You can:<br><br>-Suggest loyalty cards for the app from smaller shops too;<br>-Have your suggested loyal cards published in the new area “Users cards”<br>-Watch the new tutorial video;<br>-Open up Apple Wallet® directly from the app’s info page;<br>-Announce a new shop by e-mail or contact assistance;<br>-Check out the address of a shop for which you are creating the loyalty card on a map;<br><br>Do not hesitate to  contact us to request additional shops, no matter whether famous or not, in order to help us make your wallet increasingly digitalized!"},{"version_id":"816574646","version_name":"2.2.0","version_date":"2016-03-13 00:07:48.000 +0800","version_description":"- Introduction of the new category \"Tickets\"<br>- Fixed compatibility problem of capturing bar codes in Europe;<br>- Fix minor;"},{"version_id":"816722187","version_name":"2.2.1","version_date":"2016-03-17 23:57:33.000 +0800","version_description":"Bug fix note"},{"version_id":"817089084","version_name":"2.2.2","version_date":"2016-04-20 22:15:56.000 +0800","version_description":"Thanks to all for your requests for new tiles. Today we are more than 500 graphic themes available. Thank you!<br>In this update:<br>- We fixed bugs in the 3D Touch;<br>- Now next to each shop is an icon indicating the type of barcode used;<br>- Improvements minors."},{"version_id":"817319230","version_name":"2.2.3","version_date":"2016-05-10 22:10:56.000 +0800","version_description":"- New screen app store<br>- Minor fix"},{"version_id":"817728441","version_name":"2.3.0","version_date":"2016-06-10 21:36:48.000 +0800","version_description":"We have integrated a different system of notifications you felt you when new templates will be added to the loyalty cards.<br><br>We thank you for your suggestions and proposals for improving the app, several of these will be made with the next updates. Thank you."},{"version_id":"817742933","version_name":"2.3.1","version_date":"2016-06-14 23:05:00.000 +0800","version_description":"Fixed bug related to the sending of new templates for your loyalty cards."},{"version_id":"818696141","version_name":"2.4.0","version_date":"2016-08-30 16:35:29.000 +0800","version_description":"Thank you all for your support and cooperation by sending requests from around the world for the addition of new graphical themes for your loyalty cards. To try to please everyone and speed up the service we changed the submit method of the stores to be added. Now it is required to insert the link to the site or page Facebook® reported the store. We've also added a help screen for reading the bar code of loyalty cards. Do not forget to leave your review! Thank you!"},{"version_id":"818723867","version_name":"2.4.1","version_date":"2016-09-01 18:07:37.000 +0800","version_description":"Improved translation of loyalty cards."},{"version_id":"818850056","version_name":"2.4.2","version_date":"2016-12-09 00:56:08.000 +0800","version_description":"Many thanks to all users who have proposed new loyalty cards and suggested improvements. We always try to please everyone, it will not be easy but the work does not scare us and your thank-mails give the position to do even better. Thank you!<br>That's what changes in this version:<br>- New Start tutorial;<br>- Improved location of store: now you can start from an address and open the map by moving the pointer precisely on the map with a long press on the display;<br>- Ability to add up to 3 positions for each loyalty card that will be shown in screen lock as soon as it is close to the shops;<br>- New video tutorials;<br>- Bug fixes."},{"version_id":"820117298","version_name":"2.4.3","version_date":"2016-12-14 18:03:50.000 +0800","version_description":"Now you can view the map even in satellite and hybrid views."},{"version_id":"820634613","version_name":"2.5.0","version_date":"2017-01-23 23:38:33.000 +0800","version_description":"- New reader barcode now compatible with many more formats<br>- The cards are compatible with Apple Watch are now indicated with the appropriate icon;<br>- You can change the range in the lock screen notifications when you are nearby of the store;<br>- Added German and Japanese languages;<br>- Bug Fix;"},{"version_id":"822678748","version_name":"2.6.0","version_date":"2017-06-26 22:01:23.000 +0800","version_description":"- Fixed some bugs related to the search bar;<br>- New way of sending the loyalty cards you have proposed;<br>- New scanning screen;<br>- Now you can indicate a link to the store that will be placed on the back of the card;<br>- Compatibility with new Wallet management (available with iOS 11)"},{"version_id":"822768631","version_name":"2.6.1","version_date":"2017-07-03 22:14:36.000 +0800","version_description":"Bug fix"},{"version_id":"824233934","version_name":"3.0","version_date":"2017-11-08 01:14:18.000 +0800","version_description":"Welcome iPhone X! The app has been optimized for this great device!<br><br>We finally introduced the ability to create their missing loyalty cards and share them with the community (almost) instantly. It will no longer be necessary to request new tiles and wait for processing. Now wait for a short review period.<br><br>Introducing the category \"Users Channels\" in which all the cards presented by our users will be published. Again, we do not ask for a user registration, your privacy first!<br><br>New icon!<br><br>Fixed the language problem in german and various fixes."},{"version_id":"824335773","version_name":"3.0.1","version_date":"2017-11-09 01:07:05.000 +0800","version_description":"We've solved the GPS location on our digital cards and other minor fixes.<br><br>We thank our users for our very important comments! THANK YOU!"},{"version_id":"825712086","version_name":"3.0.2","version_date":"2018-04-09 16:43:41.000 +0800","version_description":"Bug Fix"},{"version_id":"828606367","version_name":"3.1","version_date":"2018-09-17 00:14:06.000 +0800","version_description":"iOS 12 brought some fresh news:<br><br>- Now you can tell SIRI to look for the digital card for you: Go to SETTINGS -&gt; SIRI AND SEARCH -&gt; SELECT WALLET -&gt; SELECT CARD (press +) Register your custom command here, for example: \"Game Stop card\" . Siri will show you the card on your Wallet!<br>- To facilitate the search, 1Wallet cards are grouped in Apple Wallet for product categories (clothing, supermarkets, wellness, etc. ..)<br>- On Apple Watch you can see your barcode in clear to inform the merchant<br>- New information page<br>- The app is compatible with iPhone X - XS - XSMax - XR<br>- BugFix"},{"version_id":"828645491","version_name":"3.2","version_date":"2018-09-21 18:08:13.000 +0800","version_description":"Fixed anomaly regarding the generation of tickets and documents"},{"version_id":"828802153","version_name":"3.3","version_date":"2018-10-04 17:41:45.000 +0800","version_description":"- Improved display of the info section;<br>- Now even the cards proposed by users have been divided by category;<br>- Available in the info section the following themes: grouping cards on Apple Wallet and implementation of Shortcut to add cards to the iPhone Widget;<br>- Improved support for push notifications;<br>- Minor Fix;"},{"version_id":"830400050","version_name":"3.7","version_date":"2019-02-24 23:40:58.000 +0800","version_description":"Thanks to all your suggestions in this version you can automatically return to the list of cards after their creation"},{"version_id":"830723384","version_name":"3.8","version_date":"2019-03-25 23:47:52.000 +0800","version_description":"In addition to loyalty cards, now you can propose the tickets for events"}]