[{"version_id":"813736720","version_name":"1.0","version_date":"2016-03-07 03:48:08.000 +0800","version_description":""},{"version_id":"816691078","version_name":"1.1","version_date":"2016-03-10 02:31:12.000 +0800","version_description":"---Crash fix when trying to load non compatible tracks---<br><br>Explanation:<br><br>Tracks downloaded from streaming services, while available to play on the local device, are not allowed to be used in most cases by third party apps. We fixed a crash when trying to load these non compatible tracks and for iOS 9.2 and above have filtered the results to show only non DRM tracks. For iOS 9.2 and below users will get a warning to explain why they tracks aren't working. Tracks you have purchased through iTunes or DRM free tracks loaded onto your device from the iTunes desktop app will work 100% with Transcribe+. <br><br>Please consider leaving a positive review if you are enjoying the app!"},{"version_id":"816787520","version_name":"1.2","version_date":"2016-03-22 00:05:02.000 +0800","version_description":"If you are a fan of Transcribe+ please consider leaving us a positive review on iTunes! Positive reviews are the best way to spread the word- and help us continue to dedicate more resources to improving Transcribe+<br><br>Crash discovered when user deletes a track that is currently in use- this is now fixed."},{"version_id":"816936044","version_name":"1.3.1","version_date":"2016-04-06 21:12:47.000 +0800","version_description":"Drobox, Google Drive and iCloud Integration- Your #1 requested feature is now here! Add music easily from these services if they are installed on your device.<br><br>Open music attachments from emails and other apps that support this service directly into Transcribe+. This option can be found within the 'share' menu when available and made possible by third party apps.  <br><br>Bug fixes<br><br>Please consider rating this new update in iTunes. Positive ratings from our users are the best way to support the app."},{"version_id":"817211406","version_name":"1.3.2","version_date":"2016-04-28 20:30:55.000 +0800","version_description":"Bug fixes<br>Formatting fixes"},{"version_id":"817244392","version_name":"1.4","version_date":"2016-05-05 18:38:37.000 +0800","version_description":"Export Loops and Entire Tracks-<br><br>You asked for it, so we built it! Take a look in the menu, under 'actions' to find our new export feature. It works just like you would expect. Export to a 6 different file formats. You can open the new file directly in a compatible app or save it to Dropbox, iCloud, or Google Drive. <br><br>Bug Fixes and Performance Improvements<br><br>UI fix, My Music selection page now loads faster in some cases, fixed a crash and more.<br><br>Review Us in iTunes- If you like us please leave a positive review in iTunes, it really helps spread the word!"},{"version_id":"818135299","version_name":"1.4.1","version_date":"2016-07-21 14:18:22.000 +0800","version_description":"If you are enjoying Transcribe+ please leave a review on iTunes! Reviews are reset for every update and they are the best way to spread the word about the app!<br><br>What's new:<br><br>Faster scrolling<br>Two finger swipe to skip to the next flag- navigate very quickly through really long tracks with this simple gesture!"},{"version_id":"818279238","version_name":"1.4.2","version_date":"2016-07-27 02:00:31.000 +0800","version_description":"Fixed an audio issue for devices with A5 chip- sorry about that!<br><br>Reviews are reset for every update so if you are enjoying Transcribe+ please consider leaving us a review!"},{"version_id":"821086708","version_name":"1.4.3","version_date":"2017-03-01 17:00:00.000 +0800","version_description":"New quick scrub area to instantly jump anywhere within a track<br><br>-Tap or swipe this area to move around the tracks much faster<br>-See where your flags and loop are located within the track<br><br>As always- reviews are extremely helpful and much appreciated."},{"version_id":"824991003","version_name":"1.4.4","version_date":"2017-11-28 15:01:43.000 +0800","version_description":"iPhone X update!"},{"version_id":"825441364","version_name":"1.4.5","version_date":"2018-09-20 01:37:19.000 +0800","version_description":"Now music will continue to play in the background if user exits the app during playback."},{"version_id":"831177943","version_name":"1.4.6","version_date":"2019-05-11 13:24:29.000 +0800","version_description":"Dark Mode!<br><br>Bug Fixes:<br><br>Fixed an issue where loops would not be recognized when the screen was turned off"},{"version_id":"831305012","version_name":"1.4.7","version_date":"2019-05-16 06:18:47.000 +0800","version_description":"Added a keyboard short cut for use with bluetooth connected keyboards<br>-Tap space bar to pause and play<br>Slight fix to dark mode"},{"version_id":"831417570","version_name":"1.4.71","version_date":"2019-05-24 23:10:49.000 +0800","version_description":"New App Store Preview Video"},{"version_id":"836512703","version_name":"1.4.74","version_date":"2020-06-22 22:26:20.000 +0800","version_description":"bugs fixes and streamlined the export function"},{"version_id":"836706071","version_name":"1.4.75","version_date":"2020-07-07 12:40:23.000 +0800","version_description":"Add multiple loops to tracks"},{"version_id":"836839349","version_name":"1.4.76","version_date":"2020-07-15 01:13:58.000 +0800","version_description":"EQ Toolbar Toggle-<br><br>When you toggle this on an EQ toolbar will appear just above the play control area. The EQ settings have been exaggerated somewhat to help you minimize or emphasize certain HZ ranges<br><br>Recent Songs-<br><br>Finally! Quickly find the most recent tracks you have worked on."},{"version_id":"837115621","version_name":"1.4.78","version_date":"2020-07-31 16:30:32.000 +0800","version_description":"Speed and Pitch settings now persist even when a song is closed and opened later<br>Fixed an issue where audio export options were missing<br>Fixed a crash when importing videos from the files app<br>Fixed a crash when saving a video to your camera roll<br>Voiceover improvements- speed/pitch adjustment, quick scrub, and main waveform areas now work with a double tap and hold gesture"},{"version_id":"837347777","version_name":"1.4.79","version_date":"2020-08-13 23:27:37.000 +0800","version_description":"Fixed some issues with accessing video from the Camera roll and added new permission warnings<br><br>Loops are now ignored unless you start playing within the loop itself. I welcome feedback on this change."},{"version_id":"837396021","version_name":"1.4.80","version_date":"","version_description":""},{"version_id":"837467661","version_name":"1.4.81","version_date":"","version_description":""},{"version_id":"837797009","version_name":"1.5.1","version_date":"2020-09-17 14:09:40.000 +0800","version_description":"1.5.1<br><br>Export split tracks(stems) as separate files or as one file based on the current mix you have set. <br>Fixed a bug where you couldn't mute a stem if it was covered by a loop<br>Fixed a few crashers<br><br>1.5<br><br>HUGE Update!<br><br>Isolate Vocals, Bass, Drums and Harmony  elements of ANY TRACK. Each element is split and shown as it's own waveform that can be muted if desired. The results are incredible- has to be tried to be believed. <br>Loops can now be turned off or on by tapping the loop icon<br>8 beautiful new themes<br>App icon automatically changes to match the theme you are using<br>Two finger tap gesture on the right or left side of the waveform to skip to the next flag or loop<br>Updated settings screen<br>Updated tutorial"},{"version_id":"837874006","version_name":"1.6","version_date":"2020-10-10 11:24:57.000 +0800","version_description":"Now works with Apple Music!<br><br>-Please keep in mind Apple Music tracks have limitations-<br><br>These tracks are DRM protected so most of the audio operations we can perform on normal tracks are not possible, but speed adjustments are still possible thankfully. We also preserved a visual interface with a placeholder waveform that you can easy add flags and loops too- just as easily as non DRM tracks. Transcribe+ effectively has two modes- DRM tracks with limited features, or DRM free with no limitations. <br><br>Two finger tap gesture to reset EQ toolbar<br><br>Two finger tap gesture to reset speed/pitch<br><br>Updated Tutorial"},{"version_id":"838295646","version_name":"1.6.1","version_date":"2020-10-21 02:48:19.000 +0800","version_description":"Added scrubbing sound effect for Apple Music tracks"},{"version_id":"838316702","version_name":"1.6.2","version_date":"2020-10-22 13:06:37.000 +0800","version_description":"fixed an issue that prevents screen capture videos from loading"},{"version_id":"839249529","version_name":"1.6.3","version_date":"2020-11-18 14:34:45.000 +0800","version_description":"You can now export loops from single stems"},{"version_id":"839331767","version_name":"1.6.4","version_date":"2020-11-24 01:50:38.000 +0800","version_description":"Transcribe+ cache now auto clears to prevent the app data from becoming too large"},{"version_id":"839513242","version_name":"1.6.5","version_date":"2020-12-08 01:05:38.000 +0800","version_description":"Meta Data Changes"},{"version_id":"840077728","version_name":"1.6.6","version_date":"2021-01-19 16:29:19.000 +0800","version_description":"Updated App Store Screenshots"},{"version_id":"840296499","version_name":"1.6.7","version_date":"2021-02-01 18:55:10.000 +0800","version_description":"Fixed a bug where playback speed on Apple Music tracks would revert to 100%"},{"version_id":"840471977","version_name":"1.6.8","version_date":"2021-02-15 18:57:43.000 +0800","version_description":"Added a file loading spinner when tracks are loading<br>Fixed a crash that could occur in some cases with Apple Music tracks<br>Fixed an bug for recent files<br>EQ settings now persist when a track is closed and reopened later<br>New IAP screen<br><br>Also as a reminder- Transcribe+ supports family sharing so your unlock in app purchase can be shared with anyone in your family plan!"},{"version_id":"840551367","version_name":"1.6.9","version_date":"2021-02-19 23:49:21.000 +0800","version_description":"Last build had a bug that required upgraded users to restore purchase again- this is now fixed.<br><br>---------<br><br>Added a file loading spinner when tracks are loading<br>Fixed a crash that could occur in some cases with Apple Music tracks<br>Fixed an bug for recent files<br>EQ settings now persist when a track is closed and reopened later<br>New IAP screen<br><br>Also as a reminder- Transcribe+ supports family sharing so your unlock in app purchase can be shared with anyone in your family plan!"},{"version_id":"842401422","version_name":"1.6.93","version_date":"2021-05-30 11:00:32.000 +0800","version_description":"Improvements to notification system"}]