[{"version_id":"834270959","version_name":"3.0.2","version_date":"2020-01-10 20:42:18.000 +0800","version_description":"Wir waren wieder fleißig und haben VIMpay hier und da aufpoliert. So wird das Erlebnis mit VIMpay noch schöner.<br><br>Du hast Feedback oder Wünsche? Dann schreib uns doch gerne eine Nachricht im App Chat oder auf Social Media!<br>Dein VIMpay Team"},{"version_id":"834350326","version_name":"3.0.3","version_date":"2020-01-28 15:34:31.000 +0800","version_description":"Das Update bringt dir eine Vielzahl an neuen Info-Segmenten – entdecke VIMpay mit nur einem Klick und erfahre so alles über unsere Features.\n<br>Damit VIMpay problemlos bei dir läuft gibt‘s oben drauf noch jede Menge kleine Optimierungen und Anpassungen.\n"},{"version_id":"834606363","version_name":"3.1.0","version_date":"2020-02-10 17:27:25.000 +0800","version_description":"Komm auf die dunkle Seite der Macht! Der Dark Mode für VIMpay ist da!<br>Wähle zwischen Licht und Schatten und entscheide dich für eine Seite. Aber wähle weise, junger Padawan!<br><br>Möge die Macht mit dir sein!<br>Dein VIMpay-Team"},{"version_id":"834794715","version_name":"3.2.0","version_date":"2020-02-24 20:39:04.000 +0800","version_description":"Du bist auf Reisen? Dein Kumpel daheim? Kein Problem! Geld senden geht jetzt noch einfacher und ganz ohne QR-Code! Chatte ab sofort über den VIMpay Chat mit deinen Freunden und schicke ihnen Geld in Echtzeit – egal wo du gerade unterwegs bist.\n<br>\n<br>De"},{"version_id":"834843882","version_name":"3.2.1","version_date":"2020-03-03 16:49:50.000 +0800","version_description":"Für die User unserer Partnerbank AAB haben wir diesmal ein besonderes Zuckerl am Start! Ab sofort können Karten von der Augsburger Aktienbank in der Apple Wallet hinterlegt werden, sodass du direkt mit dem Smartphone bezahlen kannst.<br><br>Dein VIMpay Te"},{"version_id":"834972020","version_name":"3.3.0","version_date":"2020-03-09 20:28:13.000 +0800","version_description":"Für alle Unternehmer da draußen – egal welche Rechtsform dein Business hat, ganz egal ob du stolzer Besitzer einer Würstchenbude oder der Gründer eines Kosmetik-Megakonzerns bist. Mit VIMpay Business bekommst du dein Geschäftskonto passend zu deinem Unter"},{"version_id":"835100430","version_name":"3.3.1","version_date":"2020-03-23 15:45:11.000 +0800","version_description":"Brandneu! Fitbit Pay mit VIMpay!<br><br>Ob die Flasche Wasser nach dem Training oder das Ticket für den Skilift. Mit Fitbit Pay und VIMpay zahlst du locker aus dem Handgelenk und verwaltest deine Finanzen sportlicher denn je. Einfach Fitbit Pay Segment hi"},{"version_id":"835348093","version_name":"3.4.0","version_date":"2020-04-06 17:42:05.000 +0800","version_description":"Juhu! Unser Beta-Testing war mehr als erfolgreich und wir sind stolz dir Version 3.4.0 nach ausgiebigem Testen zur Verfügung zu stellen. An dieser Stelle ein dickes Dankeschön an unsere fleißigen Tester, die uns tatkräftig unterstützt und die Version für "},{"version_id":"835423242","version_name":"3.4.1","version_date":"2020-04-21 17:17:53.000 +0800","version_description":"Wir bringen die nächste Beta-Testing-Version an den Start und freuen uns dir noch mehr Durchblick verschaffen zu können! Alle Push-Nachrichten findest du ab jetzt im Notification-Center wieder. Außerdem haben wir unsere Hintergrundaktualisierungen optimie"},{"version_id":"835773816","version_name":"3.4.2","version_date":"2020-05-05 21:21:00.000 +0800","version_description":"Wir werkeln fleißig im Home-Office, damit VIMpay für dich immer besser wird. Kleinere Anpassungen und Optimierungen standen diesmal auf dem Plan. Außerdem ist es unseren Basic- und Comfort-Usern ab sofort möglich ihr VIMpay Guthaben auf ihr Referenzkonto "},{"version_id":"835934160","version_name":"3.4.3","version_date":"2020-05-19 15:07:45.000 +0800","version_description":"Trotz Home-Office basteln wir weiterhin an unserer App herum, damit du VIMpay noch besser nutzen kannst! Die PushTAN ist nun für alle PayCenter Produkte eingerichtet. Ebenfalls kann jetzt jeder problemlos seine Kartennummer kopieren. Kleinere Anpassungen "},{"version_id":"836190852","version_name":"3.4.4","version_date":"2020-06-02 21:12:46.000 +0800","version_description":"Wir werkeln fleißig im Home-Office, damit VIMpay für dich immer besser wird. Kleinere Anpassungen und Optimierungen standen diesmal auf dem Plan. Viel Spaß damit!<br>Dein VIMpay Team"},{"version_id":"836472213","version_name":"3.4.5","version_date":"2020-06-19 15:32:39.000 +0800","version_description":"Wir werkeln fleißig im Home-Office, damit VIMpay für dich immer besser wird. Kleinere Anpassungen und Optimierungen standen diesmal auf dem Plan. Wenn du im VIMpay Chat noch nie Geld an jemanden übertragen hast, wirst du außerdem in einem Mini-Tutorial in"},{"version_id":"836888050","version_name":"3.5.0","version_date":"2020-07-22 15:58:54.000 +0800","version_description":"Für mehr Durchblick haben wir den VIMpay Store mal so richtig für dich auf Vordermann gebracht! <br>In weiser Voraussicht, dass unser Angebot für dich stetig steigen wird, bietet dir der neue Store eine grandiose Übersicht über deine grenzenlosen Optionen"},{"version_id":"837041868","version_name":"3.6.0","version_date":"2020-07-30 14:30:05.000 +0800","version_description":"Für noch mehr Überblick gibt es nun für alle deine Karten eine Suchfunktion in den Umsätzen. Damit VIMpay weiterhin problemlos läuft, gibt‘s oben drauf noch ein paar kleine Optimierungen und Bugfixes.<br><br>Dein VIMpay Team"},{"version_id":"837099785","version_name":"3.6.1","version_date":"2020-08-11 18:42:47.000 +0800","version_description":"Damit du deine PushTAN perfekt verwalten kannst, wurde ein neuer Bereich in deinen Sicherheitseinstellungen angelegt. <br>Startest du die App über eine neue Benachrichtigung, wird diese nun direkt als gelesen markiert. Da wir zahlreiches Kundenfeedback da"},{"version_id":"837443087","version_name":"3.6.2","version_date":"2020-08-31 17:18:06.000 +0800","version_description":"Wir werkeln fleißig im Home-Office, damit VIMpay für dich immer besser wird. Kleinere Anpassungen und Optimierungen standen diesmal auf dem Plan. Viel Spaß damit!<br>Dein VIMpay Team"},{"version_id":"837655158","version_name":"3.6.3","version_date":"2020-09-10 19:19:35.000 +0800","version_description":"Wir werkeln fleißig im Home-Office, damit VIMpay für dich immer besser wird. Kleinere Anpassungen und Optimierungen standen diesmal auf dem Plan. <br>Viel Spaß damit!<br><br>Dein VIMpay Team"},{"version_id":"837746413","version_name":"3.6.4","version_date":"2020-09-25 15:27:58.000 +0800","version_description":"Im Home-Office tüfteln wir weiterhin an unserer App, damit VIMpay für dich immer besser wird.<br>Diesmal standen kleinere Anpassungen und Optimierungen auf unserer To-do-Liste. Viel Spaß damit!<br><br>Dein VIMpay-Team"},{"version_id":"838121545","version_name":"3.6.5","version_date":"2020-10-09 15:15:50.000 +0800","version_description":"Wir werkeln fleißig im Home-Office, damit VIMpay für dich immer besser wird. Kleinere Anpassungen und Optimierungen standen diesmal auf dem Plan. <br>Viel Spaß damit!<br><br>Dein VIMpay Team"},{"version_id":"838143924","version_name":"3.7.0","version_date":"2020-10-20 15:02:05.000 +0800","version_description":"The Safest Way to Pay: Mit VIMpay und SwatchPAY! kontaktlos bezahlen<br><br>Kontaktloses Bezahlen ist aktuell so gefragt und gleichzeitig so wichtig wie nie: Gemeinsam mit SwatchPAY! machen wir den Bezahlvorgang an der Kasse ein ganzes Stück sicherer. Das"},{"version_id":"838452342","version_name":"3.7.1","version_date":"2020-11-04 16:39:10.000 +0800","version_description":"Weiterhin basteln wir fleißig daran, dass VIMpay für dich immer besser und komfortabler wird. Kleinere Anpassungen und Optimierungen wurden dafür vorgenommen. <br><br>Wir wünschen dir viel Spaß!\n<br>Dein VIMpay-Team"},{"version_id":"839018185","version_name":"3.7.2","version_date":"2020-11-20 16:51:56.000 +0800","version_description":"Damit dir nichts entgeht und du den optimalen Überblick behältst, haben wir ein paar Anpassungen für dich vorgenommen:<br><br>Beim Upgrade auf Basic erhältst du deine eigene IBAN. Hierüber informieren wir dich via Notification im Notification-Center. Bitt"},{"version_id":"839401441","version_name":"3.8.0","version_date":"2020-12-03 19:43:43.000 +0800","version_description":"Die Weihnachtselfen von VIMpay basteln fleißig an der App, damit dein VIMpay-Erlebnis noch besser wird. Eine neue Möglichkeit für dich ist der Upload von PDFs im DocStore. Ansonsten wurde die App an ein paar Stellen verbessert und angepasst.<br><br>PS: Ge"},{"version_id":"839597175","version_name":"3.8.1","version_date":"2020-12-17 16:23:23.000 +0800","version_description":"Wieder einmal haben wir für dich fleißig an der App geschraubt, Bugs wurden entfernt und der VIMpay Store auf Hochglanz gebracht.<br><br>Du bist ein echter VIMpay-Fan? Dann lass uns doch eine Bewertung da und folge uns auf Social Media. Hier gibt’s Einbli"},{"version_id":"840065240","version_name":"3.9.0","version_date":"2021-01-18 17:08:50.000 +0800","version_description":"Wir starten voller Elan ins neue Jahr und kredenzen dir zum Jahresanfang mit der neuen VIMpay Version eine neue Logik für das Laden innerhalb der App, um die Performance zu optimieren. Unsere fleißigen Bienchen haben diese Version bereits auf Herz und Nie"},{"version_id":"840142802","version_name":"3.9.1","version_date":"2021-01-22 12:59:03.000 +0800","version_description":"Im letzten Update hat sich ein kleiner Fehler eingeschlichen, wenn du deine VIMpay Karten im Banking Segment ausgeblendet hast. Mit dem neuen App Update haben wir dies nun korrigiert.<br><br>Viel Spaß weiterhin mit VIMpay!<br><br>Dein VIMpay Team"},{"version_id":"840211788","version_name":"3.9.2","version_date":"2021-02-04 15:57:53.000 +0800","version_description":"Um deinen VIMpay Store noch übersichtlicher zu machen haben wir daran gearbeitet, dass du direkt zu den jeweiligen Online-Shops unserer Zusatzkarten kommst. So hast du alle deine Möglichkeiten auf einen Klick im Blick. Schau doch mal rein!<br><br>Auch die"},{"version_id":"840632778","version_name":"3.9.4","version_date":"2021-02-28 23:41:52.000 +0800","version_description":"Um dein VIMpay-Erlebnis noch angenehmer für dich zu gestalten, haben wir kleine Anpassungen und Optimierungen vorgenommen.<br><br>Außerdem haben wir uns um eine neue Funktion im VIMpay Chat für dich gekümmert, die dir mehr Übersicht verschafft. Sendest du"},{"version_id":"840708877","version_name":"3.9.5","version_date":"2021-03-15 17:30:14.000 +0800","version_description":"Wir arbeiten weiter daran, VIMpay für dich zur perfekten App zu machen und dir dein Leben zu erleichtern. Deshalb haben wir auch dieses Mal Optimierungen vorgenommen und größere Features eingebaut.<br><br>Damit dein VIMpay Account immer reichlich mit Guth"}]