[{"version_id":"813819888","version_name":"6.0","version_date":"2016-03-12 09:02:21.000 +0800","version_description":""},{"version_id":"818084612","version_name":"6.1.0","version_date":"2016-07-11 23:25:05.000 +0800","version_description":"New:<br>• Added Google Drive remote connections. To connect to Google Drive, tap on the file transfer button (globe icon) -&gt; \"+\" -&gt; \"Google Drive Connection\" -&gt; Sign In.<br>• When opening files from Working Copy through the document picker (\"Open…\" command), Textastic can now show the external app name and file path in the list of recent files.<br>• Added Cmd-S external keyboard shortcut that allows you to trigger a file save. This is especially useful when you open an external file through the document picker and keep the two apps side-by-side using split view on iPad.<br>• Updated the following fonts to their latest version: Source Code Pro (now has an italic variant), Deja Vu, Inconsolata.<br><br>Fixed:<br>• Updated Dropbox SDK and fixed Dropbox login issues when the Dropbox app is not installed on the device.<br>• The symbols list did not work when editing a Swift file.<br>• HTML parts in PHP files are now being interpreted again by the web preview. Previously it would only show the source code.<br>• Undo and redo buttons no longer disappear when closing and re-opening Textastic while the keyboard is visible on the screen.<br>• The list of recent files is now refreshed asynchronously. Previously it could take some time to resolve external files before the list would appear.<br>• New progress indicator when unpacking zip files. This also fixes a problem where the progress indicator was rotated by 90 degrees.<br>• Sometimes the local directory in the file transfer screen would not stay in sync with the local directory selected in the main file navigator.<br>• Fixed keyboard issues when changing the UI theme.<br>• Remote Connections: Dropbox, WebDAV and Google Drive connections now use less server requests when deleting directory trees."},{"version_id":"818355199","version_name":"6.2","version_date":"2016-08-02 21:24:08.000 +0800","version_description":"It is now possible to open entire folders from the Git client Working Copy using the iOS document picker. Previously you could only open individual files.<br><br>• Make sure \"Working Copy\" is installed on your device.<br>• Tap on \"Open…\" in Textastic.<br>• Select \"Working Copy\".<br>• Navigate to an existing Git repository or clone/initialize a new one.<br>• Tap on \"Pick\" to open the repository.<br><br>The repository is now added as an external folder below the \"Open…\" command and can be used just as \"Local Files\" or \"iCloud\": You can edit existing files and add new ones. You can download and upload files. Web preview is fully supported. Changes you make will be immediately shown in Working Copy. You can then commit your changes in Working Copy. This works great in Split View mode on the iPad.<br><br>You can see this in action in the short video at http://bit.ly/txt-62<br><br>This feature is not strictly limited to Working Copy. Other apps can add support for this in the future.<br><br>Added new fonts: Anonymous Pro, CamingoCode, Fira Code, and Fira Mono. Fira Code is the same font as Fira Mono, but adds programming ligatures. See https://github.com/tonsky/FiraCode for details.<br><br>If you like Textastic, it would be amazing if you could leave a positive rating or review on the App Store!"},{"version_id":"819642021","version_name":"6.3","version_date":"2016-11-08 10:08:15.000 +0800","version_description":"• Added Emmet support: you can now expand Emmet abbreviations using the Tab key or using these shortcuts on an external keyboard: \"Expand Emmet Abbreviation\" (Ctrl-E) and \"Wrap With Emmet Abbreviation\" (Ctrl-A).<br><br>For example, in an HTML file, enter \"ul&gt;li*5\", hit Tab, and the abbreviation will be expanded to a \"ul\" tag containing five \"li\" tags. You can then use the Tab key to jump between insertion points. You can find more information about Emmet at http://emmet.io.<br><br>You can disable Emmet Tab expansion in Textastic's settings.<br><br>• Added a JavaScript console. When previewing HTML files, it can show errors in your JavaScript code and allows you to log custom messages using the JavaScript Console object (for example by calling the console.log() method).<br><br>• You can now use the Tab key to accept code completion suggestions in addition to the Return key.<br><br>Fixed:<br>• On iPad it was not possible to update TextExpander snippets.<br>• Fixed password lock screen issues on devices running iOS 10.<br>• Loading a custom syntax definition from the #Textastic folder could result in a crash if the language grammar was not a valid property list dictionary.<br><br><br>If you like Textastic, it would be amazing if you could leave a positive rating or review on the App Store!"},{"version_id":"821651097","version_name":"6.3.1","version_date":"2017-04-07 16:21:23.000 +0800","version_description":"• Updated network libraries (OpenSSL, libssh2, libcurl) to their latest versions. More SSH key exchange methods and ciphers are now supported. This fixes problems when connecting to some SFTP servers. <br>• Fixed password lock screen issues when using Touch ID in Split View mode on iPad.<br>• Fixed a crash in the built-in web preview when an alert panel is invoked by JavaScript code while the JavaScript console is displaying.<br>• Zipping files now correctly saves the modification date in the zip file.<br>• Deleting files in iCloud could result in a crash.<br>• Improved behavior when deleting and zipping files.<br>• Fixed a crash that could happen when searching the symbol list and then closing the popover on iPad.<br>• Fixed a crash when replacing text using a regular expression and the replacement string references a capture that is empty.<br><br>If you like Textastic, it would be amazing if you could leave a positive rating or review on the App Store!"},{"version_id":"821807598","version_name":"6.3.2","version_date":"2017-04-19 14:04:29.000 +0800","version_description":"• Rewrote Dropbox integration to use the Dropbox API v2. Existing Dropbox connections are migrated automatically.<br>• Fixed Google Drive issues.<br><br>If you like Textastic, it would be amazing if you could leave a positive rating or review on the App Store!"},{"version_id":"823679678","version_name":"6.4","version_date":"2017-09-16 09:21:56.000 +0800","version_description":"• Added support for the new document picker in iOS 11.<br>• Added new Cmd-O keyboard shortcut that directly opens the new document picker.<br>• On iPad and iOS 11, you can now drag a repository from the Git client app Working Copy (v3.1.0 or later) and drop it into the top-level view of Textastic to add it as an external folder. You can see this in action in the short video at: http://bit.ly/ttdrop<br>• Added support for open in place: you can now open documents from the iOS 11 Files app or from the share sheet of other apps in Textastic without having to copy the file.<br>• Added a new setting for smart punctuation on iOS 11 (disabled by default).<br>• Fixed various issues on iOS 11.<br><br>If you like Textastic, it would be amazing if you could leave a positive rating or review on the App Store!"},{"version_id":"823761159","version_name":"6.4.1","version_date":"2017-09-23 05:29:49.000 +0800","version_description":"• Fixed row height in file listings<br>• Minor improvements<br><br>If you like Textastic, it would be amazing if you could leave a positive rating or review on the App Store!"},{"version_id":"824318333","version_name":"6.4.2","version_date":"2017-11-07 23:39:46.000 +0800","version_description":"• Added support for iPhone X and Face ID<br>• Fixed: \"Replace All\" sometimes did not work when replacing line breaks<br>• Other minor improvements<br><br>If you like Textastic, it would be amazing if you could leave a positive rating or review on the App Store!"},{"version_id":"824335712","version_name":"6.4.3","version_date":"2017-11-09 00:04:12.000 +0800","version_description":"• Added support for iPhone X and Face ID<br>• Fixed: \"Replace All\" sometimes did not work when replacing line breaks<br>• Other minor improvements<br><br>If you like Textastic, it would be amazing if you could leave a positive rating or review on the App Store!"},{"version_id":"827782207","version_name":"7.0.1","version_date":"2018-07-06 16:25:40.000 +0800","version_description":"Opening multiple files in tabs, SSH terminal connections, new syntax highlighter, sorting and searching file listings, and much more:<br><br>Tabs: you can now open multiple files in tabs. When you open a file, it is opened in a transient tab, indicated by the italic title. To make the tab stay when you open another file, tap on the file title, the pin button at the right side of the tab, or on the editor. You can drag tabs to reorder them.<br><br>SSH terminal: you can now open SSH terminal connections in tabs. If you already have SFTP connections configured, they can be re-used for a terminal connection.<br><br>New syntax highlighter: Textastic 7 has a completely new syntax highlighter that can use Sublime Text 3 syntax definitions (in addition to language grammars from TextMate 1). This means much better support for modern features in almost all supported programming and markup languages.<br><br>Added syntax definitions for TypeScript, Rust, and reStructuredText. Updated syntax definitions for almost all other supported languages.<br><br>You can now sort file lists by name, extension, date, and size.<br><br>Fuzzy search for files: use it to find and open a file by typing characters that are in the name of the file or path. This searches the current folder and subfolders. A sophisticated scoring algorithm orders the search results, so you'll find the most likely match on the top of the list. Consecutive character matches, acronyms, and matching file extensions get a higher score. If you are looking for a file named “SettingsViewController.h”, try searching for the acronym “svc” or “svc.h” and it will most likely appear at the top of the list.<br><br>The document picker (“Open…” command) can now open any file with any file extension, not just text files with known file extensions. Textastic warns you if you try to open a binary file. You can also select more than one file to open them in tabs.<br><br>You can now drag &amp; drop files from other apps like the Files app or Working Copy onto the editor to open them in tabs.<br><br>Added keyboard shortcuts to close popovers and dialogs: Cmd-., Cmd-W, and Escape<br><br>If you like Textastic, it would be amazing if you could leave a positive rating or review on the App Store!"},{"version_id":"827940917","version_name":"7.0.2","version_date":"2018-07-19 22:08:58.000 +0800","version_description":"- Fixed: when using the \"Open…\" command to invoke the document picker, some files could not be selected.<br>- Improved symbol list for Objective-C<br>- New syntax definition for PowerShell<br><br><br>New in Textastic 7: Opening multiple files in tabs, SSH terminal connections, new syntax highlighter, sorting and searching file listings, and much more.<br><br>Tabs: you can now open multiple files in tabs. When you open a file, it is opened in a transient tab, indicated by the italic title. To make the tab stay when you open another file, tap on the file title, the pin button at the right side of the tab, or on the editor. You can drag tabs to reorder them.<br><br>SSH terminal: you can now open SSH terminal connections in tabs. If you already have SFTP connections configured, they can be re-used for a terminal connection.<br><br>New syntax highlighter: Textastic 7 has a completely new syntax highlighter that can use Sublime Text 3 syntax definitions (in addition to language grammars from TextMate 1). This means much better support for modern features in almost all supported programming and markup languages.<br><br>Added syntax definitions for TypeScript, Rust, and reStructuredText. Updated syntax definitions for almost all other supported languages.<br><br>You can now sort file lists by name, extension, date, and size.<br><br>Fuzzy search for files: use it to find and open a file by typing characters that are in the name of the file or path. This searches the current folder and subfolders. A sophisticated scoring algorithm orders the search results, so you'll find the most likely match on the top of the list. Consecutive character matches, acronyms, and matching file extensions get a higher score. If you are looking for a file named “SettingsViewController.h”, try searching for the acronym “svc” or “svc.h” and it will most likely appear at the top of the list.<br><br>The document picker (“Open…” command) can now open any file with any file extension, not just text files with known file extensions. Textastic warns you if you try to open a binary file. You can also select more than one file to open them in tabs.<br><br>You can now drag &amp; drop files from other apps like the Files app or Working Copy onto the editor to open them in tabs.<br><br>Added keyboard shortcuts to close popovers and dialogs: Cmd-., Cmd-W, and Escape<br><br>If you like Textastic, it would be amazing if you could leave a positive rating or review on the App Store!"},{"version_id":"828161836","version_name":"7.0.3","version_date":"2018-08-09 00:19:04.000 +0800","version_description":"- Added keyboard shortcuts for navigating with the cursor keys in the list of files, search results, and in the symbol list <br>- Added a keyboard shortcut to show the sidebar when it is not visible on iPad<br>- A long press on the preview button now shows a menu with \"Preview\" and \"Preview in Safari\" options<br>- Fixed a problem when trying to open a file from an external file provider (e.g. OneDrive) when the file was not downloaded yet<br><br>New in Textastic 7: Opening multiple files in tabs, SSH terminal connections, new syntax highlighter, sorting and searching file listings, and much more.<br><br>Tabs: you can now open multiple files in tabs. When you open a file, it is opened in a transient tab, indicated by the italic title. To make the tab stay when you open another file, tap on the file title, the pin button at the right side of the tab, or on the editor. You can drag tabs to reorder them.<br><br>SSH terminal: you can now open SSH terminal connections in tabs. If you already have SFTP connections configured, they can be re-used for a terminal connection.<br><br>New syntax highlighter: Textastic 7 has a completely new syntax highlighter that can use Sublime Text 3 syntax definitions (in addition to language grammars from TextMate 1). This means much better support for modern features in almost all supported programming and markup languages.<br><br>Added syntax definitions for TypeScript, Rust, and reStructuredText. Updated syntax definitions for almost all other supported languages.<br><br>You can now sort file lists by name, extension, date, and size.<br><br>Fuzzy search for files: use it to find and open a file by typing characters that are in the name of the file or path. This searches the current folder and subfolders. A sophisticated scoring algorithm orders the search results, so you'll find the most likely match on the top of the list. Consecutive character matches, acronyms, and matching file extensions get a higher score. If you are looking for a file named “SettingsViewController.h”, try searching for the acronym “svc” or “svc.h” and it will most likely appear at the top of the list.<br><br>The document picker (“Open…” command) can now open any file with any file extension, not just text files with known file extensions. Textastic warns you if you try to open a binary file. You can also select more than one file to open them in tabs.<br><br>You can now drag &amp; drop files from other apps like the Files app or Working Copy onto the editor to open them in tabs.<br><br>Added keyboard shortcuts to close popovers and dialogs: Cmd-., Cmd-W, and Escape<br><br>If you like Textastic, it would be amazing if you could leave a positive rating or review on the App Store!"},{"version_id":"828583513","version_name":"7.1","version_date":"2018-09-14 01:01:07.000 +0800","version_description":"This version adds a completely rewritten, much more comprehensive manual as well as support for iOS 12 and the new iPhone models.<br><br>If you like Textastic, it would be amazing if you could leave a positive rating or review on the App Store!"},{"version_id":"829242027","version_name":"7.1.1","version_date":"2018-11-09 19:47:26.000 +0800","version_description":"Added support for 11-inch iPad Pro and 12.9-inch iPad Pro (3rd generation).<br><br>If you like Textastic, it would be amazing if you could leave a positive rating or review on the App Store!"},{"version_id":"829266534","version_name":"7.1.2","version_date":"2018-11-13 18:26:11.000 +0800","version_description":"Fixed:<br>- Sometimes the folder hierarchy from the last session was not restored properly on app launch.<br>- When uploading a hierarchy of folders from an external directory (for example opened from Working Copy) to a remote server, only files in the top-level directory where correctly linked to the remote connection.<br>- The keyboard shortcut Ctrl-W did not work in terminal connections.<br>- JavaScript console: \"console.log(window)\" did not work, \"Script Error\" was shown in the console instead.<br><br>If you like Textastic, it would be amazing if you could leave a positive rating or review on the App Store!"},{"version_id":"831683293","version_name":"8.0","version_date":"2019-06-25 02:03:09.000 +0800","version_description":"• Improved Files App Integration<br>- Textastic's local files can now be accessed from the Files app in “On My iPad/iPhone”.<br>- You can now add any folder in iCloud Drive as an external folder and it will work as expected.<br>- The new command “Create External File…” allows you to select a location in the Files app for a newly created file.<br>- iTunes File Sharing is re-enabled.<br><br>• Configurable Keyboard Shortcuts<br>- Assign custom key combinations to keyboard shortcuts.<br><br>• Custom Fonts<br>- You can now select any monospaced font installed on your device. Use Apple Configurator 2 or apps like AnyFont to install custom fonts and they will be available in Textastic.<br><br>• SSH Terminal Settings<br>- Select a font, font size, terminal theme, dark or light keyboard, and whether to play the bell sound.<br><br>• Better Encryption Support<br>- Added support for ECDSA and Ed25519 SSH keys and the new OpenSSH private key file format used by default in macOS 10.14.<br><br>• Printing<br>- You can now print your source code files. Select a separate font, font size and theme for printing. Pinch to zoom the print preview to get a PDF that you can share.<br><br>• New File Lists With Support For Drag and Drop<br>- Use Drag and Drop to move files and folders to another folder.<br>- Drag files from another app into a file list to copy them into in Textastic - can also be used to import pictures from the Photos app.<br>- Dynamic Type fully supported.<br>- Long file names are displayed in two lines.<br>- If files or folders in an external folder are changed, the file listing in Textastic will now update automatically.<br>- New file actions: share, copy to another folder, export.<br><br>• Share Selected Text<br>- You can now share selected text. Share extensions like the Shortcuts app can also modify shared text. For example, use the “Change Case” action to change the selected text to upper case or the “Replace Text” action to find and replace in the selected text. This also works when invoking “Share” on the current file.<br><br>• And much more!<br>- “Ask for Password” option for (S)FTP connections: this will prompt you to enter the password when you connect to the server.<br>- The file location is now displayed in the list of file properties.<br>- You can now sort remote file lists.<br>- Improved sort order of files and folders that contain numbers.<br>- The transient tab is not closed anymore when switching to another tab.<br>- Changed the default Emmet keyboard shortcuts to not conflict with Emacs shortcuts Ctrl-A and Ctrl-E. You can assign the old key combinations in the new keyboard shortcut settings.<br>- The settings screen is completely rewritten and now supports Dynamic Type.<br><br>If you like Textastic, it would be amazing if you could leave a positive rating or review on the App Store! Perhaps you can even recommend the app to your friends and colleagues."},{"version_id":"831839131","version_name":"8.0.1","version_date":"2019-06-29 19:07:49.000 +0800","version_description":"- Fixed: files stored in the iCloud location or a subfolder did not get linked to the remote connection on upload/download, so quick upload/download did not work for these files.<br>- The manual has been updated<br><br>New in Textastic 8:<br><br>• Improved Files App Integration<br>- Textastic's local files can now be accessed from the Files app in “On My iPad/iPhone”.<br>- You can now add any folder in iCloud Drive as an external folder and it will work as expected.<br>- The new command “Create External File…” allows you to select a location in the Files app for a newly created file.<br>- iTunes File Sharing is re-enabled.<br><br>• Configurable Keyboard Shortcuts<br>- Assign custom key combinations to keyboard shortcuts.<br><br>• Custom Fonts<br>- You can now select any monospaced font installed on your device. Use Apple Configurator 2 or apps like AnyFont to install custom fonts and they will be available in Textastic.<br><br>• SSH Terminal Settings<br>- Select a font, font size, terminal theme, dark or light keyboard, and whether to play the bell sound.<br><br>• Better Encryption Support<br>- Added support for ECDSA and Ed25519 SSH keys and the new OpenSSH private key file format used by default in macOS 10.14.<br><br>• Printing<br>- You can now print your source code files. Select a separate font, font size and theme for printing. Pinch to zoom the print preview to get a PDF that you can share.<br><br>• New File Lists With Support For Drag and Drop<br>- Use Drag and Drop to move files and folders to another folder.<br>- Drag files from another app into a file list to copy them into in Textastic - can also be used to import pictures from the Photos app.<br>- Dynamic Type fully supported.<br>- Long file names are displayed in two lines.<br>- If files or folders in an external folder are changed, the file listing in Textastic will now update automatically.<br>- New file actions: share, copy to another folder, export.<br><br>• Share Selected Text<br>- You can now share selected text. Share extensions like the Shortcuts app can also modify shared text. For example, use the “Change Case” action to change the selected text to upper case or the “Replace Text” action to find and replace in the selected text. This also works when invoking “Share” on the current file.<br><br>• And much more!<br>- “Ask for Password” option for (S)FTP connections: this will prompt you to enter the password when you connect to the server.<br>- The file location is now displayed in the list of file properties.<br>- You can now sort remote file lists.<br>- Improved sort order of files and folders that contain numbers.<br>- The transient tab is not closed anymore when switching to another tab.<br>- Changed the default Emmet keyboard shortcuts to not conflict with Emacs shortcuts Ctrl-A and Ctrl-E. You can assign the old key combinations in the new keyboard shortcut settings.<br>- The settings screen is completely rewritten and now supports Dynamic Type.<br><br>If you like Textastic, it would be amazing if you could leave a positive rating or review on the App Store! Perhaps you can even recommend the app to your friends and colleagues."},{"version_id":"832245049","version_name":"8.0.2","version_date":"2019-08-03 22:33:16.000 +0800","version_description":"• Markdown preview: large images are now scaled down to fit the page width (max-width: 100%).<br>• The font selection can now display monospaced fonts that don't have a regular weight variant installed (for example, if there is a \"book\" variant of a font that has no regular variant).<br>• Added a new \"Debug Log\" settings that can write detailed logs for debugging purposes.<br>• Fixed a rare crash when uploading/downloading files.<br>• Fixed a crash that could happen when a file was saved while the file name search was active.<br>• Fixed a crash that could happen when a list of files is refreshed and changes are animated."},{"version_id":"832330927","version_name":"8.0.3","version_date":"2019-08-10 12:36:43.000 +0800","version_description":"Fixed: The type of line endings could not be selected properly when creating a new file and when trying to change them for an existing file."},{"version_id":"832846080","version_name":"8.1","version_date":"2019-09-21 11:48:49.000 +0800","version_description":"Support for iOS 13 and iPadOS:<br><br>• New \"Add External Folder…\" command that shows the new iOS 13 folder picker. <br>• Supports the new iOS 13 multi-selection gesture for selecting multiple files and folders by swiping down files lists with two fingers.<br>• Uses the new card-style modal dialogs and supports dragging down to dismiss them.<br>• You can now drag the code editor's scroll bar on iOS 13 to quickly jump to certain locations in the file.<br>• Various other improvements for iOS 13."},{"version_id":"834608437","version_name":"9.0","version_date":"2020-02-06 20:43:19.000 +0800","version_description":"• Dark Mode<br>- Added full support for the native iOS 13 Dark Mode. That means that every part of the app now supports a dark appearance - including system views such as the document picker, context menus, alerts, and share sheets. <br>- You can either match the system appearance or always use a light or dark appearance. For the dark appearance, you can choose between \"Blue\", \"Yellow\", and \"Gray\".<br><br>• Multiple Windows on iPadOS 13<br>- While Textastic is open, swipe up from the bottom edge of the screen to show the Dock and drag Textastic's app icon from the Dock to the left or right edge of the screen.<br>- Drag a file from one of Textastic's file lists or a tab to the left or right edge of the screen.<br>- Show the context menu of a file or tab and choose \"Open in New Window\".<br><br>• Context Menus for Files and Tabs<br>- Bring up the context menu of a file to show all commands previously available only through the \"Edit\" button as well as new commands like \"Open in New Window\" and \"Copy Path\".<br>- The context menu for tabs allows you to close the selected tab, close all other tabs, keep the tab open (pin), and move the tab to a new window.<br><br>• Easier Customization<br>- Added \"Reload Customizations\" to Settings -&gt; Other. This allows you to reload syntax definitions, themes, and code completions without quitting and restarting the app. All open files in the \"Local Files/#Textastic\" folder are automatically saved before reloading customizations.<br>- Added new customizable keyboard shortcuts for \"Reload Customizations\" (Cmd-Shift-R) and \"Show Scope\" (Ctrl-Shift-P).<br>- This means that you can, for example, edit a theme or code completion file and simply press Cmd-Shift-R to save and reload it, enabling easy customization.<br><br>• And More<br>- Fixed: Some user-installed monospaced fonts like \"JetBrains Mono\" and \"IPA Gothic\" were not shown in the list of fonts. <br>- Improved handling of Emoji characters in the code editor<br><br>If you like Textastic, it would be great if you could leave a positive rating or review on the App Store! Perhaps you can even recommend the app to your friends and colleagues."},{"version_id":"834657179","version_name":"9.0.1","version_date":"2020-02-12 22:10:58.000 +0800","version_description":"- The manual has been updated.<br>- Improved handling of certain .tmTheme files: Invalid scope styles are now ignored. The \"gutter\" and \"gutterForeground\" colors are now supported.<br>- Fixed some other minor issues.<br><br>New in Textastic 9:<br><br>• Dark Mode<br>- Added full support for the native iOS 13 Dark Mode. That means that every part of the app now supports a dark appearance - including system views such as the document picker, context menus, alerts, and share sheets. <br>- You can either match the system appearance or always use a light or dark appearance. For the dark appearance, you can choose between \"Blue\", \"Yellow\", and \"Gray\".<br><br>• Multiple Windows on iPadOS 13<br>- While Textastic is open, swipe up from the bottom edge of the screen to show the Dock and drag Textastic's app icon from the Dock to the left or right edge of the screen.<br>- Drag a file from one of Textastic's file lists or a tab to the left or right edge of the screen.<br>- Show the context menu of a file or tab and choose \"Open in New Window\".<br><br>• Context Menus for Files and Tabs<br>- Bring up the context menu of a file to show all commands previously available only through the \"Edit\" button as well as new commands like \"Open in New Window\" and \"Copy Path\".<br>- The context menu for tabs allows you to close the selected tab, close all other tabs, keep the tab open (pin), and move the tab to a new window.<br><br>• Easier Customization<br>- Added \"Reload Customizations\" to Settings -&gt; Other. This allows you to reload syntax definitions, themes, and code completions without quitting and restarting the app. All open files in the \"Local Files/#Textastic\" folder are automatically saved before reloading customizations.<br>- Added new customizable keyboard shortcuts for \"Reload Customizations\" (Cmd-Shift-R) and \"Show Scope\" (Ctrl-Shift-P).<br>- This means that you can, for example, edit a theme or code completion file and simply press Cmd-Shift-R to save and reload it, enabling easy customization.<br><br>• And More<br>- Fixed: Some user-installed monospaced fonts like \"JetBrains Mono\" and \"IPA Gothic\" were not shown in the list of fonts. <br>- Improved handling of Emoji characters in the code editor<br><br>If you like Textastic, it would be great if you could leave a positive rating or review on the App Store! Perhaps you can even recommend the app to your friends and colleagues."},{"version_id":"834974239","version_name":"9.0.2","version_date":"2020-03-09 22:06:15.000 +0800","version_description":"- Added JetBrains Mono font<br>- Fixed some minor issues"},{"version_id":"835238801","version_name":"9.1","version_date":"2020-03-25 19:17:34.000 +0800","version_description":"Added mouse and trackpad support on iPad.<br><br>Textastic now uses the standard iOS text selection instead of the previous custom text selection."},{"version_id":"835383957","version_name":"9.2","version_date":"2020-04-02 20:55:09.000 +0800","version_description":"This update contains some important bug fixes:<br>- The SSH terminal now supports scrolling and text selection again.<br>- Improved text selection in the code editor: in the last version it was not possible to place the insertion point before e.g. \"<div\" with=\"\" a=\"\" single=\"\" tap.=\"\" instead,=\"\" it=\"\" was=\"\" placed=\"\" between=\"\" \"<\"=\"\" and=\"\" \"d\".=\"\" this=\"\" works=\"\" again=\"\" now.<br=\"\">- The swipe gesture to move the insertion point now works again.<br>- The list of remote files was not updated after file transfers.<br>- Fixed problems with auto-capitalization and auto-correction.<br>- Fixed flickering of the code completion list on iPad when entering text at the end of a file.<br>- Other minor fixes.</div\">"},{"version_id":"835429473","version_name":"9.2.1","version_date":"2020-04-07 20:43:47.000 +0800","version_description":"Fixed minor text selection issues."}]