[{"version_id":"828812530","version_name":"1.2.2","version_date":"2018-10-05 09:42:06.000 +0800","version_description":"- You can find a Camp in the forest. Little shmoos like hiking and they are excited about camps. In return, they can bring special items for new territories from their expedititons.<br>- At level 11 you will get special quests that will lead you to the mysterious Camp in the forest.<br>- Here and there on the meadow ou can find magic chests full of useful and valuable items.<br>- New type of orders is availiable at the Market: as a reward for completeng them you can get keys to open magic chests.<br>- New special offers are now available in the game. Look for the profitable offers in the right part of the screen."},{"version_id":"829326099","version_name":"1.2.6","version_date":"2018-11-19 13:10:26.000 +0800","version_description":"- Production and upgrade interface is greatly improved. Interacting with buildings is much handier now!<br>- If you take a closer look, you can find cute hedgehogs in your village. There are more little forest inhabitants to come in the future updates.<br>- You can get special resources for upgrading buildings for sendind Airships."},{"version_id":"830231593","version_name":"1.2.10","version_date":"2019-02-11 10:05:46.000 +0800","version_description":"- Game interface became bigger and more comfortable to use.<br>- Game works faster and more stable."},{"version_id":"831515560","version_name":"1.3.6","version_date":"2019-05-31 16:20:16.000 +0800","version_description":"The game opens its AppStore page correctly for all countries."},{"version_id":"831993066","version_name":"1.3.8","version_date":"2019-07-15 07:30:28.000 +0800","version_description":"- We're happy to announce that all Magic Forest inhabitants  learned two new languages: German and French! You can choose preferable language in the Settings window.<br>- There's a new achievement available - 'Camper'. You can earn it by sending Shmoos out on an expedition. By the way, you can now see the reward you'll get for the expedition in the Camp window.<br>- If you leave the building outside the screen while moving it, the arrow will show you where it is. Tap on it and the camera will be centered on the lost building.<br>- Some bugs and errors are fixed."},{"version_id":"832294705","version_name":"1.3.9","version_date":"2019-08-09 11:53:33.000 +0800","version_description":"- The production time of many buildings decreased greatly. From now on  you can produce many items much faster than before.<br>- Reward for some Quests has increased.<br>- French and German languages have a better UI support: we optimized game interface.<br>- Reward for sending the Airship looks better in the interface. It is more visible and better animated.<br>- Various game improvements, small bugs fixed."},{"version_id":"833112946","version_name":"1.3.11","version_date":"2019-10-11 09:17:40.000 +0800","version_description":"- Great news! Game screen won't be cropped on devices with cameras or speakers on the screen. From now on game supports this type of devices!\n<br>- Sometimes you can meet Kaya near her tent :wink:\n<br>- Daily Quest interface (especially pop-up window that appears when you complete a quest) became more friendly and we are just starting improving it even more!\n<br>- Minor bugs fixed"},{"version_id":"833627813","version_name":"1.3.12","version_date":"2019-11-18 09:31:41.000 +0800","version_description":"- Yay! Shmoos tried their best and learned Spanish. The game is now fully available in Spanish.\n<br>- New decorations have been added to the store.\n<br>- After the update, you can play only if you use real time instead of set time on your device.\n<br>- We added useful tips and tricks.\n<br>- Some issues have been fixed."},{"version_id":"834046959","version_name":"1.3.14","version_date":"2019-12-23 10:25:05.000 +0800","version_description":"- Special offers design has changed.\n<br>- New objects appeared on the land. You can't interact with them now but will be able soon...\n<br>- Minor issues are fixed."},{"version_id":"834483017","version_name":"1.3.15","version_date":"2020-01-27 07:40:04.000 +0800","version_description":"- New Video orders are available at the Market. You can get Rubies or Gold for completing them.\n<br>- Some game interfaces were improved.\n<br>- Quests with discover new territory tasks will highlight the territories you need to unlock.\n<br>- You won't see time related errors unless you play unfairly.\n<br>- Camp and Cloud Quay are no longer dependant on the player's level. You can repair these building as soon as you get to them.\n<br>- Some production recipes after 60 level were changed."},{"version_id":"836422915","version_name":"1.4.6","version_date":"2020-06-16 09:09:42.000 +0800","version_description":"- The Special Offers interface has been considerably adjusted to make it more comfortable for you to use;\n<br>- The most important quests will now be highlighted;\n<br>- Useful new tips on buildings ready to be completed have been added so you don't forget about them;\n<br>- Minor bugs and issues have been fixed."},{"version_id":"837256802","version_name":"1.4.11","version_date":"2020-08-07 01:50:25.000 +0800","version_description":"- Some issues have been fixed."}]