[{"version_id":"816204860","version_name":"1.0.0","version_date":"","version_description":""},{"version_id":"816380798","version_name":"1.1.4","version_date":"","version_description":""},{"version_id":"816644748","version_name":"1.2.0","version_date":"","version_description":""},{"version_id":"816763669","version_name":"1.2.1","version_date":"","version_description":""},{"version_id":"816884585","version_name":"1.3.0","version_date":"","version_description":""},{"version_id":"817080646","version_name":"1.3.1","version_date":"","version_description":""},{"version_id":"817192630","version_name":"1.4","version_date":"","version_description":""},{"version_id":"817363804","version_name":"1.4.1","version_date":"","version_description":""},{"version_id":"817532199","version_name":"1.4.2","version_date":"","version_description":""},{"version_id":"817605045","version_name":"1.4.3","version_date":"","version_description":""},{"version_id":"817694955","version_name":"1.5","version_date":"","version_description":""},{"version_id":"817900945","version_name":"1.5.1","version_date":"","version_description":""},{"version_id":"817971508","version_name":"1.5.2","version_date":"","version_description":""},{"version_id":"818156213","version_name":"1.5.3","version_date":"","version_description":""},{"version_id":"818322616","version_name":"1.6.0","version_date":"","version_description":""},{"version_id":"818536535","version_name":"1.6.1","version_date":"","version_description":""},{"version_id":"818618067","version_name":"1.6.2","version_date":"","version_description":""},{"version_id":"818757430","version_name":"1.6.3","version_date":"","version_description":""},{"version_id":"818892383","version_name":"1.7.0","version_date":"","version_description":""},{"version_id":"819080635","version_name":"1.7.2","version_date":"","version_description":""},{"version_id":"819275752","version_name":"1.8.0","version_date":"","version_description":""},{"version_id":"819512270","version_name":"1.8.1","version_date":"","version_description":""},{"version_id":"819714414","version_name":"1.8.2","version_date":"","version_description":""},{"version_id":"819889593","version_name":"1.9.0","version_date":"","version_description":""},{"version_id":"820131990","version_name":"1.9.1","version_date":"","version_description":""},{"version_id":"820648490","version_name":"1.9.2","version_date":"","version_description":""},{"version_id":"820911057","version_name":"1.9.3","version_date":"","version_description":""},{"version_id":"821335315","version_name":"1.9.4","version_date":"","version_description":""},{"version_id":"821653918","version_name":"1.9.5","version_date":"","version_description":""},{"version_id":"822156724","version_name":"1.9.6","version_date":"","version_description":""},{"version_id":"822382954","version_name":"1.9.7","version_date":"","version_description":""},{"version_id":"822496575","version_name":"1.9.9. A number so close to the elusive version 2.0","version_date":"","version_description":""},{"version_id":"822496575","version_name":"1.9.8","version_date":"","version_description":""},{"version_id":"822691920","version_name":"1.9.9","version_date":"","version_description":""},{"version_id":"822900063","version_name":"1.9.10","version_date":"","version_description":""},{"version_id":"823002185","version_name":"1.9.11","version_date":"","version_description":""},{"version_id":"823194200","version_name":"1.9.12","version_date":"","version_description":""},{"version_id":"823392733","version_name":"1.9.13","version_date":"","version_description":""},{"version_id":"823526781","version_name":"1.9.14","version_date":"","version_description":""},{"version_id":"823827533","version_name":"1.9.15","version_date":"","version_description":""},{"version_id":"823920802","version_name":"1.9.16","version_date":"","version_description":""},{"version_id":"824013588","version_name":"1.9.17","version_date":"","version_description":""},{"version_id":"824278316","version_name":"1.9.18","version_date":"","version_description":""},{"version_id":"824352447","version_name":"1.9.18","version_date":"","version_description":""},{"version_id":"824439331","version_name":"1.9.19","version_date":"","version_description":""},{"version_id":"824982493","version_name":"1.9.20","version_date":"2017-11-29 09:57:05.000 +0800","version_description":"All these stores starting up the Christmas music and lights and it's not even December. Bah humbug. There's no early Christmas here at Monzo HQ — we want to get your app releases out to you ASAP. So here's another one! <br><br>In today's show, we answer the following questions for customers who've upgraded their Monzo account:<br><br>* What happens if you lose your brand new debit card and need a new one?<br>* How do you change your home address?<br>* How do I use Monzo.me and bill splitting?<br><br>For all this, and more, tap that Update button. Yeah, that one. Go on, do it!"},{"version_id":"825111252","version_name":"1.9.21","version_date":"2017-12-01 13:12:57.000 +0800","version_description":"This one, this time, is legitimately bug fixes and performance enhancements! We’ve fixed some issues with Pots that were reported and a fix for a ‘black screen of death’ that others reported. Thank you for all the reports"},{"version_id":"825325717","version_name":"1.9.22","version_date":"2017-12-18 11:39:47.000 +0800","version_description":"On this day in 1962, American astronaut John Glenn plopped down into the Atlantic Ocean after orbiting the Earth three times.<br><br>Today, the world celebrates another momentous landing, with the arrival of our latest app update.<br><br>You can now:<br>• Find out your PIN if you've forgotten it, securely from inside the app<br>• Tell us if your question's urgent<br><br>And we've also:<br>• Tidied up the screen where you see your account details<br>• And fixed a couple of bugs<br><br>Phew! As John Glenn put it as he re-entered the Earth's atmosphere, \"Boy, that was a real fireball.\""},{"version_id":"825423063","version_name":"1.9.23","version_date":"2018-01-03 12:46:23.000 +0800","version_description":"Happy New Year! ¡Feliz año nuevo! سنة جديدة سعيدة! godt nytår! Магчыма, вы перакладаеце ўсё гэта!<br><br>This release just fixes a lil bug we noticed over Christmas where a button was missing when you joined the waiting list. We're ramping up for 2018 now, so watch this space…"},{"version_id":"825527085","version_name":"1.9.24","version_date":"2018-01-10 10:00:34.000 +0800","version_description":"New year, new us. Well, not really. We're still the same Monzo but, in the spirit of self-improvement, we have a few fixes for you (plus something a little more fun to say thanks!)<br><br>• Sorted a couple of layout issues we were seeing on iPhone X (because that's no good)<br>• Fixed an important button (the kind you click, not the kind you sew on)<br>• Improved the performance of the feed (at least 3x snappier!) <br>• And best of all we added badges for our crowdfunding investors, and Alpha and Beta users (because you're amazing!)"},{"version_id":"825721061","version_name":"1.9.25","version_date":"2018-01-29 15:14:02.000 +0800","version_description":"Bank statements! A dream come true, fresh PDF statements you can download and decorate your home with (if you like). You'll find them in the spending tab, but maybe not straight away. We're rolling them out gradually so don't panic if you can't see yours yet.<br><br>We also fixed a problem with international keyboards and transferring money, and added some shiny new statistics on international ATM usage in the transaction screen."},{"version_id":"825895225","version_name":"1.9.26","version_date":"2018-02-08 16:02:45.000 +0800","version_description":"Steaming app updates, fresh out the oven:<br><br>We’ve fixed it so you can get your card delivered wherever you like, rather than just to your registered home address. Maybe get it from your parents’ house and do some washing while you’re there?<br><br>Plus we squished bugs, as per usual. (Sorry for making you think about bugs in an oven.)"},{"version_id":"826022952","version_name":"1.9.27","version_date":"2018-02-22 09:29:26.000 +0800","version_description":"I think it was Ernest Hemingway who said: ‘App updates. Gotta love them.’<br><br>Next time you pay someone in the app, you’ll see a little dropdown with references you’ve used before.<br><br>We’ve also put your bank statement history in your Profile, so it’s quicker to find.<br><br>Plus we’ve battled bugs, fixed errors and generally spruced the place up.<br><br>Hopefully it all makes your life a little easier. Until next time!"},{"version_id":"826220608","version_name":"1.9.28","version_date":"2018-03-08 10:10:20.000 +0800","version_description":"Spring has technically sprung, and fresh shoots are sprouting on the Monzo allotment. Actually, do shoots sprout? Or do sprouts shoot?<br><br>Anyway. You can now:<br><br>- get your card delivered anywhere in the world when you’re upgrading<br>- tell your Monzo contacts apart from other payees with a Monzo logo<br>- display your preferred name for P2P transfers<br>- see why a transaction declined in the transaction details screen."},{"version_id":"826321790","version_name":"1.9.29","version_date":"2018-03-22 11:09:22.000 +0800","version_description":"Two chunky changes this time around:<br><br>Help is getting an overhaul. We’ve (hopefully) made it easier for you to find what you’re looking for, and done smart stuff in the background so you’re more likely to see relevant information before you even start looking.<br><br>If you’re close to going overdrawn, we’ll let you know before it happens. So you can choose to go into your overdraft (if you’ve got one), or add money from elsewhere."},{"version_id":"826409692","version_name":"1.9.30","version_date":"2018-03-24 09:14:54.000 +0800","version_description":"This release is what we call a hotfix – we found something that was broken and have quickly fixed it and released it to you. <br><br>The new Help screen was crashing the Monzo app if you were on a lower version than iOS 11. We're really sorry. Turns out, there was a recursion between heightForRow and numberOfRows.<br><br>Nope, not sure what that means either. But we're happy to have fixed it! Those recursions get everywhere…"},{"version_id":"826553295","version_name":"1.9.31","version_date":"2018-04-06 12:39:49.000 +0800","version_description":"Hello! This week it's mostly a lot of stuff behind the scenes that you don't need to worry about, like bug fixes, tweaks and general sprucing up."},{"version_id":"826684036","version_name":"1.9.32","version_date":"2018-04-16 09:55:41.000 +0800","version_description":"We’ll keep this brief.<br><br>If you’re eligible for an overdraft, we’ll send you a notification to let you know. Then you can find out more and switch it on in seconds if you like.<br><br>Other than that, it’s all behind-the-scenes tweaks this time around. ¡Adiós!"},{"version_id":"826871104","version_name":"1.9.33","version_date":"2018-05-02 10:30:58.000 +0800","version_description":"There's a lot going on at Monzo. Like, really a lot. Unfortunately most of it isn't quite ready for the light of day, so only one announcement here: we've added 'Family' and 'Personal care' as two new spending categories, and renamed 'Cash' to 'Finances'. Hurrah!<br><br>Keep an eye out over the next couple of weeks though. There might well be more news..."},{"version_id":"827109796","version_name":"1.9.34","version_date":"2018-05-14 10:42:54.000 +0800","version_description":"In today’s episode of “Monzo Release Notes”:<br><br>• We’ve made it easier to switch your salary to Monzo — just open the Add Money screen!<br>• We’ve also made improvements to Summary (you can turn it on from Monzo Labs), all based on your feedback<br><br>And that’s it folks! We hope you enjoyed this week’s episode of “Monzo Release Notes”. See you next time!"},{"version_id":"827180223","version_name":"1.9.35","version_date":"2018-05-17 14:06:26.000 +0800","version_description":"It's hot out of the oven! A quick fix for a crash we were seeing for some people as they upgraded their accounts. Smells like fresh bread…mmmm, fresh bread. Yum."},{"version_id":"827235878","version_name":"2.0.0","version_date":"2018-05-23 09:59:29.000 +0800","version_description":"Here’s version 2.0! There’s lots of new things for you:<br><br>Summary is here for everyone! We’ve been testing Summary in Labs and it’s now here for everyone to enjoy. You can set when your month starts (when you get paid) and see how much you have left to spend throughout the month. Big buys you’ve been saving up for can be excluded from your targets. So you won’t be in the red.<br><br>You can also delete payees in the Payments tab, with a swipe and a tap!"},{"version_id":"827337988","version_name":"2.1.0","version_date":"2018-05-31 13:23:26.000 +0800","version_description":"Last weekend was literally named for companies like us. It's the only time we're allowed to take any holiday. We're imagining a beach full of employees from all the big banks, chatting about money and finances together, having a really great time.<br><br>Or not. Doesn't sound like our cup of tea. So instead, here's a new app update to make your bank even better! It's mainly fixing some bugs around Apple Pay (if you didn't hear, it's here!) and Summary (if you didn't hear, it's here!). We've also improved Direct Debits, so you'll start to see the amounts and dates on them (once the next ones come out).<br><br>Hope you enjoy it and all you bank employees enjoyed the bank holiday!"},{"version_id":"827426373","version_name":"2.2.0","version_date":"2018-06-14 12:33:12.000 +0800","version_description":"It's the World Cup soon! So we've done something totally unrelated and let you add notes and #tags to your Direct Debits.<br><br>Are we doing this marketing thing right?"},{"version_id":"827623981","version_name":"2.3.0","version_date":"2018-06-25 07:28:15.000 +0800","version_description":"Remember Targets? They’re now Budgets. (Because we realised that really they’re budgets to stay under, not targets to hit...) As well as setting individual budgets for particular categories like shopping and going out, you can now set a overall spending budget for the month too."},{"version_id":"827686883","version_name":"2.4.0","version_date":"2018-07-02 15:47:41.000 +0800","version_description":"You know how people say no news is good news? Well this must be the best news ever, because there's literally nothing to say about this update. Just your regular dose of bug fixes and tidy-ups."},{"version_id":"827757402","version_name":"2.5.0","version_date":"2018-07-09 15:03:17.000 +0800","version_description":"While most people are outside enjoying the summer-y, we’ve been indoors tinkering with Summary. (Sorry.)<br><br>Now you’ll see sub-totals for your upcoming payments within each category, so it’s easier to spot what sort of things you’re spending most on."},{"version_id":"827828381","version_name":"2.5.1","version_date":"2018-07-12 08:50:20.000 +0800","version_description":"This update contains a quick fix for a shiny new something that we're previewing later this week.<br><br>Come to or watch our event on Thursday night to hear more!"},{"version_id":"827857300","version_name":"2.6.0","version_date":"2018-07-16 12:06:28.000 +0800","version_description":"We've been giving a little feature you know and love some TLC behind the scenes, to tidy it up and make it easier to find. We'll let you know in-app once it's ready for the main stage."},{"version_id":"827928112","version_name":"2.7.0","version_date":"2018-07-23 12:40:45.000 +0800","version_description":"There’s not a lot to update you on at the moment, just some general sprucing up. But we didn’t want to leave you empty-handed, so here’s a nature fact:<br><br>Some types of snail can sleep for up to three years. Remarkable."},{"version_id":"828001341","version_name":"2.8.0","version_date":"2018-07-30 10:20:09.000 +0800","version_description":"Are release notes without anything in them even technically release notes? Hmm."},{"version_id":"828060113","version_name":"2.8.1","version_date":"2018-07-31 10:03:45.000 +0800","version_description":"The bald eagle actually has quite a silly cry. So film-makers dub them with something more majestic-sounding (usually the red-tailed hawk)."},{"version_id":"828088225","version_name":"2.9.0","version_date":"2018-08-06 10:01:53.000 +0800","version_description":"This week: we’ve made some updates to the Joint Account sign-up process, and fixed some issues that were affecting how Summary works with Joint Accounts. There’s also some behind-the-scenes work to make paying your bills a bit less stressful. Coming soon!"},{"version_id":"828180660","version_name":"2.10.0","version_date":"2018-08-13 10:50:54.000 +0800","version_description":"Splitting bills is a pain, right? If only there were some way to make it better. Take a look at our Labs area where you can try out new features."},{"version_id":"828255805","version_name":"2.11.0","version_date":"2018-08-20 09:08:26.000 +0800","version_description":"Ever heard the phrase 'unknown unknowns'? That's the things you don't even realise you don't know, rather than just the things you know you don't know... make sense?<br><br>If you're new to Monzo, you might have a few unknown unknowns. So we've tweaked our Help section to suggest things that new people might find more useful, rather than leaving them to fend entirely for themselves.<br><br>We've also made it so you don't need to talk to us if you want to update your phone number. You can edit it yourself from your Profile.<br><br>Should make things easier for people, you know?"},{"version_id":"828303760","version_name":"2.12.0","version_date":"2018-08-28 07:58:08.000 +0800","version_description":"No big news, we've just fixed some bugs for joint accounts. But we do have some small news: the Brazilian pygmy gecko is so small that it can walk on water."},{"version_id":"828415884","version_name":"2.13.0","version_date":"2018-09-04 09:02:35.000 +0800","version_description":"We've heard that some people's apps were a bit slow, so the fixes in this update should help make scrolling around your feed buttery smooth."},{"version_id":"828580212","version_name":"2.15.0","version_date":"2018-09-17 11:01:25.000 +0800","version_description":"You may have noticed we skipped over version 2.14.0. But rest assured, this week’s release is definitely 0.2.0 better than 2.13.0!<br><br>Your Monzo app should feel a little snappier. We’ve fine-tuned the performance of your feed and pulse graph, as well as sped up switching between tabs.<br><br>We’ve also made it easier to order replacement cards, and check the status of any current card orders. The rest of your settings have moved into the profile section."},{"version_id":"828704004","version_name":"2.16.0","version_date":"2018-09-26 09:37:53.000 +0800","version_description":"We’ve jazzed up the card activation flow, so it’s a nicer experience if you’re using your card for the first time. And, as always, we’ve battled a load of bugs."},{"version_id":"828728498","version_name":"2.17.0","version_date":"2018-10-03 12:14:10.000 +0800","version_description":"This week we've focused on smoothing out the log-in process, so it's easier to access your app. <br><br>And we're full of gratitude for the million people using Monzo to manage their money. No YOU'RE crying at your desk."},{"version_id":"828811241","version_name":"2.18.0","version_date":"2018-10-09 09:39:11.000 +0800","version_description":"Thanks to everyone who’s been testing bill splitting in Monzo Labs. This week’s release contains some fixes for when you split the bill with people who aren’t using Monzo."},{"version_id":"828871774","version_name":"2.19.0","version_date":"2018-10-15 09:52:07.000 +0800","version_description":"We fixed a silly bug in your Pulse graph that meant you could tap on a day in the future and see a 'Spent today' box. Like we said: silly."},{"version_id":"828952258","version_name":"2.20.0","version_date":"2018-10-23 09:32:45.000 +0800","version_description":"Bill splitters of the world unite – we've made it easier to tell that you can split bills with people even if they don't have Monzo accounts! Although, you know, if they wanted to get Monzo accounts that would still be cool."},{"version_id":"829061086","version_name":"2.21.0","version_date":"2018-10-30 13:12:12.000 +0800","version_description":"A bumper crop of tweaks this week. We've tidied up Pots so your transaction information is clearer. We've redesigned the 'add money' screen so it's easier to see your options. And we've wrestled with a few bugs that were making the app just a little bit less elegant."},{"version_id":"829117620","version_name":"2.63.0","version_date":"2019-09-03 07:07:22.000 +0800","version_description":"You can now submit feedback directly in-app when a store’s information doesn’t look correct, so your feed can look even more beautiful."},{"version_id":"829117620","version_name":"2.53.0","version_date":"2019-06-24 12:23:57.000 +0800","version_description":"We've made it even easier to discover awesome Monzo features when you first join. So, you know, if your friends still need a nudge, now's a good time to do it."},{"version_id":"829117620","version_name":"2.39.0","version_date":"2019-03-18 11:49:57.000 +0800","version_description":"There's nothing more motivating than seeing what you're saving for in front of your very eyes. So now you can choose your own Pot images - be it your dream holiday destination or a brand new hoover (we won't judge). <br><br>Plus, add regular payments to Shared Tabs and we'll work out who owes what. No more awkward conversations about last month's water bill. Ever."},{"version_id":"829117620","version_name":"2.22.0","version_date":"2018-11-06 09:51:40.000 +0800","version_description":"Finding stuff should be easier now. In Help we've made it simpler to query transactions, and in Settings we've added information about our fees. Plus the usual round of bug fixes."},{"version_id":"829215054","version_name":"2.23.0","version_date":"2018-11-12 11:33:02.000 +0800","version_description":"We’re pretty excited about this one: Shared Tabs have landed in Labs. It even rhymes! Set one up with friends to split ongoing expenses, and let us know what you think.<br><br>We’ve also made subscription and Direct Debit predictions more flexible, so you can set them two-weekly, monthly and quarterly."},{"version_id":"829282180","version_name":"2.24.0","version_date":"2018-11-19 11:56:09.000 +0800","version_description":"This time we've made scrolling through the app a smoother experience. Sometimes it's the little things that make all the difference."},{"version_id":"829376979","version_name":"2.25.0","version_date":"2018-11-27 11:57:31.000 +0800","version_description":"Our noble team have spent the week questing through the app in search of bugs to vanquish. (We've also been playing a lot of Dungeons &amp; Dragons recently.)"},{"version_id":"829466742","version_name":"2.26.0","version_date":"2018-12-05 15:21:04.000 +0800","version_description":"A quick fix for a few crowdfunding bugs that were reported, including the investment banner being hidden by an Apple Pay banner. Update now to get the chance to invest."},{"version_id":"829605277","version_name":"2.27.0","version_date":"2018-12-12 15:50:39.000 +0800","version_description":"We've added Shared Tabs so you can split ongoing expenses with your friends! We've also made improvements to Monzo Chat so you can now see an estimate of the wait time. And as usual, we fixed a few bugs and added a bit of polish to your current account too."},{"version_id":"829681101","version_name":"2.28.0","version_date":"2018-12-19 14:27:33.000 +0800","version_description":"We’re mostly making it easier to *not* use Monzo this week. You can now add payments to Shared Tabs that weren’t made on Monzo, for example if they were cash or on your credit card. And we’ve added the ability to send money to anyone – even if they’re not on Monzo – by text or email into Labs for testing."},{"version_id":"829832046","version_name":"2.29.0","version_date":"2019-01-07 11:37:16.000 +0800","version_description":"Happy new year! We had a small sign-up bug which was making it harder for people to open accounts. Not ideal. But it's fixed now!"},{"version_id":"829895555","version_name":"2.30.0","version_date":"2019-01-14 16:35:29.000 +0800","version_description":"A bumper crop of new year updates. You can now (deep breath): change the frequency of your standing orders and scheduled payments; save your chats with Monzo as PDFs and download or send them; see details of payments you’ve sent by text or email and cancel links if you like. Phew."},{"version_id":"829992042","version_name":"2.31.0","version_date":"2019-01-21 11:43:52.000 +0800","version_description":"Making new friends is a good thing. So now you can add someone to an existing Shared Tab."},{"version_id":"830046043","version_name":"2.32.0","version_date":"2019-01-28 14:15:57.000 +0800","version_description":"We’ve given Monzo Chat some much needed TLC so it’s even easier for you to tell us when something’s urgent. And now you can check who hasn’t paid up from splitting the bill at dinner last week. Handy."},{"version_id":"830131466","version_name":"2.33.0","version_date":"2019-02-04 14:18:24.000 +0800","version_description":"You don't (usually) start a conversation in an empty room, so we figured you shouldn't start a chat with us on an empty screen. We've made some changes to Monzo Chat so it's clearer what to expect when you start a conversation with us."},{"version_id":"830221862","version_name":"2.34.0","version_date":"2019-02-11 10:50:50.000 +0800","version_description":"Receipts are dead! Just joking – they're alive and well. But, while it won't reverse climate change, you can now get digital receipts from EAT, Itsu, Pod and Pure in your Monzo app. Just tap on a recent transaction from one of these places to get set up. Also, ask mates for money without splitting a bill, submit your passport details more easily and recover your PIN before you've even activated your card. Capeesh?"},{"version_id":"830305734","version_name":"2.35.0","version_date":"2019-02-18 11:15:20.000 +0800","version_description":"Joint account friends! If you’ve been waiting to make the switch and go full Monzo, rejoice. You can now use the Current Account Switch Service (CASS) to move your joint account across to Monzo. It’s free, takes a week, and we do all the admin for you. Kick off your switch from the Profile section of your Account tab."},{"version_id":"830361976","version_name":"2.36.0","version_date":"2019-02-25 09:32:39.000 +0800","version_description":"You know the old adage: “Pay someone once, write a payment reference. Pay someone twice, Monzo autofills the reference you used the first time.”"},{"version_id":"830413343","version_name":"2.36.1","version_date":"2019-02-26 20:49:55.000 +0800","version_description":"You told us you love locked Pots, but that not being able to unlock them easily was a pain. So we’ve fixed it! Now you can unlock Pots early in the app."},{"version_id":"830468428","version_name":"2.37.0","version_date":"2019-03-04 09:41:35.000 +0800","version_description":"Forgotten your card and need your card number? No problem. Tap 'PIN &amp; card number' in your Account tab and watch the magic happen. You can even tap and hold the number to copy it (clever, we know)."},{"version_id":"830519838","version_name":"2.38.0","version_date":"2019-03-11 11:48:43.000 +0800","version_description":"Sometimes it's releasing exciting new things. Sometimes it's \"Oh no, this thing is broken\". This week it's the latter: we fixed a bug that meant some people saw a zero balance when opening the app, or switching to their joint account."},{"version_id":"830602035","version_name":"2.39.0","version_date":"2019-03-18 11:49:57.000 +0800","version_description":"There's nothing more motivating than seeing what you're saving for in front of your very eyes. So now you can choose your own Pot images - be it your dream holiday destination or a brand new hoover (we won't judge). <br><br>Plus, add regular payments to Shared Tabs and we'll work out who owes what. No more awkward conversations about last month's water bill. Ever."},{"version_id":"830714520","version_name":"2.40.0","version_date":"2019-03-25 09:24:44.000 +0800","version_description":"Sometimes you don't know what you don't know. So when you join, we'll guide you through Monzo's handiest features to take you from rookie to pro in no time."},{"version_id":"830756245","version_name":"2.41.0","version_date":"2019-04-01 11:15:48.000 +0800","version_description":"Behold: a shiny new Payments tab. We've tidied things up so your options are more streamlined. We've also listed all the apps connected to your Monzo account under 'Manage Apps and Devices'."},{"version_id":"830855586","version_name":"2.42.0","version_date":"2019-04-08 09:51:54.000 +0800","version_description":"ISAs for everyone! You can open an ISA in the app today, in the same way you'd set up a Savings Pot (head to your Account tab to get started).<br><br>Also: we've added some Monzo magic to moving money between your accounts. You can now add notes to these just like other payments to people on Monzo."},{"version_id":"830948993","version_name":"2.43.0","version_date":"2019-04-15 11:04:37.000 +0800","version_description":"Lots of new features: good. Lots of notifications: a pain. So now features we think you'll find useful have a spot above your list of transactions in the Home tab. Also, if you change your email address, you can now update it yourself (along with your address and phone number) from your Profile in the Account tab."},{"version_id":"831020337","version_name":"2.44.0","version_date":"2019-04-24 09:23:21.000 +0800","version_description":"Introducing ISAs! You can now save money without paying tax on the interest you earn by opening a Savings Pot ISA (individual savings account). Find out more by creating a pot on the Account tab."},{"version_id":"831095029","version_name":"2.45.0","version_date":"2019-04-29 12:57:40.000 +0800","version_description":"We’ve spruced up the animation in the app for when you’re looking back at days gone by, we’re also doing lots of work behind the scenes to make the app fit for 2019 and beyond."},{"version_id":"831168792","version_name":"2.46.0","version_date":"2019-05-07 09:36:57.000 +0800","version_description":"Payday's the single best day of the month. And to celebrate it, we've made it even easier to get your salary paid into Monzo. Just go to the Account tab and tap 'Add money' to get the ball rollin'."},{"version_id":"831226806","version_name":"2.47.0","version_date":"2019-05-13 08:42:52.000 +0800","version_description":"Things you can do in under 6 minutes:<br>- Floss your teeth<br>- Pet a dog<br>- Play an instrument<br>- Make a fruit smoothie<br>- Switch your energy supplier to Octopus Energy or OVO Energy through Monzo<br><br>(By the way, they offer great customer service and use renewable energy too)."},{"version_id":"831320055","version_name":"2.48.0","version_date":"2019-05-20 08:47:14.000 +0800","version_description":"Life is all about balance. This week, we've ironed out some creases in the app (gotta be done). But we also prepped for the launch of our TV ads (*bites nails*). Keep an eye out for Monzo coming to a screen near you!"},{"version_id":"831404831","version_name":"2.49.0","version_date":"2019-05-28 09:12:53.000 +0800","version_description":"There's now two million people with Monzo! This week we made it easier for you to see and manage all of your borrowing options at Monzo. We also fixed a few bugs, so navigating around the app should feel smoother."},{"version_id":"831484632","version_name":"2.50.0","version_date":"2019-06-04 09:04:02.000 +0800","version_description":"Just some regulation tidying up and fixing bugs this week. Since there's not much to see here, maybe try and find our ads on TV?"},{"version_id":"831579681","version_name":"2.51.0","version_date":"2019-06-10 14:51:28.000 +0800","version_description":"Sometimes, it's the little things in life that bring the most enjoyment. A single snowflake resting delicately on a young puppy's nose; a fresh cool breeze cutting through the fug of a hot city day; or us changing the name of our Flexible Savings Pots to Easy Access Savings Pots."},{"version_id":"831695278","version_name":"2.52.0","version_date":"2019-06-19 13:25:16.000 +0800","version_description":"Our poor app's been lugging extra weight around for no reason. We've helped lighten the load by removing files it didn't need from iCloud backups."},{"version_id":"831756394","version_name":"2.53.0","version_date":"2019-06-24 12:23:57.000 +0800","version_description":"We've made it even easier to discover awesome Monzo features when you first join. So, you know, if your friends still need a nudge, now's a good time to do it."},{"version_id":"831824262","version_name":"2.54.0","version_date":"2019-07-01 09:51:10.000 +0800","version_description":"“That sweater is not just blue.” and neither is your card, if it’s Monzo Plus. We’ve fixed a bug so you can update your app icon to match your card, quicker. And, we made some changes under the hood to make your balance update even faster."},{"version_id":"831858281","version_name":"2.54.1","version_date":"2019-07-03 09:34:21.000 +0800","version_description":"If you had your region set to China, Japan or Canada, you weren't able to enter your date of birth when signing up for Monzo. We've fixed this now - so you can apply away!"},{"version_id":"831939497","version_name":"2.56.0","version_date":"2019-07-17 17:55:47.000 +0800","version_description":"Great news for Monzo Plustomers! (See what we did there?) We’re giving you two new features as part of your core bundle, at no extra cost.<br><br>- You’ll earn 1.5% AER on all positive balances up to £4,000.<br>- You’ll also get access to exclusive offers and discounts (including TIDAL, Zipcar and HelloFresh).<br><br>We’ve also fixed some scaling issues on smaller phones so our terms and conditions don’t get shrunk down and tricky to read."},{"version_id":"832049101","version_name":"2.57.0","version_date":"2019-07-22 11:03:04.000 +0800","version_description":"In the words of Oprah, you can get Monzo Plus! You can get Monzo Plus! Everyone can get Monzo Plus! (Because we’ve taken away the Monzo Plus waiting list and it’s available for everyone.)"},{"version_id":"832130648","version_name":"2.58.0","version_date":"2019-07-30 09:30:58.000 +0800","version_description":"Monzo is coming to the US!<br><br>This week we've been busy replacing pound signs with dollar signs, and getting rid of every 'u' that doesn't belong."},{"version_id":"832245683","version_name":"2.59.0","version_date":"2019-08-03 04:25:32.000 +0800","version_description":"Monzo is coming to the US! <br><br>This week we've been busy replacing pound signs with dollar signs, and getting rid of every 'u' that doesn't belong."},{"version_id":"832295678","version_name":"2.60.0","version_date":"2019-08-12 11:39:59.000 +0800","version_description":"This week we stopped explaining to US customers how American restaurants take payments differently from UK restaurants, because you already know how restaurants work.<br><br>We also made it clearer when you first see your PIN that you can get a reminder at any time.<br><br>For UK accounts:<br><br>The new navigation keeps on getting better! You can now open your Summary by tapping the Left to Spend progress bar, and you can access your accounts list by pulling the transaction drawer down. Try the new navigation in Monzo Labs."},{"version_id":"832384698","version_name":"2.61.0","version_date":"2019-08-19 11:23:12.000 +0800","version_description":"This week we've been working on big, important things like making payments more reliable and localizing the app. But we also got rid of a silly, confusing message about changing your PIN at cash machines, which you can only do in the UK right now. Like we said: silly.<br><br>For UK accounts:<br><br>You might've heard on the grapevine that we're giving our app a whole new look. If you want special VIP access* then head to Monzo Labs in your Profile. We've made it even easier for you to discover things like Pots and loans in there. And on that note, we've now launched loans to all eligible customers! <br><br>*Okay, it's actually just early access. But what we said sounded better."},{"version_id":"832467478","version_name":"2.62.0","version_date":"2019-08-28 09:52:06.000 +0800","version_description":"For US customers, we continued our mission to localize the app - thanks to everyone that told us where things were getting a bit too British"},{"version_id":"832593970","version_name":"2.63.0","version_date":"2019-09-03 07:07:22.000 +0800","version_description":"You can now submit feedback directly in-app when a store’s information doesn’t look correct, so your feed can look even more beautiful."},{"version_id":"832647827","version_name":"2.64.0","version_date":"2019-09-09 10:49:15.000 +0800","version_description":"You can now submit feedback directly in-app when a store’s information doesn’t look correct, so your feed can look even more beautiful."},{"version_id":"832736314","version_name":"2.65.0","version_date":"2019-09-16 10:28:23.000 +0800","version_description":"You can now submit feedback directly in-app when a store’s information doesn’t look correct, so your feed can look even more beautiful."},{"version_id":"832825289","version_name":"3.0.0","version_date":"2019-09-23 09:24:33.000 +0800","version_description":"Nothing much changed for US accounts this week!<br><br>If you have a UK account:<br><br>This is the big one: 3.0! We've had a makeover, and this new-look app is Monzo for the future. We've made it easier to find the things we do already, and left plenty of room for what's coming next. Keep your eyes open because we're just getting started."},{"version_id":"832884622","version_name":"3.0.1","version_date":"2019-09-24 08:35:08.000 +0800","version_description":"Nothing much changed for US accounts this week!<br><br>If you have a UK account:<br><br>This is the big one: 3.0! We've had a makeover, and this new-look app is Monzo for the future. We've made it easier to find the things we do already, and left plenty of room for what's coming next. Keep your eyes open because we're just getting started."},{"version_id":"832933809","version_name":"3.1.0","version_date":"2019-09-30 12:37:20.000 +0800","version_description":"You might’ve heard on the grapevine that we’re giving our app a whole new look. We’ve been working hard behind the scenes to make this happen for US accounts soon.<br><br>We’ve also listened to your feedback and helped make it clearer during signup why we collect SSN and how we safely and securely store that data."},{"version_id":"833012541","version_name":"3.2.0","version_date":"2019-10-07 13:00:36.000 +0800","version_description":"You might’ve heard on the grapevine that we’re giving our app a whole new look. We’ve been working hard behind the scenes to make this happen for US accounts soon.<br><br>We’ve also listened to your feedback and helped make it clearer during signup why we collect SSN and how we safely and securely store that data."},{"version_id":"833080329","version_name":"3.3.0","version_date":"2019-10-14 09:59:57.000 +0800","version_description":"You might've heard on the grapevine that we're giving our app a whole new look. We've been working hard behind the scenes to make this happen for US accounts soon.<br><br>We've also listened to your feedback and helped make it clearer during signup why we collect SSN and how we safely and securely store that data"},{"version_id":"833230557","version_name":"3.4.0","version_date":"2019-10-21 10:37:14.000 +0800","version_description":"You asked, we answered! This week we added your account details and bank statements to your 'Manage' screen because that's where most people were looking for them. Sensible, eh?"},{"version_id":"833305444","version_name":"3.5.0","version_date":"2019-10-28 11:29:01.000 +0800","version_description":"Say cheese! This week we updated the identity verification experience during signup to include clearer messaging and improved photo and video capture."},{"version_id":"833386541","version_name":"3.5.1","version_date":"2019-10-30 15:58:49.000 +0800","version_description":"We've been fixing bugs. Not the squishy, buzzing, two-winged, eight-legged, 12-eyed kind. But the in-app, computer, code kind."},{"version_id":"833463169","version_name":"3.7.0","version_date":"2019-11-11 10:56:54.000 +0800","version_description":"How do you stay regular? Some people recommend plenty of leafy greens. Others swear by prunes. We prescribe a week of tweaks and fixes to make your balance and transaction updates quicker and more reliable. (Prunes optional.)"},{"version_id":"833610527","version_name":"3.8.0","version_date":"2019-11-18 09:52:14.000 +0800","version_description":"We're preparing for a makeover to set Monzo up for the future alongside a healthy dose of squashed bugs and polished edges. Keep your eyes open because we're just getting started."},{"version_id":"833705569","version_name":"3.9.0","version_date":"2019-11-25 18:01:58.000 +0800","version_description":"We hate to do this to you, but all we’ve got is bug fixes. It’s important work, sure, but we appreciate it isn’t the most exciting news you’ll get today. Or maybe it will be."},{"version_id":"833768440","version_name":"3.10.0","version_date":"2019-12-02 13:51:10.000 +0800","version_description":"Great news! Our new app layout has landed on US soil."},{"version_id":"833903334","version_name":"3.11.0","version_date":"2019-12-09 13:21:17.000 +0800","version_description":"We're working on general bug fixing and performance improvements ahead of the festive season. With this update everything should feel snappier and run smoother."},{"version_id":"833950676","version_name":"3.12.0","version_date":"2019-12-16 13:57:04.000 +0800","version_description":"You know how you get socks for Christmas and it’s never really fun but it is useful. Well that’s a bit like this update. Our gift for the holidays is... bug fixes! Don't say we don't treat ya."},{"version_id":"834033601","version_name":"3.12.1","version_date":"2019-12-17 00:01:22.000 +0800","version_description":"An extra Christmas gift, so soon?! We’re treating you with one last round of bug fixes before we sign off for the year."},{"version_id":"834215874","version_name":"3.13.0","version_date":"2020-01-08 17:05:29.000 +0800","version_description":"New year, time to reflect. In 2019 we gave 1,000 people early access to our beta card and loved meeting lots of you at our community events across San Francisco, NYC, Las Vegas and LA. <br><br>Now we're busy prepping for 2020. First up, our product roadmap. Using your feedback to decide what we build next is super important to us. Later this month you'll be able to see what we're planning, plus comment and vote on what we should do next! Watch this space…"},{"version_id":"834289832","version_name":"3.14.0","version_date":"2020-01-13 11:00:15.000 +0800","version_description":"Pots have arrived! They're our way of letting you separate your money from your spending balance. Slice of the pi, anyone?"},{"version_id":"834381427","version_name":"3.15.0","version_date":"2020-01-20 13:00:33.000 +0800","version_description":"You can now pick your own PIN when you sign up with us. Sometimes it's the little things."},{"version_id":"834467760","version_name":"3.17.0","version_date":"2020-01-27 13:57:22.000 +0800","version_description":"January's the perfect time to get things organised. We've tidied up the Profile and Settings pages so it's easier for you to find things like legal documents and notification preferences. Another tick off the to-do list."},{"version_id":"834521903","version_name":"3.18.0","version_date":"2020-02-03 11:34:28.000 +0800","version_description":"Forget copying and pasting bank details. Now you can send money to other friends on Monzo easily - all you’ll need is their phone number."},{"version_id":"834602532","version_name":"3.19.0","version_date":"2020-02-10 11:03:11.000 +0800","version_description":"If you have a US and UK Monzo account:<br> 1. Lucky you<br> 2. You can now switch between the two in your accounts list, for simpler money management.<br>And where's number 3, you ask? Well, there isn't one. Not all good things come in threes."},{"version_id":"834752301","version_name":"3.20.0","version_date":"2020-02-19 10:47:05.000 +0800","version_description":"You can now split the check with friends in the app. No more paying with multiple cards, frantically swapping account details or awkward conversations about who owes who. Phew."},{"version_id":"834815090","version_name":"3.21.0","version_date":"2020-02-24 10:58:53.000 +0800","version_description":"If you’re waiting in line for a Monzo account, we’ll now let you know where you stand, and offer you ways to jump ahead! (Fun fact: our British cousins call a line a ‘queue’. Wild!)<br><br>We’ve also fixed a silly bug that was stopping people telling us their apartment number in sign-up."},{"version_id":"834894448","version_name":"3.22.0","version_date":"2020-03-02 15:14:52.000 +0800","version_description":"Ever heard the saying, \"A picture is worth a thousand words\"? We couldn't agree more. That's why we've updated our merchant logos, so you can see exactly where you're spending."},{"version_id":"834961332","version_name":"3.22.1","version_date":"2020-03-04 14:10:32.000 +0800","version_description":"Ever heard the saying, \"A picture is worth a thousand words\"? We couldn't agree more. That's why we've updated our merchant logos, so you can see exactly where you're spending."},{"version_id":"835010052","version_name":"3.23.0","version_date":"2020-03-10 14:10:14.000 +0800","version_description":"We took a leaf out of Marie Kondo's book and gave the app a spring clean. (Before we removed any old code, we thanked it for its service.)"},{"version_id":"835106333","version_name":"3.24.0","version_date":"2020-03-16 11:36:01.000 +0800","version_description":"We took a leaf out of Marie Kondo's book and gave the app a spring clean. (Before we removed any old code, we thanked it for its service.)"},{"version_id":"835137000","version_name":"3.24.1","version_date":"2020-03-18 05:32:02.000 +0800","version_description":"We fixed a problem that meant the app was crashing when some of you tried to open it."},{"version_id":"835192954","version_name":"3.25.0","version_date":"2020-03-25 10:34:19.000 +0800","version_description":"The spring cleaning is still in full swing here. We're dusting off old code and vacuuming up any bugs (the computer kind, not the buzzing, six-legged kind)."},{"version_id":"835265894","version_name":"3.26.0","version_date":"2020-03-30 11:44:39.000 +0800","version_description":"Some people were a bit confused about when your card can, or can't, be unfrozen. So we made a new 'blocked' card state, which should clear things up. Enjoy!"},{"version_id":"835381238","version_name":"3.27.0","version_date":"2020-04-06 11:03:54.000 +0800","version_description":"This week we've all been working from home, fixing bugs and tidying up the app.<br><br>If you have any questions about coronavirus and your money, head to our website for information and guidance. We hope you're all staying safe out there."},{"version_id":"835442849","version_name":"3.27.1","version_date":"2020-04-08 12:48:30.000 +0800","version_description":"This week we've all been working from home, fixing bugs and tidying up the app.<br><br>If you have any questions about coronavirus and your money, head to our website for information and guidance. We hope you're all staying safe out there."},{"version_id":"835458974","version_name":"3.28.0","version_date":"2020-04-14 09:47:19.000 +0800","version_description":"We're still working from home, still squashing masses of bugs, and looking at adorable puppy videos to stay cheery. Keep safe out there, pals!"},{"version_id":"835557112","version_name":"3.29.0","version_date":"2020-04-21 09:30:33.000 +0800","version_description":"More bug fixes and hard work behind the scenes this week, so here's a fact instead. Did you know that US paper money isn't made of paper at all? It's cloth. In Ben Franklin's day, people repaired torn bills with a needle and thread."},{"version_id":"835663870","version_name":"3.30.0","version_date":"2020-04-27 10:01:37.000 +0800","version_description":"We’ve been making our app more resilient this week, in the unlikely event we see trouble with our in app chat we’ve put in a backup option. Safety first!"},{"version_id":"835770290","version_name":"3.31.0","version_date":"2020-05-04 11:31:27.000 +0800","version_description":"With this update, we're rolling out the ability to hide and sort your Pots! Reorder them in a way that works best for you, or tuck them away entirely so they're out of sight."},{"version_id":"835820132","version_name":"3.32.0","version_date":"2020-05-11 13:05:40.000 +0800","version_description":"Another busy week clearing out bugs here at Monzo. Which got us thinking: we talk about 'bugs' a lot, but we never thought to ask if you know what that means? When we say 'bug', we're talking about an error or flaw somewhere in our system."},{"version_id":"835956523","version_name":"3.33.0","version_date":"2020-05-18 12:48:26.000 +0800","version_description":"We fixed a bug where the app would crash after granting permission to take photos when adding receipts to your transactions. From home, of course."},{"version_id":"836039631","version_name":"3.34.0","version_date":"2020-05-26 09:30:52.000 +0800","version_description":"Customers who use VoiceOver should now find steppers and number entry fields easier to navigate. We've changed the messaging to improve what's read out by the screen reader."},{"version_id":"836178375","version_name":"3.35.0","version_date":"2020-06-01 11:24:38.000 +0800","version_description":"People with a UK and US Monzo account would sometimes see their profile pictures swapped around. Not anymore, friends! That bug is well and truly squashed."},{"version_id":"836320548","version_name":"3.36.0","version_date":"2020-06-09 10:40:15.000 +0800","version_description":"This week we’ve improved accessibility for Pots by making it easier for screen readers to navigate and understand those pages."},{"version_id":"836359040","version_name":"3.37.0","version_date":"2020-06-15 10:03:19.000 +0800","version_description":"It’s a low-key update this week. Things are moving, but we’re not ready to share anything major just yet. Trust that the usual flurry of fixed bugs and improved performances are included though."},{"version_id":"836477655","version_name":"3.38.0","version_date":"2020-06-19 19:10:56.000 +0800","version_description":"You’ll see some especially fun product improvements and bug fixes this week. Make sure you check out the spinny animations that show when your balance is being refreshed."},{"version_id":"836578042","version_name":"3.39.0","version_date":"2020-06-29 11:10:58.000 +0800","version_description":"There was a pesky issue where some customers on slow connections could get stuck when trying to reset their PINs. We're happy to say that that bug's officially squashed. Onwards!"},{"version_id":"836704462","version_name":"3.40.0","version_date":"2020-07-06 11:28:34.000 +0800","version_description":"Grace Hopper introduced us to the term \"bug\" – or at least in its computing form anyway. Apparently she used it to describe a malfunction in an early electromechanical computer. Well here's to you Grace, cos we've been fixing bugs."},{"version_id":"836778676","version_name":"3.41.0","version_date":"2020-07-13 12:57:54.000 +0800","version_description":"We fixed a bug where cells were a little wonky in the 'Manage your account' section of the app when using a large device."},{"version_id":"836826370","version_name":"3.41.1","version_date":"2020-07-13 17:18:23.000 +0800","version_description":"We fixed a bug where cells were a little wonky in the 'Manage your account' section of the app when using a large device."},{"version_id":"836896182","version_name":"3.42.0","version_date":"2020-07-20 08:18:58.000 +0800","version_description":"We fixed a bug where cells were a little wonky in the ‘Manage your account’ section of the app when using a large device."},{"version_id":"837014889","version_name":"3.43.0","version_date":"2020-07-27 14:28:44.000 +0800","version_description":"This week, we're *gifting* you a new spending category. (It's gifts.)"},{"version_id":"837063648","version_name":"3.44.0","version_date":"2020-08-03 10:23:38.000 +0800","version_description":"We're all staying safe and wearing masks at the moment. So we've added the ability to open the app with your iPhone passcode, for times when your face is covered. You need to be using Face ID to unlock the app for this fallback to appear."},{"version_id":"837254533","version_name":"3.45.0","version_date":"2020-08-10 13:52:01.000 +0800","version_description":"Lots of ‘backend’ work going on this week. Which, if you don’t know, means the parts of our code that make the app work behind the scenes."},{"version_id":"837351426","version_name":"3.46.0","version_date":"2020-08-17 10:35:38.000 +0800","version_description":"Two key fixes to report this week. The first one straightened out an animation issue that popped up when going from home to the accounts list. The other is to do with loan repayments. Some of the content in that area of the app was all squished together, and now it isn’t."},{"version_id":"837433163","version_name":"3.47.0","version_date":"2020-08-24 16:03:04.000 +0800","version_description":"Our app widget is now faster and more reliable. You can use it to quickly glance at your balance and spent today without needing to open the app."},{"version_id":"837542975","version_name":"3.47.1","version_date":"2020-08-28 08:40:56.000 +0800","version_description":"Our app widget is now faster and more reliable. You can use it to quickly glance at your balance and spent today without needing to open the app."},{"version_id":"837557810","version_name":"3.48.0","version_date":"2020-09-01 09:32:10.000 +0800","version_description":"This release includes some refactor work - which means we've made existing code more reliable and less susceptible to any bugs!"},{"version_id":"837638349","version_name":"3.49.0","version_date":"2020-09-07 08:59:57.000 +0800","version_description":"This week we worked behind the scenes to make the app more reliable and less susceptible to bugs!"},{"version_id":"837755623","version_name":"3.50.0","version_date":"2020-09-14 09:50:29.000 +0800","version_description":"You'll soon be able to order a personalized Monzo card, because if you like it then you should put your name on it. Look out for an update in your feed to find out more!"},{"version_id":"837838842","version_name":"3.51.0","version_date":"2020-09-21 09:38:36.000 +0800","version_description":"Bug watch: we fixed an issue where the app was making iCloud backups larger than necessary, and one where the app crashed for some users on iOS 10."},{"version_id":"837941368","version_name":"3.52.0","version_date":"2020-09-28 14:39:08.000 +0800","version_description":"Refactoring is when you change the structure of code without changing what it does. The aim is to make it more reliable and less susceptible to bugs – we've been doing just that this week."},{"version_id":"837998195","version_name":"3.52.1","version_date":"2020-09-29 18:24:42.000 +0800","version_description":"Refactoring is when you change the structure of code without changing what it does. The aim is to make it more reliable and less susceptible to bugs – we've been doing just that this week."},{"version_id":"838043292","version_name":"3.53.0","version_date":"2020-10-05 10:40:19.000 +0800","version_description":"Refactoring is when you change the structure of code without changing what it does. The aim is to make it more reliable and less susceptible to bugs – we've been doing just that this week."},{"version_id":"838124858","version_name":"3.54.0","version_date":"2020-10-12 10:59:07.000 +0800","version_description":"Create new payees without needing to send them money first – head over to the Payments tab to give it a try. We've also fixed a bug where the bill splitting option wasn't appearing for some transactions."},{"version_id":"838231854","version_name":"3.55.0","version_date":"2020-10-19 10:46:33.000 +0800","version_description":"This week we had a party! Not your typical party with cake and funny hats, but one where our engineers deleted lots of old code that didn't need to be there any more. Things should work a little faster now."},{"version_id":"838333564","version_name":"3.56.0","version_date":"2020-10-26 10:21:49.000 +0800","version_description":"We've been doing some housekeeping around the app – cleaning, fixing and tweaking."},{"version_id":"838453582","version_name":"3.57.0","version_date":"2020-11-02 16:14:18.000 +0800","version_description":"Lots of 'backend' work going on this week. Which, if you don't know, means the parts of our code that make the app work behind the mask."},{"version_id":"838523227","version_name":"3.58.0","version_date":"2020-11-09 10:34:12.000 +0800","version_description":"We've been doing some housekeeping around the app – cleaning, fixing and tweaking."},{"version_id":"839023725","version_name":"3.59.0","version_date":"2020-11-16 11:42:27.000 +0800","version_description":"We've improved explanations for why a contactless card payment might have declined, so you know what to do to fix it."},{"version_id":"839283168","version_name":"3.60.0","version_date":"2020-11-23 11:17:12.000 +0800","version_description":"We’ve made ordering and activating your Hot Coral card even smoother."},{"version_id":"839385360","version_name":"3.61.0","version_date":"2020-11-30 11:27:20.000 +0800","version_description":"Listen out for some new sounds for when money moves in and out of your account. As well as a completely different sound for other little alerts."},{"version_id":"839488307","version_name":"3.62.0","version_date":"2020-12-07 11:49:11.000 +0800","version_description":"We’ve added a ‘roundup’ label to payments so you can clearly see when you’ve put money into savings. We’ve made some improvements behind the scenes too."},{"version_id":"839571386","version_name":"3.63.0","version_date":"2020-12-14 16:09:02.000 +0800","version_description":"We've improved searching for transactions, so you'll now see your results much faster.<br><br>And you'll find more accurate logos, locations and names for the places you've used Monzo, as well as being able to suggest improvements to them.<br><br>This is our last update of the year, so a Happy New Year from all of us at Monzo. See you in 2021!"},{"version_id":"839709644","version_name":"3.63.1","version_date":"2020-12-18 09:13:53.000 +0800","version_description":"We’ve fixed a bug that was stopping 16 and 17 year olds from signing up for an account."},{"version_id":"839926355","version_name":"3.64.0","version_date":"2021-01-11 16:07:14.000 +0800","version_description":"Happy New Year! For our first update of 2021 we’ve got... bug fixes!"},{"version_id":"840065947","version_name":"3.64.0","version_date":"2021-01-11 16:07:14.000 +0800","version_description":"Happy New Year! For our first update of 2021 we’ve got... bug fixes!"},{"version_id":"840065948","version_name":"3.65.0","version_date":"2021-01-18 13:17:19.000 +0800","version_description":"We’ve cleaned up the look of our bank statements – now with a more useful summary of your money on the first page. Tap ‘Account’ under your card in the app to find them."},{"version_id":"840126945","version_name":"3.66.0","version_date":"2021-01-25 11:50:03.000 +0800","version_description":"Nothing major to report this week. Lots of good work going on under the hood though."},{"version_id":"840249670","version_name":"3.67.0","version_date":"2021-02-01 12:50:03.000 +0800","version_description":"This week we’ve squashed a rare (but annoying) bug that was causing the app to crash when moving money around with Pots."},{"version_id":"840340505","version_name":"3.68.0","version_date":"2021-02-08 14:46:43.000 +0800","version_description":"You can now give friends nicknames, add descriptions for their bank accounts and combine details where you have multiple contacts for the same person. We’ve moved your pals out of the Payments screen and into the new payee hub so they’re easier to find, and we’ve decluttered by separating your Monzo contacts from the contacts in your phone. We’ve given the Payments screen some love too with new icons, refreshed wording and a general glow up."},{"version_id":"840467302","version_name":"3.69.0","version_date":"2021-02-15 09:11:57.000 +0800","version_description":"Nothing to see here folks. Another week working on things under the hood."},{"version_id":"840522963","version_name":"3.70.0","version_date":"2021-02-22 11:26:09.000 +0800","version_description":"No juicy announcements this week, sorry. Lots of work going on behind the scenes though. Seen any good movies recently?"},{"version_id":"840623416","version_name":"3.71.0","version_date":"2021-03-01 15:17:41.000 +0800","version_description":"Spin through your accounts and Pots by tapping the neighbouring image or card."},{"version_id":"840725432","version_name":"3.72.0","version_date":"2021-03-08 11:07:01.000 +0800","version_description":"Not much to report this week that you'll notice in the app, just lots of little performance improvements that help everything tick along."},{"version_id":"840853631","version_name":"3.73.0","version_date":"2021-03-15 11:51:45.000 +0800","version_description":"Nothing to tell you about this week. We've been busy with invisible work that keeps things running smoothly."},{"version_id":"840956773","version_name":"3.74.0","version_date":"2021-03-22 10:03:49.000 +0800","version_description":"Bugs, there are less now<br>Yes, we said less not fewer<br>We’re descriptivists"},{"version_id":"841066958","version_name":"3.75.0","version_date":"2021-03-29 11:03:19.000 +0800","version_description":"We promise we're using our extra hour of sunlight productively, but there's nothing big to report this week."},{"version_id":"841253048","version_name":"3.77.0","version_date":"2021-04-12 12:52:38.000 +0800","version_description":"Tracking your spending just got easier. You can now see a progress bar against your budgets, right under your balance. So you can see how you're doing at a glance.<br>(And if you don't already have a budgeting cycle set up, tap the pie chart on your home screen to get started.)"},{"version_id":"841367974","version_name":"3.78.0","version_date":"2021-04-19 11:51:23.000 +0800","version_description":"Just some routine maintenance and bug fixes for you this week.<br>But while we've got you, why not create a Pot in your Monzo account? You can use them to separate out your money however you'd like."},{"version_id":"841934234","version_name":"3.80.0","version_date":"2021-05-04 11:59:53.000 +0800","version_description":"Nothing to note this week. Just some updates under the hood!"},{"version_id":"842082087","version_name":"3.81.0","version_date":"2021-05-10 13:18:23.000 +0800","version_description":"Nothing to note this week. Just some updates under the hood!"},{"version_id":"842185229","version_name":"3.82.0","version_date":"2021-05-17 11:57:36.000 +0800","version_description":"Just some routine maintenance this week, folks!"},{"version_id":"842305335","version_name":"3.83.0","version_date":"2021-05-25 09:35:04.000 +0800","version_description":"Nothing specific to share this week. We’ve been busy with the usual work of keeping everything running the way it should."},{"version_id":"842404939","version_name":"3.84.0","version_date":"2021-06-01 13:45:48.000 +0800","version_description":"Nothing to update you on this week, just ongoing maintenance. Stay safe."},{"version_id":"842502315","version_name":"3.85.0","version_date":"2021-06-07 09:44:10.000 +0800","version_description":"Routine maintenance, this week."},{"version_id":"842606316","version_name":"3.86.0","version_date":"2021-06-14 09:56:06.000 +0800","version_description":"We’ve added 200+ new emojis for you to use when thanking someone for a payment. Which means there’s now a huge 1,720 ways to say cheers, much obliged, big up, ta."},{"version_id":"842703034","version_name":"3.87.0","version_date":"2021-06-21 11:12:53.000 +0800","version_description":"No announcements today, but we’ve been busy writing lots of code for things we can tell you about soon. Stay tuned."},{"version_id":"842791086","version_name":"3.88.0","version_date":"2021-06-28 14:40:23.000 +0800","version_description":"We're (almost exactly) halfway through the year. Thought you should know.<br>We've also got some exciting updates coming to your screens soon – but not just yet. Stay tuned!"},{"version_id":"842928175","version_name":"3.89.0","version_date":"2021-07-05 10:14:22.000 +0800","version_description":"Nothing specific to share this week. We've been busy with the usual work of keeping everything running the way it should."},{"version_id":"843029942","version_name":"3.90.0","version_date":"2021-07-13 11:22:59.000 +0800","version_description":"We’ve been working on some routine maintenance this week to make sure your Monzo app is performing at the top of its game."},{"version_id":"843180304","version_name":"3.91.1","version_date":"2021-07-21 09:55:06.000 +0800","version_description":"More maintenance and building below the surface this week. We’ve got a nice queue of announcements lined up for the next few months though, stay tuned."},{"version_id":"843220227","version_name":"3.92.0","version_date":"2021-07-26 11:04:23.000 +0800","version_description":"Nothing big to tell you about just yet. All the work we’ve been doing has been happening behind closed doors, gearing up for launches coming soon."}]