[{"version_id":"821392542","version_name":"1.1.0","version_date":"","version_description":""},{"version_id":"821448748","version_name":"1.1.1","version_date":"","version_description":""},{"version_id":"821491760","version_name":"1.1.2","version_date":"","version_description":""},{"version_id":"821576169","version_name":"1.1.3","version_date":"","version_description":""},{"version_id":"821714065","version_name":"1.1.4","version_date":"","version_description":""},{"version_id":"821797956","version_name":"1.1.5","version_date":"","version_description":""},{"version_id":"822458077","version_name":"1.4.2","version_date":"","version_description":""},{"version_id":"826595642","version_name":"1.9.0","version_date":"2018-04-12 23:14:46.000 +0800","version_description":"This release adds a new “Privacy Settings” menu, for people who prefer to have absolutely no data stored in the cloud. <br><br>There’s also a fix for the very long pauses when trying to change the activity type of long trips (eg airplane flights). It’s now possible to correct these trips without having to wait forever for the view to load. Yay!<br><br>Thanks for all your support! <br><br>### Misc other changes: <br><br>- Improved altitude charts<br>- Improvements to accuracy and battery life<br>- Fixed the “overlapping timelines on daylight savings changeover” bug<br>- Fixed some rare crashes"},{"version_id":"827604735","version_name":"2.0.0","version_date":"2018-07-12 23:37:37.000 +0800","version_description":"# Arc App v2.0 <br><br>This one’s a big one!<br><br>Although this release doesn’t add any big new features, there is instead a very long list of smaller but still very cool new features and often requested improvements.<br><br>Hopefully many of you will have your pet feature requests satisfied with this release!<br><br>## Become a Backer!<br><br>I’ve added a new menu option for “Become a Backer” in this release. Please do have a look!<br><br>Arc App is completely free to use, and does not collect or sell any of your personal data, and never will. Like many of you, I take data privacy seriously, and will never compromise on that. I also want the app to continue to be free.<br><br>Arc App it is a labour of love, built because it’s the app that I want for myself, and because I enjoy solving the technical challenges it presents. <br><br>But without financing, the project can’t last forever.<br><br>The more people supporting the project, the more time I can dedicate to building and improving it, and the more certainty we can have that the project will continue growing and improving instead of fading away. <br><br>So please do consider either becoming a backer or making a once off donation to support the project. Thanks so much! &lt;3<br><br>## New<br><br>- Added a “Save to workouts” button to the “Workouts” section on walking, running, and cycling items, for saving workouts to Apple Health<br>- Added an “All visits” view from the place details section on item details view, for easy access to a list of all visits to that place<br>- The current timeline item’s details view now shows current speed and current altitude on item details view<br>- The “Common Visit Times” graph now shows bars for other visits in the same day<br>- Visit details view now shows predicted leaving times<br>- Timeline items now show grey dots instead of red dots when they’re mostly certain but could do with some minor cleanup<br>- Added a new “deep sleep” mode, to get extra battery savings by automatically turning off Arc completely when Arc is confident that you aren’t going anywhere for the next several hours<br>- Added “Become a Backer” to the options menu, for anyone who wants to help support the project’s continued development<br><br>## Improved<br><br>- Much better airplane detection<br>- Improvements to place detection<br>- Walking, running, and cycling paths are now recorded with higher sampling frequency, to match Apple Health’s recommended workouts sampling frequency<br>- GPX exports now include visit start times, visit altitudes, and item notes<br>- “Recorded Activities” is now sorted with newest at the top, same as timelines<br>- Added a bunch more cleanups and minor improvements to the “Recorded Activities” view<br>- Stationary segments in “Recorded Activities” can now be changed to other activity types, to make it easier to undo accidents or fix weirdly wrong data<br>- Going back and viewing old timeline items now automatically reprocesses and reanalyses them using up to date “local knowledge”<br><br>## Fixed<br><br>- Unused places are now automatically deleted<br>- Misc fixes to “knowledge score” calculation<br>- Fixed X axis labels on altitude graphs"},{"version_id":"827940282","version_name":"2.1.1","version_date":"2018-07-20 01:25:54.000 +0800","version_description":"# Arc App v2.1.1<br><br>This update fixes a problem with the Moves data importer not automatically starting for some users. <br><br>It also includes several stability fixes. So if you've been seeing gaps in your recorded data, this update might help!<br><br>Thanks again for all your support!<br><br># Arc App v2.1<br><br>This is the “Moves data importer” release! Yay!<br><br>To import your moves data, download your moves_export.zip from the Moves website, and put a copy of it in the ‘Arc App’ folder on your iCloud Drive. The import will then begin automatically.<br><br>This release also has some stability and battery life fixes. Version 2.0 wasn’t as stable or reliable as it should’ve been, so v2.1 fixes some of those problems.<br><br>Thanks for your support!<br><br>## Become a Backer!<br><br>There is a new menu option for “Become a Backer”. Please do have a look!<br><br>Arc App is completely free to use, and does not collect or sell any of your personal data, and never will. Like many of you, I take data privacy seriously, and will never compromise on that. I also want the app to continue to be free.<br><br>Arc App it is a labour of love, built because it’s the app that I want for myself, and because I enjoy solving the technical challenges it presents.<br><br>But without financing, the project can’t last forever.<br><br>The more people supporting the project, the more time I can dedicate to building and improving it, and the more certainty we can have that the project will continue growing and improving instead of fading away.<br><br>So please do consider either becoming a backer or making a once off donation to support the project. Thanks so much!"},{"version_id":"827956924","version_name":"2.1.2","version_date":"2018-07-21 13:51:24.000 +0800","version_description":"- Cleaned up all those messy unprocessed timeline items that started appearing after v2.0<br>- Fixed more cases where the Moves data importer wasn't starting automatically"},{"version_id":"827969738","version_name":"2.1.3","version_date":"2018-07-24 15:37:41.000 +0800","version_description":"Another bug fixes release. Nothing new or exciting to see yet, just more fixes for silly mistakes ;)<br><br>- Fixed the weird untappable buttons on iPhone SE<br>- Stopped place choices from sometimes quietly reverting<br>- Fixed the disappearing private places<br>- More stability fixes"},{"version_id":"828004494","version_name":"2.1.4","version_date":"2018-07-29 01:43:12.000 +0800","version_description":"- Added thumbs up / thumbs down buttons to the timeline, for easier confirmations <br>- More tweaks to the Moves data importer to handle zip file variations<br>- Added year to search results<br>- Added the app version to the About view<br>- Added Foursquare and Facebook place links to the GPX files"},{"version_id":"828045685","version_name":"2.1.5","version_date":"2018-08-01 15:35:09.000 +0800","version_description":"- Moves data importer v2, for filling in any gaps missed by the first import, and adding calories and step counts to previously imported items<br>- Showing timeline item times in the item's local timezone in timeline view (eg for holidays in a different timezone from your usual)<br>- Using the whole screen for calendar view, for easier scrolling through lots of years"},{"version_id":"828094804","version_name":"2.1.6","version_date":"2018-08-08 01:55:28.000 +0800","version_description":"- Fixed the slow search view results and slow \"All Visits\" view loading. No more weird freezes. Yay!<br>- Added optional automatic daily JSON exports, along side the existing GPX exports. (See the Export menu in the calendar view).<br>- Previously exported auto daily GPX and JSON files are now updated when changes have been made in the app"},{"version_id":"828162130","version_name":"2.1.7","version_date":"2018-08-09 02:48:50.000 +0800","version_description":"Another bug fixes release! Lots of fixes for commonly reported problems and annoyances in this one. <br><br>- Fixed the searching for item notes, street address, and custom titles<br>- Fixed the problem that was stopping day summaries from updating when they should<br>- Fixed the problem of day summaries showing nonsense numbers for unused transport types<br>- Changed the trip distances to show more precise values, instead of simplified / rounded distances<br>- Stopped the processing engine from rudely merging our visits that have different places assigned"},{"version_id":"828178067","version_name":"2.1.8","version_date":"2018-08-10 04:18:04.000 +0800","version_description":"Slight JSON export file format change (center for places and visits is now encoded as only latitude/longitude)"},{"version_id":"828199520","version_name":"2.1.9","version_date":"2018-08-12 03:29:07.000 +0800","version_description":"- Added a URL scheme for opening the app (arcapp://)<br>- Stability and battery life improvements"},{"version_id":"828306232","version_name":"2.2.0","version_date":"2018-08-28 00:48:31.000 +0800","version_description":"# Arc App 2.2<br><br>Finally a feature release!<br><br>It’s not the biggest feature release ever, but hopefully you will agree that the new “confirm view” is rather nice, and much more pleasant to use than the old, cluttered confirm/correct/edit views.<br><br>Tap the new “2 unconfirmed” button at top right of the timeline view to quickly clean up the day’s timeline items, in the new easier to read and understand confirm views.<br><br>I’ve also added “tram” as a transport type. I’ve been laying the groundwork for adding tens more types, as well as custom types. So tram is just the first small step towards the fully expanded list, which should be arriving in other updates soon!<br><br>As always, thanks for all your support and enthusiasm for the project!<br><br>## The full list<br><br>- Redesigned confirmation / correction view for visits and trips<br>- Added tram to the transport types<br>- Show first line of item notes in the timeline view<br>- Tighter visit radiuses, to make them less greedy, and be less likely to swallow other nearby trips and visits<br>- Reverted the failed experiment of running the daily backups at lower priority. (iOS treated the lower priority as permission to just not do the backups at all, sometimes. Sigh)<br>- Improved battery use when at new places for the first time<br>- Trips with extremely uncertain transport type will now show as “transport” until confirmed, to avoid cluttering the timeline with bad guesses<br>- Fixed the overly aggressive edit locking, which was in some cases hiding the EDIT buttons for too long, in situations where it seemed unnecessary (and indeed was unnecessary!)"},{"version_id":"828494048","version_name":"2.2.2","version_date":"2018-09-07 02:47:13.000 +0800","version_description":"# IMPORTANT FUNDING NOTICE!<br>If you use Arc App regularly, and can afford to pay for it, tap \"Become a backer\" from the options menu, and support the project now.<br><br>Unlike most other free apps, Arc has a strict privacy policy, and does not collect or sell your personal data. There is no hidden or secret funding source that pays the bills. If you do not pay for it, I cover all of the costs myself. I cannot continue to do that.<br><br>Arc App is far from reaching its funding target, and is in danger of disappearing. If it does not reach that target soon, it will disappear. Until Arc reaches its funding target, I am paying all of the bills from my personal savings.<br><br>So if you don't want Arc to disappear, and can afford to pay for it, please do so now. Tap \"Become a backer\" the options menu, and support the project.<br><br>If you cannot afford to pay for Arc, that's fine! In that case, I am completely happy for you to continue to use the app for free. Those who can afford to pay should pay, as a matter of fairness. And those who cannot afford to pay should not be deprived of the same experiences or enjoyment.<br><br># Arc App 2.2.2<br><br>Fixed the crash on launch that some people people got with the 2.2.1 release. <br><br># Arc App 2.2.1<br><br>This update is mostly housekeeping. Lots of cleanup under the hood. The main change is a major under-the-hood upgrade to the Places database. Place names for visits should now appear immediately on app launch (except for the first launch after upgrade, during which there will be a brief database migration).<br><br># Other stuff<br><br>- Shows day of week in the title of timeline views<br>- Finally a more sensible icon on the button to close the full map view<br>- Faster processing after making changes on the new confirm view<br>- Fixed the date format in JSON export files<br>- Removed a bunch of unnecessary fields from the JSON exports<br>- Misc bug fixes, crash fixes, battery use optimisations, processing improvements, and UI speed ups"},{"version_id":"828501108","version_name":"2.2.3","version_date":"2018-09-08 02:09:14.000 +0800","version_description":"# IMPORTANT FUNDING NOTICE!<br>If you use Arc App regularly, and can afford to pay for it, tap \"Become a backer\" from the options menu, and support the project now.<br>Unlike most other free apps, Arc has a strict privacy policy, and does not collect or sell your personal data. There is no hidden or secret funding source that pays the bills. If you do not pay for it, I cover all of the costs myself. I cannot continue to do that.<br><br>Arc App is far from reaching its funding target, and is in danger of disappearing. If it does not reach that target soon, it will disappear. Until Arc reaches its funding target, I am paying all of the bills from my personal savings.<br><br>So if you don't want Arc to disappear, and can afford to pay for it, please do so now. Tap \"Become a backer\" the options menu, and support the project.<br><br>If you cannot afford to pay for Arc, that's fine! In that case, I am completely happy for you to continue to use the app for free. Those who can afford to pay should pay, as a matter of fairness. And those who cannot afford to pay should not be deprived of the same experiences or enjoyment.<br><br># Arc App 2.2.2, 2.2.3<br><br>Fixed the crash on launch that some people people got with the 2.2.1 release.<br><br># Arc App 2.2.1<br><br>This update is mostly housekeeping. Lots of cleanup under the hood. The main change is a major under-the-hood upgrade to the Places database. Place names for visits should now appear immediately on app launch (except for the first launch after upgrade, during which there will be a brief database migration).<br><br># Other stuff<br><br>- Shows day of week in the title of timeline views<br>- Finally a more sensible icon on the button to close the full map view<br>- Faster processing after making changes on the new confirm view<br>- Fixed the date format in JSON export files<br>- Removed a bunch of unnecessary fields from the JSON exports<br>- Misc bug fixes, crash fixes, battery use optimisations, processing improvements, and UI speed ups"},{"version_id":"828520838","version_name":"2.2.4","version_date":"2018-09-11 03:40:49.000 +0800","version_description":"# # IMPORTANT FUNDING NOTICE<br><br>If you use Arc App regularly, and can afford to pay for it, tap \"Become a backer\" from the options menu, and support the project now.<br><br>Unlike most other free apps, Arc has a strict privacy policy, and does not collect or sell your personal data. There is no hidden or secret funding source that pays the bills. If you do not pay for it, I cover all of the costs myself. I cannot continue to do that.<br><br>Arc App has not reached its funding target, and is in danger of disappearing. If it does not reach that target soon, it will disappear. Until Arc reaches its funding target, I am paying all of the bills from my personal savings.<br><br>So if you don't want Arc to disappear, and can afford to pay for it, please do so now. Tap \"Become a backer\" the options menu, and support the project.<br><br>If you cannot afford to pay for Arc, that's fine! In that case, I am completely happy for you to continue to use the app for free. Those who can afford to pay should pay, as a matter of fairness. And those who cannot afford to pay should not be deprived of the same experiences or enjoyment.<br><br># Arc App 2.2.4 Release Notes<br><br>### More details saved to Apple Health walking / running / cycling workouts<br><br>The “Save to workouts” button for these trips was not previously incrementing “Walking + Running Distance” or “Cycling Distance” in Apple Health. Now it does that correctly. <br><br>Make sure to grant Arc permission to write to those Health values when it asks!<br><br>### Bogus location data<br><br>I’ve added the much requested option for marking location data as “bogus”, for when your phone records location data that is so wildly wrong that no amount of mathematical magic can fix it. <br><br>To use this feature, either tap on the dot on the map for the nonsense data, or tap on its row in the “Recorded Activities” view. You will find the new “Bogus location data” option there. <br><br>This also means that stationary segment dots on the map are now tappable, for assigning to places, or changing activity type. <br><br># Arc App 2.2.1 Release Notes<br><br>This update is mostly housekeeping. Lots of cleanup under the hood. The main change is a major under-the-hood upgrade to the Places database. Place names for visits should now appear immediately on app launch (except for the first launch after upgrade, during which there will be a brief database migration).<br><br># Other stuff<br><br>- Shows day of week in the title of timeline views<br>- Finally a more sensible icon on the button to close the full map view<br>- Faster processing after making changes on the new confirm view<br>- Fixed the date format in JSON export files<br>- Removed a bunch of unnecessary fields from the JSON exports<br>- Misc bug fixes, crash fixes, battery use optimisations, processing improvements, and UI speed ups"},{"version_id":"828693277","version_name":"2.2.5","version_date":"2018-09-27 14:03:07.000 +0800","version_description":"## IMPORTANT FUNDING NOTICE ##<br><br>If you use Arc App regularly, and can afford to pay for it, tap \"Become a backer\" from the options menu, and support the project now.<br><br>Unlike most other free apps, Arc has a strict privacy policy, and does not collect or sell your personal data. If you do not pay for it, I cover all of the costs myself. I cannot continue to do that.<br><br>Arc App has not reached its funding target, and if it does not do so soon, it will disappear. My savings are all gone, and I cannot continue to pay the bills alone.<br><br>So if you can afford to pay for it, please do so now. Tap \"Become a backer\" the options menu, and support the project.<br><br>If you cannot afford to pay for Arc, that's fine! In that case, I am completely happy for you to continue to use the app for free. Those who can afford to pay should pay, as a matter of fairness. And those who cannot afford to pay should not be deprived of the same experiences or enjoyment.<br><br>## Arc App 2.2.5 Release Notes<br><br>This release adds eight more activity types! Tractor, tuk-tuk, songthaew, skateboarding, inline skating, snowboarding, skiing, and horseback.<br><br>## Other Changes<br><br>- Added back the option to set a visit's custom title to the street address<br>- Added next and previous place names to confirm view, for context<br>- Moving segments can be marked as bogus, the same as stationary segments<br>- Search view now allows two letter searches<br>- Faster timeline item confirms and edits<br>- Faster backups and restores<br>- Misc bug fixes and minor tweaks"},{"version_id":"828781032","version_name":"2.2.6","version_date":"2018-10-02 06:07:25.000 +0800","version_description":"## Arc App 2.2.6 Release Notes<br><br>Various performance improvements. Snappier, less laggy! <br><br>And the usual housekeeping, minor bug fixes, etc. <br><br>## Arc App 2.2.5 Release Notes<br><br>This release adds eight more activity types! Tractor, tuk-tuk, songthaew, skateboarding, inline skating, snowboarding, skiing, and horseback.<br><br>## Other Changes<br><br>- Added back the option to set a visit's custom title to the street address<br>- Added next and previous place names to confirm view, for context<br>- Moving segments can be marked as bogus, the same as stationary segments<br>- Search view now allows two letter searches<br>- Faster timeline item confirms and edits<br>- Faster backups and restores<br>- Misc bug fixes and minor tweaks"},{"version_id":"828840042","version_name":"2.2.7","version_date":"2018-10-13 03:35:01.000 +0800","version_description":"This update is a housekeeping release, for fixing the UI slowness and background unreliability that some users have experienced in the previous update."},{"version_id":"828938022","version_name":"2.2.8","version_date":"2018-10-18 04:54:20.000 +0800","version_description":"This one's another maintenance release, for fixing a bunch of minor bugs. <br><br>NOTE: A handful of people have been experiencing extremely slow UI and processing in Arc since the 2.2.5 update. If you're experiencing this, I'm aware of the problem, and I'm on the case! I've doing everything I can to find the cause and get it fixed as soon as possible!<br><br>I don't think this update will fix the slowness (or at least, it hasn't fixed it for any of the remote testing team who are experiencing the problem). But I've at least eliminated a bunch of \"welp, I guess that's not it\" possibilities, by fixing a bunch of minor bugs that I thought might be the cause. Hopefully I'll find the real cause tomorrow, and get another update out soon. (There's only so many corners it can be hiding in!)<br><br>## Misc fixes<br><br>- Fixed the editing of private place names<br>- Stopped duplicate places showing in place change lists<br>- Fixed the problem of backer purchases getting forgotten. (Tap the \"Restore\" button on the Backers view - this time it'll work properly!)"},{"version_id":"828981682","version_name":"2.2.9","version_date":"2018-10-19 16:12:30.000 +0800","version_description":"This update fixes the mystery slowness bug! Yay! I finally found it :D<br><br>For the technical minded in the audience: The problem wasn't to do with anything added in recent updates, which is why I was looking in all the wrong places for the source of the problem. It turns out it was a frequently used SQL query that's been around since forever, but the SQLite query planner was poorly optimising (due to reasons). It just coincidentally hit its \"too slow\" threshold and created cascading failures around the time of one of the recent releases. So in this release I've now added a multi-column index which makes the query planner happy again.<br><br>There's also another fix for backers who're even *still* being asked to back the app again. Tap the \"Restore\" button again on the backer view again, and this time it'll definitely for sure this time stop bugging you, if you're already a backer."},{"version_id":"829004980","version_name":"2.2.10","version_date":"2018-10-22 06:34:59.000 +0800","version_description":"The 2.2.9 update solved the slow UI problems for some people, but not everyone! So I went back to hunting, and found another possible cause, and got that fixed too."},{"version_id":"829046954","version_name":"2.2.11","version_date":"2018-10-25 04:50:21.000 +0800","version_description":"This update has some more performance improvements. And adds the \"scooter\" activity type."},{"version_id":"829090110","version_name":"2.2.12","version_date":"2018-10-29 00:01:06.000 +0800","version_description":"Hopefully fixed the daylight savings bug!"},{"version_id":"829174693","version_name":"2.2.13","version_date":"2018-11-06 12:07:48.000 +0800","version_description":"Minor bug fixes that no one will notice. And some equally minor tweaks that might help to reduce the chances of the app getting killed by iOS 12 on newer phone models."},{"version_id":"829200723","version_name":"2.2.14","version_date":"2018-11-08 12:23:22.000 +0800","version_description":"For people with iPhone X, XS, XS Max, XR, 8, and 8 Plus phones who have been experiencing frequent \"Arc has stopped recording\" messages, this update should help improve the situation. <br><br>I finally found the cause of the problem! The cause is not in Arc itself, the problem is instead a bug in iOS 12. So the proper fix will require an iOS update. But while we're waiting for that iOS update, this Arc update is designed to work around the problem as best as is possible. <br><br>This update also adds the often requested \"metro\" activity type. <br><br>Thanks for all your support!"},{"version_id":"829250039","version_name":"2.2.15","version_date":"2018-11-10 17:41:32.000 +0800","version_description":"For people with iPhone X, XS, XS Max, XR, 8, and 8 Plus phones who have been experiencing frequent \"Arc has stopped recording\" messages, this update should help improve the situation.<br><br>I finally found the cause of the problem! The cause is not in Arc itself, the problem is instead a bug in iOS 12. So the proper fix will require an iOS update. But while we're waiting for that iOS update, this Arc update is designed to work around the problem as best as is possible.<br><br>Thanks for all your support!"},{"version_id":"829254473","version_name":"2.2.16","version_date":"2018-11-11 19:02:09.000 +0800","version_description":"## Arc 2.2.16<br><br>This release includes subtle improvements to the timeline item processing, and minor background reliability improvements.<br><br>Basically it's another tweaks and fixes release, to help cope more reliably with the iOS 12 problem mentioned below. Also there's the processing improvements, which aren't related to any of that iOS 12 bug stuff, but were safe enough to squeeze in, so hey, why not. <br><br>## Arc 2.2.13, 2.2.14, 2.215<br><br>For people with iPhone X, XS, XS Max, XR, 8, and 8 Plus phones who have been experiencing frequent \"Arc has stopped recording\" messages, this update should help improve the situation.<br>I finally found the cause of the problem! The cause is not in Arc itself, the problem is instead a bug in iOS 12. So the proper fix will require an iOS update. But while we're waiting for that iOS update, this Arc update is designed to work around the problem as best as is possible.<br><br>Thanks for all your support!"},{"version_id":"829296467","version_name":"2.2.17","version_date":"2018-11-15 16:24:42.000 +0800","version_description":"## Arc 2.2.17<br><br>- Performance optimisations<br>- Reliability improvements (more tweaks to work around the iOS 12 bug affecting owners of new model phones)<br>- Timeline processing improvements<br><br>## Arc 2.2.16<br><br>This release includes subtle improvements to the timeline item processing, and minor background reliability improvements.<br><br>Basically it's another tweaks and fixes release, to help cope more reliably with the iOS 12 problem mentioned below. Also there's the processing improvements, which aren't related to any of that iOS 12 bug stuff, but were safe enough to squeeze in, so hey, why not.<br><br>## Arc 2.2.13, 2.2.14, 2.215<br><br>For people with iPhone X, XS, XS Max, XR, 8, and 8 Plus phones who have been experiencing frequent \"Arc has stopped recording\" messages, this update should help improve the situation.<br><br>I finally found the cause of the problem! The cause is not in Arc itself, the problem is instead a bug in iOS 12. So the proper fix will require an iOS update. But while we're waiting for that iOS update, this Arc update is designed to work around the problem as best as is possible.<br><br>Thanks for all your support!"},{"version_id":"829413494","version_name":"2.2.19","version_date":"","version_description":""},{"version_id":"829489627","version_name":"2.3.0","version_date":"2018-12-03 08:17:55.000 +0800","version_description":"This update adds cable car, funicular, chairlift, and ski lift. <br><br>There's also the usual minor bug fixes, performance improvements, and that sort of thing. Stuff that you'll probably never notice, but help to make the general experience more happy."},{"version_id":"829605592","version_name":"2.3.1","version_date":"2018-12-12 14:08:21.000 +0800","version_description":"Arc now monitors the thermal state of your phone (ie how hot it is), and dynamically adjusts its processing and recording to suit the thermal conditions.<br><br>A note on data gaps and \"Arc has been stopped\" notifications: <br><br>If you are experiencing frequent notifications that Arc has been stopped by iOS, or frequent data gaps, and you own a newer model phone (iPhone 8, X, or newer), please contact Apple support, quoting bug number 45805073. <br><br>Apple have yet to acknowledge the iOS 12 bug that is causing increased instability and unreliability for background apps on newer model phones. Perhaps it's time they heard from more of us!"},{"version_id":"829665062","version_name":"2.3.2","version_date":"2018-12-17 03:30:23.000 +0800","version_description":"## 2.3.2<br><br>Hopefully fixed the crash during launch that is affecting a small number of people. <br><br>## 2.3.1<br><br>Arc now monitors the thermal state of your phone (ie how hot it is), and dynamically adjusts its processing and recording to suit the thermal conditions.<br><br>A note on data gaps and \"Arc has been stopped\" notifications:<br><br>If you are experiencing frequent notifications that Arc has been stopped by iOS, or frequent data gaps, and you own a newer model phone (iPhone 8, X, or newer), please contact Apple support, quoting bug number 45805073.<br><br>Apple have yet to acknowledge the iOS 12 bug that is causing increased instability and unreliability for background apps on newer model phones. Perhaps it's time they heard from more of us!"},{"version_id":"832250482","version_name":"3.0.1","version_date":"2019-08-10 11:31:22.000 +0800","version_description":"# Arc 3.0.1<br><br>- \"View in activity\" and \"View in timeline\" options, to jump between Activity and Timeline tabs with the same date range<br>- Responsiveness and stability improvements<br>- Added more place category icons <br><br># Welcome to Arc 3.0, our biggest update ever!<br><br>We have completely rethought and redesigned the app’s interface, updating every single view, making the app easier to use, and common tasks faster and more convenient. <br><br>The timeline view now includes not only daily timelines but also weekly, monthly, and yearly. View maps of entire months of your travels, or even entire years. And scroll down to see your day’s photos directly in the new daily timeline design.<br><br>The activity summaries also now support daily, weekly, monthly, and yearly summaries for every activity type. The new activity summary details views provide a wealth of new statistics and analysis, as well as maps for the chosen date range and activity type. <br><br>The new Overview tab summarises both the activities and places in each day, and allows you to favourite specific days then find them again easily in the calendar. <br><br>The new Settings tab contains new map settings for switching between different map styles, including custom Mapbox styles.<br><br>The new timeline view options menu makes it easy to export chosen date ranges to GPX and JSON, making it possible to export entire months or years, for analysis in third party apps and services.<br><br>## More<br><br>- Path lines are now tappable on the map, for direct editing from the map view<br>- Added new swimming, golf, wheelchair, and taxi activity types<br>- Force Touch timeline items to open a quick access menu of common actions<br>- Tap the times on timeline view to toggle between display of start times only and both start and end times<br><br>## Thanks!<br><br>A massive thanks to all the Arc private beta testers and public testers who provided invaluable feedback throughout the development of this major release! <br><br>And thanks also to all the Arc Backers who have kept the project alive and funded, making possible the development of a release of this scale!<br><br>## Feedback<br><br>For any feedback, bug reports, or otherwise, please feel free to contact me via the “Feedback &amp; Support” button on the Settings tab. Emails sent from there will include essential debug information that helps to track down the source of any potential problems."},{"version_id":"832336281","version_name":"3.0.2","version_date":"2019-08-21 15:13:38.000 +0800","version_description":"# Arc 3.0.2 <br><br>- Added Map Settings options for allowing map tilt and rotate<br>- Added rowing and kayaking activity types<br>- Added more place category icons<br><br># Arc 3.0.1<br><br>- \"View in activity\" and \"View in timeline\" options, to jump between Activity and Timeline tabs with the same date range<br>- Responsiveness and stability improvements<br>- Added more place category icons<br><br># Welcome to Arc 3.0, our biggest update ever!<br><br>We have completely rethought and redesigned the app’s interface, updating every single view, making the app easier to use, and common tasks faster and more convenient.<br><br>The timeline view now includes not only daily timelines but also weekly, monthly, and yearly. View maps of entire months of your travels, or even entire years. And scroll down to see your day’s photos directly in the new daily timeline design.<br><br>The activity summaries also now support daily, weekly, monthly, and yearly summaries for every activity type. The new activity summary details views provide a wealth of new statistics and analysis, as well as maps for the chosen date range and activity type.<br><br>The new Overview tab summarises both the activities and places in each day, and allows you to favourite specific days then find them again easily in the calendar.<br><br>The new Settings tab contains new map settings for switching between different map styles, including custom Mapbox styles.<br><br>The new timeline view options menu makes it easy to export chosen date ranges to GPX and JSON, making it possible to export entire months or years, for analysis in third party apps and services.<br><br>## More<br><br>- Path lines are now tappable on the map, for direct editing from the map view<br>- Added new swimming, golf, wheelchair, and taxi activity types<br>- Force Touch timeline items to open a quick access menu of common actions<br>- Tap the times on timeline view to toggle between display of start times only and both start and end times<br><br>## Thanks!<br><br>A massive thanks to all the Arc private beta testers and public testers who provided invaluable feedback throughout the development of this major release!<br><br>And thanks also to all the Arc Backers who have kept the project alive and funded, making possible the development of a release of this scale!<br><br>## Feedback<br><br>For any feedback, bug reports, or otherwise, please feel free to contact me via the “Feedback &amp; Support” button on the Settings tab. Emails sent from there will include essential debug information that helps to track down the source of any potential problems."},{"version_id":"832585036","version_name":"3.0.3","version_date":"2019-09-01 08:15:24.000 +0800","version_description":"- Fixed some cases where activity summaries weren't updating when they should<br>- Added more place category icons<br>- Stability improvements"},{"version_id":"832706779","version_name":"3.0.4","version_date":"2019-09-10 18:48:50.000 +0800","version_description":"- Fixed the Settings menu not updating after turning on or off recording<br>- Sped up the loading of place results on the visit confirm / edit view<br>- Added more place category icons"},{"version_id":"839359911","version_name":"3.4.3","version_date":"2020-11-27 02:43:48.000 +0800","version_description":"- Various bug fixes and stability improvements<br>- Lots of prep work for the new backups system"}]