[{"version_id":"815655316","version_name":"1.0.1","version_date":"2016-01-05 00:47:17.000 +0800","version_description":"We've squashed a bunch of bugs in this version. Thanks for all the feedback! Keep letting us know your thoughts on the app, we really appreciate it."},{"version_id":"815761946","version_name":"1.0.2","version_date":"2016-03-12 00:04:03.000 +0800","version_description":"FIXED<br>- We've fixed a crash when deleting a meditation from your Studio<br>- Changes to Settings now stick<br><br>NEW<br>- We've updated our new user intro tour<br>- Compatibility to install our iPhone app on your iPad<br><br>We’re loving your feedback—keep it coming!"},{"version_id":"817350535","version_name":"1.1","version_date":"2016-05-23 16:46:44.000 +0800","version_description":"NEW<br>- 50+ New meditations <br>- 9 New Teachers: Cassandra Vieten, Julie Campilio, Sarah Plummer Taylor, Pamela Stokes Eggleston, Stefanie Goldstein, Lisa Wimberger, Beryl Bender Birch, Charlotte Reznick, and Lodro Rinzler <br>- 5 New Collections: Relationships, Long Breaks, Just for Moms, Just for Kids, Just for First Responders<br>- Link to Untangle by Gaiam Podcast in Settings<br>- Sort order for Teachers, now ordered by number of meditations<br>- Updated UI for Schedule tab and Logbook<br><br>FIXED<br>- Minor Bug Fixes<br>- Background sounds updated to loop seamlessly<br>- Descending order of Course sessions in Studio"},{"version_id":"818657813","version_name":"1.2","version_date":"2016-09-21 17:28:24.000 +0800","version_description":"iOS 10 compatibility<br>Health app activity now appears in the new Mindfulness category under \"Mindful Minutes\"<br>Big bug fix! Updates won’t get stuck on the update screen anymore. Sorry about that.<br>Scheduling is easier and prettier than ever!"},{"version_id":"820800091","version_name":"1.3","version_date":"2017-03-08 19:28:17.000 +0800","version_description":"SEARCH - Easily filter meditations by Duration, Type or Teacher<br>ENDING SOUNDS - Choose from a selection of sounds to indicate the end of a meditation<br>3D TOUCH - Play your Most Recent, Most Played and next Scheduled mediation session right from your homescreen or Search to quickly find a meditation to suit your mood<br><br>NEW CONTENT<br>40+ New Meditations (including many longer ones!)<br>2 New Collections: Just for Teens and Just for Quarterlife<br>4 New Teachers: Cara Bradley, Chris Willard, Coby Kozlowski and Janet Curry"},{"version_id":"821322772","version_name":"1.3.1","version_date":"2017-05-22 13:38:18.000 +0800","version_description":"Now available on iPad! Meditate on a larger screen with all of your favorite collections, courses and teachers."},{"version_id":"822556638","version_name":"1.3.2","version_date":"2017-07-21 21:06:42.000 +0800","version_description":"Updated iPad to add landscape orientation. (Thank you for your patience.)<br>Slimmed up our app package to make more room for your meditations.<br>Squashed some bugs."},{"version_id":"823748286","version_name":"1.3.3","version_date":"2017-09-23 00:05:10.000 +0800","version_description":"Our app is now ready for iOS11!"},{"version_id":"825364754","version_name":"1.4.0","version_date":"2017-12-19 17:04:37.000 +0800","version_description":"Something new for everyone with our biggest feature release of this year!<br>- Want to kick-start your practice? Enjoy our brand new 10-Day Starter Series with Elisha Goldstein<br>- Looking to deepen your practice? Check out our new Unguided feature, where you can create custom meditations with start, interval and ending sounds, and select a favorite background sound.<br>- Ready for some relaxing background music? Enjoy our new and exclusive Music tracks.<br>- Want to explore? Enjoy a sampling of our favorite Guided Meditations in the new Discover collection.<br>Enjoy!"},{"version_id":"825403259","version_name":"1.4.1","version_date":"2017-12-22 17:06:42.000 +0800","version_description":"- Fix for Legacy users: If you believe you should have access as a Legacy user please go to Studio, Settings in the top left and Restore Purchase. You may be prompted for your iTunes password to verify your original purchase date. Your access to the appropriate level of content will be restored and meditations will now be unlocked. If you continue to experience issues please email us at support@meditationstudioapp.com with your unique ID from the Help &amp; Support Settings menu. (Thanks for your patience.)<br>- Bug fixes<br><br>Something new for everyone with our biggest feature release of this year!<br>- Want to kick-start your practice? Enjoy our brand new 10-Day Starter Series with Elisha Goldstein<br>- Looking to deepen your practice? Check out our new Unguided feature, where you can create custom meditations with start, interval and ending sounds, and select a favorite background sound.<br>- Ready for some relaxing background music? Enjoy our new and exclusive Music tracks.<br>- Want to explore? Enjoy a sampling of our favorite Guided Meditations in the new Discover collection.<br>Enjoy!"},{"version_id":"826054374","version_name":"1.7.0","version_date":"2018-03-05 13:13:39.000 +0800","version_description":"Favorites are here, plus brand NEW Meditations for Leadership and College!<br>- NEW Favorite functionality. You can now easily mark and quickly identify your most loved meditations. (ps. Thanks to all of you who requested this feature.)<br>- NEW Leadership collection; designed to inspire and empower you to fully embrace your authentic leadership style.<br>- NEW College collection; designed to support students in many new situations, whether entering or exiting the college experience.<br>- March’s featured collection is Be Your Best Self; designed to help you be your best self every single day.<br><br>RECENTLY ADDED<br>- NEW Collections: Mindful Eating and Work<br>- NEW Courses: Sleep Basics and Mindful Work<br>- NEW Teachers: Mindfulness meditation teacher, Kate Johnson; expert yogi and thought-leader Dianne Bondy; therapist and mindfulness expert, Giselle Jones; New Zealand musician Franko Heke; and Australia’s top mindfulness teacher Melli O’Brien<br>- NEW Original Meditations from our regular experts like Chrissy Carter, Ashley Turner, Noah Levine, Chodo Campbell, Pamela Stokes Eggleston and Hugh Bryne<br><br>---------------------------------------<br>FAVORITES DETAILS<br>Simply tap the heart on the player to mark any meditation as your favorite. There will now be a heart in your meditation circle within lists for quick identification of your favorites. Sort by Favorites in your Studio, a Collection or Teacher Detail, and Search lists.<br><br>NEW ‘NEW MEDITATIONS’ DETAILS<br>While we were at it...in addition to adding a way to remember your favorites, we updated how we identify newly added content. Now, we have a new ‘NEW’ in the meditation circle within lists to identify content that has been recently added (within the last 2 to 3 months). Like Favorites, you will see NEW in your meditation circle for quick identification of newly released meditations and be able to sort by meditations by NEW in your Studio and other lists of meditations. The old NEW, which identified Meditations that you ‘downloaded but had not listened to’ has now gone away (it was too confusing).<br><br>NOTE<br>If you favorite any NEW content, the heart will override the NEW within the meditation circle (the circle isn’t big enough to show everything :-))<br><br>NEW BANNER DETAILS<br>We also wanted to highlight both new Collections, as well as existing Collections that have new meditations added to them. You will now see a banner on the Collection scribbles highlighting ‘NEW’ when the entire Collection of meditations is new or ‘# NEW’ noting how many new meditations have been added to an existing Collection.<br><br>BACKGROUND SOUND ICON DETAILS<br>And lastly, we have a new Music icon in the player. If you haven’t noticed our brand new (pretty amazing) music and ambient sound tracks, you’ll now see that we’ve updated our icon to a musical note. We’ve moved the icons to the bottom of the player, for easier access and no more stretching; right next to that cute little heart for adding a favorite.<br><br>Please Enjoy -- and let us know your feedback or comments at founders@meditationstudioapp.com"},{"version_id":"826743673","version_name":"1.8.1","version_date":"2018-04-23 08:06:31.000 +0800","version_description":"FIXED<br>- We've squashed a bug that caused the Player to start a few seconds into a meditation on occasion.<br><br>NEW COLLECTIONS<br>- Mantra collection; explore a technique that uses words or phrases as a way to focus and inspire you. - Earth Day collection; celebrate our connection to nature and find gratitude with a collection of meditations created Just For Earth Day.<br>NEW TEACHER - Taylor White Moffitt; therapist and yoga teacher.<br><br>FEATURED COLLECTIONS April has two featured collections: - Make Today Amazing; a selection of meditations designed to start your day with a little inspiration. - Work Hacks; designed to boost your productivity and help you become more focused and creative during your workday.<br><br>FEATURES - Social Sharing; share your favorite meditations with friends right from the player.<br><br>ADDED IN 2018 - NEW Collections: original Leadership, College, Mindful Eating and Work - NEW Courses: original Sleep Basics and Mindful Work - NEW Teachers: Mindfulness meditation teacher, Kate Johnson; expert yogi and thought-leader Dianne Bondy; therapist and mindfulness expert, Giselle Jones; New Zealand musician Franko Heke; and Australia’s top mindfulness teacher Melli O’Brien - NEW Original Meditations from our regular experts like Chrissy Carter, Ashley Turner, Noah Levine, Chodo Campbell, Pamela Stokes Eggleston and Hugh Bryne"},{"version_id":"826846966","version_name":"1.9.0","version_date":"2018-04-28 10:25:28.000 +0800","version_description":"NEW IN MAY<br>- Kids Meditations; Franko Heke lends his New Zealand accent to these beautiful meditations designed to get your little ones into a peaceful slumber<br>- Entrepreneurs Collection; created to support the unique needs of entrepreneurs as they face the everyday challenges of creating and scaling their businesses<br>- Teacher Christina Dufour; corporate wellness guide, mindful life coach, and an award-winning entrepreneur<br><br>FEATURED COLLECTIONS<br>May has two Featured Collections:<br>- Happiness Hacks; get your happy on with these guided meditations designed to shift any mood<br>- Tools for Students; explore these meditations selected to help you manage end of school year challenges and stress<br><br>ADDED IN 2018<br>- NEW Collections; Mantra, Leadership, College, Eating and Work<br>- NEW Courses; Sleep Basics and Mindfulness at Work<br>- NEW Teachers; Mindfulness meditation teacher, Kate Johnson; expert yogi and thought-leader Dianne Bondy; therapist and mindfulness expert, Giselle Jones; New Zealand musician Franko Heke; and Australia’s top mindfulness teacher Melli O’Brien<br>- NEW Original Meditations from our regular experts like Chrissy Carter, Ashley Turner, Noah Levine, Chodo Campbell, Pamela Stokes Eggleston and Hugh Bryne"}]