[{"version_id":"815915379","version_name":"1.1","version_date":"2016-01-14 19:08:32.000 +0800","version_description":"• Taming multipliers! You can now adjust the taming calculator based on your server's settings. Tap \"settings\" at the bottom of the app to adjust.<br>• Narcoberry estimates, in addition to Narcotics.<br>• Fixed iOS 8 issue where Dododex would immediately crash upon launching. (Sorry!)<br>• Fixed flash that would sometimes happen after launching app.<br>• Various minor visual changes.<br>• Earlier this week: Procoptodon has been added!<br><br>Have a feature request? Share it here: chacy.com/dododex<br><br>Dodo Fact #1: The dodo only ever inhabited the island of Mauritius in the Indian Ocean."},{"version_id":"816310715","version_name":"1.2","version_date":"2016-02-03 16:47:59.000 +0800","version_description":"Custom weapon damage is here! The most highly requested feature was the ability to add your own weapons with a custom damage amount.  Now, Dododex knock-out estimates are personalized to you!<br><br>Also in this update:<br>- A “done” button to dismiss the iOS keyboard. (Popular request!) <br>- Tap on a food to quickly calculate taming for ONLY that food. (Another commonly requested feature!)<br>- Add your own character melee damage by visiting Settings. (Currently only applies to the Wooden Club.)<br>- Corrected Quetzal Kibble recipe and a few other data errors. (Thanks for spotting, Raver90 and Jason.B.)<br>- Increased max level to 200.<br>- The Oviraptor has been added. Thanks for the 4-star App Store review, FlipinMudkip: “No oviraptor? This isn't amateur hour.” Do I get 5 stars now? ;)<br><br>Dodo Fact #2: It wasn’t until 2007 that a complete skeleton of a dodo bird was found. The specimen was named \"Fred\" after the man who found it."},{"version_id":"816494592","version_name":"1.3","version_date":"2016-03-01 20:48:46.000 +0800","version_description":"- Non-violent taming is finally here! Now you know how much of your poop to hand-feed to a beetle!<br>- Breeding times! Raising a baby Giganotosaurus? Now Dododex will tell you how many weeks that'll take you.<br>- Egg incubation temperatures! Keep them eggs warm and cozy!<br>- Improved accuracy of narcotics/narcoberries required.<br><br>Also in this update:<br>- Minor visual tweaks. Buttons look more clickable.<br>- Over the past few weeks, new creatures were added and data errors were fixed. (These updates happen live and don’t require a new app version).<br>- You can now easily report data errors from the “About” section of the app.<br><br>Did you know? Dododex is now on Android! Tell your tribemates!<br><br>Dododex App Store Review of The Month: \"I stole a fertilized Giganotosaurus egg on a PVP official server, I was chased by two tribes, as the last rocket hit my raft I ate the egg, and heard the enemy scream.\" —5 star rating by RORK91<br><br>Dodo Fact #3: Researchers believe that dodo birds were monogamous creatures, likely only having one mate their entire life. That is... until 2015 when humans started building cruel Dodo egg farms with 50 females and 1 male. ;)"},{"version_id":"816707374","version_name":"1.3.1","version_date":"2016-03-16 22:44:54.000 +0800","version_description":"- By popular demand, pictures of every creature have been added!<br>- Kibble flow chart!<br>- Creature data is now stored locally on your device, speeding up app load times!<br>- Increased loading speed of images, making them as fast as a Gallimimus.<br>- Fixed an issue some users were having that prevented images from loading.<br><br>Thank you all for the reviews and support! If you'd like to share your feedback on what features you'd like to see next, vote here: http://dododex.com/feedback<br><br>Dodo Fact #4: The extinction of dodo birds was actually quite recent. The last sightings of the birds were in the late 1600s."},{"version_id":"816801945","version_name":"1.3.2","version_date":"2016-03-25 13:48:18.000 +0800","version_description":"- Breeding multipliers are here! A popular request!<br>- You can now open the official wiki page for any creature! Another common request!<br>- When you close the app, it'll now remember the last selected creature and level you were on.<br>- Coming soon: starve timer! (The most popular feature request!)<br><br>Also in this update:<br>- Narcotics calculator now focuses on the minimum amount required. (Don't worry, the maximum is still there!) <br>- Various data accuracy fixes including Dung Beetle and Oviraptor. (Thanks for the reports! Keep them coming!)  <br>- Dododex now shows a few tips on how to use the app.<br>- Toggle button between celsius and fahrenheit is more obvious.<br>- Removed knock-out information for non-tamable creatures like the Titanboa.<br>- Fixed bug where creature data wouldn't automatically update.<br><br>What features would you like to see next? Vote and share your feedback: dododex.com/feedback<br><br>Dododex just reached 100,000 downloads!<br><br>Dodo Fact #5: Dodo birds are often depicted as fat, however, modern scientists believe this is exaggerated. It is believed that descriptions and drawings of the bird were referencing overfed, captive birds."},{"version_id":"817071251","version_name":"1.4","version_date":"2016-04-23 00:36:55.000 +0800","version_description":"Dododex's biggest version since launch! This version includes:<br><br>- Starve timer (one of the most requested features!)<br>- Base creature stats (stat calculator coming soon!)<br>- \"Carryable by\" section that shows you which flyers can pick up a dino<br>- List of creatures and which flyers can pick them up (great for pen taming!)<br>- Stat comparison that lets you see how a creature's base stats rank against other creatures<br>- Island map with biomes and cave locations (thanks to smallsiren on Reddit for providing!)<br>- Chart of creatures with headshots and damage modifiers<br>- Increased max creature level to 300 to support popular mods (common request!)<br>- New item: Electric Prod! (Thanks for the suggestion, Index154!)<br><br>Bug fixes and other improvements:<br>- Improved narcotics estimates causing overestimation for many creatures (thanks for noticing, R.A. Schmid!)<br>- Increased max dino level after taming to +61 (patch 239 change)<br>- \"Report Data Error\" form now loads within app<br>- Fixed bug where mating interval multiplier was reversed<br>- Added support for international keyboards where commas are used as decimal marks (thanks, Orilby!)<br>- Fixed \"JSON parse error\" bug that caused app to not load for a period of time<br>- Fixed bug where temperature selection would be saved until you close the app.<br>- Fixed bug where \"Check for New Data\" button would sometimes not check for new data (YOU HAD ONE JOB!)<br><br>Dodo Fact #6: It was once believed that white dodo birds existed, however, researchers think that the early reports of the white dodo were actually referring to the Réunion ibis, an extinct white bird that inhabited the same island as the dodos."},{"version_id":"817337920","version_name":"1.5","version_date":"2016-05-13 00:27:44.000 +0800","version_description":"• Stat Calculator — See how a wild dino's stats have been distributed. (Also available on dododex.com!)<br>• \"Probability of Death\" — Dododex's new and original formula will calculate the probability that each weapon will kill a dino rather than knocking it out.<br>• Feeding intervals for non-violent taming — Shows you how long you need to wait before feeding that beetle another poop.<br>• More stats including melee damage and speeds.<br>• Dino summaries — Summaries on what makes each creature unique. (Only available for some creatures. More added weekly!)<br>• XP per kill — Find out how much experience is gained for killing each creature. (Thanks, SkyKiwi!) <br>• Tabbed sections — The Kibble, Stats, and Saddle sections now have tabs so less scrolling is required.<br>• Slightly larger creature images — So you can see how woolly that rhino really is. ;)<br><br>Bug fixes and other improvements:<br>• Fixed bug that would cause some users to only see a blank screen.<br>• Fixed bug where breeding times would sometimes display \"Tomorrow\" when it was actually two days away. (Thanks for spotting, Josh!)<br>• Performance improvements when switching between creatures, levels, and screens.<br>• Improved accuracy of taming estimates that was causing some bonus level estimates to be off by 1.  (Thanks for spotting, DmpTrkDrvr!)<br>• Images added for newest creatures (new creatures have already been added and don't require App Store updates).<br><br>What would you like to see next on Dododex? Vote here: dododex.com/feedback<br><br>Dodo Fact #7: In 2005, researches excavated a swamp that was covered up by the British to prevent malaria hundreds of years ago. Bones from at least 17 dodos were found. These findings were sent to museums around the world."},{"version_id":"817682316","version_name":"1.6","version_date":"2016-06-07 20:44:35.000 +0800","version_description":"• Torpor timer: Calculate and track how long you have until that dino wakes up! (One of the top requests!)<br>• New weapons: Pachy, Beelzebufo, Pulmonoscorpius, Fists! (Another top request!)<br>• Switch between a level picker and text input<br>• Redesigned weapon editor, including the ability to delete default weapons, and custom weapon and dino names!<br>• The Center map<br>• Design uplift!<br>• Redesigned timers<br>• Knock-out estimates are grayed out if there’s a high chance a weapon will kill a creature<br>• Added feature to rate a creature’s gathering efficiency. Dododex’s gathering efficiency database includes over 20,000 ratings from 1,200 players!<br><br>ALSO:<br>• Added support for creatures with both violent and non-violent taming. Non-violent Diplo data coming soon!<br>• Improved taming effectiveness calculations<br>• Stat calculator now properly calculates above/below averages “wasted stats” when there are more than 1 wasted stats<br>• Fixed bug where breeding timer would sometimes label today’s date as “tomorrow”  <br>• Added warning when you add too much food<br>• Added breeding data for several more creatures<br>• Fixed error where Dunkleosteus KO estimates were really low  <br>• Fixed various performance, speed, and crashing issues<br><br>Thanks for the 200,000 downloads across all platforms!<br><br>What features would you like to see added next? Vote here: dododex.com/feedback<br><br>Dodo Fact #8: It is believed that dodo birds would sometimes ingest stones to help digest foods."},{"version_id":"817703432","version_name":"1.6.1","version_date":"2016-06-09 07:55:06.000 +0800","version_description":"• Find out how much experience you gain for killing each creature. (Thanks to SkyKiwi on Reddit for the calculations!)<br>• Fixed issue where \"also preferred by\" section would not show under creature's preferred Kibble. (Thanks, Aaron!)<br>• Fixed calculation error where KO estimates for Pachy, Frog, and Scorpion were way too high, and the \"chance of death\" was almost always around 100%. (Thanks for spotting, roithe and rawrreddit!)<br>• Fixed ad display issue."},{"version_id":"817934728","version_name":"1.7","version_date":"2016-07-07 02:14:33.000 +0800","version_description":"NOTE: Dododex Pro will be released in the coming hours. Stay tuned! :)<br><br>- By popular demand, you can now go ad-free with Dododex Pro!<br>- Gathering efficiency ratings of every creature using data contributed by 10,000+ Dododex users!<br>- Find out which creatures can damage thatch, wood, stone, or metal. (Suggested by Keith L)<br>- Find out which creatures can be trapped with a Bola, Chain Bola, Bear Trap, or Large Bear Trap! (Suggested by Shaun D)<br>- New server setting: Player Damage Multiplier, for KO estimates (Suggested by Josh L)<br>- New server setting: Player XP Multiplier, for “XP per kill” estimates (Suggested by Jghake)<br>- Level picker can now be customized to only show levels in multiples. (Suggested by Bailey)<br><br>Minor updates:<br>- Fixed issue where switching between Violent and Non-Violent taming would cause strange errors.<br>- Improved accuracy of “Chance of Death” calculations for KO estimates.<br><br>Dodo Fact #9: Scientists have only rough estimates of the dodo's weight. A lot of the early paintings and descriptions showed the bird as very large because they were referencing captive, overfed birds, however, the modern estimates are around 13 to 23 kg. A 2016 study using CT scans of composite skeletons suggests that the dodo was even slimmer, estimating it at around 11-14 kg."},{"version_id":"818046618","version_name":"1.7.1","version_date":"2016-07-08 13:45:33.000 +0800","version_description":"Fixed bug where Dododex Pro was not enabled. You can now go ad-free using the \"Dododex Pro\" button at the bottom of the app. (NOTE: This may take a few hours to be activated in all countries.)"},{"version_id":"818243654","version_name":"1.8","version_date":"2016-07-29 02:14:25.000 +0800","version_description":"- Brand new navigation system, making it easier to access all Dododex has to offer<br>- Recipes and dyes (Suggested by 10PercentPaul and several others)<br>- Tap to increment (or reset) stat calculator<br>- Shortcuts to Patch Notes, popular Wiki articles, and other resources <br>- Clickable creature icons on Kibble recipes (Suggested by “Just a Nickname”)<br><br>Also:<br>- Creatures are clickable in most places, including kibble flow charts and other charts (Suggested by Josh)<br>- Maps now load faster, and interaction is smoother and more responsive!<br>- Fixed several timer bugs and visual tweaks, including bug that would cause torpor timer to suddenly finish early (thanks for the reports!)<br>- Breeding timeline is now collapsed, since it isn’t used as frequently  <br><br>Dododex is being translated to dozens of languages! Join the project: dododex.com/translate<br><br>Dodo fact #10: The taste of dodo meat seems to have had received mixed reviews. An early traveler described it as \"always skinny and very tough, whatever sauce you put them in.\""},{"version_id":"818856124","version_name":"1.9","version_date":"2016-09-16 19:27:50.000 +0800","version_description":"WHAT'S NEW:<br>- Dododex is now available in German, French, Portuguese and Italian! More languages are coming soon. Contribute at dododex.com/translate<br>- Dododex Stickers for iMessage! Express yourself using dinos! Now available in your iOS 10 iMessage keyboard!<br>- List of items dropped by each creature<br>- Scorched Earth map<br>- Find out which creatures can be carried by the Wyvern (Suggested by… basically everyone)<br>- Find out which creatures can damage adobe buildings<br>- New shortcuts: Xbox patch notes, item spoilage times (Suggested by OhNoTheLag and Matt T)<br>- Various minor design and font color uplifts (Suggested by Andrew R)<br>- Max melee damage increased to 9999% (Suggested by Brandon A)<br><br>OTHER MINOR UPDATES:<br>- Fixed issue where hamburger menu button would sometimes have to be tapped twice<br>- \"Report data error\" button now more accessible at the bottom of every creature's profile<br>- \"Knock Out\" section disabled for Titanosaur and Rock Elemental since they cannot be KO'ed by traditional methods<br><br>Dino images and more content from Scorched Earth will be coming once the Dev Kit is released!<br><br>Thank you to the translators who provided! Will Oliveira, Daniel Bertocci, Arachmeus, Aimeric99, and Fabien Morel!"},{"version_id":"819110355","version_name":"1.10","version_date":"2016-10-05 17:45:42.000 +0800","version_description":"• Player Tips! Learn tips from pros about taming, KO'ing, encountering and utilizing a dino.<br>• Player Tips Contest! Win $100 by sharing your a tip about your favorite creature! See app for details.<br>• New “capabilities” feature shows master chart of creatures that can be carried, can damage structures, and be affected by traps<br>• New Scorched Earth and The Center Map (More updates to come! Thanks, Exhumed!)<br>• Spanish, Russian, Chinese languages added! Help translate at dododex.com/translate<br>• Tapejara added to carryable creatures list<br>• Plant Species Y Trap added to traps list<br>• New Jerboa and Morellatops iMessage stickers<br><br>Also:<br>• More translations added<br>• New loading screen<br>• Dino profiles now load sequentially, improving performance when switching between dinos/levels <br>• Fixed bug where non-English devices wouldn’t preserve English setting after closing the app<br>• Fixed bug where torpor timer would pause when app closed while narcotics were still being consumed."},{"version_id":"819205108","version_name":"1.10.1","version_date":"2016-10-08 20:59:00.000 +0800","version_description":"• Load your cannons! The Titanosaur and Rock Elemental KO calculators are finally here!<br>• Fixed bug where adding narcotics to the Torpor Timer would not do anything. (Thanks for spotting, montana12345!)<br><br>What features do you want to see next? Share here: dododex.com/feedback"},{"version_id":"819455817","version_name":"1.11","version_date":"2016-10-28 03:48:27.000 +0800","version_description":"• Push Notifications for timers! (Highly requested feature!)<br>• Admin commands! Copy and paste dino spawn and weapon commands! (Highly requested!) <br>• Edit weapon damage<br>• Tips now have vote counts<br>• New Jerboa iMessage Stickers! Thanks to Studio Wildcard for providing! (Designed by @uguubear)<br>• New language: Polish (Thank you for the translations, Morg!)<br><br>More minor changes:<br>• Timers screen design updates with creature images<br>• More sections of the app have been translated (for all languages!)<br>• XP per kill is back! (Oops, it was removed in the last version. Thanks for spotting, @PokerBoySwag!)<br>• Downvoted tips will now be faded out after hitting a certain threshold<br>• \"Load more\" button now loads more tips at once<br>• Fixed crashing issue with capabilities feature<br><br>LAST CHANCE: Dododex's tips contest to win $100 in Steam or Xbox credit ends on October 31st! See the \"Tips\" section of any creature's profile for details!"},{"version_id":"820329075","version_name":"1.12","version_date":"2017-01-03 00:33:05.000 +0800","version_description":"Thank you for half a million downloads!<br><br>• Ark's new 2x multipliers are now built-in to calculations. Please set your Taming Multiplier and XP Multiplier to \"1\" for official servers.<br>• New recipes feature<br>• Build your own recipe book by saving your most frequently used recipes!<br>• New maps by Exhumed! (Includes new underwater cave locations!)<br>• Saved Server Settings - Now you can easily switch between a set server multipliers.<br>• Button to quickly access your multipliers!<br>• By popular demand, the starve timer now shows the \"target food\" value.<br>• By request, creatures tamed non-violently now show knock-out estimates (for players who like to KO and airlift to a taming pen).<br>• Will my bronto fit through this door? Find out with the new \"fits through\" section!<br>• Korean (partial translation) is Dododex's 10th language! Thanks to kohm6012 for translating! More to come!<br>• PS4 Patch Notes<br><br>BUG FIXES:<br>• Tips submitted after December 1st wouldn't display proper date.<br>• The delete button on timers would not work.<br>• Some users have reported intermittent crashing when scrolling. This is still being investigated."},{"version_id":"820388855","version_name":"1.12.1","version_date":"2017-01-05 23:39:28.000 +0800","version_description":"• Fixed bug where level would reset to 1 when navigating between screens, but still appear as if it were the correct level. (Some users mistook this as multipliers not being applied correctly.)<br>• Fixed bug where starve timer push notification would be sent twice.<br>• Redesigned text inputs in settings.<br><br>What would you like to see added next to Dododex? Share and vote on your favorite ideas: dododex.com/feedback"},{"version_id":"820464607","version_name":"1.12.2","version_date":"2017-01-10 06:56:19.000 +0800","version_description":"• Shocking Tranquilizer Dart and Compound Bow added to available weapons. Tap “Edit Weapons” to add them!<br>• Bio Toxins added as narcotic method! (Coming soon to Torpor Timer as well!)<br>• By request, the volume of Narcotic eating sound effect on Starve Timer has been decreased. Sorry to the users who said it has startled them countless times or woke up their significant others. :P <br>• Fixed bug where Dododex Pro would cause app to crash. (Thanks for pointing out, Jesse and @Suma_134!)<br>• More Korean, German, and Polish Translations!<br><br>Dododex is working on new breeding features and your input is needed! Take the 5-minute survey: bit.ly/dodobreed"},{"version_id":"820626971","version_name":"1.12.3","version_date":"2017-01-23 19:42:45.000 +0800","version_description":"• NEW: Troodon taming calculator! Find out how many dinos you need to sacrifice! (Thanks to everyone who requested this!)<br>• Major caching and performance improvements of the Player Tips feature.<br>• Sulfur added to Gathering Efficiency list. (More Scorched Earth items will be added once they receive enough votes. Please use the \"Rate This Creature\" button to contribute ratings!)<br>• Some times would be incorrectly labeled as \"Today\" or \"Tomorrow\". (Thanks for spotting, Ampspinz!)<br>• The \"Report Data Error\" button under “About/Feedback” would crash faster than a doedicurus rolling indoors.<br>• Report Data Error form would sometimes behave wonkier than a pteranodon set on follow."},{"version_id":"822958001","version_name":"1.13","version_date":"2017-07-29 19:50:39.000 +0800","version_description":"- New breeding calculator lets you calculate when your new baby will reach every stage of maturation! (Timer coming soon!)<br>- New tabbed design!<br>- Fixed major crashing issues! Sorry about that!<br>- Name Ideas! Browse through hundreds of original names for every dino! Submit your own and see how much other Ark players love it!<br>- By popular demand, funny tips now have their own category, and are filtered out of the default \"all\" mode.<br>- New Map: Ragnorak (Plus: Updates to The Island and Scorched Earth)<br>- Dododex's original torpor ranking system classifies each dino by how fast their torpor drops.<br>- Stat calculator now classifies stats into five categories: very low, low, average, high, very high. <br>- Recipes needed to tame or battle a dino now show on dino profiles (Bug Repellent, Broth of Enlightenment, etc.).<br>- New Forge Calculator built by Tristan Gregory!<br>- New Weapons for KO calculations: Harpoon Gun, Thorny Dragon, Equus<br>- Find out which dinos can be Lassoed, damage Tek Structures.<br>- Find out which creatures can be carried by the Griffin!<br>- Torpor Buffer — Torpor timer now shows you how many Narcotics you'll need to max out your dino.<br>- Tips with a rating below 0 now show their score.<br>- New Languages: Japanese, Romanian, and Dutch! (Plus: Updates to German, Portuguese, and French)<br><br>Minor updates:<br>- New contact form<br>- Increased max level after taming from 61 to 71. <br>- Button to access the Dododex Discord<br>- Fixed “chance of death” calculation error for custom weapons. <br>- Fixed bug where quantity of foods could not be changed.<br>- Fixed bug where stats would sometimes “round” to numbers like .9999<br>- Ability to copy/paste tips<br>- Various design uplifts"},{"version_id":"823271861","version_name":"2.1","version_date":"2019-03-31 01:13:29.000 +0800","version_description":"- Added increment setting on level picker to allow for intervals of 4, 5, etc.<br>- Resource Calculator! Third party tool by Tristian Gregory.<br>- Upon opening level picker, the level is now automatically highlighted so you don't have to tap backspace  <br>- Fixed issue where pressing +/- on the level picker would sometimes skip a level<br>- Implemented Dododex URLs (dododex://creature/raptor/30) to allow other apps/sites to deep link to Dododex <br>- Recipes of new Kibble now show color of Kibble<br>- Fixed issue where top navigation (info / stats / etc) would not scroll when menu is too large (more noticeable on Spanish, Russian, and some languages)<br>- Abbreviated many translations for those menu items to require less scrolling<br>- Breeding input would not support decimals<br>- Fixed issue where Restore Purchases button would cause app to crash (users needed to use upgrade button instead)<br>- Pre-Rework Kibbles now include a “Mobile / Switch” indicator <br>- Open (or install) Ark Mobile from Dododex<br>- On gathering, fixed rare issue where a dino will show another dino's image after switching between items<br>- Minor design improvements to the creature tabs"},{"version_id":"823271861","version_name":"1.13.1","version_date":"2017-08-15 02:01:45.000 +0800","version_description":"- The original breeding timeline has returned! So many people have said they prefer the old timeline view, so it's back!<br>- Ragnorak map (by 3xhumed) updated!<br>- Find out which dinos can be carried by the Kaprosuchus, Megalosaurus, Tusoteuthis, and humans (suggested by Cameron D. and many other users!)<br>- Breeding tab now shows the chance of twins and triplets<br>- Fixed bug where KO estimates would not update when you switched dinos or levels<br>- Stat calculator now shows a notice for flyers, who no longer have wasted stats<br>- Larger favorite star button on recipe cards (suggested by KensonPlays)<br>- Increased amount of tips loaded when you click \"load more”<br>- Maturation is now entered as a percent instead of by weight<br>- Editing your weapon's damage wouldn't always work (thanks for spotting, u/nlappe!)<br>- New “Use Single Player Settings” now matches Ark's settings<br>- French patch notes (thanks, ark-france.fr!)<br>- Minor translation updates"},{"version_id":"823271861","version_name":"1.14.1","version_date":"2018-03-28 21:51:42.000 +0800","version_description":"- Fixed issue where keyboard would not always have a close button<br>- Fixed a [rare] crashing issue when entering certain values into the stat calculator<br>- Keyboard close button was accidentally in Vietnamese for all users. Oops!<br><br>Want to help translate Dododex? Visit dododex.com/translate"},{"version_id":"826341885","version_name":"1.14","version_date":"2018-03-21 04:17:17.000 +0800","version_description":"- iPhone X support<br>- New Stats tab shows all dino stats in one consolidated tab<br>- Updated taming table. Tap on a food item to easily increment quantity, view intervals, and food value for each item.<br>- Added Aberration map (Thanks, 3xhumed!)<br>- Updated Ragnarok map <br>- Find out which land dinos can carry other dinos <br>- Stat comparisons highlight really low or high stats<br>- Added Ascerbic Mushrooms to list of Narcotics <br>- Creatures with large amounts of food are collapsed <br>- Removed rocket launcher from Rock Elemental <br>- More admin commands added<br>- Various minor design updates<br><br>TRANSLATIONS:<br>- New languages: Czech, Thai, Turkish, Swedish, Danish<br>- Updates: Russian, German, Portuguese<br>- Support for translated Dino names (contribute translations at dododex.com/translate!) <br><br>BUG FIXES:<br>- Some creatures listed recipes twice<br>- Fixed incubation temperature display issue for Rock Drake <br>- Fixed broken Xbox patch notes link<br>- Fixed crashing issues when not connected to the internet"},{"version_id":"826478096","version_name":"1.14.1","version_date":"2018-03-28 21:51:42.000 +0800","version_description":"- Fixed issue where keyboard would not always have a close button<br>- Fixed a [rare] crashing issue when entering certain values into the stat calculator<br>- Keyboard close button was accidentally in Vietnamese for all users. Oops!<br><br>Want to help translate Dododex? Visit dododex.com/translate"},{"version_id":"828673704","version_name":"1.14.2","version_date":"2018-09-26 17:39:35.000 +0800","version_description":"- Updated Maps interface to support future maps<br>- Forge Calculator fixed (Note: The forge calculator is a third party tool developed by Tristan Gregory)<br>- Added dinosaur name translations for Russian, partial Danish and Russian. (Translators needed! dododex.com/translate)<br>- More translations added for French, Italian, Japanese, and Russian<br>- Fixed crashing issue related to upgrading to Dododex Pro<br><br>With iOS 12, you can add dino stickers to your selfies! In iMessage, tap the camera feature and you'll be able to add Dododex stickers on your face as you take a photo or video, even with your Memoji!"},{"version_id":"830637108","version_name":"2","version_date":"2019-03-16 23:52:38.000 +0800","version_description":"Dododex Version 2 is finally here!<br><br>- Brand new look! (Updates with each creature!)<br>- Creature search!<br>- Creature categories allow you to slice and dice the creature list<br>- (Pro tip: Switch to “List” view and select the “All” category for an alphabetical list of all creatures)<br>- Night mode (Dododex Pro feature)<br>- New “More” tab, including a brand new redesigned capabilities list<br>- Updated stats tab design with new sharing ability<br>- Last food selection is remembered when switching dinos<br>- Find the minimum wall gap size to fit each Dino<br>- See which dinos fit through Hatchframes and Giant Hatchframes<br>- See which dinos can be carried in a Procoptodon pouch<br>- Reorder your weapons <br>- Torpor and Starve Timer designs updated<br>- Bio Toxin and Ascerbic Mushroom added to Torpor Timer<br>- Share button on player tips<br>- Share button to show off (or save) your new tame's stats<br>- Saved settings redesign makes it easier to switch between saved settings<br>- GFI Commands now available in Admin Commands <br>- New ARK Buddy by Tristian Gregory includes forge calculator, tek calculators, and more<br>- Cloning chamber calculator (Ark Wiki)<br>- List of related dinos <br>- Merch now available!<br>- 6 New Languages: Arabic, Croatian, Dutch, Finish, Greek, Hebrew, and Norwegian<br>- Translate player tips (when app language is not set to English)<br><br>PLUS:<br>- \"Help\" button on Settings to access common multiplier configurations <br>- Increased training level cap to +73 <br>- Bad tips are now permanently removed <br>- Older tips now display year posted<br>- Basilisk added as KO weapon <br>- Carriers are now clickable<br>- App now remembers last selected tab upon reopening<br><br>BUG FIXES:<br>- On Kibble recipes, dino list would not scroll<br>- Restore purchases was not working on some devices <br>- Fixed Rock Elemental Boulder data<br>- Double recipes were showing for some creatures<br>- Fixed issue where shortcuts would crash<br>- Fixed bug that made it look like you could upvote a tip many times<br>- Fixed Titanosaur stat calculator<br>- Better error handling when offline"},{"version_id":"830641951","version_name":"2.0.1","version_date":"2019-03-17 23:57:56.000 +0800","version_description":"- Dododex Pro is now available. Fixed bug that displayed it as unavailable.<br>- New ARK Buddy by Tristian Gregory includes forge calculator, tek calculators, and more<br>- Improved display of long item names<br><br>Note: I'm looking into performance issues with loading creature images. Hoping to have it fixed soon!"},{"version_id":"830806012","version_name":"2.1","version_date":"2019-03-31 01:13:29.000 +0800","version_description":"- Added increment setting on level picker to allow for intervals of 4, 5, etc.<br>- Resource Calculator! Third party tool by Tristian Gregory.<br>- Upon opening level picker, the level is now automatically highlighted so you don't have to tap backspace  <br>- Fixed issue where pressing +/- on the level picker would sometimes skip a level<br>- Implemented Dododex URLs (dododex://creature/raptor/30) to allow other apps/sites to deep link to Dododex <br>- Recipes of new Kibble now show color of Kibble<br>- Fixed issue where top navigation (info / stats / etc) would not scroll when menu is too large (more noticeable on Spanish, Russian, and some languages)<br>- Abbreviated many translations for those menu items to require less scrolling<br>- Breeding input would not support decimals<br>- Fixed issue where Restore Purchases button would cause app to crash (users needed to use upgrade button instead)<br>- Pre-Rework Kibbles now include a “Mobile / Switch” indicator <br>- Open (or install) Ark Mobile from Dododex<br>- On gathering, fixed rare issue where a dino will show another dino's image after switching between items<br>- Minor design improvements to the creature tabs"},{"version_id":"833825693","version_name":"2.2","version_date":"2020-03-12 00:36:41.000 +0800","version_description":"- Genesis X-Creatures toggle on KO calculator<br>- Improved dino search. You can now search for common names like “beaver” or “frog” <br>- Favorite creatures<br>- New Resources feature includes Gathering Efficiency, Drops, and Weight Reduction<br>- Improved stat calculator design making it easier to input stats. Now defaults to a creature’s average stats. <br>- Improved Capabilities feature includes all capabilities and sorting<br>- Redesigned Knock Out calculator now includes torpor depletion between hits for improved accuracy. <br>- Number of hits before a dino flees<br>- Chance of death added for headshots<br>- Improved speed of image loading<br>- New tips are marked as “NEW” and now have emojis on categories<br>- Increased text size of name ideas<br>- Tip algorithm prioritizes newer tips<br>- Quick links to Wiki Spawn Maps and Resource Maps<br>- Karkinos KO calculator<br>- New Recipes<br>- Mobile Kibble moved to separate recipe category <br>- Gathering screen now shows meter for easy comparison <br>- Fits through: Double Doors<br>- When Single Player Settings is enabled, it now shows your your new multipliers <br>- You can now combine up to 5 dino categories instead of 3<br>- Performance improvements across the app <br>- Some third party tools may voluntarily hide ads for Dododex Pro users <br>- New translations added<br><br>Bug Fixes:<br>- Favorite recipes would sometimes duplicate, or be unable to remove. <br>- Bug caused the app to randomly redirect you back to the main screen<br>- Torpor timer would not sync properly if narcs were being consumed<br>- Adjusted some fonts that were too thin to read<br>- App turns music off"},{"version_id":"835745887","version_name":"2.2.1","version_date":"2020-04-29 20:32:30.000 +0800","version_description":"- Fixed bug where annoying ads on the ARK Wiki would repetitively pop-up full screen. (Note: These were not Dododex ads.)<br>- App would sometimes reset every 30 seconds for a small amount of users.<br>- Kibbles are now in proper order rather than alphabetical. <br>- Tranq Darts would display as impossible or too high for some creatures. <br>- Base stats would not update when switching between creatures.<br>- Removed the total % progress on breeding timer. Having the % progress in two areas caused a lot of confusion. <br>- Fixed issue where chance of death would display “NaN” for dinos on Lvl 1.<br>- Added ability for other languages to filter out English tips."},{"version_id":"837187899","version_name":"2.3","version_date":"2020-08-02 15:41:49.000 +0800","version_description":"- Breeding timers are now here!<br>- Primitive Plus support\n<br>- New tips category: Stories!\n Share memorable moments, wild encounters, or even fan fiction about your favorite dinos <br>- Spawn maps directly linked on each creature profile\n<br>- Categories now indicate if a creature spawns on each map or not\n<br>- Carryable by: Tropeognathus\n<br>- Crystal Isles Maps\n<br>- Trophy requirements for bosses\n<br>- Translation updates (Spanish, Chinese, Arabic)\n<br>- Absolute weapon damage (for ARK Mobile)\n<br>- Major performance improvements across the app\n<br>- Kibble recipes have a larger scroll area to see more dinos at once\n<br>\n<br>BUG FIXES:\n<br>- Finally(!) fixed issue where app would reset every ~30 seconds or so\n<br>- Increasing a recipe’s quantity would multiply the ingredients exponentially\n<br>- Minor updates and bug fixes"},{"version_id":"837477258","version_name":"2.4","version_date":"2020-08-25 20:24:55.000 +0800","version_description":"- Dododex now includes 2x taming, matching ARK’s new update on PC and console. Visit Settings for details.  <br>- Tips for recipes! Share tips on any recipe: consumable strategies, saddle ideas...<br>- Tips for resources! Best ways to gather, farm, obtain, and use each resource.<br>- Tools in gathering efficiency<br>- Offline mode<br>- Carryable by: Crystal Wyvern <br>- New setting presets<br>- “Read more” button now displays on longer tips and text<br>- Opening Dododex from ARK Mobile for the first time would show an blank confirmation pop-up <br>- Fixed crash when selecting a level<br>- \"Consumption Speed\" is now labeled \"Dino Character Food Drain\" (as it is in-game)<br>- Delete button on the Edit Weapons screen showed HTML code<br>- When you have more than 5 timers, switching pages would sometimes not work properly<br>- Fixed issue where \"Pause All\" timers button would not work<br>- Minor design updates<br>- Bug fixes and performance improvements"},{"version_id":"837552541","version_name":"2.4.1","version_date":"2020-08-28 19:32:40.000 +0800","version_description":"- Fixed issue when upgrading to Dododex Pro<br>- Updates to Spanish, Chinese, and Portuguese translations"}]