[{"version_id":"817224917","version_name":"1.0.1","version_date":"","version_description":""},{"version_id":"817784681","version_name":"1.2","version_date":"","version_description":""},{"version_id":"818564010","version_name":"1.3.1","version_date":"2016-08-19 09:26:35.000 +0800","version_description":"Bug Fixes - The team has been working hard to fix some of the most commonly reported bugs."},{"version_id":"818633172","version_name":"1.6.1","version_date":"2016-08-25 18:21:07.000 +0800","version_description":"Bug Fixes - Fixed crashes and bugs related to iPhone 5 and iPhone 5C"},{"version_id":"818721714","version_name":"1.6.2","version_date":"2016-09-02 18:53:34.000 +0800","version_description":"Bug fix - Fixed a bug experienced by users with a 12-hour clock setting."},{"version_id":"818859477","version_name":"1.6.3","version_date":"2016-09-14 06:16:20.000 +0800","version_description":"Bug fixes and iOS 10 compatibility"},{"version_id":"818904883","version_name":"1.7","version_date":"2016-10-27 14:16:09.000 +0800","version_description":"Version 1.7 introduces a longboat-load of new features:<br><br>• Leaderboards (due to popular demand) - see how your empire shapes up with the competition, globally or amongst your friends<br>• Customise! - Unlock 36 new shield quarters to customise your coat of arms, with our new achievements feature<br>• Battle reports - Choose to receive notifications when an opponent invades your empire<br>• Style changes - Cleaning up some visual elements<br>• Several bugs fixed"},{"version_id":"820024420","version_name":"1.8","version_date":"2016-12-08 12:06:36.000 +0800","version_description":"- Fixed crashing on iPhone 5 &amp; 5C Devices<br>- New map colours (let us know what you think!)<br>- Referral Rewards - Get your friends to build their empires and reap the benefits.<br>- Expanded Map View (5S and later) - View your entire empire on one screen (and most of the city as well).<br>- Bug fixes"},{"version_id":"820179598","version_name":"1.8.1","version_date":"2016-12-20 12:37:53.000 +0800","version_description":"- Fixed crashing on iPhone 5 &amp; 5C Devices<br>- New map colours (let us know what you think!)<br>- Referral Rewards - Get your friends to build their empires and reap the benefits.<br>- Expanded Map View (5S and later) - View your entire empire on one screen (and most of the city as well).<br>- Bug fixes"},{"version_id":"820724914","version_name":"1.9.1","version_date":"2017-02-01 13:05:57.000 +0800","version_description":"- New grid view for choosing shield quadrants<br>- Add your height, weight, age, gender and activity level to your account<br>- Improvements to the way cheat detection works<br>- Bug fixes"},{"version_id":"821057047","version_name":"1.10","version_date":"2017-02-27 11:01:14.000 +0800","version_description":"- new run history screen for both your own and opponent runs.<br>- Updated run report with a new layout.<br>- You will now see calories burned for each run. We’ve also added a new system which calculates the efficiency of each run in the number hexes affected per minute, and then gives you a rating out of five stars. Beat any personal bests, and you’ll see a little ‘PB’ sticker next to that metric, too. Just in case you needed even more motivation to capture hexes.<br><br>Finally, we’ve updated the graphic that appears when you share your runs – so there’s even more reason to revel in that sweet revenge raid."},{"version_id":"821466410","version_name":"1.12","version_date":"2017-03-27 10:45:30.000 +0800","version_description":"- Facebook login<br>- Bug fixes"},{"version_id":"821937984","version_name":"1.13","version_date":"2017-04-28 15:02:27.000 +0800","version_description":"Simplified sign-up.<br>Enhanced tutorial with detail on all key features.<br>Graphic improvements.<br>Bug fixes."},{"version_id":"822352544","version_name":"1.13.1","version_date":"2017-06-12 13:41:49.000 +0800","version_description":"Bug fixes<br>Graphical improvements<br>Preparations for the addition of running teams"},{"version_id":"828668298","version_name":"2.15.1","version_date":"","version_description":""},{"version_id":"828969181","version_name":"2.18.5","version_date":"2018-10-19 07:36:22.000 +0800","version_description":"- Push notifications for when you lose a castle<br>- Option to watch adverts to double earnings<br>- Improvements to the onboarding"},{"version_id":"829119356","version_name":"2.19.2","version_date":"","version_description":""},{"version_id":"829199723","version_name":"2.20.3","version_date":"","version_description":""},{"version_id":"829295965","version_name":"2.21.2","version_date":"","version_description":""},{"version_id":"829363312","version_name":"2.22.3","version_date":"","version_description":""},{"version_id":"829388806","version_name":"2.22.5","version_date":"2018-11-24 10:00:50.000 +0800","version_description":"Small fix for a bug that appeared whilst users were offline."},{"version_id":"829466786","version_name":"2.25.3","version_date":"2018-11-30 15:40:12.000 +0800","version_description":"Castle battles updated: Compete with your rivals and earn prizes for holding on to your castles! Advance through the eras to get better at capturing castles."},{"version_id":"829503022","version_name":"2.25.4","version_date":"2018-12-04 00:57:34.000 +0800","version_description":"Bug fix - You can now drop more warriors on your castles even if you already own them"},{"version_id":"829679098","version_name":"2.27.3","version_date":"2018-12-18 03:01:51.000 +0800","version_description":"- Get a sense of the competition by viewing the empire of players in your vicinity<br>- Rebalanced progression: Later eras are a bit easier"},{"version_id":"829979709","version_name":"2.31.2","version_date":"2019-02-12 15:34:11.000 +0800","version_description":"Pro subscription: Get monthly perks with the new monthly subscription!<br><br>The subscriptions includes:<br>- 50 gems every day<br>- An improved warrior<br>- A gold stave for your banner<br>- Doubled profit when you are away<br>- And every other purchases give 20% more gems<br><br>We also improved the layout for iPhoneX users"},{"version_id":"830520974","version_name":"2.32.9","version_date":"2019-03-07 10:07:33.000 +0800","version_description":"Objectives: Fulfil daily missions and unlock achievements to earn rewards"},{"version_id":"830574480","version_name":"2.33.1","version_date":"2019-03-13 10:17:07.000 +0800","version_description":"Misc improvements and bug fixes"},{"version_id":"830672663","version_name":"2.34.1","version_date":"2019-03-20 17:53:19.000 +0800","version_description":"Bug fixed on advisor achievements"},{"version_id":"830799154","version_name":"2.37.1","version_date":"2019-04-01 10:11:05.000 +0800","version_description":"- Achievements and missions<br>- Bug fixes in the tutorial"},{"version_id":"830920978","version_name":"2.38.2","version_date":"2019-04-10 14:21:00.000 +0800","version_description":"- Bug fix around confusion between metric and imperial system"},{"version_id":"831004156","version_name":"2.39.3","version_date":"2019-04-18 09:37:16.000 +0800","version_description":"- Free trial for subscriptions"},{"version_id":"831083163","version_name":"2.40.4","version_date":"2019-04-30 12:09:19.000 +0800","version_description":"- Improvement to Strava integration"},{"version_id":"831582582","version_name":"2.42.3","version_date":"2019-06-10 16:15:57.000 +0800","version_description":"◆ We're continuing to work hard to fix issues you are having with Strava. Special thanks for the all the feedback, work is ongoing. <br>◆ Strava runs will no longer use up hearts. <br>◆ Fixed some display issues on newer iPhones with taller screens. <br>◆ It's now much clearer what's included in each of the Subscription options."},{"version_id":"831708230","version_name":"2.43.4","version_date":"2019-06-24 15:37:34.000 +0800","version_description":"◆ We've fixed an issue with the \"Unique Castles Attacked'' achievement. Thanks to Jez for reporting. <br>◆ Strava runs should now fetch slightly faster. We also fixed a bug which was causing delay in fetching Strava runs.<br>◆ Further fixes for display issues on newer phones with taller screens."},{"version_id":"831791732","version_name":"2.44.1","version_date":"2019-06-27 09:49:33.000 +0800","version_description":"◆ We've fixed an issue with the \"Unique Castles Attacked'' achievement. Thanks to Jez for reporting. \n<br>◆ Strava runs should now fetch slightly faster. We also fixed a bug which was causing delay in fetching Strava runs.\n<br>◆ Further fixes for display issues on newer phones with taller screens."},{"version_id":"832386421","version_name":"2.46.4","version_date":"","version_description":""},{"version_id":"832558973","version_name":"2.47.2","version_date":"2019-08-30 09:33:22.000 +0800","version_description":"Fixed a bug causing Strava runs to be imported repeatedly. Thanks to those who pointed this out for us."},{"version_id":"832742876","version_name":"2.48.1","version_date":"2019-09-13 09:08:22.000 +0800","version_description":"We've been doing some work in the background on testing some new features. More details coming very soon!"},{"version_id":"832812735","version_name":"2.48.2","version_date":"2019-09-19 15:18:28.000 +0800","version_description":"- Bug fixing issue with UI and \"New Strava activity\" modal not appearing"},{"version_id":"832905809","version_name":"2.49.1","version_date":"2019-09-25 16:06:07.000 +0800","version_description":"We've been doing further preparation for the upcoming release of our major redesign. We'll have more news in app for our existing users on our next release! Watch this space!"},{"version_id":"832952167","version_name":"2.49.3","version_date":"2019-09-30 20:55:16.000 +0800","version_description":"We've fixed a bug preventing players on taller screens from accessing the Adviser Quests."},{"version_id":"833097529","version_name":"2.50.4","version_date":"","version_description":""},{"version_id":"833176254","version_name":"2.50.5","version_date":"2019-10-15 20:54:00.000 +0800","version_description":"We've fixed a bug which was preventing users from loading the new version after opting in to the update. Thanks to those of you who reported the problem."},{"version_id":"833299685","version_name":"2.51.3","version_date":"2019-10-28 11:48:10.000 +0800","version_description":"We've got bags of great new features coming your way in this release:<br>◈ Claim 8 exciting NEW 'Chests' from across your empire each containing great prizes. <br>◈ An 'Alerts' feed to instruct on your Chieftain duties and a 'Quick Find' menu to find buildings fast.  <br>◈ Visit a 'Friendly Village' nearby to find 'Specialists'. Specialists like the Lumberjack and Digger clear Forests and Rocky ground. <br>◈ Check out the 'Trader' - you can now buy resources to complete 'Requests'. <br>◈ Revisit owned clear land for a chance to discover a hidden 'Bandit Camp' to win prizes.<br><br>Please get in touch at feedback@runanempire.com and let us know what you think! We love hearing your feedback."},{"version_id":"833477035","version_name":"2.52.1","version_date":"2019-11-06 09:10:16.000 +0800","version_description":"◈ We've brightened the map colors, which has made us all happier. We hope it works for you too.<br>◈ Progress on the last version was much too fast, so we've been working hard on balancing the game to keep it fun and make it last. <br>◈ Go and discover your first Friendly Village for a reward of 3 free Specialists. <br>◈ Advisor quests are now shorter and clearer. Because who likes reading?<br>◈ We love your feedback! So much so, in fact, that we're now giving away 25 gems for filling out a survey, Much appreciated!<br>◈ Info popups, to help guide you. Tap on Info when inspecting a hex to find out more.<br>◈ Your Lodge is now a Palace. The Market is now a Trader. That's 2 free upgrades on us. Call it an early Christmas present. <br><br>Please get in touch at feedback@runanempire.com and let us know what you think! We love hearing your feedback."},{"version_id":"833669723","version_name":"2.53.3","version_date":"2019-11-20 10:20:11.000 +0800","version_description":"◈ Activity Boost, the new incentive to get moving. Double production speed (for 12 hours!!) for any structure visited during an activity.<br>◈ Store House - your Empire doesn't have unlimited storage. Consider carefully which resources to gather and craft.<br>◈ Upgrade your Store House with Bean Counter specialists. Tip - find specialists by visiting Friendly Villages.<br>◈ Sell unwanted resources to the Trader (check out his newly renovated pink tent).<br>◈ Banners now cost far less gems. Go to the Settings menu to customize your Banner. More coming soon!<br><br>Please get in touch at feedback@runanempire.com and let us know what you think! We love hearing your feedback."},{"version_id":"833841093","version_name":"2.54.2","version_date":"2019-12-06 11:33:58.000 +0800","version_description":"◈ Extra Loot, 3 more Subjects &amp; 10 daily Gems from the '7 Wonders'. Unlock 7 historic structures to get subscriber benefits FREE for 48 hours. \n<br>◈ New exciting Christmas Banners! Head to Settings to customize your Banner for less Gems than ever before.  \n<br>◈ Era Packs are back - Level up your Era to unlock special discounted offers including exclusive Decorations. \n<br>◈ 'This Hex' &amp; 1 hex activities are now limited to 1 every 30 mins. No such limits on longer activities so get active to boost hexes for 12 hours. \n<br>◈ Bug fix - lost progress should now occur less often. Thanks for those who wrote to us! \n<br>◈ Strava fix - 'Rides' and 'Wheelchair' Strava activities will now be imported. \n<br>\n<br>Our Survey is now complete, many thanks to all those who responded. Please get in touch at feedback@runanempire.com if you have any further feedback."},{"version_id":"833908720","version_name":"2.54.4","version_date":"2019-12-07 07:21:36.000 +0800","version_description":"◈ Urgent fix to prevent notifications causing the app to crash. Notifications have been disabled temporarily whilst we explore the cause of this issue. <br>◈ Extra Loot, 3 more Subjects &amp; 10 daily Gems from the '7 Wonders'. Unlock 7 historic structures to get subscriber benefits FREE for 48 hours. <br>◈ New exciting Christmas Banners! Head to Settings to customize your Banner for less Gems than ever before.  <br>◈ Era Packs are back - Level up your Era to unlock special discounted offers including exclusive Decorations. <br>◈ 'This Hex' &amp; 1 hex activities are now limited to 1 every 30 mins. No such limits on longer activities so get active to boost hexes for 12 hours. <br>◈ Bug fix - lost progress should now occur less often. Thanks for those who wrote to us! <br>◈ Strava fix - 'Rides' and 'Wheelchair' Strava activities will now be imported. <br><br>Our Survey is now complete, many thanks to all those who responded. Please get in touch at feedback@runanempire.com if you have any further feedback."},{"version_id":"834025030","version_name":"2.54.5","version_date":"2019-12-19 21:32:12.000 +0800","version_description":"◈ New exciting Christmas themed banner colors and sigils. Head to Settings to customize your Banner for less Gems than ever before.\n<br>◈ The '6 Month Subscription' option is now working correctly. Apologies for the inconvenience."},{"version_id":"834305507","version_name":"2.55.7","version_date":"2020-01-23 09:13:26.000 +0800","version_description":"◈ New and updated Castle capture feature - including new warrior upgrade system and ALSO a new coin reward for captured castles<br>◈ New exciting banners colors and sigils. Head to Settings to customize your Banner for less Gems than ever before."},{"version_id":"834515077","version_name":"2.56.3","version_date":"2020-01-29 14:20:37.000 +0800","version_description":"◈ In preparation for many new Levels, Structures can now be upgraded to produce more Resources.\n<br>◈ New Warriors added, upgrade your Warriors now to win Castle battles for Chests and Coins.\n<br>◈ Scroll through multiple structures using the new arrows either side of each building when inspecting a hex.\n<br>◈ Cyclists - we've made some changes to prevent you from being falsely accused as cheats.\n<br>◈ Fixed bug which caused Banners which have been bought to disappear."},{"version_id":"834794673","version_name":"2.57.3","version_date":"2020-02-26 11:23:31.000 +0800","version_description":"◈ A completely redesigned 'End of Activity' experience, providing a summary of all the 'need to know' info from your activity. <br>◈ You have to see it to believe it. Start a 'This Hex' activity today for a new exciting response from your Empire.     <br>◈ Tap on 'View Empire' to inspect another Empire from inside any Castle.  <br>◈ Push notifications are back and better than ever. Enable permissions if you'd like to be notified about your Empire.  <br>◈ We'll now alert Stone Circle lovers when more free prizes are available. <br>◈ Fixed a bug which was preventing players from starting activity. Thanks to those of you who reported this bug."},{"version_id":"834987826","version_name":"2.58.3","version_date":"2020-03-06 14:12:55.000 +0800","version_description":"◈ A new Banner Monument structure which displays your current banner and gives you quick access to customizations.\n<br>◈ More than 10 new fantastic banner sigils to choose from. Raise your customized banner over your conquered Castles!\n<br>◈ Our most requested feature, competitive LEAGUES, is coming soon to an Empire near you!\n<br>◈ Also coming soon, 10 new levels. Many new work order recipes, levels and eras will be added to the game soon."},{"version_id":"835074770","version_name":"2.59.1","version_date":"2020-03-13 10:04:10.000 +0800","version_description":"◈ We've made some visual improvements to the Request Board. <br>◈ Prepare yourselves! In the next release we have a brand new LEAGUES feature.  Compete to win League Chests!<br><br>Please get in touch at feedback@runanempire.com and let us know what you think! We love hearing your feedback. I know it seems quiet from us on our sub reddit, but we do read all of your posts."},{"version_id":"835262374","version_name":"2.60.5","version_date":"2020-04-08 09:15:49.000 +0800","version_description":"≡ The Arena awaits brave competitors. Compete against other players in our Arena leagues for extra valuable chests. <br>≡ 7 Wonders - we've made some improvements to how we explain the power of each Wonder. <br>≡ Settlements are now simpler, you only need the Bureaucrat specialist to upgrade. Get them from Friendly Villages. <br>≡ We fixed a bug which was preventing you from being able to tap the map level location button on some devices. Thanks to those of you who reported the issue.  <br><br>Stay safe everyone, and remember, only go outside to use Run An Empire if your government guidance allows this activity. We will prevent many deaths with proper social distancing [ | ]"},{"version_id":"835647401","version_name":"2.63.2","version_date":"2020-05-06 08:31:45.000 +0800","version_description":"◈ 37 new levels through to the 'Renaissance' era. For those of you who've been stuck on Level 18, we thank you for your patience. \n<br>◈ Adding new levels required changes to item prices. You may notice that this will make the game more of a challenge. We will continue to improve the economy of the game in the coming weeks. Please get in touch if you have any feedback. \n<br>◈ We've completely redesigned and themed the resource chains required in each level of the game. Some old buildings will be deleted from the game, but don't worry, this is expected and required in order to add new Eras. Do get in touch if you have any questions.  <br>◈ The Store House is now called the 'Stronghold' and has a new building design.  \n<br>◈ We've made it much clearer what each 'Wonder' does for you and made it easier to upgrade. \n<br>\n◈ Resources for each structure will now generate in a queue, rather than simultaneously, it takes a bit of getting used to, but we hope in time that you'll prefer this like we do. <br><br>\n<br>Please get in touch at feedback@runanempire.com and let us know what you think! We love hearing your feedback."},{"version_id":"835907216","version_name":"2.64.3","version_date":"2020-05-12 07:33:33.000 +0800","version_description":"◈ Fixed a serious bug preventing location tracking from working. We're sorry if this bug messed with your weekend activities. <br>◈ We've added a lovely animation to the game to make resource generation more enjoyable. <br>◈ Fixed a bug preventing login. Thanks to those of you who reported this issue. <br>◈ All resources now have a white outline to make them much clearer on the map.<br>◈ The Barracks structure interior has been decorated by your people. Go see it now and upgrade your warriors.  <br><br>Please get in touch at feedback@runanempire.com and let us know what you think! We love hearing your feedback."},{"version_id":"836069372","version_name":"2.65.2","version_date":"2020-05-27 11:10:24.000 +0800","version_description":"◈ Look out for the yellow eye button in your Palace, Arena and Castles to inspect your neighbor's empire and claim a special prize. <br>◈ Banners now have 5 customizations, that's millions of unique combinations. Inspect your Banner Monument now and take a look.<br>◈ New time limited chests are spawning in your neighborhood. Visit these chests now for great rewards. <br>◈ Structures such as mines can now be upgraded when their unlock level is reached. <br>◈ Fixed negative gem and empire inspect from Leagues issues. <br>◈ More testing of the economy is ongoing, thanks for bearing with us. We love reading your detailed balancing feedback on Reddit. <br><br>Please get in touch at feedback@runanempire.com and let us know what you think!"},{"version_id":"836277288","version_name":"2.67.2","version_date":"2020-06-04 22:20:08.000 +0800","version_description":"◈ Look out for the yellow eye button in your Palace, Arena and Castles to inspect your neighbor's empire and claim a special prize. \n<br>◈ Banners now have 5 types of customizations, that's millions of unique combinations. Open your Banner Monument now and take a look.\n<br>◈ New time limited chests are spawning in your neighborhood. Visit these chests now for great rewards. \n<br>◈ Settlement rewards are now better balanced. Thanks for your detailed feedback Reddit community!!"},{"version_id":"836376680","version_name":"2.68.2","version_date":"2020-06-16 09:36:09.000 +0800","version_description":"◈ Birds chirping, trumpeters trumpeting, and the sweet sound of coins hitting your wallet. Sound nice? \n<br>◈ Toggle Vibration option in settings - many requests for this one so we hope you all enjoy your new haptic void. <br>◈ Temple of Artemis resource boosting effect has been doubled to 10%.   \n<br>◈ Civic structures, the life blood of your empire are now free to build. So you can save your coins for the Triumphant Arch. \n<br>◈ A number of bug fixes, including the zoom out to world map bug which has been a real nuisance."},{"version_id":"836589524","version_name":"2.69.3","version_date":"2020-06-26 19:23:46.000 +0800","version_description":"◈ We've reduced the chance of back to back popups occuring. \n<br>◈ Fixed a bug where coffee and herb resources overlapped and prevented production.  \n<br>◈ New users will now get 1 free lumberjack and digger.  \n<br> \n<br>We are testing a number of changes to the economy balancing. Please get in touch at feedback@runanempire.com and let us know what you think! \n<br>We love hearing your feedback on Reddit too. The more detailed the better."},{"version_id":"836698335","version_name":"2.70.6","version_date":"2020-07-06 11:37:42.000 +0800","version_description":"◈ We've reduced the chance of back to back popups occurring. \n<br>◈ Fixed a bug where coffee and herb resources overlapped and prevented production.  \n<br>◈ New users will now get 1 free lumberjack and digger.  \n<br> \n<br>We are testing a number of changes to the economy balancing. <br>We love hearing your feedback on Reddit. The more detailed the better."}]