[{"version_id":"816197460","version_name":"1.0","version_date":"2016-01-31 04:27:26.000 +0800","version_description":""},{"version_id":"819930497","version_name":"2.0","version_date":"2017-01-04 17:21:23.000 +0800","version_description":"Calendar 2017 - Now Available<br>Marriage Matching - Now Available<br>Beauty Tips - Added<br>Monthly Sheet - More Info<br>Daily Sheet - Modern and Classic Layouts available now<br>Dictionary - Tamil &amp; English both available now<br>Baby Names - Now you can find baby names (male &amp; female) with modern, classic, religious etc"},{"version_id":"823570079","version_name":"2.1","version_date":"2017-09-07 19:31:59.000 +0800","version_description":"App Crashes due to date issues - Fixed<br>Minor bugs &amp; Minor UI Improvements"},{"version_id":"824774408","version_name":"3.0","version_date":"2017-11-26 19:49:57.000 +0800","version_description":"2018 Calendar Data - Now Available<br>2017 - 2025 Years Data - Also Available<br>Rasi Palan for Sani Peyarchi, Guru Peyarchi, Raaghu and Kethu Peyarchi for Year 2018 - Added"},{"version_id":"825072788","version_name":"3.1","version_date":"2017-11-30 21:49:41.000 +0800","version_description":"**FIX** Month Sheet Data - Now corrected<br>2018 Calendar Data - Now Available<br>2017 - 2025 Years Data - Also Available<br>Rasi Palan for Sani Peyarchi, Guru Peyarchi, Raaghu and Kethu Peyarchi for Year 2018 - Added"},{"version_id":"829498501","version_name":"4.0","version_date":"2018-12-05 03:01:37.000 +0800","version_description":"Year 2019 Calendar Data Available<br>Year 2019 - Important Days such as Marriage Days, Government Holidays, Fasting Days Available<br>App Stability Issues - Fixed and overall performance improved<br>App Experience - Minor updates on UI Screens, reduced navigation between screens and reordered important information"},{"version_id":"834021823","version_name":"5.0","version_date":"2019-12-18 22:23:51.000 +0800","version_description":"As new year arrives, we have brought the complete Tamil Calendar info for 2020, including Rasi Palan, Marriage Days, Government Holidays list and more.<br>Ohh yes, we have an interesting English to Tamil Dictionary packed along with the calendar. And you have got to read more with this calendar."},{"version_id":"834507751","version_name":"5.1","version_date":"2020-01-28 16:07:51.000 +0800","version_description":"Alright, I got few important things covered in the update and many minor issues.<br><br>1. Back not possible from Daily and Monthly sheets - FIXED<br>2. Sani Peyarchi Palangal for year 2020-2022 - NEW<br>3. Minor issues Marriage matching, Numerology and Beauty Tips - FIXED"},{"version_id":"835824530","version_name":"5.2","version_date":"2020-05-05 22:21:05.000 +0800","version_description":"Here we ship a collection minor bug fixes along with additional info.<br><br>1. Theipirai &amp; Valarpirai Info - Fixed Now<br>2. Muhurtha Natkal not displaying properly - Fixed Now<br>3. Back press from Daily Calendar Sheet not working - Fixed Now<br>4. Dictionary Data - Additional words added<br>5. New articles on Daily Sheet - Additional articles added"},{"version_id":"838204562","version_name":"6.2","version_date":"2020-10-15 15:47:12.000 +0800","version_description":"Here is another minor update with some critical bug fixes and two minor features.<br>1. Guru Peyarchi Palankal for 2021-2023 updated now<br>2. App is cleaned up to remove old calendar data<br><br>Bugs<br>1. Horai Timing Issues - Fixed Now<br>2. Raagu, Kuligai, Emakandam and Karnam Timing Issues - Fixed Now<br>3. Close / Back buttons not working on some of the screens - Fixed Now"},{"version_id":"839216286","version_name":"6.4","version_date":"2020-11-23 00:20:39.000 +0800","version_description":"Wishing you all a great festive season and a very prosperous new year. With this release, we have added,<br><br>1. Year 2021 Calendar Data (Good Timing, Marriage Time, Festival &amp; Holidays, Daily Rashi Palan etc)<br>2. New Year 2021 Palankal for all 12 Rashis<br>3. Guru Peyarchi 2020-21 Palankal<br>4. Color-graded the screens such as Thirukural, Rashi Palankal etc"},{"version_id":"839477806","version_name":"6.5","version_date":"2020-12-08 00:12:36.000 +0800","version_description":"Wishing you all a great festive season and a very prosperous new year. With this release &amp; the last one,<br><br>1. Year 2021 Calendar Data (Good Timing, Marriage Time, Festival &amp; Holidays, Daily Rashi Palan etc)<br>2. New Year 2021 Palankal for all 12 Rashis<br>3. Guru Peyarchi 2020-21 Palankal<br>4. Color-graded the screens such as Thirukural, Rashi Palankal etc<br>5. Minor UI misalignment issues in Daily Calendar, Word of the day and notification handling issues - Fixed"},{"version_id":"839639399","version_name":"6.6","version_date":"2020-12-15 23:01:04.000 +0800","version_description":"Wishing you all a great festive season and a very prosperous new year. With this current release &amp; the previous one,<br><br>1. Home Widget NEW - Now you can glance today's info from home widget<br>2. Year 2021 Calendar Data (Good Timing, Marriage Time, Festival &amp; Holidays, Daily Rashi Palan etc)<br>3. New Year 2021 Palankal for all 12 Rashis<br>4. Guru Peyarchi 2020-21 Palankal<br>5. Color-graded the screens such as Thirukural, Rashi Palankal etc<br>6. Minor UI misalignment issues in Daily Calendar, Word of the day and notification handling issues - Fixed"},{"version_id":"839763666","version_name":"6.7","version_date":"2020-12-23 20:23:54.000 +0800","version_description":"Wishing you all a great festive season and a very prosperous new year. With this current release &amp; the previous one,<br><br>1. Complete 2020 Year Events - Upto Dec 20, 2020 Added Now<br>1. Home Widget NEW - Now you can glance today's info from home widget<br>2. Year 2021 Calendar Data (Good Timing, Marriage Time, Festival &amp; Holidays, Daily Rashi Palan etc)<br>3. New Year 2021 Palankal for all 12 Rashis<br>4. Guru Peyarchi 2020-21 Palankal<br>5. Color-graded the screens such as Thirukural, Rashi Palankal etc<br>6. Minor UI misalignment issues in Daily Calendar, Word of the day and notification handling issues - Fixed"},{"version_id":"839891736","version_name":"6.8","version_date":"2021-01-06 04:02:49.000 +0800","version_description":"Wishing you all a very healthy &amp; prosperous new year. With this current release &amp; the previous one,<br><br>1. Rewind 2020 Added<br>2. Home Widget Alignment Issues - Fixed Now<br>3. Year 2021 Calendar Data (Good Timing, Marriage Time, Festival &amp; Holidays, Daily Rashi Palan etc)<br>4. New Year 2021 Palankal for all 12 Rashis<br>5. Guru Peyarchi 2020-21 Palankal<br>6. Color-graded the screens such as Thirukural, Rashi Palankal etc<br>7. Minor UI misalignment issues in Daily Calendar, Word of the day and notification handling issues - Fixed"}]