[{"version_id":"817694815","version_name":"2.0","version_date":"","version_description":""},{"version_id":"818522248","version_name":"2.0.1","version_date":"","version_description":""},{"version_id":"818727848","version_name":"2.0.2","version_date":"2016-09-02 02:35:41.000 +0800","version_description":"Improvements:<br><br>- Fixes an issue where queue could become unresponsive<br>- Fixes issue where extra empty space could be added to the bottom of the queue<br>- Improvements to performance when opening Inbox, History and Starred when you have a lot of "},{"version_id":"818818930","version_name":"2.1","version_date":"2016-09-13 04:10:52.000 +0800","version_description":"Introducing our iMessage App (requires iOS 10)<br>- Easily share recently played episodes with your friends and family<br>- When you receive a recommendation from someone else add it to your queue without leaving the Messages app<br>- Send a “Queued!” sti"},{"version_id":"818937539","version_name":"2.1.1","version_date":"2016-09-26 07:19:11.000 +0800","version_description":"- Fixes certificate pinning issue preventing access to our server.<br>- Fixes push notifications for users who restored from a backup to a new device.<br>- Tapping subscribe before the podcast has finished loading now subscribes instead of failing.<br>- F"},{"version_id":"819173675","version_name":"2.1.2","version_date":"2016-10-06 03:23:55.000 +0800","version_description":"- Fixed an issue where two refreshes could happen at once and episodes could get duplicated.<br>- Cleans up duplicate episodes.<br>- Fixes issue where some downloads would always fail after restoring the Castro 2 database from an iPhone backup. <br>- If t"},{"version_id":"819200812","version_name":"2.2","version_date":"2016-11-28 23:50:47.000 +0800","version_description":"This release focusses on providing convenient access to your podcasts from new places, for those times when you want to quickly start listening with minimal effort.<br><br>NEW FEATURES<br>- CarPlay: You've already queued the episodes you're interested in,"},{"version_id":"819933043","version_name":"2.2.1","version_date":"2016-12-01 05:58:12.000 +0800","version_description":"FIXED IN 2.2.1<br>- Fixes a crash that could happen when downloading large artwork in the Widget.<br><br>NEW IN 2.2<br>This release focusses on providing convenient access to your podcasts from new places, for those times when you want to quickly start li"},{"version_id":"820996546","version_name":"2.3","version_date":"2017-02-22 23:30:53.000 +0800","version_description":"We focused on bug fixes and polish for this version, but we also fit in some nice new features.<br><br>If you enjoy using Castro please rate this version on the App Store.<br><br>[ NEW ]<br><br>* Expanded interactive notifications, including podcast artwo"},{"version_id":"822268625","version_name":"2.4","version_date":"2017-05-26 19:34:56.000 +0800","version_description":"CASTRO 2.4 INTRODUCES ENHANCED AUDIO<br><br>Enhanced Audio improves the listening experience for many podcasts and makes it easier to listen in loud environments. Under the hood, Enhanced Audio applies a dynamic compressor and a peak limiter to increase v"},{"version_id":"822665970","version_name":"2.4.1","version_date":"2017-06-24 04:25:11.000 +0800","version_description":"FEATURES &amp; CHANGES<br>* There’s a new interface orientation lock in Settings-&gt;General .<br>* The notification that invites you to archive the episode when you press pause now triggers with up to 10 mins remaining instead of just 3 mins.<br>* Tappin"},{"version_id":"823680541","version_name":"2.5","version_date":"2017-09-19 08:53:00.000 +0800","version_description":"Drag and Drop! <br>* In iOS 11 you can tap and hold to lift an episode, then drag it.<br>* Drop episodes on the queue, inbox or archive to move them to these locations. <br>* While dragging, tap more episodes with another finger to add them to the bundle."},{"version_id":"824196883","version_name":"2.5.2","version_date":"2017-10-31 06:53:59.000 +0800","version_description":"2.5.2<br>* Adds support for new hardware. Enjoy your new phones guys!<br><br>2.5.1<br>* You can now share whole podcasts as well as individual episodes.<br><br>FIXED<br>* Castro resumes properly after turn by turn directions.<br>* Restoring from an iCloud"},{"version_id":"824370773","version_name":"2.5.3","version_date":"2017-11-22 05:45:05.000 +0800","version_description":"* New design for iPhone X.<br>* Handoff to Mac now works on podcast screens.<br><br>FIXED<br>* Fixes issue where incorrect episode could get associate with a downloaded file, leading to the wrong episode playing.<br>* Fixes a crash that could occur when p"},{"version_id":"825330411","version_name":"2.6","version_date":"2017-12-16 08:11:22.000 +0800","version_description":"New Features:<br>* Backup your Castro data to iCloud Drive<br>Castro will automatically back up your user data every 24 hours. This means that if anything else goes wrong that causes you to lose your data, you will be able to restore everything back the w"},{"version_id":"825734279","version_name":"2.6.1","version_date":"2018-01-26 07:09:03.000 +0800","version_description":"* Confirmation alerts at the bottom of the screen (e.g. when using Archive All) are now dark when Castro is in Night Mode. <br>* After archiving all in Inbox with a podcast filter selected, the selected filter no longer jumps to All, instead it’ll jump to"},{"version_id":"825866262","version_name":"2.6.2","version_date":"2018-02-06 02:03:29.000 +0800","version_description":"* Fixes an issue where queue cells could show invalid time remaining at the end of an episode.<br>* Fixes an issue where Castro’s play position could skip back when resuming playback after pausing. <br>* Castro no longer loses play position if audio is in"},{"version_id":"825962121","version_name":"3.0","version_date":"2018-05-19 13:06:13.000 +0800","version_description":"CASTRO 3<br>* We rebuilt the player engine from scratch. The app is much faster to start playing when streaming and the controls are much more responsive.<br>* The player screen has a new cleaner, simpler layout.<br>* Star the current episode from the pla"},{"version_id":"827394128","version_name":"3.0.1","version_date":"2018-06-05 01:36:08.000 +0800","version_description":"We fixed some bugs:<br><br>* Fixes issue where automatic backups could fail unless one manual backup was created first.<br>* Fixes crash when streaming episodes that redirect endlessly.<br>* Fixes issue where the top episode in the queue could fail to loa"},{"version_id":"827697486","version_name":"3.0.2","version_date":"2018-06-30 06:34:03.000 +0800","version_description":"* Fixes issue where downloads could get stuck “Waiting To Download”.<br>* Fixes some crashes and other issues with the sleep timer.<br>* Fixes issue where pausing from AirPods or Bluetooth remotes could fail after a new episode started through continuous "},{"version_id":"827902505","version_name":"3.0.3","version_date":"2018-07-18 06:50:06.000 +0800","version_description":"* Fixes an issue where audio would appear to play in the interface but not actually be playing. This would usually occur after an audio routing change (e.g. connecting / disconnecting lightning-jack earphones). <br>* Invalid audio files appeared to play b"},{"version_id":"827943927","version_name":"3.0.4","version_date":"2018-07-23 15:01:09.000 +0800","version_description":"As a bonus feature, Castro Plus subscribers can now choose from a collection of alternative app icons.<br><br>If you haven’t yet, please consider subscribing to Castro Plus to support ongoing development and unlock the new app icons and these advanced fea"},{"version_id":"828116269","version_name":"3.1","version_date":"2018-08-07 05:11:00.000 +0800","version_description":"[NEW FEATURES] <br><br>1. Sideloading<br>2. Chapter Pre-Selection<br><br>*** Sideloading ***<br>Import any audio to Castro!  Drop audio files into your iCloud Drive/Castro/Sideloads folder on your Mac, or using the iOS Files app, and they'll appear in you"},{"version_id":"828201449","version_name":"3.1.1","version_date":"2018-08-15 05:40:18.000 +0800","version_description":"* Sideloads in formats other than `m4a` or `mp3` were failing to play, but now any audio file that iOS can play should work, including `wav` and `m4b`<br>* Fixes an issue where Castro could crash when restoring a backup.<br>* Reworks skipping pre-selected"},{"version_id":"828627054","version_name":"3.1.2","version_date":"2018-09-19 06:55:06.000 +0800","version_description":"* Adds Siri shortcuts for “Play my Queue”, “Play and Sleep”, and “Star this episode” — see Castro settings to add these. (requires iOS 12)<br>* Support for new phone and watch sizes.<br>* Dragging an episode up the queue is no longer awkward.<br>* Brings "},{"version_id":"828682715","version_name":"3.1.3","version_date":"2018-09-24 03:43:20.000 +0800","version_description":"Bug Fixes:<br>* The app Icon badge no longer shows an incorrect count.<br>* The indicator on the Inbox tab is no longer incorrectly on even when Inbox is empty.<br>* New episodes of podcasts set up to automatically “Queue Next” were intermittently going s"},{"version_id":"829231748","version_name":"3.2","version_date":"2018-11-13 22:48:42.000 +0800","version_description":"[NEW] Sideloading Action Extension: From a webpage with an audio file on it, tap share, then More, then toggle “Sideload to Castro” on. After that you can use that action to save audio files to your iCloud Drive folder which Castro will pick as Sideloads."},{"version_id":"829353663","version_name":"3.2.1","version_date":"2018-11-21 06:37:26.000 +0800","version_description":"* Adds \"Time Remaining\" to Watch App<br>* Adds controls for Trim Silence, Enhance Voices + Continuous Play to Watch App<br>* Podcast title no longer displayed in the status bar on Watch App<br>* Fixes issue where Sideloads would fail if there was a / in t"},{"version_id":"829700644","version_name":"3.2.2","version_date":"2018-12-22 03:13:49.000 +0800","version_description":"[NEW]<br>* Adds \"Support This Podcast\" button to now playing screen for podcasts that include payment links in their show notes.<br>* Adds haptic feedback to more player buttons.<br><br>[FIXED]<br>* Fixes an issue where Castro could interrupt Siri and res"},{"version_id":"829997241","version_name":"2019.1","version_date":"2019-01-29 04:50:22.000 +0800","version_description":"Our first update of 2019 introduces local search:<br><br>- Use the new search bar at the top of the Archive to quickly find podcasts you're subscribed to<br>- Tap the search icon on a podcast screen to search through episodes in that podcast<br>- You can "},{"version_id":"830202860","version_name":"2019.2","version_date":"2019-03-08 00:05:10.000 +0800","version_description":"NEW STUFF<br>* Discovery Section: Includes featured podcasts on category charts and our own curated recommendations feed. Check back each week to find new curated collections!<br>* Live Search: Searching for podcasts happens live as you type and should be"},{"version_id":"830803892","version_name":"2019.3","version_date":"2019-04-04 22:01:18.000 +0800","version_description":"INTRODUCING TOP PICKS<br>Castro uses your listening activity to highlight the best new episodes across all your subscriptions. Your Top Picks are unique to you and are calculated privately on your device. Look for Top Picks in the \"New\" tab to see what it"},{"version_id":"830955048","version_name":"2019.4","version_date":"2019-05-02 05:06:40.000 +0800","version_description":"[NEW] <br>* Auto Toggle night mode based on screen brightness. Activate this in Settings-&gt;Night Mode<br>* Adds intro text to discovery collections.<br>* Links to Castro podcasts share pages in Show Notes now open directly in Castro<br>* Tapping a link "},{"version_id":"831192857","version_name":"2019.5","version_date":"2019-05-09 18:09:31.000 +0800","version_description":"[NEW]<br>* The Castro Plus pitch screens have been re-designed to explain the subscription-only features much more clearly.<br>* Adds new heart app icons.<br>* About screen in Settings shows the current app version.<br>* Adds \"Export Logs\" feature so user"},{"version_id":"831460720","version_name":"2019.6","version_date":"2019-05-31 02:09:17.000 +0800","version_description":"[CLIP SHARING] Castro now supports sharing clips of podcast episodes. Clips can be up to 60s long and are exported as videos that include the artwork, episode title, podcast name and date of the podcast being shared. You can share on Twitter, Instagram, S"},{"version_id":"831527098","version_name":"2019.7","version_date":"2019-06-03 21:50:25.000 +0800","version_description":"CLIP SHARING IMPROVEMENTS<br>- The button to make a clip is now white instead of red, slightly smaller, and fills in with the Castro gradient as you tap and hold.<br>- Tapping the clip button is more reliable.<br>- A link to the episode is now automatical"},{"version_id":"831701038","version_name":"2019.8","version_date":"2019-06-26 07:17:07.000 +0800","version_description":"* Adds a monthly option to Castro Plus<br>* Fixes iCloud Drive warning and some other issues for thrill seekers<br>* Fixes issue where playback position on the player screen wasn’t updating for every second<br>* Fixes issue where silence trimming could fa"},{"version_id":"832199777","version_name":"2019.9","version_date":"2019-08-03 03:33:27.000 +0800","version_description":"[NEW] Audio-only option when sharing clips.<br>[NEW] Tapping share on now playing screen presents option to share a link to: now playing episode, current timestamp, start of current chapter, now playing podcast.<br>[CHANGED] Inbox is Inbox again.<br>[CHAN"},{"version_id":"832489164","version_name":"2019.10","version_date":"2019-08-25 06:14:40.000 +0800","version_description":"BUG FIXES<br>- Action button on episodes in Inbox and Queue could get into a state where they didn’t work as expected<br>- Next episode was not always auto-selected properly after clearing an episode from Inbox or Queue<br>- Show notes screen was not gett"},{"version_id":"832654721","version_name":"2019.11","version_date":"2019-09-21 05:30:50.000 +0800","version_description":"Automatic Night Mode &amp; Watch Sync Beta<br><br>iOS 13 is here, and we’re ready to roll. Alongside some foundational compatibility support, we’re happy to announce that Night Mode can be set up to listen to Apple’s system night mode setting. Head on ove"},{"version_id":"832959018","version_name":"2019.12","version_date":"2019-10-09 05:59:22.000 +0800","version_description":"With this update, Castro’s Night Mode is now darker, to fit in better with the iOS 13 aesthetic, and includes a true black background on the Now Playing screen.<br><br>We’re also introducing some goth app icon options for Castro Plus subscribers who aren'"},{"version_id":"833102289","version_name":"2019.13","version_date":"2019-10-16 05:42:38.000 +0800","version_description":"THIS UPDATE 2019.13<br><br>- Clips shared from the Now Playing screen can now be up to 3 minutes long<br>- Fixes an issue that meant that after a delete and reinstall the app wouldn't know your Castro Plus status until you tapped Restore Purchases<br>- Ma"},{"version_id":"833483739","version_name":"2019.14","version_date":"2019-11-18 13:11:55.000 +0800","version_description":"WATCH SYNC IS HERE<br>All your favorite podcasts on your wrist. <br><br>Watch sync frees you up to listen completely untethered from your iPhone. Whether you’re out on a run, your kids have your phone during a road trip, or you just want to go phoneless f"},{"version_id":"834047136","version_name":"2019.15","version_date":"2019-12-23 19:29:48.000 +0800","version_description":"CHANGES<br>- Inbox now contains a banner for promoted podcasts. Castro Plus subscribers can choose to hide them.<br>- Chapter artwork, and artwork embedded in downloaded audio files, will now show on the lock screen and in CarPlay as well as on the Now Pl"},{"version_id":"834223435","version_name":"2020.1","version_date":"2020-01-08 02:39:58.000 +0800","version_description":"Promoted content in Inbox is now off by default for Castro Plus subscribers instead of needing to be toggled off in settings.<br><br>Apologies for this oversight. The setting had been this way for the better part of the year with Discover promotions, but "},{"version_id":"834487887","version_name":"2020.2","version_date":"2020-01-31 06:55:17.000 +0800","version_description":"Sideloads may now be both deleted and shared directly within Castro. <br><br>CarPlay users can now enjoy access to Top Picks, Starred, History, Sideloads, and Library.<br><br>Promoted Podcasts in the Inbox have been redesigned to be a little easier on the"},{"version_id":"834712732","version_name":"2020.5","version_date":"2020-02-15 00:28:17.000 +0800","version_description":"THIRD TIME LUCKY?<br>We tried to&nbsp;introduce an early supporter Castro Plus discount in 2020.3 but some errors prevented it from being available in the app. We hope it's there now!<br><br>If you purchased Castro when it was a paid app, have never subsc"},{"version_id":"834916924","version_name":"2020.6","version_date":"2020-03-04 11:14:45.000 +0800","version_description":"REVAMPED DISCOVERY<br>- Smart Categories Card: We now make it easier for you to jump in and find new shows in your favorite categories.<br>- Browse All Categories: Tap on \"More...\" to see all podcast categories in Castro, sorted by your interests!<br>- Qu"},{"version_id":"835016200","version_name":"2020.7","version_date":"2020-03-12 01:07:49.000 +0800","version_description":"BUG FIXES<br>- Fixed a crash that could happen after subscribing to a new show by tapping (+) in Discover<br>- Fixed a crash that could happen after refreshing content in Discover<br>- Fixed some internal reporting issues related to promoted content in Di"},{"version_id":"835266675","version_name":"2020.8","version_date":"2020-03-28 09:08:11.000 +0800","version_description":"BUG FIXES<br>- Fix for \"Show More Episodes\" not always working when browsing to a podcast in Discover<br>- Fix for wrong podcast getting subscribed to when tapping (+) buttons in Discover category listings<br>- Fix for a crash that could happen when pulli"},{"version_id":"836414462","version_name":"2020.9","version_date":"2020-06-18 14:20:24.000 +0800","version_description":"SIRI + SHORTCUTS INTEGRATION<br><br>SIRI<br>- Ask Siri to play any show in Castro, whether or not you're subscribed to it- and Castro will find the episode of that show that makes the most sense to play.<br>- Ask Siri to play the news in Castro, and Castr"},{"version_id":"836609934","version_name":"2020.10","version_date":"2020-06-30 07:01:14.000 +0800","version_description":"Feedback Integration Release<br><br>- Intra-chapter images are now supported! Mr. Thompson feel free to update that chart. Mr. Thompson feel free to update that chart.  <br>- Ryan on Twitter asked for yellow versions of our app icons for Castro Plus users"},{"version_id":"838060219","version_name":"2020.12","version_date":"2020-10-06 01:45:21.000 +0800","version_description":"QUICK BUG FIXES<br>Fixes a crash that could happen when performing actions on new episode notifications. Also fixes another issue that could prevent actions taken on new episode notifications from sticking (e.g. you might clear an episode from a notificat"},{"version_id":"838850492","version_name":"2020.13","version_date":"2020-11-13 07:07:30.000 +0800","version_description":"Widgets! <br>You can now add small, medium and large Queue widgets to your home screen. You'll get a short-list of episodes at the top of the Queue, as well as stats displaying total episode count as well as duration. There are both light and dark mode op"},{"version_id":"839075178","version_name":"2020.14","version_date":"2020-11-15 23:44:16.000 +0800","version_description":"2020.14<br>- Fixes a bug that could cause Castro widgets to disappear from your homescreen.<br>- Private feeds are now marked properly as so and sharing is disabled on them.<br><br>2020.13<br>Widgets! <br>You can now add small, medium and large Queue widg"},{"version_id":"839308906","version_name":"2020.15","version_date":"2020-11-26 01:41:17.000 +0800","version_description":"WIDGETS IMPROVEMENTS<br>- In medium and large widgets you can now choose whether tapping an episode plays it immediately or just jumps to the episode details screen. Tap and hold on a widget and choose “Edit Widget” (or “Edit Castro” if it’s in a stack) t"},{"version_id":"839587700","version_name":"2020.16","version_date":"2020-12-21 00:14:07.000 +0800","version_description":"PLAYERS GONNA PLAY?<br>This version of Castro should be much faster and more reliable at resuming playback after interruptions like phone calls, alarms, timers, Siri, etc. I also fixed a bug that could get the play/pause buttons stuck in the wrong state a"},{"version_id":"840349717","version_name":"2021.1","version_date":"2021-02-09 05:00:05.000 +0800","version_description":"BUG FIX RELEASE<br>- Fixes issues where playback would be jumpy on certain podcast episodes, specifically those with sample rate lower of 32kHz or lower<br>- Fixes issue where app could get stuck in a state of showing error messages on every refresh<br>- "}]