[{"version_id":"816454612","version_name":"2.0","version_date":"2016-04-04 16:50:39.000 +0800","version_description":""},{"version_id":"822550997","version_name":"3.0","version_date":"2017-06-26 16:39:27.000 +0800","version_description":"BREAKING NEWS *** ShutterCount Mobile 3 supports recent Canon EOS DSLRs!\n\nNew camera support:\n• Canon 5D Mark IV, 5DS + W-E1, 5DS R + W-E1, 77D, 80D, 800D, 9000D, Kiss X9i, Rebel T7i using Wi-Fi connection.\n\nNew features:\n• Introducing the Live View Pack. The app displays the count for still photos by default - purchase the optional Live View Pack to get additional counters that also cover videos. The Live View Pack is available as an in-app purchase for the following Canon camera models: 5D Mark IV, 5DS + W-E1, 5DS R + W-E1, 6D, 7D Mark II + W-E1, 70D, 77D, 80D, 800D, 9000D, Kiss X9i, Rebel T7i. Must use the W-E1 card for 5DS, 5DS R and 7D Mark II - WFT-E7 transmitter connections will not work.\n• \"Share Report\" creates a more detailed shutter count report when either the Live View Pack or the Plus Pack is purchased.\n\nFixes:\n• Corrected the month display on Graphs when the data spans more than 5 years."},{"version_id":"823228303","version_name":"3.1","version_date":"2017-08-24 02:28:30.000 +0800","version_description":"New features:\n• Added support for Canon EOS 6D Mark II, 200D/Rebel SL2/Kiss X9.\n• Camera selection is synchronized between the History and Graph tabs. History and Graph will automatically show the camera displayed on the Summary tab when a new reading is made."},{"version_id":"828960122","version_name":"3.4","version_date":"2018-10-20 14:59:17.000 +0800","version_description":"New features:\n• Mirrorless camera support for Canon EOS R and M50/Kiss M.\n• Added support for iPhone XS Max and XR screen sizes.\n• Added a menu item to quickly access our privacy policy and a privacy notice before sending a problem report."},{"version_id":"829181753","version_name":"3.5","version_date":"2018-11-29 18:14:34.000 +0800","version_description":"New features:\n• File Mode to read the shutter counter stored in Nikon and Pentax photos. For the complete list of certified cameras please see the app description. File Mode works by opening original images from Photos, so you have to make a photo with your camera and import this unmodified original into Photos first. Possible ways to import include: using a Lightning to USB Camera Adapter, direct USB connection on iPad Pro 11\" and iPad Pro 12.9\" 3rd Generation, or the camera manufacturer's iOS app. File Mode requires iOS 12 or later.\n• French localization.\n• Added support for iPad Pro 11\" and iPad Pro 12.9\" 3rd Generation."},{"version_id":"831280161","version_name":"4.0","version_date":"2019-06-05 14:25:52.000 +0800","version_description":"New features:\n• Added support for Canon EOS RP and 250D/Rebel SL3/Kiss X10/200D Mark II.\n• Added shutter rating for Nikon D850.\n• Auto power off is prevented on connected Canon cameras by default. It can be disabled in the menu.\n\nWHAT'S NEW IN THE PLUS PACK\n\nNew features for Canon EOS cameras:\n• The copyright information template provides an easy way to set and maintain author and copyright metadata. Supports tokens for the current year (so it's always up-to-date), owner/author name and the copyright symbol. Also sets copyright tags in IPTC information on cameras having IPTC support.\n• Owner name editing. Click the \"Owner Name\" label on the \"Summary\" tab or choose \"Camera Settings\" and then \"Edit Owner Name\" in the menu to edit it.\n• IPTC export/import for cameras that support IPTC information (EOS-1D X Mark II, 5D Mark IV, R). The created files are compatible with Kuuvik Capture and Canon EOS Utility.\n• Date/time is synchronized immediately on all connected cameras when \"Sync Camera Date/Time\" is set."},{"version_id":"832790503","version_name":"4.1","version_date":"2019-09-19 00:49:20.000 +0800","version_description":"New features:\n• iOS 13 compatibility, including support for Dark Mode."},{"version_id":"833132343","version_name":"4.2","version_date":"2019-10-14 16:22:07.000 +0800","version_description":"New features:\n• Added support for Canon EOS 90D and Nikon Z50.\n• Improved connection error messages.\n• Support for the 10.2\" iPad screen size."},{"version_id":"834222500","version_name":"4.3","version_date":"2020-01-06 04:29:52.000 +0800","version_description":"New features:\n• Added support for Canon EOS M6 Mark II and EOS Ra."},{"version_id":"835194494","version_name":"4.4","version_date":"2020-03-22 02:47:17.000 +0800","version_description":"BREAKING NEWS *** ShutterCount Mobile now supports USB connected Canon EOS cameras! For the complete list of supported cameras please refer to the description below or our Tech Specs page: https://www.direstudio.com/shuttercount/tech-specs/\nFor detailed connection instructions check out the Getting Started Guide: https://www.direstudio.com/shuttercount/getting-started/\n\nUSB connection requires a Lightning to USB Camera Adapter or a USB-C equipped iPad and iOS/iPadOS 13.4 or later.\n\nAdditional New features:\n• Added support for Canon EOS-1D X Mark III.\n\nFixes:\n• Worked around a 1D X Mark II firmware bug that could hang the camera when copyright information or IPTC data is set while live view is active."}]