[{"version_id":"821207903","version_name":"1.0.1","version_date":"2017-03-07 16:06:38.000 +0800","version_description":"The Grid 1.0.1 is a minor update focused on bug fixes.<br><br>• Posting to Instagram – Fixed a problem where Instagram would not have your photos and videos already selected when posting to Instagram.<br>• Crash – Fixed a crash that could occur when deleting posts.<br><br>If you have any feedback or questions, I'd love to hear from you! I offer free technical support; you can email hello@thegridapp.co or tweet @The_GridApp.<br><br>If The Grid empowers you, I would appreciate an App Store review. Your review will help other people find The Grid and make them more productive too."},{"version_id":"823941873","version_name":"1.0.2","version_date":"2017-10-10 00:48:13.000 +0800","version_description":"• Bug fixes for new iOS devices."},{"version_id":"825426488","version_name":"2.0","version_date":"2018-01-07 18:55:03.000 +0800","version_description":"• Sync your existing Instagram feed with The Grid. Now you can visualize how future posts fit into your past posts during your planning.<br>• The Grid's new design makes it easier to manage multiple grids."},{"version_id":"827756122","version_name":"2.0.1","version_date":"2018-07-09 14:34:06.000 +0800","version_description":"• Faster Instagram syncing.<br>• Fixed bug that would cause older posts that were synced from Instagram to not load."},{"version_id":"832020853","version_name":"2.0.2","version_date":"2019-08-27 19:49:37.000 +0800","version_description":"I added some tips on the Instagram login screen on what to do if you have problems logging in."},{"version_id":"832760441","version_name":"2.1","version_date":"2019-09-17 14:03:15.000 +0800","version_description":"Added support for iOS 13:<br>• Dark Mode<br>• Context Menus"},{"version_id":"832811686","version_name":"2.1.1","version_date":"2019-09-18 17:08:32.000 +0800","version_description":"The Grid 2.1.1 is a minor update focused on bug fixes and minor improvements.<br><br>• iOS 11 – Added back support for iOS 11.<br>• Posting – Attempted to fix an error from Instagram that occurred when creating a new post that read: \"Something went wrong, please try again later.\"<br>• Various – Smaller fixes and improvements, including an issue that caused some button titles to be incorrect (example: \"Delete 1 Photos\" instead of \"Delete Photo\").<br><br>If The Grid empowers you, I would appreciate an App Store review. Your review will help other people find The Grid and make them more organized too."},{"version_id":"832906778","version_name":"2.2","version_date":"2019-10-05 09:22:45.000 +0800","version_description":"Added support for Portuguese, Japanese, Russian, French, Indonesian, and Spanish."},{"version_id":"833065360","version_name":"2.2.1","version_date":"2019-10-08 17:40:54.000 +0800","version_description":"Fixed crashes that occurred when rearranging posts in your grid."},{"version_id":"835246292","version_name":"2.2.2","version_date":"2020-03-27 22:17:17.000 +0800","version_description":"Modernized the way the app syncs with Instagram.<br><br>Instagram is disabling the previous methods used for syncing. You must upgrade to continue syncing with Instagram."},{"version_id":"835349188","version_name":"2.2.3","version_date":"2020-04-01 12:25:17.000 +0800","version_description":"- Made it easier to log in to multiple Instagram accounts.<br>- Fixed bug that prevented linking to Instagram accounts that had 0 posts.<br>- Fixed some crashes."},{"version_id":"835396411","version_name":"2.2.4","version_date":"2020-04-03 18:23:35.000 +0800","version_description":"The last version gave everyone the upgrade for free (bad for me; good for you). This version fixes that bug.<br><br>If you have already created multiple grids, you get to keep the extra ones. Going forward, you'll need to purchase the upgrade to create more grids."},{"version_id":"835557176","version_name":"2.2.5","version_date":"2020-05-26 21:49:14.000 +0800","version_description":"Fixed crashes that occurred when deleting posts."},{"version_id":"836273784","version_name":"2.2.6","version_date":"2020-06-04 19:11:54.000 +0800","version_description":"Made improvements for sending feedback."},{"version_id":"836767629","version_name":"2.2.7","version_date":"2020-08-04 00:16:18.000 +0800","version_description":"Minor improvements"},{"version_id":"837386041","version_name":"2.3.0","version_date":"2020-09-24 11:35:27.000 +0800","version_description":"Added support for iOS 14."},{"version_id":"842476376","version_name":"2.4.0","version_date":"2021-06-14 20:50:12.000 +0800","version_description":"Added support for Afrikaans, Albanian, Amharic, Arabic, Armenian, Assamese, Azerbaijani, Bangla, Bosnian, Bulgarian, Cantonese (Traditional), Catalan, Chinese Simplified, Chinese Traditional, Croatian, Czech, Danish, Dutch, Estonian, Filipino, Finnish, French (Canada), German, Greek, Gujarati, Hebrew, Hindi, Hungarian, Icelandic, Inuktitut, Irish, Italian, Kannada, Kazakh, Khmer, Korean, Kurdish (Central), Lao, Latvian, Lithuanian, Malagasy, Malay, Malayalam, Maltese, Maori, Marathi, Myanmar, Ne pali, Norwegian, Odia, Pashto, Persian, Polish, Portuguese (Portugal), Punjabi, Romanian, Serbian (Cyrillic), Serbian (Latin), Slovak, Slovenian, Swahili, Swedish, Tamil, Telugu, Thai, Tigrinya, Tongan, Turkish, Ukrainian, Urdu, Vietnamese, and Welsh."}]