[{"version_id":"816516929","version_name":"2.13.2","version_date":"2016-03-07 18:28:10.000 +0800","version_description":""},{"version_id":"817567784","version_name":"2.13.3","version_date":"2016-06-02 17:38:57.000 +0800","version_description":"You asked, we deliver !<br><br>Couple of new features<br><br>Added display of total duration of all files in a folder or playlist<br>New setting added to switch between display of filename vs metadata<br>Repeat function added to the player<br><br>...and fixes<br><br>Fixed scanning of m4b files<br>Fixed bug with seek &amp; rewind buttons not functioning properly<br><br>If you think CloudBeats is worthy, please review it on the Appstore. This helps us a lot and is much appreciated! Thanks."},{"version_id":"819799467","version_name":"2.16.3","version_date":"2016-11-22 20:23:18.000 +0800","version_description":"- Amazon Cloud Drive support<br>- Numerous fixes and performance improvements"},{"version_id":"821063947","version_name":"2.16.8","version_date":"2017-03-03 15:40:56.000 +0800","version_description":"Switched to using newer version of Dropbox API and Google Drive authentication method<br>Added 3x speed<br><br>If you enjoy using Cloudbeats, please spend a minute and submit a positive review. This really helps and keeps us motivated to work on the new updates. Thank you."},{"version_id":"822166280","version_name":"2.16.11","version_date":"2017-05-17 23:44:13.000 +0800","version_description":"NOTE. You will be asked to sign in again into the connected cloud after this update.<br><br>This update includes several fixes."},{"version_id":"823439896","version_name":"2.17.1","version_date":"2017-08-26 21:09:33.000 +0800","version_description":"New functionality:<br><br>- A configurable setting to reset sleep timer when device moves, signaling that you are still awake<br>- Mark entire folders as finished/unfinished<br>- If you are not willing for certain files to appear in My Library, you can now remove either a single track, album or entire folder from the Library.<br>- Pull down the screen to refresh is still an option but it is no longer necessary as Cloudbeats will automatically refresh folder content when entering it.<br>- Navigate back to the parent folder with swipe gesture.<br><br>Fixed:<br><br>- Device space was not cleared up after renaming downloaded file in the cloud.<br>- Removed Unknown artist from the list in My Library.<br>- Fixed order in which folders and tracks are added to Queue and Playlist.<br>- Fixed several playlist synchronization problems.<br>- Fixed bug when tracks were skipped on 2x speed.<br>- Search results by Songs are sorted by title now.<br>- Fixed crash when enabling iTunes library with large number of tracks.<br><br>- Removed Cellular Data app option as it was conflicting with identical device setting<br><br>If you are still enjoying Cloudbeats, please spend a minute and update your review on the Appstore. This is really helpful and keeps us motivated to support the app!"},{"version_id":"823534994","version_name":"2.17.4","version_date":"2017-10-07 21:47:40.000 +0800","version_description":"iOS 11 compatibility update<br>Improved speed up playback (pitch control)<br><br>If you like CloudBeats, please spend a minute and submit a positive review on the Appstore. This is really helpful and keeps us motivated to support the app!"},{"version_id":"825482498","version_name":"2.18.4","version_date":"2017-12-31 07:34:49.000 +0800","version_description":"Improved sound quality while playing on higher speeds<br>Tweaked UI for iPhone X <br>Fixed problem when download was not starting immediately<br>Fixed playback issue on m4a files longer than 1 hour<br>Fixed missing menu items on a folder<br><br>If you enjoy Cloudbeats, please spend a minute and submit a positive review on the Appstore. This is really helpful and keeps us motivated to support the app!"},{"version_id":"825739831","version_name":"2.19.2","version_date":"2018-01-24 17:03:51.000 +0800","version_description":"Now you can type notes in the bookmarks<br>Listening progress is now displayed on a folder and playlist<br>Added support of OneDrive for Business <br><br>If you enjoy Cloudbeats, please spend a minute and submit a positive review on the Appstore. This is really helpful and keeps us motivated to support the app!"},{"version_id":"826176717","version_name":"2.20.1","version_date":"2018-03-04 22:14:52.000 +0800","version_description":"Fixed error when playing m4b files<br>Improved performance of My Library<br>Added support for Recently Uploaded smart playlist<br>Saved position in the track is being reset now when track is marked as Finished<br>Import your m3u playlists stored in the cloud<br><br>If you enjoy Cloudbeats, please spend a minute and submit a positive review on the Appstore. This is really helpful and keeps us motivated to support the app!"},{"version_id":"826774224","version_name":"2.21.4","version_date":"2018-04-27 17:46:49.000 +0800","version_description":"Fixed Dropbox login problem<br>Added a setting to read album art from the image in the folder. The following filenames are treated as album covers: folder.jpg, cover.jpg, albumartsmall.jpg, albumart.jpg, album.jpg, thumb.jpg and same filenames with .png extension.<br><br>If you enjoy Cloudbeats, please spend a minute and submit a positive review on the Appstore. This is really helpful and keeps us motivated to support the app!"},{"version_id":"828165029","version_name":"2.22.0","version_date":"2018-08-16 00:04:29.000 +0800","version_description":"With this release we are introducing an optional service for Synchronization &amp; Backup to keep your playlists, scanned My Library database and audiobooks listening progress in sync between multiple devices. It can also be used to backup and restore your music data. <br><br>We really appreciate the feedback you might have via email. We read every email and reply as soon as we can! Thank you."},{"version_id":"828299510","version_name":"2.22.1","version_date":"2018-08-21 19:43:46.000 +0800","version_description":"Fixed problem with user logout from synchronization service after app closure<br>Fixed crash<br><br>We really appreciate the feedback you might have via email. We read every email and reply as soon as we can! Thank you."},{"version_id":"828364970","version_name":"2.22.2","version_date":"2018-08-27 18:54:13.000 +0800","version_description":"Fixed Onedrive for Business login problem"},{"version_id":"828489479","version_name":"2.22.3","version_date":"2018-09-07 18:18:03.000 +0800","version_description":"Several fixes and improvements"},{"version_id":"828591088","version_name":"2.22.4","version_date":"2018-09-14 20:34:16.000 +0800","version_description":"Fixed Google Drive login problem<br>Added pCloud support"},{"version_id":"829192622","version_name":"2.23.2","version_date":"2018-11-07 16:46:38.000 +0800","version_description":"Added function to delete the file from cloud<br>Added convenient way to close Now Playing screen with swipe down gesture<br>Several fixes and improvements"},{"version_id":"830354321","version_name":"2.23.7","version_date":"2019-02-20 18:29:03.000 +0800","version_description":"We have added listening progress to the album view<br>Several tweaks and performance optimizations"},{"version_id":"831203127","version_name":"2.26.1","version_date":"2019-05-10 14:07:00.000 +0800","version_description":"We have added support of Carplay and fixed several issues"},{"version_id":"832863182","version_name":"2.26.7","version_date":"2019-09-25 17:24:01.000 +0800","version_description":"Minor bug fixes and UI improvements<br>iOS 13 compatibility fixes<br><br>You will be asked to reconnect to the cloud after the update. Apologies for the inconvenience.<br><br>We regret to inform that CloudBeats integration to the Amazon Drive is discontinued. Amazon has disallowed all third-party apps to access Amazon Drive via API but you will continue to have access to your content through Amazon first party applications. Your music files remain on Cloud Drive, but Cloudbeats can no longer access them. Please consider moving your music collection to another cloud to use CloudBeats. If you have any questions, please contact us with email."},{"version_id":"832990152","version_name":"2.26.9","version_date":"2019-10-09 18:20:04.000 +0800","version_description":"Fixes synchronisation<br>Other fixes and improvements<br><br>If you enjoy using Cloudbeats, please spend a minute and submit a positive review on the Appstore. This really helps and keeps us motivated to keep working on the app. We are reading every review!"},{"version_id":"834638882","version_name":"2.27.6","version_date":"2020-02-11 21:02:59.000 +0800","version_description":"Fixed Google Drive problem"},{"version_id":"835375512","version_name":"2.27.11","version_date":"2020-04-06 15:16:08.000 +0800","version_description":"In this update we have made a few fixes and improvements"},{"version_id":"835819037","version_name":"2.27.14","version_date":"2020-05-05 17:33:42.000 +0800","version_description":"Fixed scanning bug when the first file in the folder was sometimes skipped<br>Fixed synchronization issue when listening progress was not sometimes synched<br><br>If you enjoy using the app, please spend a minute and submit a positive review to the Appstore. We are reading every review and appreciate all your feedback and comments."},{"version_id":"836294861","version_name":"2.28.1","version_date":"2020-06-09 18:55:06.000 +0800","version_description":"Support of dark mode<br><br>If you enjoy using the app, please spend a minute and submit a positive review to the Appstore. We are reading every review and appreciate all your feedback and comments."},{"version_id":"836896269","version_name":"2.29.5","version_date":"2020-07-21 20:14:56.000 +0800","version_description":"Fixed problem with Dropbox login"},{"version_id":"837214268","version_name":"2.29.8","version_date":"2020-08-06 22:40:20.000 +0800","version_description":"Bug fixes and improvements"},{"version_id":"837574462","version_name":"2.29.12","version_date":"2020-09-01 15:58:08.000 +0800","version_description":"Added some stats about the size of your library and fixed several bugs"},{"version_id":"837694983","version_name":"2.29.13","version_date":"2020-09-10 16:30:48.000 +0800","version_description":"Fixed bug in sign up for synchronisation service"},{"version_id":"838299145","version_name":"2.29.16","version_date":"2020-10-23 16:22:55.000 +0800","version_description":"New features:<br>+ Choose to keep downloaded files after logout from the cloud<br>+ Connect to EU pCloud server<br><br>Several bug fixes and UI improvements"},{"version_id":"839443453","version_name":"2.31.1","version_date":"2020-12-04 19:53:37.000 +0800","version_description":"New functionality:<br>+ miniplayer for convenient access to Play/Pause buttons from any screen<br>+ switch audio to headphones or speakers directly from the player<br>+ improved user interface for adding tracks to playlist<br>+ import audio files from Files app and iCloud Drive<br><br>Fixed<br>- bug when in some cases wrong cover art was displayed<br>- bug when lyrics would not update between tracks<br>- scrolling to the top inside the playlist when track changes<br>- fix for My Cloud Home authentication"},{"version_id":"839910436","version_name":"2.33.4","version_date":"2021-01-06 19:44:49.000 +0800","version_description":"We've fixed number of reported issues and made few improvements. Thank you for your feedback!<br><br>Fixed several UI glitches in playlists screens<br>Fresh look to album and genres screen<br>Added forward button to the miniplayer<br>Added search function to playlist<br>Added handling of the situation when folder or files were deleted in the cloud or moved to another location"},{"version_id":"840026178","version_name":"2.33.5","version_date":"2021-01-20 20:44:52.000 +0800","version_description":"Fixed issue when empty files with 00:00 duration where created during download error.<br>Fixed Select All button<br>Added listening progress bar album songs<br>Few minor UI improvements"},{"version_id":"840440277","version_name":"2.34.0","version_date":"2021-02-18 07:12:05.000 +0800","version_description":"The app is going from the paid one to free with in-app purchase to unlock Premium functions. Customers who purchased the app before, will retain access to all functionality and won't need to purchase it again. If Premium functions are not available to you when they should, please try restarting the app and if that does not help, send us email.<br><br>Fixed bug when you were occasionally signed out from synchronization service"},{"version_id":"840625465","version_name":"2.35.0","version_date":"2021-02-27 17:28:30.000 +0800","version_description":"Updated integration with Dropbox, Onedrive and Onedrive for Business to the latest version. All data in the app will remain but you will be asked to sign in to the cloud once. If you experience any issues during this transition, please let us know via email."}]