[{"version_id":"816618904","version_name":"1.0.1","version_date":"2016-03-21 23:59:04.000 +0800","version_description":"This update is here to fix small bugs and bring minor improvements. More updates with actual features will come in the near future, but we wanted to make sure those bugs were squashed asap! <br><br>Those of you who tried to tap on the Next or Previous buttons like maniacs and managed to crash the app will be happy to hear that this has now been fixed. We have enlisted the services of the fastest screen tapper in the word (a 106 year old man called Lei Ying Lo from Motuo, China) and have verified that even at 16 taps per second, the app will remain stable. Try to beat that! <br><br>We have also made some very minor improvements that you probably won't be able to notice. These improvements will hopefully make you sleep better at night knowing we were proactive in taking care of stuff. <br><br>Now we have a small favor to ask... App Store reviews are very important to us, so if you like the iDB app, would you please consider leaving a review? Thank you very much, and do not hesitate to reach out if you have any question or comment."},{"version_id":"816748141","version_name":"1.1 is really not good enough to get fired over.SAN FRANCISCO FONTFollowing the riots that have started in 496 cities across 16 countries","version_date":"","version_description":""},{"version_id":"816748141","version_name":"1.0.2","version_date":"","version_description":""},{"version_id":"817028666","version_name":"1.1.0","version_date":"2016-04-19 00:19:44.000 +0800","version_description":"Before we get started with what’s new and improved, let me tell you that this update does not contain an in-app purchase to remove ads yet. This is not because we want to push ads down your throats. It’s just that before adding such an important feature, we want to make sure that the foundations of the app are perfect. Ad removal is definitely coming, so please bear with us. <br><br>Now that we have that out of the way, let’s move to the exciting stuff, shall we?<br><br>BOOKMARKS<br><br>Close your eyes and imagine this. It’s the morning, and as usual, you’re late for work. Suddenly, you see this awesome article on iDB about this new app, or cool accessory, or amazing news that just dropped. You just don’t have time to read it, because remember, you’re late for work. Well, now you can double tap on that article Card to save it as a bookmark and return to it later. Or simply tap the Bookmark icon in the Article view, and BAM, it’s saved to your list of bookmarks, just like that. Now if you’re really late for work, get going and resume reading this changelog later. Version 1.1 is really not good enough to get fired over.<br><br>SAN FRANCISCO FONT<br><br>Following the riots that have started in 496 cities across 16 countries, we have added support for the San Francisco font. You can now change the default font to San Francisco either from the general Settings of the app, or directly from an Article view. San Francisco is a beautiful city, and an even better font, so quite frankly, I’m not sure why this wasn’t part of version 1.<br><br>NEW 3D TOUCH SHORTCUT<br><br>“The devil is in the details,” they say. We, at iDB, say “great features are in the details,” like the addition of this new 3D Touch action that can take you to your bookmarks when you press firmly on the iDB app icon. Of course, you must have a compatible device to take advantage of this life-changing feature, specifically an iPhone 6s or iPhone 6s Plus. Or maybe you have a way to add 3D Touch to unsupported devices? None of our business ;)<br><br>BUG FIXES AND STABILITY IMPROVEMENTS <br><br>You know how sometimes changelogs simply mention “bug fixes and stability improvements” without giving you more details than that? Well, that’s because they’re absolutely boring, and in many cases, most users don’t even experience those issues to begin with. Now if you really must know what’s been fixed, let me list this out for you: issue #76, #78, #79, and #83 have all been taken care of once and for all. The most important here is probably #76, which should allow VoiceOver to play nice with the app.<br><br>FUN FACT<br><br>Codename of version 1.1.0 of the iDB app is Green Beagle. Don’t ask me why, because I didn’t come up with it. <br><br>DO YOU LIKE THIS APP?<br><br>If you’ve taken the time to read through this unnecessarily long list of changes and additions, then it probably means you like the iDB app. If that’s the case, would you mind taking a minute to rate, and maybe even review this app in the App Store? For every 5-star rating we get, we will donate a unicorn to the Mythological Society of Westeros. <br><br>MORE SERIOUSLY<br><br>Thank you so much for downloading this app and also for the amazing feedback you have sent us so far. We understand this app might not appeal to everybody, but the large majority of users seem to really like it, so that’s a win in our book.<br><br>As mentioned above, please bear with us as we work on improving the iDB app and adding more features. Very high on the priority list are in-app purchase to remove ads, push notifications, Apple Watch support, and more. Thanks again!"},{"version_id":"817466841","version_name":"1.2.0","version_date":"2016-05-23 15:29:05.000 +0800","version_description":"Besides the usual round of bug fixes and stability improvements, iDB app version 1.2 comes with some major features that a lot of you have been waiting for. So hold down to your seat because you’re about to get wowed. Big time!<br><br>PUSH NOTIFICATIONS<br><br>After updating the app, you will be asked if you want to receive notifications from iDB. The right answer to this question is “heck yes I want to.” Doing so will alert you every time a newsworthy article is published on iDB. Note we will not send notification for every single article published. That would be way overkill, and not so helpful. We want to notify you only about stuff we believe is important. <br><br>REMOVE ADS<br><br>It took us a while but we are happy to say you can now browse the entire app without seeing one single ad. I just heard 20,000 of you scream “finally!” and it really hurt my ears, but it did warm up my heart, so we’re all good. <br><br>There are two levels of in-app purchases available. You can unlock ad removal (and more features) for $0.99 for one month, or $2.99 for one year. At the end of that period, you will be asked whether you want to unlock the features again or not. Note this is not set to auto-renew, so don’t you worry about that. <br><br>Why would you pay one month at a time when you can get one year for the price of three months? Well, maybe you care a lot about iDB and want to financially contribute to make sure we can keep doing what we do best?<br><br>OFFLINE READING<br><br>Buying the in-app purchase will also allow you to access bookmarked articles even if you don’t have an active Wi-Fi or cellular connection. Simply bookmark all articles you want to read offline, and they will be readily available for you at any time.<br><br>MUCH BETTER VOICEOVER SUPPORT<br><br>Accessibility features are something most of us don’t need, but they must be perfect for the very small minority of users that does need them. Today, we are very proud to bring great VoiceOver support to the iDB app, and we couldn’t have done it without the help of our top beta tester, David. It really took us a while to get this right, but David helped us iron all the kinks. Remember in the last changelog how I said that we at iDB believe great features are in the details. This is more true than ever! <br><br>THERE IS STILL MORE TO COME<br><br>The bulk of the iDB app is now in your hands, but we have one more feature in the oven right now, and it’s Apple Watch support. We can’t make any promises, but chances are you will be able to check iDB on your Apple Watch by the end of this century. We know, we know. We’re fast!<br><br>HOW DO YOU LIKE THE iDB APP?<br><br>If you hate it, then please just move along with your day, but if you do love the app, please take some time to rate and review it in the App Store. It means a lot to us.<br><br>THANK YOU SO MUCH<br><br>Can you believe that 21,000+ people have downloaded the iDB app? Yeah, me neither. This is very rewarding, and obviously, it’s all thanks to you. So thank you very much for your ongoing support."},{"version_id":"817520736","version_name":"1.2.1","version_date":"2016-05-25 17:16:28.000 +0800","version_description":"This minor update fixes a bug that would make the currency sign of the in-app purchase always show a $ sign instead of the local currency sign<br><br>And of course, this version also comes with all these great features:<br><br>PUSH NOTIFICATIONS<br><br>After updating the app, you will be asked if you want to receive notifications from iDB. The right answer to this question is “heck yes I want to.” Doing so will alert you every time a newsworthy article is published on iDB. Note we will not send notification for every single article published. That would be way overkill, and not so helpful. We want to notify you only about stuff we believe is important. <br><br>REMOVE ADS<br><br>It took us a while but we are happy to say you can now browse the entire app without seeing one single ad. I just heard 26,000 of you scream “finally!” and it really hurt my ears, but it did warm up my heart, so we’re all good. <br><br>There are two levels of in-app purchases available. You can unlock ad removal (and more features) for $0.99 for one month, or $2.99 for one year. At the end of that period, you will be asked whether you want to unlock the features again or not. Note this is not set to auto-renew, so don’t you worry about that. <br><br>Why would you pay one month at a time when you can get one year for the price of three months? Well, maybe you care a lot about iDB and want to financially contribute to make sure we can keep doing what we do best?<br><br>OFFLINE READING<br><br>Buying the in-app purchase will also allow you to access bookmarked articles even if you don’t have an active Wi-Fi or cellular connection. Simply bookmark all articles you want to read offline, and they will be readily available for you at any time.<br><br>MUCH BETTER VOICEOVER SUPPORT<br><br>Accessibility features are something most of us don’t need, but they must be perfect for the very small minority of users that does need them. Today, we are very proud to bring great VoiceOver support to the iDB app, and we couldn’t have done it without the help of our top beta tester, David. It really took us a while to get this right, but David helped us iron all the kinks. Remember in the last changelog how I said that we at iDB believe great features are in the details. This is more true than ever! <br><br>THERE IS STILL MORE TO COME<br><br>The bulk of the iDB app is now in your hands, but we have one more feature in the oven right now, and it’s Apple Watch support. We can’t make any promises, but chances are you will be able to check iDB on your Apple Watch by the end of this century. We know, we know. We’re fast!<br><br>HOW DO YOU LIKE THE iDB APP?<br><br>If you hate it, then please just move along with your day, but if you do love the app, please take some time to rate and review it in the App Store. It means a lot to us.<br><br>THANK YOU SO MUCH<br><br>Can you believe that 26,000+ people have downloaded the iDB app? Yeah, me neither. This is very rewarding, and obviously, it’s all thanks to you. So thank you very much for your ongoing support."},{"version_id":"817910304","version_name":"1.2.2","version_date":"2016-06-28 18:05:20.000 +0800","version_description":"Poem for an update<br><br>This update addresses a small bug<br>Which prevented images to display properly.<br>We won't settle for a shrug,<br>Because now images work without anomaly."},{"version_id":"818308111","version_name":"1.3.0","version_date":"2016-08-02 16:18:36.000 +0800","version_description":"NEW AND IMPROVED<br><br>With the addition of Apple Watch support, you can now get a glimpse at the latest iDB articles right from your wrist. This is a great way to have a quick look at the latest headlines without pulling your iPhone out of your pocket. Simply tap on a headline to read an excerpt of the post, and you’ll be able to stay up-to-date with everything Apple in a very beautiful yet impractical way.<br><br>We’ve also tweaked a couple things here and there under the hood. One of the main annoyances that was fixed is this issue where music would stop playing when browsing the app. We’ve also fixed post headlines so the font matches your font settings.  <br><br>SUBSCRIBE IF YOU LIKE THE iDB APP<br><br>If you like the app and want to support iDB, the best way to do so is to buy an in-app purchase that adds a few features, including the removal of advertising in the app. All proceeds from in-app purchases will be reinvested into the app development to add even more features in the future. <br><br>THANK YOU<br><br>As always, we want to thank you for your continued support and feedback. Don’t hesitate to get in touch with us to let us know what you like or don’t like about the app so we can keep on improving it."},{"version_id":"819797413","version_name":"1.3.1","version_date":"2016-11-22 16:54:51.000 +0800","version_description":"This is a very minor update to fix an issue where articles containing an iFrame without URL would crash the app. You might have not even experienced that to begin with since it happened on one post only, and that post was quickly hidden from the app. <br><br>As always, thank you for your support!"},{"version_id":"821613874","version_name":"1.4.0","version_date":"2017-04-17 02:01:46.000 +0800","version_description":"NEW IN THIS VERSION<br><br>Cache clearing: If you're an avid iDB reader (let's face it, if you're reading this, you definitely are!), the app has probably built up a large cache of images over the months. We have added a cache clearing feature in the app's settings that allows you to flush all that and regain precious storage space of your device in a jiffy. <br><br>Subscription renewal: The monthly and annual subscriptions are now set to automatically renew every month or year, unless you cancel this from Settings &gt; iTunes &amp; App Store. Note that if you subscribed before today, your subscription will  not renew automatically and will expire at the end of the month or year. By the way, if you’re wondering how to support iDB, the best way is to get a monthly subscription.<br><br>FIXED IN THIS VERSION<br><br>Link redirect bug: A strange bug sneaked in a while ago, allowing itself to redirect links to iDB posts within an article to the latest post published on the site. So you might have thought you were tapping on a link to go to a specific post, but no matter what, you were automatically redirected to the newest post on iDB. Weird, right? This was a strange behavior that our awesome iOS developer (hello Tamara) was able to identify and take care of.<br><br>Other stuff: We’ve also performed the typical “bug fixes and stability improvements” that you will most likely not notice. If you do notice, then congratulations, please walk to the front office to collect your cookie.<br><br>RATING IS CARING<br><br>If you like the iDB app, please consider rating it in the App Store. As a reminder, for every five-star review we receive, we donate a unicorn to the Mythological Society of Westeros. <br><br>If you don’t like the iDB app, then don’t rate it, but feel free to tell us why, so maybe we can make things better."},{"version_id":"821875276","version_name":"1.4.1","version_date":"2017-05-04 00:42:03.000 +0800","version_description":"NEW IN THIS VERSION<br><br>The following modifications were made to meet the requirements of section \"3.1.2 Business: Payments - Subscriptions\" of Apple Review Guidelines:<br>– Information about the auto-renewable nature of the subscription is displayed right above purchase buttons.<br>– Links to the Privacy Policy and Terms of Use are available in the application settings.<br><br>Terms of Service: http://www.idownloadblog.com/terms-of-service/<br>Privacy Policy: http://www.idownloadblog.com/privacy-policy/<br><br>FIXED IN THIS VERSION<br><br>This version fixed an issue where the app would crash if you tried to save an image. To save images, you will now have to allow access to the photo library first.  <br><br>We also made some minor improvements to the way in-app purchases are restored. The \"success\" message you get will now actually reads like it was written by someone who speaks English.<br><br>For some reason, YouTube videos stopped showing in the app. The good news is, they're back!<br><br>We value your feedback, so if you find something that doesn't work as it should, please let us know.<br><br>I know you've probably done it already, but because this is a new version, would you please rate us again in the App Store? We would really really really really (I mean \"really\") appreciate it."},{"version_id":"825014399","version_name":"1.4.5","version_date":"2019-09-12 19:26:29.000 +0800","version_description":"Added compatibility with future versions of iOS."},{"version_id":"825014399","version_name":"1.4.4","version_date":"2019-04-27 14:33:34.000 +0800","version_description":"Fixes an issues with how text what sometimes being improperly displayed."},{"version_id":"825014399","version_name":"1.4.3","version_date":"2019-01-31 07:02:19.000 +0800","version_description":"This update fixes an issue where content wouldn't display properly on some articles."},{"version_id":"825014399","version_name":"1.4.2","version_date":"2017-12-08 06:25:40.000 +0800","version_description":"We could tell you that this app update brings support for iPhone X and Smart Invert Colors. Or we could just rewrite a poem about it...<br><br>Twas the night before the iDB app update, when all through the App Store, <br>Not a bug was stirring, not even an error. <br>iPhone X support was brought to the app with care, <br>In hopes that iDB readers' screens soon would glare.<br><br>The readers were perusing the news in their beds, <br>While visions of dark mode danced in their heads. <br>And all iDB fans, without further ado, <br>Had just settled their brains for a five-star review."},{"version_id":"830131943","version_name":"1.4.3","version_date":"2019-01-31 07:02:19.000 +0800","version_description":"This update fixes an issue where content wouldn't display properly on some articles."},{"version_id":"831121686","version_name":"1.2","version_date":"2016-05-23 15:29:05.000 +0800","version_description":"Besides the usual round of bug fixes and stability improvements, iDB app version 1.2 comes with some major features that a lot of you have been waiting for. So hold down to your seat because you’re about to get wowed. Big time!<br><br>PUSH NOTIFICATIONS<br><br>After updating the app, you will be asked if you want to receive notifications from iDB. The right answer to this question is “heck yes I want to.” Doing so will alert you every time a newsworthy article is published on iDB. Note we will not send notification for every single article published. That would be way overkill, and not so helpful. We want to notify you only about stuff we believe is important. <br><br>REMOVE ADS<br><br>It took us a while but we are happy to say you can now browse the entire app without seeing one single ad. I just heard 20,000 of you scream “finally!” and it really hurt my ears, but it did warm up my heart, so we’re all good. <br><br>There are two levels of in-app purchases available. You can unlock ad removal (and more features) for $0.99 for one month, or $2.99 for one year. At the end of that period, you will be asked whether you want to unlock the features again or not. Note this is not set to auto-renew, so don’t you worry about that. <br><br>Why would you pay one month at a time when you can get one year for the price of three months? Well, maybe you care a lot about iDB and want to financially contribute to make sure we can keep doing what we do best?<br><br>OFFLINE READING<br><br>Buying the in-app purchase will also allow you to access bookmarked articles even if you don’t have an active Wi-Fi or cellular connection. Simply bookmark all articles you want to read offline, and they will be readily available for you at any time.<br><br>MUCH BETTER VOICEOVER SUPPORT<br><br>Accessibility features are something most of us don’t need, but they must be perfect for the very small minority of users that does need them. Today, we are very proud to bring great VoiceOver support to the iDB app, and we couldn’t have done it without the help of our top beta tester, David. It really took us a while to get this right, but David helped us iron all the kinks. Remember in the last changelog how I said that we at iDB believe great features are in the details. This is more true than ever! <br><br>THERE IS STILL MORE TO COME<br><br>The bulk of the iDB app is now in your hands, but we have one more feature in the oven right now, and it’s Apple Watch support. We can’t make any promises, but chances are you will be able to check iDB on your Apple Watch by the end of this century. We know, we know. We’re fast!<br><br>HOW DO YOU LIKE THE iDB APP?<br><br>If you hate it, then please just move along with your day, but if you do love the app, please take some time to rate and review it in the App Store. It means a lot to us.<br><br>THANK YOU SO MUCH<br><br>Can you believe that 21,000+ people have downloaded the iDB app? Yeah, me neither. This is very rewarding, and obviously, it’s all thanks to you. So thank you very much for your ongoing support."},{"version_id":"832743483","version_name":"1.1","version_date":"2016-04-19 00:19:44.000 +0800","version_description":"Before we get started with what’s new and improved, let me tell you that this update does not contain an in-app purchase to remove ads yet. This is not because we want to push ads down your throats. It’s just that before adding such an important feature, we want to make sure that the foundations of the app are perfect. Ad removal is definitely coming, so please bear with us. <br><br>Now that we have that out of the way, let’s move to the exciting stuff, shall we?<br><br>BOOKMARKS<br><br>Close your eyes and imagine this. It’s the morning, and as usual, you’re late for work. Suddenly, you see this awesome article on iDB about this new app, or cool accessory, or amazing news that just dropped. You just don’t have time to read it, because remember, you’re late for work. Well, now you can double tap on that article Card to save it as a bookmark and return to it later. Or simply tap the Bookmark icon in the Article view, and BAM, it’s saved to your list of bookmarks, just like that. Now if you’re really late for work, get going and resume reading this changelog later. Version 1.1 is really not good enough to get fired over.<br><br>SAN FRANCISCO FONT<br><br>Following the riots that have started in 496 cities across 16 countries, we have added support for the San Francisco font. You can now change the default font to San Francisco either from the general Settings of the app, or directly from an Article view. San Francisco is a beautiful city, and an even better font, so quite frankly, I’m not sure why this wasn’t part of version 1.<br><br>NEW 3D TOUCH SHORTCUT<br><br>“The devil is in the details,” they say. We, at iDB, say “great features are in the details,” like the addition of this new 3D Touch action that can take you to your bookmarks when you press firmly on the iDB app icon. Of course, you must have a compatible device to take advantage of this life-changing feature, specifically an iPhone 6s or iPhone 6s Plus. Or maybe you have a way to add 3D Touch to unsupported devices? None of our business ;)<br><br>BUG FIXES AND STABILITY IMPROVEMENTS <br><br>You know how sometimes changelogs simply mention “bug fixes and stability improvements” without giving you more details than that? Well, that’s because they’re absolutely boring, and in many cases, most users don’t even experience those issues to begin with. Now if you really must know what’s been fixed, let me list this out for you: issue #76, #78, #79, and #83 have all been taken care of once and for all. The most important here is probably #76, which should allow VoiceOver to play nice with the app.<br><br>FUN FACT<br><br>Codename of version 1.1.0 of the iDB app is Green Beagle. Don’t ask me why, because I didn’t come up with it. <br><br>DO YOU LIKE THIS APP?<br><br>If you’ve taken the time to read through this unnecessarily long list of changes and additions, then it probably means you like the iDB app. If that’s the case, would you mind taking a minute to rate, and maybe even review this app in the App Store? For every 5-star rating we get, we will donate a unicorn to the Mythological Society of Westeros. <br><br>MORE SERIOUSLY<br><br>Thank you so much for downloading this app and also for the amazing feedback you have sent us so far. We understand this app might not appeal to everybody, but the large majority of users seem to really like it, so that’s a win in our book.<br><br>As mentioned above, please bear with us as we work on improving the iDB app and adding more features. Very high on the priority list are in-app purchase to remove ads, push notifications, Apple Watch support, and more. Thanks again!"},{"version_id":"832908005","version_name":"2.0","version_date":"2019-10-19 14:15:35.000 +0800","version_description":"The iDB app has been completely redesigned from the ground up. Same great content in a completely new layout. And of course it supports Dark Mode!<br><br>Because this is a brand new app, there might be a bug or two hidden somewhere, so if you see something wrong, please make sure to get in touch.<br><br>We really hope you're going to like this app even better than the previous version. If you do, please take a second to rate the app in the App Store. If you don't, let us know what we can do better.<br><br>As always, thank you very much for your continuing support!"},{"version_id":"833287914","version_name":"2.1","version_date":"2019-11-01 19:10:29.000 +0800","version_description":"New in this version:<br>- increased contrast in the Comments page when using Dark Mode<br>- added support for persistent audio playback (ie. you can start listening to our podcast in the app, leave the app, and keep playing the audio)<br>- improved app backgrounding (ie. the app preserves your position on the main screen for a longer period of time) <br>- added ability to close the image viewer with a gesture"},{"version_id":"833446327","version_name":"2.2","version_date":"2019-11-02 22:56:28.000 +0800","version_description":"This update fixes a small issue that would prevent users from zooming in on images."},{"version_id":"833553530","version_name":"2.3","version_date":"2019-11-20 01:12:21.000 +0800","version_description":"Small formatting bug fix."},{"version_id":"833742359","version_name":"2.3.1","version_date":"2019-12-04 16:12:30.000 +0800","version_description":"This update fixes a couple small display bugs that you might not have even noticed. <br><br>Thank you to James for reporting one of these bugs to us via Twitter!"},{"version_id":"834562043","version_name":"2.3.2","version_date":"2020-02-04 14:22:06.000 +0800","version_description":"This update fixes an issue where the app would sometimes crash when opening articles.<br><br>Thank you to everyone who reported this issue!"},{"version_id":"840007864","version_name":"2.4","version_date":"2021-01-12 23:18:08.000 +0800","version_description":"This update fixes an issue that prevented some images from displaying properly."},{"version_id":"840109190","version_name":"2.5","version_date":"2021-01-20 21:08:09.000 +0800","version_description":"This update fixes an issue that would sometimes prevent images from being displayed."},{"version_id":"840732883","version_name":"2.6","version_date":"2021-03-04 00:09:50.000 +0800","version_description":"This update enforces App Tracking Transparency, which is Apple's latest privacy feature."}]