[{"version_id":"818891471","version_name":"2017.1.18","version_date":"2016-10-12 02:43:59.000 +0800","version_description":"This build updates subscribers to Human Anatomy Atlas 2017 Edition."},{"version_id":"827462271","version_name":"2018.5.51","version_date":"2018-06-13 09:53:11.000 +0800","version_description":"* This app REQUIRES iOS 11.3 or later and runs on: iPhone 5S or later, iPad Air or later, and iPad Mini 2 or later.\n* Augmented Reality! Turn any room into an anatomy lab. The Augmented Reality (AR) features REQUIRE: iPhone 6S or later, iPhone SE, iPad Pro or later, or iPad (5th gen).\n* New Augmented Reality Lab Activities Section! Use these 3D views along with our downloadable worksheets to create a virtual lab experience.\n* New 3D Gross Anatomy Lab! Dissect a virtual cadaver in the prone or supine position.\n* New Dental Anatomy models! Explore cusps, fossae, and surfaces or view cross sections of an incisor, canine, premolar, double root molar, and triple root molar. Find these models in the Microanatomy section.\n* And, as always, we've got performance enhancements, minor improvements, and bug fixes."},{"version_id":"832298586","version_name":"2020.0.73","version_date":"2019-10-10 02:34:24.000 +0800","version_description":"The male and female gross anatomy models have over a hundred new refinements!\n\nAdditional nerves, arteries, and veins in the head and neck region.\nNew 3D brain anatomy: Refined model of the cerebrum, new motor and sensory maps, and new dermatomes.\n\nAnatomy added and refined in the thoracic, abdominal, and pelvic regions.\n- Enhanced 3D lungs now include the pleura and the option to study and dissect each lung by bronchopulmonary segment\n- Refinements to the pectoralis major, intercostals, and the cartilage that attaches the ribs to the sternum\n- Refinements to the kidneys to show more gross anatomy detail\n- New detailed microanatomy of the small intestine and villus\n\nTag structures! Use the new 3D labels feature to show the name of multiple structures on screen. Use this feature for interactive presentations or to create study cards.\n\nNew Draw and Notepad features for 3D interactive lectures and note-taking! \n- Draw in 3D space around any model while you lecture\n- Use the new notepad to label or add descriptive text to any view"}]