[{"version_id":"818593546","version_name":"1.0.2","version_date":"2016-08-24 00:42:33.000 +0800","version_description":"This update fixes a bug where the subscription list for Feedbin users could not be parsed if the URL of a subscribed feed could not be parsed.<br><br>Please consider leaving a review. Thank you!"},{"version_id":"821038195","version_name":"1.3","version_date":"2017-02-22 23:57:20.000 +0800","version_description":"This update adds the ability to find feeds on sites that take advantage of frame-based URL forwarding.<br><br>Thank you for using Feed Hawk. Please consider leaving a review in the App Store."},{"version_id":"821113751","version_name":"1.4","version_date":"2017-02-28 19:41:40.000 +0800","version_description":"Feed Hawk now uses a newer Oauth (web-based) login system for Inoreader.<br><br>Thank you for using Feed Hawk. Please consider leaving a review in the App Store."},{"version_id":"822615836","version_name":"1.5","version_date":"2017-06-26 13:00:43.000 +0800","version_description":"Feed Hawk 1.5 delivers three big sets of changes:<br>* Feed discovery improvements<br>* Support for JSON Feed<br>* Better success and error notifications<br><br>= Feed Discovery Improvements =<br><br>Most sites link to their feeds from pages that are part of the site’s blog. Many do not link to those feeds from pages that are not part of the site’s blog. With this update, Feed Hawk will now look for a blog page and search that page for feeds if it does not find a feed on the current page. If you are visiting foo.com, Feed Hawk will look for a page at blog.foo.com and at foo.com/blog/. It will also look for links to a blog on the page you are visiting.<br><br>In addition Feed Hawk will now find the relevant blog feed, author feed, and tag feeds for any page hosted by Medium. Medium publishes these feeds but Medium pages generally only link to one feed or to no feeds at all. Feed Hawk now detects whether a page is served by Medium even if it does not have a medium.com URL. If the page is served by Medium, Feed Hawk will use its knowledge of where Medium feeds are located.<br><br>= Support for JSON Feed =<br><br>JSON Feed is a new feed format written by Manton Reece and Brent Simmons. If you are using a feed service that supports JSON Feed (Feedbin, Inoreader, or NewsBlur), Feed Hawk now discovers and allows you to subscribe to JSON Feeds. <br><br>Because JSON Feed is so new, most sites that publish JSON Feeds also publish RSS or Atom feed equivalents. Showing customers a list of feeds where some are essentially duplicates of others would make for a poor user experience. Therefore Feed Hawk will hide RSS and Atom feeds for the page if there are also JSON Feeds and you are not subscribed to any of the RSS or Atom feeds. It will hide the JSON Feeds if you are already subscribed to at least one of the RSS or Atom feeds and not to any of the JSON Feeds.<br><br>= Better Success and Error Notifications =<br><br>If you tap on the screen while Feed Hawk is displaying a confirmation message, Feed Hawk will now immediately dismiss that confirmation message. Feed Hawk now displays error messages in traditional alerts instead of in HUD windows.<br><br>If you enjoy using Feed Hawk or if you like these improvements, please consider leaving a review."},{"version_id":"823415708","version_name":"1.6","version_date":"2017-08-28 13:05:29.000 +0800","version_description":"Feed Hawk 1.6 delivers a variety of improvements:<br><br>• Feed Hawk now discovers YouTube channel feeds when opened with youtube.com URLs or from the YouTube app.<br>• Feed Hawk will now be available in the share sheet when you long press a URL in Safari.<br>• Feed Wrangler and The Old Reader now support JSON Feed. Feed Hawk will now make JSON Feeds available to users of Feed Wrangler, Feedbin, Inoreader, NewsBlur, and The Old Reader.<br>• On the iPad, touching anywhere on the screen will now dismiss confirmation messages.<br>• The Feed Hawk Web Service no longer serves as a search engine for feeds when none are found on a web page. This functionality has been obsoleted by feed discovery improvements in the app.<br>• Feed Hawk now uses a universal link for the NewsBlur OAuth Redirect URL. This results in a more secure login process for customers using NewsBlur.<br><br>If this makes you happy, please leave a review."},{"version_id":"823538954","version_name":"1.6.1","version_date":"2017-09-05 23:59:05.000 +0800","version_description":"This update delivers two bug fixes.<br><br>Inoreader expires logins after a certain period of time. With this update, Feed Hawk will provide a much clearer error message if your Inoreader login has expired.<br><br>This update also fixes a bug in which Feed Hawk would, under a narrow set of  circumstances, not display a feed’s title.<br><br>If this update makes you happy, please leave a review."},{"version_id":"824201926","version_name":"1.6.2","version_date":"2017-11-01 13:06:55.000 +0800","version_description":"This update is compiled with Xcode 9 against the iOS 11 SDK. It adds some important hardware compatibility improvements.<br><br>If this update makes you happy, please leave a review."},{"version_id":"825311632","version_name":"1.6.3","version_date":"2017-12-15 00:32:18.000 +0800","version_description":"This update fixes some crashes and other bugs that could be encountered when configuring Feed Hawk to work with your feed service.<br><br>If this update makes you happy, please leave a review."},{"version_id":"825440997","version_name":"1.6.4","version_date":"2018-01-03 15:48:05.000 +0800","version_description":"This update adds the following changes:<br>• I removed support for Minimal Reader. That service has shut down.<br>• I added messaging improvements around the required version of tt-rss.<br>• The software keyboard presented when entering URLs for Fever and tt-rss instances is now more suitable for entering URLs.<br>• I updated the copyright for the new year.<br><br>If this update makes you happy, please leave a review."},{"version_id":"826169204","version_name":"1.7","version_date":"2018-03-12 12:35:23.000 +0800","version_description":"This update adds the following improvements:<br><br>• Feed Hawk now supports Feedly.<br>• Feed Hawk’s credentials to Inoreader now expire far less frequently. I thank the Inoreader team for their assistance with this.<br>• This update adds minor improvements to the heuristics used to determine whether JSON Feeds and RSS or Atom Feeds presented on a page provide identical content.<br>• The color of the “Save” navigation bar button is now brighter when it is enabled.<br>• Feed Hawk now works with sites that use “x-” variants of feed MIME types, such as “application/x-rss+xml”.<br><br>If you like this update, please leave a review in the App Store."},{"version_id":"827370835","version_name":"1.7.1","version_date":"2018-06-11 10:23:13.000 +0800","version_description":"Feed Hawk 1.7.1 fixes a crasher when searching for feeds at news.blizzard.com.<br><br>This update also adds significant changes to the privacy policy in light of GDPR. I was in good shape with regard to GDPR because I have never wanted to collect personal information. I have a simple business model, selling an app. However I updated the privacy policy to be explicit about the right to have personal information supplied or deleted upon request. I removed HockeyApp for crash reporting. The privacy policy is also now more explicit about Feed Hawk’s interaction with third party web sites when searching for feeds. A detailed list of changes to the policy is available in its Document History section.<br><br>If you are happy about this update, please leave a review in the App Store."},{"version_id":"828692953","version_name":"1.7.2","version_date":"2018-09-24 18:56:31.000 +0800","version_description":"This update adds compatibility improvements for iOS 12 and the 2018 iPhone models."},{"version_id":"829186329","version_name":"1.7.3","version_date":"2018-11-07 12:11:14.000 +0800","version_description":"This update adds hardware compatibility improvements."},{"version_id":"829848646","version_name":"1.7.4","version_date":"2019-01-07 12:51:28.000 +0800","version_description":"Feed Hawk 1.7.4 addresses these issues:<br><br>• This update fixes a bug on the iPad where tapping “Feed Hawk Web Site” in the Settings view would cause the Settings view to expand and contract.<br>• This update fixes a bug on the iPad where, after tapping “Contact Support” and then sending an email from the Mail view, the “Contact Support” row would remain highlighted."}]