[{"version_id":"816795315","version_name":"1.0.0","version_date":"2017-01-09 16:31:02.000 +0800","version_description":""},{"version_id":"820732380","version_name":"1.0.1","version_date":"2017-01-30 10:09:08.000 +0800","version_description":"New: Limited Edition Pack Volume 2!<br><br>Bug Fixes and Improvements. Specifically with the cache. You could say that we were trying to save some cache...<br><br>I'll see myself out..."},{"version_id":"821308779","version_name":"1.0.2","version_date":"2017-03-15 01:22:19.000 +0800","version_description":"Tweaked the submission form.<br><br>Check out the new \"Recrystallized Pack\" that was added last week which is full of beautiful stone wallpapers.<br><br>Want to know when the latest packs get added? Make sure push notifications are turned on!"},{"version_id":"822068610","version_name":"1.1.0","version_date":"2017-05-10 17:37:07.000 +0800","version_description":"Introducing the Daily Wallpaper:&nbsp;&nbsp;A brand spankin' new limited wallpaper every day of the year!&nbsp;&nbsp;Each wallpaper is available for one day only.<br><br>We will still be adding new packs regularly so make sure you have push notifications turned on to be notified when those go live.<br><br>Bug fixes/clarified in-app alerts.<br><br>If you enjoy using Vellum and want to help us and other potential users, an App Store review from you means the world.  And you'll get a flood of good karma. Win-win!"},{"version_id":"822449523","version_name":"1.2.0","version_date":"2017-06-07 18:22:04.000 +0800","version_description":"Don't like seeing ads? You now have the option to remove them through the help menu!<br><br>Various bug fixes to make Vellum run the smoothest and butteriest it's ever ran.<br><br>New wallpaper pack from NFN Labs! Vector illustrations galore!<br><br>If you haven't seen it yet, we introduced the Daily Wallpaper:&nbsp;A brand spankin' new limited wallpaper every day of the year!&nbsp;Each wallpaper is available for one day only.<br><br>Thanks for using Vellum! Hope we've made your screens less ugly. A review letting people know how much you love us helps them out, and helps us too!"},{"version_id":"822965921","version_name":"1.3.0","version_date":"2017-07-21 06:15:17.000 +0800","version_description":"Introducing Vellum Premium - No ads and access to the last four weeks of the Daily Wallpapers in the Daily Archive.<br>(If you paid to remove ads previously, you automatically have access to the Daily Archive!)<br><br>New wallpaper pack from Mextures Collective - Beautiful landscape and macro photos.<br><br>Bug fixes &amp; optimization tweaks.<br><br>Thanks so much for downloading Vellum! Your support has been incredible. We love hearing how we’ve helped make your screen less ugly! Be sure to have push notifications turned on for when we drop new packs.  And as always, reviews are always appreciated."},{"version_id":"824215805","version_name":"1.4.0","version_date":"2017-11-02 16:41:47.000 +0800","version_description":"Updated UI for all you iPhone X users! <br><br>Updated lock screen and home screen previews.<br><br>Pixel quality bump on some wallpaper packs with more packs getting a pixel quality makeover in the next few weeks.   <br><br>The Daily Wallpapers will be receiving a pixel quality bump as well moving forward. The tones should look more tonier. The land should look more landier. The water should look more waterier. The colors should look more colorier. The words should look more made-uppier.<br><br>Minor bugs squashed and *whoosh* magical spells cast to optimize the app.<br><br>Thanks so much for downloading Vellum! We love hearing how we’ve helped make your screen prettier!  Be sure to turn your push notifications on in the app for when we drop new packs and follow us on Instagram at @getvellum to get a preview of the Daily Wallpaper.  <br><br>*Disclaimer: no magical spells were actually cast for the update of this app.  We're still on probation from Hogwarts.  Sorry professor."},{"version_id":"825492487","version_name":"1.4.1","version_date":"2018-01-02 16:56:26.000 +0800","version_description":"We've squashed a couple of bugs this time around.<br> - Fixed a strange visual scrolling issue on the iPhone X<br> - Fixed an issue where the Daily Archive was not showing up immediately after purchasing Vellum Premium for some users<br> - Fixed our own SUPER fun New Year's bug with all the Daily Archive wallpapers disappearing on January 1.  *Note: The order of the Daily Archive wallpapers is slightly out of order with the latest wallpapers after December 31 appearing at the bottom of the pack. This is a known issue that we have a fix for coming in the next update. Sorry about that! For the time being it's better than a big pack of nothing.<br><br>If you haven't already seen Emily Kaszton's beautiful pack, be sure to check it out!<br><br>Thanks so much for downloading Vellum! We love hearing how we’ve helped make your screen prettier!  Be sure to turn your push notifications on in the app for when we drop new packs, and follow us on Instagram @getvellum to get a preview of the Daily Wallpaper."},{"version_id":"825504759","version_name":"1.4.2","version_date":"2018-01-03 17:15:10.000 +0800","version_description":"1.4.2 fixes a bug we made when we fixed a bug we made when we fixed a bug we made when we.....<br><br>1.4.1 squashed a couple of bugs this time around.<br> - Fixed a strange visual scrolling issue on the iPhone X<br> - Fixed an issue where the Daily Archive was not showing up immediately after purchasing Vellum Premium for some users<br> - Fixed our own SUPER fun New Year's bug with all the Daily Archive wallpapers disappearing on January 1.<br><br>If you haven't already seen Emily Kaszton's beautiful pack, be sure to check it out!<br><br>Thanks so much for downloading Vellum! We love hearing how we’ve helped make your screen prettier!  Be sure to turn your push notifications on in the app for when we drop new packs, and follow us on Instagram @getvellum to get a preview of the Daily Wallpaper."},{"version_id":"825532161","version_name":"1.6.0","version_date":"2019-06-24 21:28:25.000 +0800","version_description":"Minor UI fixes.<br>Fixed a gross bug where push notifications were not being delivered to some devices.<br>Be sure to check out the new packs from Evgeniy Zemelko and our new Limited Edition Summer Pack!<br><br>Thank you so much for the support! We love seeing the kind reviews and social media posts. We appreciate you spreading the word and sharing Vellum with your friends."},{"version_id":"825532161","version_name":"1.5.0","version_date":"2018-10-09 20:01:35.000 +0800","version_description":"Updated UI &amp; Preview screens for iPhone Xs, Xs Max, and Xr.  Updated some other UI elements.<br>If you haven't viewed the new Limited Edition Fall pack (added this week) or Aeforia's Wallpaper pack, check them out!<br><br>Added \"What's New\" section in settings for announcements for new packs, and updates to existing packs.<br>Added \"Tutorials\" section in settings.<br>Added social icons in settings.  Check us out!<br><br>Fixed some bugs and improved some functionality.<br><br>Thanks so much for downloading Vellum! We love hearing how we’ve helped make your screen prettier! Be sure to turn your push notifications on in the app for when we drop new packs, and follow us on Instagram @getvellum to get a preview of the Daily Wallpaper."},{"version_id":"825532161","version_name":"1.4.3","version_date":"2018-01-04 22:28:11.000 +0800","version_description":"1.4.3 fixes a bug we made when we fixed a bug we made when we fixed a bug we made when we.....sigh.  Happy New Year.<br><br>1.4.1 and 1.4.2 squashed a couple of bugs this time around.<br> - Fixed a strange visual scrolling issue on the iPhone X<br> - Fixed an issue where the Daily Archive was not showing up immediately after purchasing Vellum Premium for some users<br> - Fixed our own SUPER fun New Year's bug with all the Daily Archive wallpapers disappearing on January 1.<br><br>If you haven't already seen Emily Kaszton's beautiful pack, be sure to check it out!<br><br>Thanks so much for downloading Vellum! We love hearing how we’ve helped make your screen prettier!  Be sure to turn your push notifications on in the app for when we drop new packs, and follow us on Instagram @getvellum to get a preview of the Daily Wallpaper."},{"version_id":"826777078","version_name":"1.5.0","version_date":"2018-10-09 20:01:35.000 +0800","version_description":"Updated UI &amp; Preview screens for iPhone Xs, Xs Max, and Xr.  Updated some other UI elements.<br>If you haven't viewed the new Limited Edition Fall pack (added this week) or Aeforia's Wallpaper pack, check them out!<br><br>Added \"What's New\" section in settings for announcements for new packs, and updates to existing packs.<br>Added \"Tutorials\" section in settings.<br>Added social icons in settings.  Check us out!<br><br>Fixed some bugs and improved some functionality.<br><br>Thanks so much for downloading Vellum! We love hearing how we’ve helped make your screen prettier! Be sure to turn your push notifications on in the app for when we drop new packs, and follow us on Instagram @getvellum to get a preview of the Daily Wallpaper."},{"version_id":"831739947","version_name":"1.6.0","version_date":"2019-06-24 21:28:25.000 +0800","version_description":"Minor UI fixes.<br>Fixed a gross bug where push notifications were not being delivered to some devices.<br>Be sure to check out the new packs from Evgeniy Zemelko and our new Limited Edition Summer Pack!<br><br>Thank you so much for the support! We love seeing the kind reviews and social media posts. We appreciate you spreading the word and sharing Vellum with your friends."}]