[{"version_id":"816939118","version_name":"1.0","version_date":"2017-04-16 03:23:53.000 +0800","version_description":""},{"version_id":"821779002","version_name":"1.0.1","version_date":"2017-04-16 23:32:37.000 +0800","version_description":"- Fix a crashing bug when attempting to enable location or notification permissions.\n- Move the Device ID into Keychain so it survives across reinstalls/restores\n- Make the device identify itself to your Home Assistant instance after every push registration to support server migration\n- Hide unnecessary settings and buttons before initial connection\n- Fix issues with row visibility on settings\n- Auto login to web interface after initial setup\n- Other general fixes"},{"version_id":"821795222","version_name":"1.0.2","version_date":"2017-04-19 04:45:18.000 +0800","version_description":"Thanks for all the great feedback thus far, please keep it coming! Feel free to leave a review with your thoughts about the app so far too :).\n\nNew features and improvements:\n- Enable zone tracking by default (no more track_ios required!)\n- Allow enable/disable of location-related notifications (check the Location Settings screen)\n- Rename push token to push ID and remove from identify payload to cut down confusion\n- Prepend base URL if attachment URL begins with /api/ (No need to prepend your base URL to notification attachments)\n- Whenever we update location let's identify too so battery gets updated (battery stats should update much more frequently)\n\nBug fixes:\n- Remove some force unwraps which may have been causing crashing bugs around notification and location setup\n- Don't force unwrap base URL in connect step (was also possibly causing crashes around notification/location)\n- Quote the password in the userscript (Should fix auto login problems)\n- Make app version number a string instead of an int since semver can't be coerced to an int like 1.0 could (This is the long term version of the fix implemented in 0.42.4)"},{"version_id":"821827474","version_name":"1.0.3","version_date":"2017-04-22 06:42:44.000 +0800","version_description":"New Features:\n\n  - Add a reset function to clear out credentials and device ID, resetting the app to its fresh state\n  - Add background fetch so battery updates even more frequently than before\n  - Add a new notification for background fetch\n  - Initial iBeacon support. Requires 0.43.0 or higher to use. Check the Location documentation for details on configuration.\n  - Add location update via background fetch notification\n  - Camera notification content extension supports play/pause controls\n  - Map is no longer a static image which makes it look much better\n  - Map supports multiple pins. Look for updated docs in the next day or two describing how to do this\n  - Map supports customization of features via the push payload\n\nFixes:\n\n  - Notification actions didn't work if activationMode was set to background and app had been terminated\n  - Significant Location Updates correctly send a notification (if you have that enabled)\n  - Significant Location Updates didn't work after app termination\n  - Fix weblinks so they open in external browser\n  - General Settings is now correctly hidden if you don't have Chrome installed and shown if you do\n  - Open in Chrome preference was continually being overwritten at app launch\n  - Send location during background fetch only if location is enabled, otherwise just update device state (i.e. battery)\n  - Web view contents aren't cut off at the bottom anymore\n\nMisc:\n\n  - Disable entity picture downloading for now, should speed up startup and most operations\n  - Continue localization work. German is coming up this week, French shortly thereafter!\n  - Changed to a new icon\n  - Add a space to the display name so notifications look better at the expense of a truncated homescreen name\n  - Status bar is now Home Assistant blue\n  - Set color of toolbar items to Home Assistant blue\n  - Remove old dependencies to cut down app size"},{"version_id":"821875911","version_name":"1.0.4","version_date":"2017-04-26 04:12:14.000 +0800","version_description":"This change log may be shorter than the last one, but it actually has more overall fixes, I just didn't want to bore you all!\nStill loving those reviews, keep them coming!\n\nNew Features:\n  - Add a reset badge to 0 button\n  - Allow users to specify UUID/Major/Minor, UUID/Major or just UUID for iBeacons\n\nImprovements:\n  - Set status bar to white on main screen\n  - Add error message display to camera notification\n  - Add error message display to map notification\n  - iBeacons monitoring is correctly resumed after termination\n  - If a discovered instance is selected and requires a password the password field is required\n  - If a discovered instance does not require a password the field is hidden at first set up\n\nBug fixes:\n  - Fix a ton of crashes and bugs\n  - Only start monitoring beacons if device has the right hardware\n  - Refactor the API client to improve layout and more importantly, to remove a lot of crashes/bugs\n  - Reset the web view when credentials change"},{"version_id":"824177820","version_name":"1.1.0","version_date":"2017-11-08 01:52:19.000 +0800","version_description":"Summer is over, school is back in session, that means it's well past time for a big Home Assistant for iOS update! We are back on track and working on pumping out new features and squashing bugs once more. Apologies for the lull there in the summer.\n\nHere's what's new in this version:\n\n- iPhone X compatibility (IMHO HA looks super slick on it)\n- Default camera category attachment content-type to JPEG\n- Status bar color changes with frontend theme color\n- Support landscape orientation\n- Improved permission dialogs\n- Improve API communication with Home Assistant\n- Change chat support link from Gitter to Discord\n- Add the version string to the about page\n- Our first translation: German!\n- Improve location management\n- Swift 4\n- Removed a bunch of stale code and dependencies\n- Removed native UI. It's web view only from here on out since Home Assistant adds new components/platforms too frequently for native UI to keep up\n- Lots of web view improvements around sizing/layout and logic\n- Status bar improvements for landscape and sizing issues\n\nDon't forget to leave an updated review as iOS 11 resets reviews with every new version. Thanks!"},{"version_id":"824429374","version_name":"1.5.1","version_date":"2019-05-03 07:56:33.000 +0800","version_description":"This is a minor bugfix release to 1.5.0.\n\n- Fixes the annoying permissions popup\n- Reverts removal of iBeacon exits\n- Fixes a problem when calling the URL handler without a action\n- Allows saving pictures from the webview to your photo library\n- Adds support for confirm/alert/textInput dialogs in the webView. This will unlock the full functionality of the UI, allowing things like deleting tokens and managing configuration.\n\n2.0 is now in beta, check the forums for the invite link!"},{"version_id":"824429374","version_name":"1.5.0","version_date":"2019-01-15 02:17:13.000 +0800","version_description":"We're back! With a BIG update which is leading to a even BIGGER update! The major highlights of this update are:\n\n- Drastically improved location accuracy and timeliness\n- Support for the new authentication API introduced in 0.69\n- Rewrite of internal functions to be less buggy and generally better\n\nSee below for the full change log.\n\nTo those of you anxiously waiting for it, this is NOT the much vaunted iOS 12 release, that will be arriving in the next few weeks, so keep pulling to refresh that updates screen. So that means you'll just need to wait a little bit longer for Siri Shortcuts, Apple Watch Complications and the Today Widget. It'll be well worth the wait, promise :).\n\nAs always, we greatly appreciate a good review, they keep us going!\n\nNew Features:\n  - New Auth API support\n  - Event logging\n\nImprovements:\n  - Major internal overhaul of API, classes, division of duties and more\n  - Refactored Location\n    - Removed SwiftLocation in favor of a custom implementation\n    - Now using Core Motion to determine motion type during location updates. This might be removed later\n    - Store zones in Realm for easier access\n    - iBeacon support improved\n\nBug fixes:\n  - Modified device_tracker.see to be compliant with schema\n  - Webview fixes\n    - General UI fixes like making sure buttons at bottom are always there and ordered properly\n    - Support basic authentication on the UI only\n    - Catch more errors\n  - The app should be disconnecting less, if at all\n\nMisc:\n  - Updated translation strings"},{"version_id":"824429374","version_name":"1.1.1","version_date":"2017-11-18 01:26:54.000 +0800","version_description":"Another week, another new Home Assistant for iOS build!\n\n- More localization support! We now support Chinese (Traditional and Simplified), Dutch and Spanish. Minor updates were also made to the existing German translation.\n- Add support for granular control of location update triggers (in Settings->Location)\n- Support customization of notification display options (see online docs for this, but allows you to specify badge/alert/sound or any combination of the three for each notification)\n- Add ability to send URL in push notification which opens upon tap\n- Add confirmation dialogs when opening a homeassistant:// URL\n- Re-enable Fabric so I can start tracking crashes again\n- Improve notification permission check\n- Fix text input notifications so they actually work again\n- Lots of other localization work\n- Bug fixes\n\nPlease submit a rating if you haven't already, it's my fuel that keeps me going!"},{"version_id":"824491337","version_name":"1.5.0","version_date":"2019-01-15 02:17:13.000 +0800","version_description":"We're back! With a BIG update which is leading to a even BIGGER update! The major highlights of this update are:\n\n- Drastically improved location accuracy and timeliness\n- Support for the new authentication API introduced in 0.69\n- Rewrite of internal functions to be less buggy and generally better\n\nSee below for the full change log.\n\nTo those of you anxiously waiting for it, this is NOT the much vaunted iOS 12 release, that will be arriving in the next few weeks, so keep pulling to refresh that updates screen. So that means you'll just need to wait a little bit longer for Siri Shortcuts, Apple Watch Complications and the Today Widget. It'll be well worth the wait, promise :).\n\nAs always, we greatly appreciate a good review, they keep us going!\n\nNew Features:\n  - New Auth API support\n  - Event logging\n\nImprovements:\n  - Major internal overhaul of API, classes, division of duties and more\n  - Refactored Location\n    - Removed SwiftLocation in favor of a custom implementation\n    - Now using Core Motion to determine motion type during location updates. This might be removed later\n    - Store zones in Realm for easier access\n    - iBeacon support improved\n\nBug fixes:\n  - Modified device_tracker.see to be compliant with schema\n  - Webview fixes\n    - General UI fixes like making sure buttons at bottom are always there and ordered properly\n    - Support basic authentication on the UI only\n    - Catch more errors\n  - The app should be disconnecting less, if at all\n\nMisc:\n  - Updated translation strings"},{"version_id":"830288505","version_name":"1.5.1","version_date":"2019-05-03 07:56:33.000 +0800","version_description":"This is a minor bugfix release to 1.5.0.\n\n- Fixes the annoying permissions popup\n- Reverts removal of iBeacon exits\n- Fixes a problem when calling the URL handler without a action\n- Allows saving pictures from the webview to your photo library\n- Adds support for confirm/alert/textInput dialogs in the webView. This will unlock the full functionality of the UI, allowing things like deleting tokens and managing configuration.\n\n2.0 is now in beta, check the forums for the invite link!"},{"version_id":"831732594","version_name":"2.0.0","version_date":"","version_description":""},{"version_id":"836383486","version_name":"2020.1","version_date":"2020-06-13 00:17:29.000 +0800","version_description":"- Fix misleading location warning on pull to refresh\n- Fix SSID storage\n- Fix URLs that end in a slash, causing http://localhost//auth/token\n- Fix shortcut action name\n- Fix FCM disabling\n- Use app-header-background-color\n- Add more custom icons\n- Updated icons and added new ones\n- Update icons to fix chimney\n- Fix battery icon logic\n- Use app's user agent for web view requests\n- Fix webview insets\n- Fix links to docs\n- Fix minor misspellings\n- Fix sensor registration infinite loop\n- Fix deleting notification categories when reordering\n- Fix editing a just-created notification category or action\n- Fix building MDI\n- Improve state restoration of location\n- Validate manually-entered URL strings\n- Fix crash on discovery from 0.110\n- Don't send device_id when updating registration\n- Handle logouts and invalidated tokens\n- Fix opening notification settings deeplink\n- Fix more doc URLs\n- Add location and notification permission statuses/fallback buttons to settings\n- Update localizations"},{"version_id":"836444525","version_name":"2020.2","version_date":"2020-06-18 00:25:07.000 +0800","version_description":"This build:\n- Fix beta/release environment check\n- Update strings\n- Add space between sensor value and unit (#662)\n- Fix Notifications Help Link (#658)\n- Sensor Settings: fix icon loading (#657)\n- Sensor Settings: Periodic Update (#655)\n- Retry \"Unable to connect\" frontend error automatically (#654)\n- Reconnect WebView on a warm start if it failed to load (#653)\n- Append User-Agent rather than resetting it (#632)\n\nLast build:\n- Handle and persist theme color (#647)\n- Notifications: Camera Aspect Ratio (#650)\n- Run tests on pull requests (#636)\n- Update sensors and other information on warm-launch (#648)\n- Settings Permissions: Add Background Refresh (#646)\n- Fix another JavaScript alert issue on iPad (#642)\n- Don't re-register when update has a network error (#641)\n- Sensors in Settings (#640)\n- New One Shot Location Logic (#623)\n- Today Widget: Empty Handling (#639)\n- Version bump to 2020.2 (1)\n- State Restoration: Save Last Page (#637)\n- Fix SwiftLint errors and a handful of others (#635)\n- Today Widget: Dynamic Height (#633)\n- Update strings (#634)\n- Add SwiftLint Github Action\n- Fix JavaScript alerts on iPad (#631)\n- Make Reset also trigger onboarding (#630)\n- Always register for remote notifications (#629)\n- Page Zoom setting (#628)\n- Wrap several API operations in background tasks (#627)"},{"version_id":"836508264","version_name":"2020.3","version_date":"2020-07-01 04:28:46.000 +0800","version_description":"- Camera Notifications now play HLS videos when supported. Requires HA 0.112+.\n- Actionable Notifications can now have per-action URLs to open.\n- Relative URLs (like `/lovelace-tacos/0`) now work in Notifications.\n- Added Pride-themed alternate App Icons.\n- Added \"Storage\" sensor, showing available disk space.\n- Added example Service Calls and Triggers to Notification Categories & Actions.\n- Added \"Device Name\" setting in App Configuration > General.\n- Added \"Open Links In\" setting in App Configuration > General.\n- Updated \"Last Updated\" sensor to have values of \"Launch\" or \"Periodic\" instead of \"Initial\".\n- Updated the \"In-Development Updating\" work to cover all Location management, which may improve accuracy.\n- Updated the Sensors list to show the last-sent versions.\n- Updated the icons of floors ascended/descended sensors.\n- Fixed a hard-to-see input cursor when typing manual server addresses during onboarding.\n- Fixed another case where reconnecting was slow or got stuck.\n- Fixed importing notification settings causing visual duplicates.\n- Fixed some issues with timing out when connecting to older servers.\n- Fixed handling non-hex theme colors, now the full gamut of CSS is supported.\n- Fixed pull-to-refresh not refreshing the current page but instead loading the main dashboard.\n- Fixed the background color when opening Settings."},{"version_id":"836654377","version_name":"2020.3.1","version_date":"2020-07-05 06:43:16.000 +0800","version_description":"We shipped 2020.3 with a few major issues:\n\n- Critical Alerts entitlement didn't exist, silently disabling Critical Alerts for new and existing users\n- Viewing cameras in Notification Previews broke due to an authentication issue\n- Onboarding for new users broke for those using older versions of Home Assistant Core\n\nAll of these have been fixed in this version.\n\nWe apologize for these issues and are working to ensure that they don't happen again. Thanks as always for using Home Assistant!"},{"version_id":"836930224","version_name":"2020.4","version_date":"2020-07-23 01:22:22.000 +0800","version_description":"Highlights\n\n- Location tracking should now be more accurate and reliable.\n- Sensor and location updates now retry sending during poor connectivity.\n- Minimum iOS version is now 11.4, minimum watchOS version is 6.2\n\nImprovements\n\n- Reduced file size of the app by about 30%.\n- “Geocoded Location” sensor can now use Zones as a geocode source.\n- Storage Sensor now more accurately reflects the system % available.\n- Improvements to how long logs are kept, reducing disk space usage.\n- Allows `camera`-category notifications to show thumbnails without attachments.\n- Event Log now allows you to search for entries.\n\nBug Fixes\n\n- Fixes not respecting \"Open Links In\" setting for notification URLs.\n- Fixes a few rough edges when editing actions in the app.\n- Fixes a few rough edges when editing Shortcuts in the Shortcuts app.\n- Fixes battery icon in a few situations using the wrong icon.\n- Fixes dismissing a notification while the app is running causing the notification to fire."},{"version_id":"837016954","version_name":"2020.4.1","version_date":"2020-07-28 01:08:35.000 +0800","version_description":"Small fixes in this build as followup from 2020.4:\n- Fixes location updates entering/exiting smaller-than-100m zones.\n- Fixes duplicate integrations happening when deleting and reinstalling the app."},{"version_id":"837290678","version_name":"2020.5","version_date":"2020-08-11 23:22:26.000 +0800","version_description":"NOTE: You will be signed out upon installing this release due to the team transfer. Learn more at https://companion.home-assistant.io/app/ios/about-the-move\n\nACTIONS\n- Actions are now automatically created for Scenes.\n- Actions can be added to Siri when editing. They’ll also show up as Siri suggestions.\n- “Perform Action” is now a Shortcut in the Shortcuts app.\n- Random colors when creating an Action will be more compatible with each other.\n\nNFC TAGS\n- You can now read and write NFC tags in the app’s settings.\n- Tags written by the app will show a notification when you bring your device near them. Activating the notification will launch the app and fire an event.\n- Tags will work on any device with Home Assistant installed which has hardware support to read them.\n\nOTHER THINGS\n- Added Dark Mode support for the frontend with HA 0.114+.\n- Added automatic syncing of Push Notification Categories.\n- Improved saving and editing of Actions, Push Categories, and Connection Settings.\n- Reduced the app’s file size by nearly 50% (!) by compressing push sounds. There shouldn’t be any noticeable drop in quality.\n- Added Czech, Ukrainian and Vietnamese localizations.\n- Removed Robbie’s Patreon. Thanks again to all the backers for a great year!\n- Removed Firebase Crashlytics in favor of Sentry.\n- Removed Google Analytics\n- Minimum versions now iOS 11.0 (down from 11.4) and watchOS 5 (down from 6). Shortcuts requires iOS 13.0 (down from 13.5), Today Widget requires iOS 12.4."},{"version_id":"837320635","version_name":"2020.5.1","version_date":"2020-08-12 22:44:43.000 +0800","version_description":"NOTE: You will be signed out upon installing this release due to the team transfer. Learn more at https://companion.home-assistant.io/app/ios/about-the-move\n\nACTIONS\n- Actions are now automatically created for Scenes.\n- Actions can be added to Siri when editing. They’ll also show up as Siri suggestions.\n- “Perform Action” is now a Shortcut in the Shortcuts app.\n- Random colors when creating an Action will be more compatible with each other.\n\nNFC TAGS\n- You can now read and write NFC tags in the app’s settings.\n- Tags written by the app will show a notification when you bring your device near them. Activating the notification will launch the app and fire an event.\n- Tags will work on any device with Home Assistant installed which has hardware support to read them.\n\nOTHER THINGS\n- Added Dark Mode support for the frontend with HA 0.114+.\n- Added automatic syncing of Push Notification Categories.\n- Improved saving and editing of Actions, Push Categories, and Connection Settings.\n- Reduced the app’s file size by nearly 50% (!) by compressing push sounds. There shouldn’t be any noticeable drop in quality.\n- Added Czech, Ukrainian and Vietnamese localizations.\n- Removed Robbie’s Patreon. Thanks again to all the backers for a great year!\n- Removed Firebase Crashlytics in favor of Sentry.\n- Removed Google Analytics\n- Minimum versions now iOS 11.0 (down from 11.4) and watchOS 5 (down from 6). Shortcuts requires iOS 13.0 (down from 13.5), Today Widget requires iOS 12.4.\n\n---\n\n2020.5.1 fixes a few crashes discovered in 2020.5."},{"version_id":"837335437","version_name":"2020.5.2","version_date":"2020-08-13 05:02:42.000 +0800","version_description":"NOTE: You will be signed out upon installing this release due to the team transfer. Learn more at https://companion.home-assistant.io/app/ios/about-the-move\n\nACTIONS\n- Actions are now automatically created for Scenes.\n- Actions can be added to Siri when editing. They’ll also show up as Siri suggestions.\n- “Perform Action” is now a Shortcut in the Shortcuts app.\n- Random colors when creating an Action will be more compatible with each other.\n\nNFC TAGS\n- You can now read and write NFC tags in the app’s settings.\n- Tags written by the app will show a notification when you bring your device near them. Activating the notification will launch the app and fire an event.\n- Tags will work on any device with Home Assistant installed which has hardware support to read them.\n\nOTHER THINGS\n- Added Dark Mode support for the frontend with HA 0.114+.\n- Added automatic syncing of Push Notification Categories.\n- Improved saving and editing of Actions, Push Categories, and Connection Settings.\n- Reduced the app’s file size by nearly 50% (!) by compressing push sounds. There shouldn’t be any noticeable drop in quality.\n- Added Czech, Ukrainian and Vietnamese localizations.\n- Removed Robbie’s Patreon. Thanks again to all the backers for a great year!\n- Removed Firebase Crashlytics in favor of Sentry.\n- Removed Google Analytics\n- Minimum versions now iOS 11.0 (down from 11.4) and watchOS 5 (down from 6). Shortcuts requires iOS 13.0 (down from 13.5), Today Widget requires iOS 12.4.\n\n---\n\n2020.5.1 and 2020.5.2 fix a few crashes discovered in 2020.5."},{"version_id":"837629133","version_name":"2020.6","version_date":"2020-09-18 04:50:16.000 +0800","version_description":"iOS 14 & MODERN-NESS\n\n- Support for iOS 14, especially around Local Network permissions.\n- Add our first new Widget: Actions. These work similarly to the existing Today widget.\n- Add multi-window support on iPadOS 13+.\n\nHA 0.115 STUFF\n\n- Add automatic syncing of Actions, defined in the configuration yaml.\n- Add support for Tag configuration.\n- Update Material Design Icons to v5.5.55.\n\nZONES\n\n- Fix a case where entering a zone would inconsistently fail due to accuracy.\n- Improve handling of passive zones, especially beacon zones.\n- Fire events when entering and existing zones, for some automation cases.\n\nBUG FIXES\n\n- Fix database error for duplicate notification categories.\n- Fix crash deleting Actions, deletes Scene Action when Scene is deleted.\n- Fix links containing %20 not opening in Chrome & Firefox.\n- Fix exporting logs producing extra disk usage.\n- Fix device name in events when overridden.\n- Fix some cases where connection settings get lost or incorrectly adjusted.\n- Fix not automatically enabling Cloud for External Access when setting up.\n- Fix some issues with editing settings for Apple Watch Complications.\n\nWhat to try out an early release of the HA app for macOS? Keep your eyes peeled on the Home Assistant Blog! https://www.home-assistant.io/blog/"},{"version_id":"837845576","version_name":"2020.6.1","version_date":"2020-09-18 23:33:32.000 +0800","version_description":"iOS 14 & MODERN-NESS\n\n- Support for iOS 14, especially around Local Network permissions.\n- Add our first new Widget: Actions. These work similarly to the existing Today widget.\n- Add multi-window support on iPadOS 13+.\n\nHA 0.115 STUFF\n\n- Add automatic syncing of Actions, defined in the configuration yaml.\n- Add support for Tag configuration.\n- Update Material Design Icons to v5.5.55.\n\nZONES\n\n- Fix a case where entering a zone would inconsistently fail due to accuracy.\n- Improve handling of passive zones, especially beacon zones.\n- Fire events when entering and existing zones, for some automation cases.\n\nBUG FIXES\n\n- Fix database error for duplicate notification categories.\n- Fix crash deleting Actions, deletes Scene Action when Scene is deleted.\n- Fix links containing %20 not opening in Chrome & Firefox.\n- Fix exporting logs producing extra disk usage.\n- Fix device name in events when overridden.\n- Fix some cases where connection settings get lost or incorrectly adjusted.\n- Fix not automatically enabling Cloud for External Access when setting up.\n- Fix some issues with editing settings for Apple Watch Complications.\n\nWant to try out an early release of the HA app for macOS? Keep your eyes peeled on the Home Assistant Blog! https://www.home-assistant.io/blog/\n\n----\n\n2020.6.1:\n- Fixes Home Assistant Shortcuts not working on iOS 14 when every parameter wasn't defined.\n"},{"version_id":"837945923","version_name":"2020.6.2","version_date":"2020-09-25 01:54:25.000 +0800","version_description":"iOS 14 & MODERN-NESS\n\n- Support for iOS 14, especially around Local Network permissions.\n- Add our first new Widget: Actions. These work similarly to the existing Today widget.\n- Add multi-window support on iPadOS 13+.\n\nHA 0.115 STUFF\n\n- Add automatic syncing of Actions, defined in the configuration yaml.\n- Add support for Tag configuration.\n- Update Material Design Icons to v5.5.55.\n\nZONES\n\n- Fix a case where entering a zone would inconsistently fail due to accuracy.\n- Improve handling of passive zones, especially beacon zones.\n- Fire events when entering and existing zones, for some automation cases.\n\nBUG FIXES\n\n- Fix database error for duplicate notification categories.\n- Fix crash deleting Actions, deletes Scene Action when Scene is deleted.\n- Fix links containing %20 not opening in Chrome & Firefox.\n- Fix exporting logs producing extra disk usage.\n- Fix device name in events when overridden.\n- Fix some cases where connection settings get lost or incorrectly adjusted.\n- Fix not automatically enabling Cloud for External Access when setting up.\n- Fix some issues with editing settings for Apple Watch Complications.\n\nWant to try out an early release of the HA app for macOS? Keep your eyes peeled on the Home Assistant Blog! https://www.home-assistant.io/blog/\n\n----\n\n2020.6.2:\n- Fixes crashing on Apple Watch Series 3.\n\n2020.6.1:\n- Fixes Home Assistant Shortcuts not working on iOS 14 when every parameter wasn't defined.\n"},{"version_id":"838342951","version_name":"2020.7","version_date":"2020-10-26 00:47:10.000 +0800","version_description":"MULTIPLE COMPLICATIONS\n- Create multiple Complications per watch face and type. You can now fill up a face with as many Home Assistant Complications as you want!\n- Shows previews when choosing Complications on Watch.\n- Requires watchOS 7.\n\nCOMPLICATION UPDATING\n- Improved the reliability of Complications updating.\n- Updates now occur around :00, :15, :30, :45 of the hour, within a few minutes.\n- Switching between faces now updates complications significantly faster.\n- Improves syncing Complication settings from the iOS App to the Watch App.\n- Adds basic template validation when tapping the ‘Preview’ button when editing; when a template is invalid, it is now more obvious on the Watch.\n- Fixes many Complication types which would not work before, especially containing Rings and Gauges.\n- Fixes incorrect icon sizes for many Complications’ images.\n\nSHARE EXTENSION\n- Adds a Share Extension which fires `mobile_app.share` when performed.\n- Learn more about the contents at https://companion.home-assistant.io/docs/integrations/sharing\n\nUPDATE SENSORS\n- Adds an “Update Sensors” shortcut to Shortcuts.app.\n- Use this when you’d like to trigger a sensor update, for example a Personal Automation when starting or ending charging, at certain times of day, when changing Wi-Fi, etc.\n\nMISCELLANEOUS\n- Adds support for 5G information in the connectivity sensors.\n- Adds device info to lifecycle events.\n- Adds support for HA 0.117 changes.\n- Fixes server-defined Actions failing to execute via Widget.\n- Fixes some cases where connection changes would not correctly update the frontend.\n- Fixes incorrectly re-registering integration for some HTTP errors, resetting sensor names.\n- Fixes handling of connection URLs which contain a trailing slash (/).\n- Fixes internal/external not being considered different if only the port number changed.\n- Fixes pathless notification attachment URLs causing future attachments to fail.\n- Fixes crash when saving server-defined Actions (which are not able to be edited locally).\n- Fixes crash when using Camera to upload a profile photo.\n- Fixes some CodeMirror (which powers the code editor) issues in the frontend.\n- Fixes example for notification category dictionary-based URLs.\n- Fixes notification settings showing 'errors' instead of 'attempts' as the first row.\n- Fixes 'Choose' and other Widget config text readability when editing them.\n- Uses Zone name rather than its ID for enter/exit notifications.\n- Reduced app size by about 10%."},{"version_id":"839249365","version_name":"2021.1","version_date":"2021-01-03 11:24:31.000 +0800","version_description":"COMPLICATIONS\n- Add a \"Placeholder\" complication which is just the Home Assistant icon. This requires watchOS 7.\n- Add the ability to hide complications' contents when Watch is locked.\n\nMISCELLANEOUS\n- Unified Server & Connection settings into 1 row in App Configuration.\n- Add 'error' images for attachments that fail to download for some reason.\n- Fix hanging occasionally when number of zones when exceeding maximums.\n- Fix icons with 'hass:' prefix not working.\n- Fix crash when Map notification is provided invalid latitude/longitude.\n- Fix crash when signed out and performing some Shortcuts.\n- Fix crash when connection URL contains invalid scheme.\n- Fix crash when something on the frontend needs microphone permission.\n- Minimum iOS version is now iOS 12."},{"version_id":"840072201","version_name":"2021.1.1","version_date":"2021-01-19 03:05:39.000 +0800","version_description":"Adds alerting for security issues that may apply to your Home Assistant. See https://www.home-assistant.io/blog/2021/01/14/security-bulletin/ for more information on the current security advisory."},{"version_id":"840287388","version_name":"2021.2","version_date":"2021-02-05 00:38:31.000 +0800","version_description":"- Updated the look of the default icon at small sizes.\n- Update Material Design Icons to 5.9.55.\n- Adds an event log entry when webhook calls fail due to non-network reasons.\n- Improves the error messages for webhook errors, especially around Shortcuts.\n- Removes redundant information from Battery Level and Battery State sensors.\n- Moves Cloud settings into External URL editing and fixes a couple cases where it would not be switched to immediately.\n- Security alerts now look less terrifyingly red and can be controlled by a setting in Privacy whether they are displayed.\n- Fixes a crash when deleting an action in a newly-created notification category.\n- Fixes getting stuck on e.g. a 404 page due to an invalid notification `url`. Pull to refresh will now reset to the main dashboard in this case.\n- Fixes the friendly name of zones not showing up in Location settings.\n- Fixes name of default choice on iOS 14 for “Open Links In.”\n- Fixes handling of non-precise location accuracy by prompting during pull-to-refresh for temporary precise location permission to send a more accurate location.\n- Fixes complications failing to update on Watch if none of the configured complications contained a template needing rendering.\n- Fixes cases where the Watch App would signal an action was performed before it was actually confirmed to have been performed. This may make it feel a little slower, but it is more accurate."},{"version_id":"840429873","version_name":"2021.2.2","version_date":"2021-02-10 09:35:44.000 +0800","version_description":"- Updated the look of the default icon at small sizes.\n- Update Material Design Icons to 5.9.55.\n- Adds an event log entry when webhook calls fail due to non-network reasons.\n- Improves the error messages for webhook errors, especially around Shortcuts.\n- Removes redundant information from Battery Level and Battery State sensors.\n- Moves Cloud settings into External URL editing and fixes a couple cases where it would not be switched to immediately.\n- Security alerts now look less terrifyingly red and can be controlled by a setting in Privacy whether they are displayed.\n- Fixes a crash when deleting an action in a newly-created notification category.\n- Fixes getting stuck on e.g. a 404 page due to an invalid notification `url`. Pull to refresh will now reset to the main dashboard in this case.\n- Fixes the friendly name of zones not showing up in Location settings.\n- Fixes name of default choice on iOS 14 for “Open Links In.”\n- Fixes handling of non-precise location accuracy by prompting during pull-to-refresh for temporary precise location permission to send a more accurate location.\n- Fixes complications failing to update on Watch if none of the configured complications contained a template needing rendering.\n- Fixes cases where the Watch App would signal an action was performed before it was actually confirmed to have been performed. This may make it feel a little slower, but it is more accurate.\n\n2021.2.2: Fixes some cases where sensor values sent to the server would get stuck with an outdated version."},{"version_id":"840772240","version_name":"2021.3","version_date":"2021-03-07 06:58:40.000 +0800","version_description":"NEW THINGS\n- my.home-assistant.io links open the app directly.\n- Pinch-to-zoom is now controllable in App Configuration.\n- Sensors can now be selectively disabled. When disabled, they will be reported as unavailable.\n- Notification settings has been reworked to be easier to understand.\n\nFIXED THINGS\n- Fixes a few cases where sensors would not be updated with the latest value. \n- Fixes location sources setting for significant changes and zones.\n- Fixes a few crashes in languages other than English.\n- Fixes a rare crash on startup.\n- Fixes Graphic Bezel Circular Text & Graphic Rectangular Standard Body complications requiring text fields which were optional.\n- Fixes brightness of the launch screen when in Dark Mode.\n- Fixes some issues on upcoming versions of iOS."},{"version_id":"841208619","version_name":"2021.4","version_date":"2021-04-06 03:16:16.000 +0800","version_description":"LIVE-UPDATING THINGS\nStarts using the WebSocket API. This is fairly under-the-hood but has a few immediate changes:\n\n- Previews of templates when editing Watch Complications now live-update.\n- Zones and Scene-based Actions now live-update while the app is running.\n- Avatar in the server row in Settings now live-updates.\n\nMORE LOCATION FIXES\n\n- Adds “Location History” to the Location settings. This shows a visual representation of each location change, which should help improve bug reporting. It also includes the ability to ‘share’ debug information about the update.\n- Fixes entering zones smaller than 100m on versions of iOS prior to 13.4.\n- Fixes some cases of entering zones smaller than 100m at certain angles with high location accuracy, e.g. during a workout or while running GPS.\n\nBUG FIXES\n\n- Fixes handling of some 'my' links and other url-based navigations for things like importing blueprints. (Did you know you can use homeassistant://navigate to open a particular location?)\n- Fixes over-performing an Action on Apple Watch if the request fails and is retried later.\n- Fixes choosing 'Release' app icon not using the exact same icon as the default.\n- Fixes a crash on iPad when trying to share the current push ID.\n- Fixes a crash when editing or performing some Siri Shortcuts.\n- Fixes push ID not updating after logging when when using the 'Reset' option in Settings."},{"version_id":"841225192","version_name":"2021.4.1","version_date":"2021-04-07 01:14:44.000 +0800","version_description":"LIVE-UPDATING THINGS\nStarts using the WebSocket API. This is fairly under-the-hood but has a few immediate changes:\n\n- Previews of templates when editing Watch Complications now live-update.\n- Zones and Scene-based Actions now live-update while the app is running.\n- Avatar in the server row in Settings now live-updates.\n\nMORE LOCATION FIXES\n\n- Adds “Location History” to the Location settings. This shows a visual representation of each location change, which should help improve bug reporting. It also includes the ability to ‘share’ debug information about the update.\n- Fixes entering zones smaller than 100m on versions of iOS prior to 13.4.\n- Fixes some cases of entering zones smaller than 100m at certain angles with high location accuracy, e.g. during a workout or while running GPS.\n\nBUG FIXES\n\n- Fixes handling of some 'my' links and other url-based navigations for things like importing blueprints. (Did you know you can use homeassistant://navigate to open a particular location?)\n- Fixes over-performing an Action on Apple Watch if the request fails and is retried later.\n- Fixes choosing 'Release' app icon not using the exact same icon as the default.\n- Fixes a crash on iPad when trying to share the current push ID.\n- Fixes a crash when editing or performing some Siri Shortcuts.\n- Fixes push ID not updating after logging when when using the 'Reset' option in Settings.\n\n2021.4.1: Fixes a rare crash on startup."},{"version_id":"842129751","version_name":"2021.5","version_date":"2021-05-11 00:34:47.000 +0800","version_description":"EASIER NOTIFICATIONS\n- Actions are now specified in the notification itself; categories are no longer required.\n- Include dynamic (camera/map) and standard (image/video/audio) attachments in any notification.\n- Share common configuration across platforms: collapsing and grouping uses `tag` and `group`, adding standard attachments uses `image`, `video` and `audio` keys.\n- Clear notifications using the  `clear_notification` command.\n- Download standard attachments only when viewed by using the `lazy` option.\n- Improves the display of all attachments on Apple Watch.\n- See the updated documentation at: https://companion.home-assistant.io/app/ios/actionable-notifications\n\nMISCELLANEOUS\n- Updates the look, feel and organization of settings.\n- Fixes handling of precise location being turned off, allowing the low accuracy to be sent up as location updates.\n- Fixes another sub-100m-sized zone entering issue.\n- Fixes scrolling/sizing issue with page zoom less-than 100% and pinch-to-zoom disabled.\n- Fixes a crash in the share extension.\n- Fixes using a lot of CPU when in-app settings is open.\n- Fixes scrolling and keyboard handling when editing Complications.\n- Improves compatibility with some reverse proxy configurations in the WebSocket connectivity, specifically adds the right User-Agent, fixes Host to be identical to other requests, and fixes an issue getting services list on core releases prior to 2021.3."},{"version_id":"842506406","version_name":"2021.6","version_date":"2021-06-05 03:40:54.000 +0800","version_description":"Small release this month!\n\n- Adds `update_complications` notification command and ability to manually update complications in complication list\n- Changes Crash Reporting and Analytics to be opt-in. If you've never changed one, this has now been switched to off, but you can turn it back on.\n- Fixes entering zones when multiple, overlapping zones (e.g. an \"outer\" zone and an \"inner\" zone with the same center, but differing radiuses).\n- Fixes a location update error when a significant location change occurs immediately following entering a zone, when entering that zone occurs with locations just outside the zone."},{"version_id":"842995714","version_name":"2021.7","version_date":"2021-07-09 02:34:17.000 +0800","version_description":"LOCAL PUSH\nReceive push notifications without going through the internet, directly from your HA server and without affecting rate limits. You can read more about this at https://companion.home-assistant.io/docs/notifications/notification-local/\n\n- Requires core version 2021.6 or later and iOS 14.0 or later.\n- You must specify internal SSIDs in Connection Settings for Local Push to be active on, as this is restricted to working on your local network.\n- You can see the current Local Push status in App Configuration > Notifications. You can disable it on iOS under the Internal connection settings. You may need to restart your device after upgrading for it to begin working.\n\nMISCELLANEOUS\n\n- Badge will now reset to 0 automatically when opening. You can turn this off in App Configuration > Notifications.\n- Fixes a crash when a port larger than the maximum (65535) or a hostname beginning with a colon (:) is specified as a connection URL.\n- Fixes incorrectly reloading often the webview if connection URL uses a default port (80 for http, 443 for https) and specifies it in the URL.\n- Fix incorrectly entering a sub-100m zone whose regions intersect another nearby zone.\n- Fixes the sizing of several watch complication images.\n- Fixes an issue where the app would get banned when outside the local network after setting up the app via `trusted_networks`. In December, HA started rejecting connections in this scenario, which the app didn't realize wasn't retryable, so it would retry and get itself banned. This will now log you out instead."},{"version_id":"843382663","version_name":"2021.8","version_date":"2021-08-04 13:16:55.000 +0800","version_description":"Small changes this month:\n\n- Prevents loading the WebView when launching the app in the background. This should reduce bandwidth, memory and battery usage of e.g. location updates which launch the app.\n- Notifications can now change badge values when sending a command like clear_notification.\n- Fixes a case where local push would get stuck not alerting.\n- Fixes some incorrect location update cases that happen in future versions of iOS.\n- Fixes error messages when initially connecting to a server fails for some reason.\n- Fixes playback of animated GIF notification attachments."},{"version_id":"844500569","version_name":"2021.10","version_date":"2021-10-16 00:53:24.000 +0800","version_description":"iOS 15\n- Supports time-sensitive notification interruption level. See the docs: https://companion.home-assistant.io/docs/notifications/notifications-basic/#interruption-level\n- Adds `binary_sensor.focus` which reports on your device's focus state (aka do-not-disturb). This updates immediately in the background. You’ll need to enable permission in App Configuration > Sensors.\n- Dynamic notification actions can now have icons using SF Symbols; for example, `sfsymbols:bell`. See the docs: https://companion.home-assistant.io/docs/notifications/actionable-notifications/#ios-specific-options\n- Allows frontend microphone/camera access when the app has permission, rather than prompting each time.\n\nWidget Updates\n- New “Open Page” widget to quickly open your \"Lights\" dashboard, History, Developer Tools, etc.\n- Increases the number of actions in most “Perform Action” widgets by 2x.\n- Fixes crashes and other errant behavior when opening from a widget repeatedly.\n\nMiscellaneous\n- Confirms local notifications with core 2021.10 or later, which eliminates potential missed notifications by falling back to non-local push.\n- Upgrades MaterialDesignIcons to 6.1.95.\n- Fixes a rare crash when sensors update and doing other network requests.\n- Reduces the verbosity of Shortcut results. For example, instead of \"called service light.turn_on\" it is now \"done.”"},{"version_id":"845276331","version_name":"2021.11.1","version_date":"2021-11-12 11:35:12.000 +0800","version_description":"Onboarding\n- Simplifies and improves the steps necessary to set up the app.\n- Adds support for internal/external URLs.\n- Adds support for landscape, VoiceOver and Dynamic Type.\n- Prompts for missing permissions on app startup in a simpler flow.\n\n2021.11.1:\n- Fixes a crash when connecting to a server picked up by scanning the network."},{"version_id":"846025356","version_name":"2021.12","version_date":"2021-12-19 04:28:58.000 +0800","version_description":"MULTIPLE SERVERS\n- Add and manage additional servers in App Configuration.\n- App features are multi-server aware. For example, notifications work on all servers.\n- Swipe with three fingers left, right, or up to quickly switch between servers.\n\nMISCELLANEOUS\n- Changes how Shortcuts run on iOS 14 or later, hopefully improving reliability.\n- Notification categories are now fully deprecated and support for them will be removed in iOS-2022.4. It's time to transition to in-notification actions. See the docs: https://companion.home-assistant.io/docs/notifications/actionable-notifications/\n- Swipe left and right with two fingers to navigate forward and back in the frontend.\n\nONBOARDING IMPROVEMENTS\n- Adds button to export logs when showing an onboarding error to aid in bug reporting.\n- Fixes error message for the `mobile_app`  component not being loaded.\n- Fixes error 404 when server URL has a trailing `/`.\n- Fixes connecting when the internal URL doesn’t work but the external does. The app will now use the external only for connecting.\n- Fixes Cloud not being enabled by default during onboarding.\n- Fixes 'timeout' errors during onboarding if only an internal URL is set in the server config.\n- Fixes potentially confusing error when \"Local Network\" privacy permission was not granted.\n\nBUG FIXES\n- Improves the reliability of the \"Local Push\" status, which is now under the server rather than in Notifications.\n- Fixes time sensitive notification interruption levels not working.\n- Fixes avatar in settings showing a black line on some edges, depending on font sizes.\n- Fixes AirPlay showing a different version of the frontend than what's on-screen\n\nKNOWN ISSUES\n- Actions, scene actions, and notification categories defined in the HA configuration with duplicate identifiers across multiple servers will fight each other; one server value will win."},{"version_id":"846063265","version_name":"2021.12.1","version_date":"2021-12-22 06:00:31.000 +0800","version_description":"MULTIPLE SERVERS\n- Add and manage additional servers in App Configuration.\n- App features are multi-server aware. For example, notifications work on all servers.\n- Swipe with three fingers left, right, or up to quickly switch between servers.\n\nMISCELLANEOUS\n- Changes how Shortcuts run on iOS 14 or later, hopefully improving reliability.\n- Notification categories are now fully deprecated and support for them will be removed in iOS-2022.4. It's time to transition to in-notification actions. See the docs: https://companion.home-assistant.io/docs/notifications/actionable-notifications/\n- Swipe left and right with two fingers to navigate forward and back in the frontend.\n\nONBOARDING IMPROVEMENTS\n- Adds button to export logs when showing an onboarding error to aid in bug reporting.\n- Fixes error message for the `mobile_app`  component not being loaded.\n- Fixes error 404 when server URL has a trailing `/`.\n- Fixes connecting when the internal URL doesn’t work but the external does. The app will now use the external only for connecting.\n- Fixes Cloud not being enabled by default during onboarding.\n- Fixes 'timeout' errors during onboarding if only an internal URL is set in the server config.\n- Fixes potentially confusing error when \"Local Network\" privacy permission was not granted.\n\nBUG FIXES\n- Improves the reliability of the \"Local Push\" status, which is now under the server rather than in Notifications.\n- Fixes time sensitive notification interruption levels not working.\n- Fixes avatar in settings showing a black line on some edges, depending on font sizes.\n- Fixes AirPlay showing a different version of the frontend than what's on-screen\n\nKNOWN ISSUES\n- Actions, scene actions, and notification categories defined in the HA configuration with duplicate identifiers across multiple servers will fight each other; one server value will win.\n\n2021.12.1: Fixes crash on iOS 12."},{"version_id":"846928840","version_name":"2022.2","version_date":"2022-02-02 12:44:22.000 +0800","version_description":"PRIVACY\n- Control the locations sent to your servers. Choose from sending exact coordinates (the existing behavior), the name of the current zone (e.g. Home or Work), or not sending locations at all. This requires core-2022.2 or later.\n- Choose whether sensors are sent to particular servers, either all on or all off.\n- Begins removing libraries used by the app which talk to third-party servers.\n\nMISC\n- Reduces data use by the app by enabling compression on the app's WebSocket connection."},{"version_id":"847413743","version_name":"2022.3","version_date":"2022-03-03 01:32:03.000 +0800","version_description":"- Fix overlapping zones with zone-only privacy level\n- Fix importing audio for notifications failing if format is correct already\n- Fix WebView reloading itself when server hostname contains uppercase\n- Fix discovery of instances older than 0.110\n- Fix many “invalid authentication” errors from happening\n- Fix re-adding a just-deleted server saving incorrect information\n- Add copy option when tapping version number"}]