[{"version_id":"823708433","version_name":"2.8.0","version_date":"2017-09-21 12:26:27.000 +0800","version_description":"Here are a few of the great new features we’ve added in this version of UltraSync!<br><br>-  More Camera Settings Like Resolution, Clip Length, Night Vision, and More<br>- Help Video Section<br>- A New Way to Invite Others to Join Your UltraSync System<br>- Optimized Device Management<br>- BETA Mode to Help Us Test Some Future Features<br>- And More!<br><br>Every update to the UltraSync app includes the typical bug fixes, stability, and performance improvements"},{"version_id":"825328311","version_name":"2.9.0","version_date":"2017-12-18 10:23:02.000 +0800","version_description":"We're continuing our push to add even more features and benefits to the UltraSync Mobile App!<br><br>Here are a few of the new features added in this release!<br>- Brand New Setup Wizard for Professional Dealers.<br>- Optimization for iOS 11 and iPhone X.<br>- New BETA features for Live Video we hope to launch soon!<br><br>Every Update to the UltraSync App includes the typical bug fixes, stability, and performance improvements."},{"version_id":"825738914","version_name":"2.9.2","version_date":"2018-01-31 23:51:42.000 +0800","version_description":"Squashed some bugs"},{"version_id":"826041653","version_name":"2.10.1","version_date":"2018-02-22 00:16:26.000 +0800","version_description":"Squashed some bugs"},{"version_id":"826663167","version_name":"2.11.0","version_date":"2018-04-17 21:11:21.000 +0800","version_description":"We’re excited to announce the 10th consecutive release of new features on the UltraSync+ Mobile App!<br><br>Here are the highlights of this release:<br>- UltraSync Doorbell Camera Support<br>- More Camera Settings including brightness, contrast, etc…<br>- 2-Way Audio Support for Cameras<br>- Motion Detection on Cameras<br>- And Much More!<br><br>Every Update to the UltraSync+ App includes the typical bug fixes, stability, and performance improvements."},{"version_id":"831205975","version_name":"2.14.0","version_date":"2019-06-26 02:50:30.000 +0800","version_description":"Improved push notification sound<br>Bug fix for Thermostats integration<br>Improved connection status display<br>Other bug fixes and stability improvement"},{"version_id":"832928647","version_name":"2.15.0","version_date":"2019-11-25 20:31:29.000 +0800","version_description":"Keyword search for sites list.<br>Special Push Notification ring tone for alarm events.<br>Other bug fixes and enhancements"},{"version_id":"840011232","version_name":"2.17.1","version_date":"2021-01-18 01:25:33.000 +0800","version_description":"- Minor bug fixes and improvements<br>- Updated for iOS 12 or later devices"},{"version_id":"842045425","version_name":"2.18.0","version_date":"2021-05-20 07:58:14.000 +0800","version_description":"Added SMS notifications for selected event groups in the ZeroWire panel<br>Minor bug fixes and performance improvement<br>Support for iOS14 devices"}]