[{"version_id":"821878877","version_name":"1.1.3","version_date":"2017-04-24 22:45:10.000 +0800","version_description":"- Fixed this bug where if you don't give Vekt permission to read/write into your Health App it would crash.<br>- Now the App Icon changes with the theme as well (Thanks again Tim de Groot!)"},{"version_id":"824126639","version_name":"1.2.2","version_date":"2017-10-25 00:20:55.000 +0800","version_description":"- Layout fixes for more flexibility<br>- There was this bug in the Watch version that prevented it from working with the digital crown, this is fixed now :)<br>- Small visual adjustments"},{"version_id":"824226528","version_name":"1.3","version_date":"2018-08-11 17:47:55.000 +0800","version_description":"It has been a while, but it's finally here: Vekt 1.3!<br><br>Here is what's new:<br><br>- BMI is here! Now you can add your height to Vekt, and your BMI is automatically calculated. So convenient. <br>- Target placeholder now shows your previous target (if there is one)<br>- Vekt now uses the new fancy iOS 11 titles where it makes sense<br>- UI Improvements and more consistency<br>- Code cleanup (you can't see this, but it helps building new things)<br><br> Thanks again for the support and from now on you can expect more frequent but smaller updates. Feel free to reach out for requests and or general feedback thru the settings inside the app or by leaving a review in the App Store."},{"version_id":"828329977","version_name":"1.3.1","version_date":"2018-09-27 06:32:59.000 +0800","version_description":"This small update changes the way we ask for your height in the imperial unit. Now it's easier and less error-prone​ and It also adds​ compatibility with the new watches that just came out"},{"version_id":"828901525","version_name":"1.3.2","version_date":"2018-10-13 18:02:22.000 +0800","version_description":"Here we are again, small bug fix and improvements release:<br>- Fixes a bug where if you're using iOS in German you couldn't add a measurement with a decimal value.​<br>- Now shows correct height in Imperial (displays ft + in and asks for inches)<br><br>Please leave a review if you enjoy using the app :)"},{"version_id":"829689345","version_name":"1.4","version_date":"2019-01-03 05:16:37.000 +0800","version_description":"Happy new year!!<br><br>Here's an update with a feature that has been requested a lot: Reminders!<br><br>You can get Daily, Weekly, Bi-Weekly or Monthly reminders to add a new weight measurement. This helps you form a healthy habit of getting the weigh-ins at the same time. Of course, you can disable them at any time you want because I don't want to spam you and only provide notifications when they matter :)<br><br>Also, some small UI improvements have been made and some structural changes are coded for a healthier app in the future.<br><br>I hope you enjoy this update and see you on the next one! There are a lot of things planned for this year including a revamp of the watch app :)<br><br>Thanks again.<br><br>Hidde"},{"version_id":"829911395","version_name":"1.4.1","version_date":"2019-01-11 09:47:12.000 +0800","version_description":"Added support for Stones unit, this helps if you're in or from the UK."},{"version_id":"830484715","version_name":"1.5","version_date":"2019-04-02 14:32:10.000 +0800","version_description":"While working hard on a big 2.0 release (ugh-uhm.. new watch version anyone?) this update adds quite some performance improvements and offers you a new way to support the development of Vekt. <br><br>As it's a free app (and I would love to keep it that way) I offer you the option to support the development of this app by your own will. I hope you will consider doing so."},{"version_id":"830865754","version_name":"1.5.1","version_date":"2019-04-18 18:14:31.000 +0800","version_description":"Fixed a crucial bug that made Vekt crash when you would use the wrong decimal separator."},{"version_id":"831182360","version_name":"2.0","version_date":"2019-06-11 22:14:47.000 +0800","version_description":"The Update brings a fully re-written watchOS app including BMI &amp; Target.<br>Next, I've improved the UI on both iOS and watchOS more and frequently updates coming really soon!<br><br>This update also fixes the bug where the Tipping modal was still shown every time you entered a new weight"},{"version_id":"831638423","version_name":"2.0.1","version_date":"2019-06-27 00:05:31.000 +0800","version_description":"I made some small improvements. this is what I've done this time:<br><br>There is now a label showing how many weigh-ins are still needed before the line chart shows up.<br>Added a direct link to the reminder configuration when you're in the notification settings of your phone."},{"version_id":"832097546","version_name":"2.1.1","version_date":"2019-07-23 18:57:44.000 +0800","version_description":"Small holiday update with the following things:<br>- Updated motivational messages<br>- Fixed bug where \"Send Feedback\" would crash if you didn't have the default mail client installed"},{"version_id":"832645739","version_name":"2.2","version_date":"2019-09-19 15:55:54.000 +0800","version_description":"With this release Vekt is ready to rock on iOS 13! Here's what's new:<br><br>- The onboarding, Change Unit and Change Height screens have been re-designed for a better experience.<br>- Target and BMI now use the fancy new looking modals on iOS 13<br>- BMI is calculated more accurate and updates in the UI correctly<br>- Fixes the bug on watchOS and Notification UI of BMI 0 being added to Health<br>- Custom Theming has been removed but now used the one you're using on your iPhone (Custom Icon is still an option)<br>- Overall better performance and UI improvements"},{"version_id":"832881377","version_name":"2.2.1","version_date":"2019-09-25 17:56:27.000 +0800","version_description":"Whoops! Accidentally made the app crash on iOS13 when some views were presented... So sorry, but it should be fixed now!&nbsp;<br><br>I hope you'll keep enjoy using Vekt. Reviews and feedback always appreciated :)"},{"version_id":"834290777","version_name":"2.3.1","version_date":"2020-01-09 21:35:42.000 +0800","version_description":"This update fixes a bug that made Vekt crash for some people and adds some new icons in the interface."},{"version_id":"834760201","version_name":"2.3.2","version_date":"2020-03-04 15:39:33.000 +0800","version_description":"Improved design for light mode."},{"version_id":"835312510","version_name":"2.3.4","version_date":"2020-03-30 18:01:23.000 +0800","version_description":"- Fix for a visual bug introduced by accident in the previous version<br>- Fix for the title in onboarding to fit and be readable in every language"},{"version_id":"836970068","version_name":"2.4","version_date":"2020-08-24 19:22:47.000 +0800","version_description":"While we're working hard to release a significantly better version, we didn't want to keep you waiting any longer with some tweaks and additions into the right direction. Here's what's new:<br><br>Tweaks in the UI to have more layers and fewer navigation bars<br>a more structured settings page<br>There is a ticker on the home view now for even faster adjustment of your weight measuring.<br>Performance and bug fixes<br><br>If you have any feedback or comments, do let us know!"},{"version_id":"837600997","version_name":"2.4.1","version_date":"2020-09-02 02:20:42.000 +0800","version_description":"This release contains a fix that prevented the chart from showing up for some users."}]