[{"version_id":"817698040","version_name":"1.0.0","version_date":"2016-10-12 04:01:48.000 +0800","version_description":""},{"version_id":"819489120","version_name":"1.1.0","version_date":"2016-11-24 08:06:06.000 +0800","version_description":"Official support for Chat on Synology NAS."},{"version_id":"819972611","version_name":"1.1.1","version_date":"2016-12-05 03:06:54.000 +0800","version_description":"1. Fixed an issue where some strings are not properly translated.<br>2. Usability enhancements."},{"version_id":"822310309","version_name":"1.2.0","version_date":"2017-05-31 07:34:47.000 +0800","version_description":"1. Supports external users to sign in Chat with guest accounts to join the discussions.<br>2. Added a newly designed tool bar for uploading photos, videos, and files.<br>3. Added a new section in the channel list, allowing unread messages to be easily checked.<br>4. Supports setting a daily snooze schedule.<br>5. Supports promoting personal conversations to private channels.  <br>6. Supports pinning posts to the top of the post list.<br>7. Supports setting passcode for data protection (Fingerprint scanner supported).<br>8. Supports sending messages by pressing the Enter button, making message sending easy when using a bluetooth keyboard.<br>9. Supports hiding the conversations that have been idle for a long time when the conversation list is too long.  <br>10. Supports regenerating or renewing the private keys for encrypted channels if unfortunately the passphrase is lost or for security concern. <br>11. Fixed the security vulnerability of SSRF.<br>12. Enhanced user interface performance.<br>13. Minor bug fixes."},{"version_id":"823851303","version_name":"2.0.0","version_date":"2017-10-05 09:26:14.000 +0800","version_description":"1. Supports browsing multiple pictures by swiping the screen in non-encrypted channels and conversations<br>2. Supports archiving the existing messages before inviting new members to join a private channel<br>3. Supports archiving messages when a channel or conversation is closed<br>4. Supports video streaming and playback when using HTTP connection or when connecting to a server with trusted certificate via&nbsp;HTTPS<br>5. Minor bug fixes<br><br>The following features require Chat 2.0.0<br>1. Supports poll creation to timely collect feedback from the members in a channel or conversation<br>2. Supports message scheduling to automatically send messages on the scheduled time<br>3. Supports message forwarding to effortlessly forward messages to one or multiple channels and conversations<br>4. Supports message reminders, allowing you to receive push notifications on important messages at specific time<br>5. Supports message threads, allowing you to directly comment on specific messages and receive notifications on the latest updates in the subscribed and joined threads<br>6. Supports Google Safe Browsing to automatically check the safety of the posted URLs and trigger warnings for unsafe URLs"}]