[{"version_id":"817802406","version_name":"1.1 haben wir Ihre Rückmeldungen berücksichtigt und neben einer neu designten Login-Seite folgende Anpassungen vorgenommen:- Unseren Geldautomaten-Finder","version_date":"","version_description":""},{"version_id":"817802406","version_name":"1.0.0","version_date":"2016-10-07 07:04:04.000 +0800","version_description":""},{"version_id":"820124408","version_name":"1.0.2","version_date":"2017-02-07 19:11:16.000 +0800","version_description":"In unserem Update auf die Version 1.1 haben wir Ihre Rückmeldungen berücksichtigt und neben einer neu designten Login-Seite folgende Anpassungen vorgenommen:<br><br>- Unseren Geldautomaten-Finder, die Push-Nachrichten und die Fotoüberweisung haben wir weiter für Sie optimiert: Höhere Genauigkeit und Reaktionsgeschwindigkeit machen die Nutzung dieser Funktionen für Sie jetzt noch einfacher.<br>- Als neues Sicherheitsfeature bieten wir Ihnen zukünftig eine zusätzliche Hilfestellung bei der Vergabe eines sicheren Passworts sowie die Möglichkeit, das Passwort jederzeit abzuändern.<br>- Zusätzlich haben wir für Sie in der gesamten App an der Seitenladegeschwindigkeit gefeilt - damit Sie noch schneller unterwegs sind.<br><br>Wir bedanken uns für Ihre Rückmeldungen und werden auch weiterhin daran arbeiten, die App ständig zu verbessern!"},{"version_id":"823591331","version_name":"2.0.0","version_date":"2017-09-19 13:35:59.000 +0800","version_description":"Laden Sie jetzt das 1822direkt Banking App Update und nutzen Sie damit noch mehr tolle Features!<br><br>- Multibankenfähigkeit: Sie können ab jetzt all Ihre Konten über die Banking App verwalten und sich jeweils die Umsätze anzeigen lassen.<br>- Umsatzsuche: Mit der neuen Umsatzsuche können Sie nach dem Betreff suchen. So finden Sie Ihre Umsätze schneller und können sie noch übersichtlicher darstellen.<br>- Diverse Bugfixes: Fehler in der App sind durch Bugfixes behoben."},{"version_id":"823996837","version_name":"2.2.2","version_date":"2018-03-12 15:28:45.000 +0800","version_description":"Optimierung für iOS 9.<br><br>Sie haben Fragen oder Anmerkungen? Ihre Meinung ist uns wichtig - wir freuen uns auch weiterhin auf Ihr Feedback an info@1822direkt.de."},{"version_id":"823996837","version_name":"2.0.1","version_date":"2017-10-17 15:34:12.000 +0800","version_description":"Wir arbeiten kontinuierlich an der Verbesserung der 1822direkt Banking App. Das Update enthält kleinere Fehlerbehebungen (u.a. bei Push-Benachrichtigungen).<br><br>Haben Sie noch Fragen oder Anmerkungen? Wir freuen uns über Ihr Feedback per E-Mail info@1822direkt.de oder Ihre Bewertung.  <br><br>Viel Spaß mit dem neuen Update!"},{"version_id":"825374798","version_name":"2.1.0","version_date":"2017-12-20 15:51:19.000 +0800","version_description":"Mit unserem neuen Update haben wir die Bargeldsuche noch einfacher gemacht und verschiedene Fehler behoben -  die Änderungen im Überblick:<br>•Bargeld-Finder: Unsere Geldautomatensuche wird jetzt zum  Bargeld-Finder. Zukünftig finden Sie neben den Geldautomaten der Sparkassen auch  Supermärkte in Ihrer Nähe bei denen Sie ab einem Einkaufswert von 20 € bzw. 25 €  kostenlos Bargeld abheben können.<br>•Einzelne Bugfixes und Verbesserungen<br>•Bitte beachten Sie: In Einzelfällen kann es dazu kommen, dass die Logindaten neu hinterlegt werden müssen<br>Sie haben Fragen, Anregungen oder Fehler identifiziert? Wir freuen uns über Ihre Rückmeldung an info@1822direkt.de"},{"version_id":"826083494","version_name":"2.2.0","version_date":"2018-02-27 15:59:09.000 +0800","version_description":"Vielen Dank für Ihr Feedback! Wir entwickeln die 1822direkt Banking App kontinuierlich weiter! In diesem Update haben wir bereits einige Hinweise von Ihnen berücksichtigt:  <br><br>- Design-Optimierungen: Die Finanzübersicht und die Navigation sind übersichtlicher gestaltet. <br>- Multibanking: Ab sofort haben Sie eine noch bessere Übersicht über Ihre Konten und Kontostände. Die Banking App gruppiert Ihre Konten nach der jeweiligen Bank. Zudem können Sie weitere 1822direkt Konten einfacher einbinden.<br>- TAN-Verfahren: Weiterhin haben Sie die Möglichkeit in der Banking App per iTAN eine Überweisung durchzuführen – auch wenn Ihr bevorzugtes TAN-Verfahren mTAN ist. <br>- Fotoüberweisung: Wir haben die Leistungsfähigkeit der Fotoüberweisung weiter optimiert. Sie haben zukünftig außerdem die Möglichkeit, Überweisungsträger und QR-Codes abzufotografieren – für eine einfache und schnelle Überweisung. <br>- Postbox: Auch Ihre Postbox wurde weiter verbessert. Ihre Dokumente teilen Sie ab sofort einfach über die neue Social Sharing Funktion. Außerdem können Sie zukünftig besser zwischen gelesenen und ungelesenen Dokumenten unterscheiden. <br>- Bargeld-Finder: Die Banking App zeigt Ihnen genau wo Sie einen Geldautomaten oder einen Supermarkt mit Bargeldservice finden, so bleiben Sie finanziell immer flexibel.<br>- Kontakt &amp; Info: Sie finden außerdem unsere Kontaktdaten und aktuelle FAQs zur Banking App unter dem Menüpunkt „Kontakt &amp; Info“. <br><br><br>Sie haben Fragen oder Anmerkungen? Ihre Meinung ist uns wichtig – wir freuen uns auch weiterhin auf Ihr Feedback an info@1822direkt.de. In den kommenden Updates sind u. a. die Umbenennung von Konten, ein neues mobiles TAN-Verfahren und die Kategorisierung der Umsätze geplant."},{"version_id":"826248176","version_name":"2.2.2","version_date":"2018-03-12 15:28:45.000 +0800","version_description":"Optimierung für iOS 9.<br><br>Sie haben Fragen oder Anmerkungen? Ihre Meinung ist uns wichtig - wir freuen uns auch weiterhin auf Ihr Feedback an info@1822direkt.de."},{"version_id":"827193369","version_name":"2.3.0","version_date":"2018-05-24 06:18:20.000 +0800","version_description":"Vielen Dank für Ihr Feedback! In diesem Update haben wir weitere Hinweise von Ihnen berücksichtigt:<br><br>- Kontoname ändern: Ab sofort können Sie die Kontonamen ganz einfach in der Banking App mit dem Bearbeitungs-Button auf der Umsatzseite ändern. So können Sie Ihre Finanzübersicht individuell gestalten.<br>- 1822direkt Kontoverbindung wechseln: Sie können in der Banking App ganz einfach über die Navigation zwischen Ihren 1822direkt Kontoverbindungen wechseln.<br>- Überweisung leicht gemacht: Mit dem neuen Update können Sie direkt über die Umsatzdetails die Überweisungsinformationen, wie Empfängername, IBAN, Verwendungszweck und Betrag, übernehmen.<br>- Kein lästiges Abtippen bei Überweisungen: Geben Sie einfach die ersten drei Buchstaben des Empfängers ein und der Name und die IBAN werden automatisch ausgefüllt, wenn der Empfänger bereits bekannt ist.<br><br>Des Weiteren haben wir Designoptimierungen, Fehlerbehebungen und Optimierungen für iPhone X durchgeführt.<br><br>Sie haben Fragen oder Anmerkungen? Ihre Meinung ist uns wichtig - wir freuen uns auch weiterhin auf Ihr Feedback unter www.1822direkt.de/kontakt."},{"version_id":"827326614","version_name":"2.3.2","version_date":"2018-05-29 09:54:08.000 +0800","version_description":"Fehlerbehebung iPhone X<br><br>Sie haben Fragen oder Anmerkungen? Ihre Meinung ist uns wichtig - wir freuen uns auch weiterhin auf Ihr Feedback unter www.1822direkt.de/kontakt."},{"version_id":"827909793","version_name":"2.3.3","version_date":"2018-07-18 13:39:52.000 +0800","version_description":"Sie müssen dieses Update installieren, um Ihre 1822direkt Banking App weiterhin nutzen zu können.<br><br>Wir werden das Zertifikat unseres Webservers tauschen. Mit diesem Update wird das neue Zertifikat von der 1822direkt Banking App akzeptiert.<br><br>Sie haben Fragen oder Anmerkungen? Ihre Meinung ist uns wichtig - wir freuen uns auch weiterhin auf Ihr Feedback unter www.1822direkt.de/kontakt."},{"version_id":"828350530","version_name":"2.4.0","version_date":"2018-08-29 07:14:20.000 +0800","version_description":"Vielen Dank für Ihr Feedback! In diesem Update haben wir Ihre Hinweise berücksichtigt:<br><br>-Echtzeit-Überweisung: Mit dem neuen Update können Sie unkompliziert in sekundenschnelle Geld überweisen.<br>-Multibanking: Bei der Anbindung einer Fremdbank können Sie ab sofort entscheiden, ob Sie die PIN Ihrer Fremdbank speichern oder manuell eingeben möchten.<br>-Sie können die App jetzt  wieder im Querformat nutzen.<br>-Postbox-Nachricht schreiben: Sie wollen uns schnell kontaktieren? Schreiben Sie uns einfach eine Postbox-Nachricht direkt aus der App.<br><br>Außerdem haben wir kleinere Verbesserungen und Fehlerbehebungen durchgeführt.<br><br>Sie haben Fragen oder Anmerkungen? Ihre Meinung ist uns wichtig – wir freuen uns auch weiterhin auf Ihr Feedback unter www.1822direkt.de/kontakt"},{"version_id":"828681398","version_name":"2.4.1","version_date":"2018-09-25 09:25:58.000 +0800","version_description":"Kleinere Verbesserungen<br><br>Sie haben Fragen oder Anmerkungen? Ihre Meinung ist uns wichtig – wir freuen uns auch weiterhin auf Ihr Feedback unter www.1822direkt.de/kontakt"},{"version_id":"828681398","version_name":"2.4.5","version_date":"2018-12-12 07:08:32.000 +0800","version_description":"- Fehlerkorrekturen und Leistungsverbesserungen<br><br>Wenn Ihnen die 1822direkt Banking App gefällt, empfehlen Sie uns Ihren Freunden und bewerten uns im App Store. Danke!"},{"version_id":"829170636","version_name":"2.4.3","version_date":"2018-11-07 10:52:46.000 +0800","version_description":"Kleinere Verbesserungen und Fehlerbehebungen<br>Sie haben Fragen oder Anmerkungen? Ihre Meinung ist uns wichtig - wir freuen uns auch weiterhin auf Ihr Feedback unter www.1822direkt.de/kontakt"},{"version_id":"829474393","version_name":"2.4.4","version_date":"2018-12-05 14:54:03.000 +0800","version_description":"- Fehlerkorrekturen und Leistungsoptimierungen<br>- Einbindung des Testsieger-Siegels \"Beste Banking App 2018\" auf der Login-Seite<br><br><br>Wenn Ihnen die 1822direkt Banking App gefällt, empfehlen Sie uns Ihren Freunden und bewerten uns im App Store. Danke!"},{"version_id":"829563790","version_name":"2.4.5","version_date":"2018-12-12 07:08:32.000 +0800","version_description":"- Fehlerkorrekturen und Leistungsverbesserungen<br><br>Wenn Ihnen die 1822direkt Banking App gefällt, empfehlen Sie uns Ihren Freunden und bewerten uns im App Store. Danke!"},{"version_id":"830047600","version_name":"2.5.0","version_date":"2019-01-24 08:16:06.000 +0800","version_description":"- Finanzübersicht: Überarbeitetes Design für mehr Übersichtlichkeit<br>- Finanzübersicht: Gesamtsaldoanzeige bei Nutzung der Multibanking-Funktion <br>- Überweisung: Upload von Rechnungen im PDF-Format<br>- Überweisung: Anzeige der IBAN bei Empfängervorschlägen <br>- Datenaktualität: Anzeige von Hinweisen zur Adressaktualität<br>- Kontoticker: Plug-In für die Push-Mitteilungen aktualisiert.<br>- Kleinere Design-, Stabilitäts- und Leistungsverbesserungen<br><br>Wenn Ihnen die 1822direkt Banking App gefällt, empfehlen Sie uns Ihren Freunden und bewerten uns im Apple App Store."},{"version_id":"830878050","version_name":"2.6.0","version_date":"2019-04-08 12:21:11.000 +0800","version_description":"- Automatischer Logout nach fünf Minuten ohne Benutzerinteraktion (EBA-RTS-Anforderung)<br>- Erteilung von Überweisungsaufträgen direkt aus der Umsatzübersicht<br>- Kleinere Design-, Usability-, Stabilitäts- und Leistungsverbesserungen<br><br>Wenn Ihnen die 1822direkt Banking App gefällt, empfehlen Sie uns bitte Ihren Freunden und bewerten uns im Apple App Store."},{"version_id":"830906964","version_name":"2.6.1","version_date":"2019-05-29 14:00:48.000 +0800","version_description":"- Optimierung der Fotoüberweisungsfunktion<br>- Fehlerbehebung in Verbindung mit der Nutzung eines aktivierten Zeitschlosses<br>- Kleinere Design-, Usability-, Stabilitäts- und Leistungsverbesserungen<br><br>Wenn Ihnen die 1822direkt Banking App gefällt, empfehlen Sie uns bitte Ihren Freunden und bewerten uns im Apple App Store."},{"version_id":"831327872","version_name":"2.6.2","version_date":"","version_description":""},{"version_id":"832743850","version_name":"2.6.4","version_date":"2019-09-13 05:50:20.000 +0800","version_description":"Ab 14.09.2019 gelten die neuen Anforderungen der europäischen Zahlungsdiensterichtlinie (PSD2). <br>Mit diesem Update haben wir die erforderlichen Anpassungen vorgenommen. Hierzu ist es erforderlich, dass nach der App-Aktualisierung die App \"neu eingerichtet\" und somit mit dem Online-Banking durch die sogenannte Gerätebindung verknüpft wird. <br>Erfahren Sie alles Wichtige rund um die Neuerungen unter https://www.1822direkt.de/psd2 <br><br>Wenn Ihnen unsere 1822direkt Banking App gefällt, empfehlen Sie uns bitte Ihren Freunden und bewerten uns im Apple App Store."},{"version_id":"832773438","version_name":"2.6.7","version_date":"2019-09-20 13:41:13.000 +0800","version_description":"Ab 14.09.2019 gelten die neuen Anforderungen der europäischen Zahlungsdiensterichtlinie (PSD2). <br>Mit diesem Update haben wir die erforderlichen Anpassungen vorgenommen. Hierzu ist es erforderlich, dass nach der App-Aktualisierung die App \"neu eingerichtet\" und somit mit dem Online-Banking durch die sogenannte Gerätebindung verknüpft wird. <br>Erfahren Sie alles Wichtige rund um die Neuerungen unter https://www.1822direkt.de/psd2<br>Wenn Ihnen unsere 1822direkt Banking App gefällt, empfehlen Sie uns bitte Ihren Freunden und bewerten uns im Apple App Store."},{"version_id":"832938478","version_name":"2.6.8","version_date":"2019-09-27 11:28:05.000 +0800","version_description":"Wir haben einen Fehler behoben, der teilweise den Start der App verhinderte.<br><br>Wenn Ihnen unsere 1822direkt Banking App gefällt, empfehlen Sie uns bitte Ihren Freunden und bewerten uns im Apple App Store."},{"version_id":"833038550","version_name":"2.6.9","version_date":"2019-10-08 15:36:33.000 +0800","version_description":"- Kleinere Design-, Usability-, Stabilitäts- und Leistungsverbesserungen<br> <br>Wenn Ihnen die 1822direkt Banking App gefällt, empfehlen Sie uns bitte Ihren Freunden und bewerten uns im App Store."},{"version_id":"833798051","version_name":"2.6.10","version_date":"2019-12-21 08:02:02.000 +0800","version_description":"- Kleinere Design-, Usability-, Stabilitäts- und Leistungsverbesserungen\n<br> \n<br>Wenn Ihnen die 1822direkt Banking App gefällt, empfehlen Sie uns bitte Ihren Freunden und bewerten uns im App Store."},{"version_id":"834482983","version_name":"2.6.11","version_date":"2020-01-24 17:36:14.000 +0800","version_description":"- Kleinere Design-, Usability-, Stabilitäts- und Leistungsverbesserungen<br> <br>Wenn Ihnen die 1822direkt Banking App gefällt, empfehlen Sie uns bitte Ihren Freunden und bewerten uns im App Store."},{"version_id":"835381842","version_name":"2.7.1","version_date":"2020-04-02 22:38:15.000 +0800","version_description":"Das ist neu in dieser Version:<br>- Behebt einen Fehler bei der Eingabe von Überweisungen.<br><br>Wenn Ihnen die 1822direkt Banking App gefällt, empfehlen Sie uns bitte Ihren Freunden und bewerten uns im App Store."},{"version_id":"836596576","version_name":"2.8.0","version_date":"2020-07-07 13:01:58.000 +0800","version_description":"- Die Funktion \"Multibanking\" steht wieder zur Verfügung. Jetzt sogar mit der Möglichkeit Transaktionen <br>  für Ihre registrierten Konten vorzunehmen.<br>- Kleine Design-, Usability-, Stabilitätsverbesserungen<br> <br>Wenn Ihnen die 1822direkt Banking App gefällt, empfehlen Sie uns bitte Ihren Freunden und bewerten uns im App Store."},{"version_id":"836789262","version_name":"3.0.0","version_date":"2020-07-31 22:00:47.000 +0800","version_description":"- Neus Logo, neues Design, angepasste Farbwelten.<br>- Girokonten können ab sofort über die Banking App beantragt werden<br>- Neuer Menüpunkt \"Produkte &amp; Informationen\" wurde integriert<br> <br>Wenn Ihnen die 1822direkt Banking App gefällt, bewerten Sie uns im App Store. <br>Ihr Feedback hilft uns, die App weiter zu verbessern."},{"version_id":"838121474","version_name":"3.1.0","version_date":"2020-10-12 07:24:49.000 +0800","version_description":"Wir haben die App verbessert - und noch mehr auf Ihre Bedürfnisse angepasst.<br><br>- NEU: Anzeige verfügbarer kostenloser Abhebungen am Geldautomaten<br>- Download- und Sharefunktion von PDFs<br>- Optimierungen bei der Neueinrichtung der App<br>- Kleinere Designanpassungen und weitere Verbesserungen und Leistungsoptimierungen<br><br>Wenn Ihnen die 1822direkt Banking App gefällt, dann bewerten Sie uns im App Store. Ihr Feedback hilft uns, die App weiter zu verbessern."},{"version_id":"838274886","version_name":"3.1.1","version_date":"2020-10-27 21:46:27.000 +0800","version_description":"- Stabilitäts- und Leistungsverbesserungen<br> <br>Wenn Ihnen die 1822direkt Banking App gefällt, empfehlen Sie uns bitte Ihren Freunden und bewerten uns im App Store."},{"version_id":"839608232","version_name":"3.2.0","version_date":"2020-12-18 14:07:21.000 +0800","version_description":"- Zusätzlicher Kontoticker für Umsatzvormerkungen<br>- Korrekturen und Stabilitätsverbesserungen<br><br>Teilen Sie Ihre Erfahrungen und schreiben Sie Bewertungen im iOS Store. Bei technischer Hilfe nutzen Sie bitte unser Kontaktformular unter https://www.1822direkt.de/kontakt/"},{"version_id":"840517251","version_name":"3.3.0","version_date":"2021-02-22 08:29:48.000 +0800","version_description":"Stabilitäts- und Leistungsverbesserungen<br><br>\n<br>\n<br>Wenn Ihnen die 1822direkt Banking App gefällt, dann bewerten Sie uns im App Store und empfehlen uns weiter.\n<br>Ihr Feedback hilft uns, die App weiter zu verbessern."}]