[{"version_id":"817929604","version_name":"1.0","version_date":"2017-03-22 07:26:26.000 +0800","version_description":""},{"version_id":"821467211","version_name":"1.01","version_date":"2017-03-26 18:44:13.000 +0800","version_description":"Surprise update! We decided to get everyone the new content as soon as possible. <br>1.01 Update Changes:<br><br>- New feature: Selling weapons to a new trader that can show up. She will give you food if the weapon is to her high standards.<br>- New trader: The Polearm Pal.<br>- New weapons! Bardiche, Modern Spear, Sports Horn, #1 Foam Hand, Enchanted Skull Hammer, Boot on a Stick, and more.<br>- New rare trader: Sir Boney, the Skeletal Knight.<br>- New rare recruit: Ultimate Sports Fan. Endlessly blasts their Air Horn, recharging it every mission.<br><br>The rest of the planned update (MFi controller, feedback requests, fixes and more) is on the way.<br><br>Thanks for all your support so far! Rate and review Death Road and send feedback to us for what you'd like to see next:<br>Twitter @rocketcatgames"},{"version_id":"821674389","version_name":"1.02","version_date":"2017-04-13 08:07:29.000 +0800","version_description":"Here's a quick update to add controller support! We also plan on a small follow-up update in about a couple of weeks.<br><br>Features:<br>- MFi controller support!<br>- Tweaks and fixes.<br><br>Send us your feedback! We plan on expanding support for multiplayer and control customization in future updates, and will read your requests.<br>If you like what we're doing, tell your friends about Death Road to Canada and leave a review!"},{"version_id":"821907428","version_name":"1.04","version_date":"2017-05-04 08:52:17.000 +0800","version_description":"- Streaming added with Apple Replay!<br>- Some bugfixes, including one for Enable Music.<br>- Lots of tweaks!<br><br>We're now working on a big update (codenamed: COCCYX) that will add a new Unlock System to the game. This should help with beginner player difficulty balance. You'll be able to earn new perks, traits, and more. This update should also include some new controls options that people have requested.<br><br>Full change list for this update:<br><br>- Apple Replay support added for streaming game footage!<br>- A fix for Enable Music acting strangely.<br><br>- Passed out Bar rescue no longer picks weapons up when unconscious<br>- Alternate foodless method to wake up POBR, takes a bunch of time instead.<br><br>- Civilized now always starts with 1 morale, preventing cases where it started with 0 or -1. No more INSTANTLY LOSING a Civilized recruit.<br><br>- Less frequent NOT ENOUGH MED SUPPLIES blurbs<br>- OUT OF MEDS blurb lasts longer onscreen, same time as other med messages<br>- OOM blurb can happen again if you heal, if a day passes, or you load a save.<br><br>- Revamped CAR NUT now let you choose whether or not you want the new car if you recruit a CAR NUT after the game starts.<br>- CAR NUT start of game check moved to game-start.df rather than the perk definition itself.<br>- Added familiar-recruit-check for the CAR NUT choice and future things like it. We can move other things here if requested, so that a recruit properly only gives you things if recruited. Let us know in the comments.<br><br>- Group healing doctor and trainers now have LEAVE as the first, default choice. Temporary measure until we can add extra options.<br>- Strength trainer strength check event now moved to last option.<br><br>- Cars no longer run out of gas if they have 0 car-mpg. No more losing the alien car for it being out of gas, hopefully.<br>- Wizzle Stick now properly gets a weapon score bonus. Maybe this will make the wizard stop using baseball bats instead of his staff. Let me know!<br><br>Misc Fixes<br><br>- Fixed a needless extra dup with zombie summoning that lead to putting garbage on the memory stack.<br>- Put in a missing day-passed tracking for a CYOA camp option<br>- Cancelled LNK day <br>- Pronoun correction for bully-sprayit<br>- Corrected recruit-familiarreplace, before it was unused and familiar characters were using the normal recruit-replace<br>- Changed familiar camp recruits to also use the above<br><br>- Modern Spear is now named Tactical Spear, which is a much more tactical name.<br><br>- The Blunt Master sledgehammer trader now has a special sale in April. Mark your calendars."},{"version_id":"822557404","version_name":"1.05","version_date":"2017-06-29 17:20:20.000 +0800","version_description":"Here's a big update! We're hoping the new unlock system gives beginner players something to look forward to as they get used to the Death Road. Advanced players will also get more options with their character builds and setups, while enjoying new content.<br><br>Another big update will hit sometime in August!<br><br>Update Changes Summary:<br><br>- A new unlock system that adds perks, traits, one-game bonuses, passive upgrades, and more!<br>- New Zombo Points that you can collect over the course of multiple games, to spend on unlocks, upgrades, and the new Gnome Trader.<br>- Gnome Trader that lets you buy one thing per game with Zombo Points, including supplies, recruits, and battle rodents.<br>- 7 new special characters you can recruit!<br>- New road events, including one that finally lets you change your hat.<br>- Many new perks and traits to build characters with.<br>- The ending text is now determined by your gameplay mode and characters. Characters with different skills and personalities have different epilogues, and most special characters have their own ending text!<br>- A new rare trader, the Sleepy Trader.<br>- Unlocks button on title screen leads to Zombo Town, where you can meet all the new upgrade and unlock characters.<br>- Unlock Gnome lets you buy unlocks and passive upgrades, including a long series of toilet upgrades.<br>- Upgraded toilets.<br>- Balance tweaks<br>- And more!<br><br>If you like what we're doing, rate us on the App Store and follow us on Twitter: @rocketcatgames"},{"version_id":"823217541","version_name":"1.10","version_date":"","version_description":""},{"version_id":"824245418","version_name":"1.11","version_date":"","version_description":""},{"version_id":"824425860","version_name":"1.21","version_date":"2017-11-16 19:36:51.000 +0800","version_description":"- Fix for an issue that caused black bars on iPhone X<br><br>This is a quick addition to our recent update (EYEBALL), which added a lot of new text events, upgrades, perks, fixes, and more!<br><br>Next big update will hit in January or February. It will include another batch of new content to expand the game even more. We're also planning on adding some requested mobile specific features, like more control tweak suggestions."},{"version_id":"824425860","version_name":"1.12","version_date":"","version_description":""},{"version_id":"825324946","version_name":"1.13","version_date":"","version_description":""},{"version_id":"825980577","version_name":"1.23","version_date":"2018-02-13 18:17:03.000 +0800","version_description":"New mini-update that lets ultra-strong characters rip heavy stuff off the floors and walls! They can now throw toilets at zombies, making toilets the ultimate weapon. This update also includes tweaks and fixes, along with a new character and special weapon type.<br><br>Try playing on Valentine's Day for a new surprise event!<br><br>Another big update is arriving in March, which will focus on new trading camps.<br><br>New Changes:<br><br>- Valentine's Day Event<br><br>- Spraying pipes added! Toilets, sinks, and bathtubs now spray water.<br>- Bolted furniture added! Some characters can rip up previously immobile furniture. This mostly benefits T*S*T*C characters and T*L*B, giving them more heavy stuff to pick up<br>- Various furniture tweaks for more varied zombie splatting<br>- HP reduction to toilets, sinks, bathtubs<br><br>- In-pause Options menu no longer changes the current music<br><br>- Fix for the chainsaw hand event bug that would happen if you were a solo character<br>- Thanksgiving change to be 4th Thursday of November<br>- America and Canada Day both now let you skip the special character<br>- Grammar tweak for trade-firearms<br>- Phoenix trait no longer sets loyalty to max<br><br>- Bow added! Silent and has a big piercing value at maximum draw<br>- Cupid character added and available for testing at game start<br>- Cupid's arrows recharge at a rate of 10 every time you go to the road, max of 60"},{"version_id":"826470144","version_name":"1.24","version_date":"2018-04-12 19:27:44.000 +0800","version_description":"The new FEMUR Update for Death Road to Canada adds two new weapons, a new perk for starting with a bow and regenerating arrows, and 5 new trader camps with new mechanics! We also add a new special character, the Barbarian, who constantly gets new weapons. She can get anything from a shovel to a gigantic sword, that she will then use alongside her powerful bow.<br><br>Full Changes:<br><br>- Bow and Arrows Perk added! This will give a character a no-drop bow, which will regenerate 4/7/10 arrows when going back to the road screen, depending on level<br>- Special bonuses for Bow and Arrows + Specialist Trait, you get more max arrows and regenerate them twice as fast<br><br>- Special Character: Barbarian added, rare chance in trading camps<br>- Barbarian has a bow and arrow with 60 arrows maximum, and gets 20 arrows back per mission<br>- Every mission, she gets out a new weapon, with a pool of 17 different weapons for 18 total when you include her bow<br>- She either has +1 max strength or +1 max fitness, when recruited<br><br>- Bonesaw added, it can rarely be found in hospitals and clinics. Similar to a fireaxe, but with almost no knockdown capabilities and always cleaves an extra zombie<br>- Bow values tweaked. Strength and fitness make more of a difference for fatigue, fatigue is less harsh, and bows take 33% longer to draw to full power<br>- You can now rarely find bow and arrow sets in places with sporting and/or camping goods<br><br>- 5 new common trading camps added, for a total of 15 now<br>- Fence of Values, with 4 traders and also a fence of some sort<br>- Ruined Camp, but not so ruined that it's not having a FIRE SALE!!!<br>- Farmhouse Camp, with a barn and dogs and hay<br>- Big Trading House, with a chance for bathroom reading<br>- Bazaar, it's the largest one now with 5 traders, gas and weapon buyer, and a campsite for getting a recruit. Its got it all<br><br>- Farm dogs that are well behaved but very aggressive against zombies<br>- Tsundere chicken<br>- Random egg chance<br>- Big Trading House has a 20% chance to spawn a magazine<br><br>- Ruined Trader/FIRE SALE guy is a special trader with a random inventory, some of which isn't for sale anywhere else<br>- Tier 1 item costs 3 food, Tier 2 is 6 food, Tier 3 is 10<br>- 5 tier 1 items, all supplies for about half the usual price<br>- 6 tier 2 items: 3 Grenades, Sturdy Machete, 5 Pipebombs, Aluminum Bat, Double Barrel Shotgun, Bow + 50 Arrows<br>- 7 tier 3 items: Uzi, Chainsaw, 9 Molotovs, Mega Maul, Scythe, Ultimate Log, Blowtorch XL<br>- Blowtorch XL is a blowtorch with extra charges<br><br>- Special trading camp failure rate without City Seeker reduced from 60% to 50%<br>- Burning Car Wrecks now have enough hitpoints to survive burning for 3 minutes instead of destroying itself instantly<br>- Double Barrel Shotgun can now be sold to weapon buyer for 3 food<br>- The Whammer now sells for 3 food instead of 2 (still a rip off)<br>- Plasma Rifle name change<br>- Moved strength trainer's dumbbell rack down by 1, as it was getting in the way sometimes<br>- Zombotown Rambeux has a new Haiku<br>- Mad Doctor Rare Trader now lets you \"pick someone else\" if you have 4 choices<br>- Some perks/traits will no longer give you a free \"total heal\" stat increment"},{"version_id":"827570225","version_name":"1.25","version_date":"2018-06-28 19:39:49.000 +0800","version_description":"This is the new GIZZARD update for Death Road to Canada! It has some changes to the final level, a new character with a few all new weapons, a new special trading camp, a new song, and some requested tweaks and fixes.<br><br>Next update will be a big one! It will have multiplayer improvements, new locations, AI weapons management, and more!<br><br>Changes this Update:<br><br>- Added the Last Mall on Earth, a new special trading camp. Has gas trader, weapons buyer, recruit campfire, 6 random traders, and a guaranteed rare 7th trader!<br>- Added the ability for trading camps to force a rare trader, currently used in the Mall.<br>- Fixed a hospital generation bug<br>- Fixed a room crash bug<br>- Changed how the on-death attributes work. Now Phoenix, Shield of Hope, and the July 4th and Bort characters will not drop their weapons on resurrection.<br>- Adjusted a bunch of city generation code for less getting stuck on trash.<br>- Made that really narrow city no longer generate door-trash.<br>- New rare character: Moody added<br>- New weapon support added for Rocket Launchers and Electric Tools<br>- New weapons for Moody: Off-Brand Plasms Rifle, Moody Launcher, Moody Chainsaw<br>- You can no longer sell no-drop weapons to the Weapons Buyer, partially due to how exploitable this was on Moody<br>- New Song Added: One More Road. Plays during credits and as a random road song.<br>- Snubnose Pistol will now replace normal pistols 20% of the time<br>- Double-barrel Shotgun will now replace normal shotguns 10% of the time<br>- Ruined Trading Camp/Fire Sale: Removed the flaming car that was right next to you as you spawned.<br>- Fix for a crash caused by completely empty rooms"},{"version_id":"829245594","version_name":"1.26","version_date":"2018-11-22 02:49:55.000 +0800","version_description":"Lots of new features in this update, including new gameplay modes, a new way to pick a new leader, multiplayer improvements, and more!<br><br>CHANGES:<br><br>- 3 new gameplay modes added!<br>- Endless Mode added, see how far you can get<br>- Over Powered Party Mode added. This lets you start in a special map that lets you recruit any rare character in the game<br>- Quick Death Mode added. It's Short Trip to Heck, but with the difficulty tripled<br><br>- Removed the \"pick a new character\" text event when the leader is killed. Now it works similarly to how joining in as a multiplayer buddy would work, meaning you should be able to choose a new character more seamlessly. This only takes one second to kick in. Swipe to change characters, attack or tap a button to pick that character as new leader.<br><br>- Expanded multplayer features! 4 players supported, if you have enough MFI controllers!<br>- In multiplayer, player-controlled characters will teleport to the leader's room after one second. This was done to drastically reduce the waiting time when the other players are inactive. This is turned off if the character is grabbed<br>- Event Picker Cursor splits into P1 through P4 cursors as players join, all can be used<br>- Players 2-4 now have more control over menu choices. Whoever picks first makes the choice<br>- If the leader dies and there is another player, the leadership will go to that player. Camera will swap over, they will get pause menu control, and the Leader crown will pop over their head<br><br>- OPP mode has a FORBIDDEN HUT that lets you recruit characters that may break the game. Have fun with that, but also NO REFUNDS<br>- Special ending wave tweaks for OPP. The ending fight takes about twice as long as in other modes. I may later also make the harder modes have a longer ending fight wave, such as in KEPA Mode<br>- Endless Mode shows your days in, instead of days left<br>- Endless Mode tracks your highest day reached in the game mode select screen<br><br>- The game now remembers who the leader was on the next mission. So if Player 2 was leader, they will retain leadership in the next mission.<br>- All players now will get to retain who they were controlling at the start of the next mission.<br>- When they're selecting a character to control, non-leader players can now choose to take over the characters of other players.<br>- Non-leader players can now take over the leader's character. This will give them leadership. This gives a way to swap which player is leader, which was missing before.<br>- The game will run a quick check to clear your control settings to make them compatible with the new 4-player changes.<br><br>- The ability to press escape to quit a menu added to more menus, for now mostly the supply and weapon traders.<br>- Changed effect of camp2-zwatch for Sound Sleepers that have no loyalty<br>- Text adjustments in camp2-bwatch and camp3-trap for Sound Sleepers<br>- Weegee event now gives a different effect for the fire result if Fireproof<br>- Fix for the walking event with the yelling car, which would error if you had an Oblivious character<br>- Car Detour event no longer nukes your gas if you're in a 0 gas consumption car<br><br>- Irritating Trademark Weapon is now a recharging Air Horn<br>- IRRITATION HORN has 20 charges for maximum cooling it<br><br>- Revamped recruit system on recruit-yes and recruit-replace, now most will give \"pick more\" with a full group and let you cancel the recruit.<br>- Exceptions to above: Familiar Face recruiting, which uses a different system that would have problems with this. Recruiting dogs by feeding them and recruiting rare camp recruits, which have food costs, so the game forces you as to not waste the food.<br>- Jerk-recruiting uses the new system<br>- Changed two recruit1 events to no longer use the old \"3 choices or leave behind system\", as the new system makes this even more obsolete.<br>- Removed nodeathdrop from Rambeaux<br>- Buffed Ninja-countdown from 4-5 to 6-8<br>- Moody now destroys your entire group less often, but still does sometimes<br><br>And more!"},{"version_id":"832575568","version_name":"1.27","version_date":"2019-09-19 08:00:52.000 +0800","version_description":"- AI Weapon Locking added! Select a weapon twice to lock it. AI followers will try to use whatever weapon is locked, and they will try to not drop it<br>- If you lock an empty slot, they should treat it like it's a weapon and not replace it. This was added for characters with good unarmed skills or if you want a dog to not pick up anything<br>- When a square is selected and flashing in the Swap Meet weapon menu, it will show a flashing lock indicator to hint to players that the locking feature exists<br><br>- Dogs now have a realistic poop system<br><br>- 4 new events. The Last Internet Connection, Death Car to Right Here, The Big McDowell, and Cloud Watching.<br>- 2 new rare events added, Wonkor Burger and Trust Building Exercise<br><br>- New trader added, Heavy Ordinance Trader. Sells the new Grenade Launcher, Bazooka, and Land Mine<br><br>Weapons<br><br>- New weapons: Tableware (spoon, fork, butterknife), rake, hoe, wood saw, blacksmith hammer, land mines, bazooka, electric leaf blower and weed whacker, grenade launcher, electric chainsaw, haunted tableware<br><br>- Rakes and Hoes added to farm loot<br>- Blacksmith hammer, woodsaw, electric chainsaw/blower/whacker, rakes and hoes added to hardware store loot<br>- Electric Chainsaw how has 80 juice when found instead of 250<br>- Electric Blower and Whacker now have 50 battery<br>- Fix for Moody's Plasms Rifle<br>- Tableware added to kitchen loot table, spatula chance halved (NERF)<br>- Replaced ghost mansion turret rewards with haunted tableware set and 3-5 food<br>- Removed pistol, snubnose, regular rifle from forest bunker end loot, added both turret types<br>- Secret city bunkers how have a 30% chance of green turret, 10% chance of red<br>- Mansions now have haunted furniture, the ULTIMATE weapon<br>- Mansion kitchens now have a small chance of haunted tableware<br>- Rocket launcher now fires more slowly<br>- Fairy bat added<br>- Charge-based ranged weapons now use reload for shot time and cooldown for melee, like regular guns<br>- Character strength added to bow draw speed<br>- Fixed a bug with swapping a knocked bow with another<br>- New weapons added to weapon buyer<br>- Napalm Launcher will spawn in the Inferno locations, replacing the flamethrower<br>- Napalm Launchers found on the ground give 50 charges<br>- Burning locations now have a slightly higher chance of flamethrower<br>- Fireproof special recruit now gets a 20 charge Napalm Launcher, losing the 200 charge blowtorch<br>- 50 charge Napalm Launcher added as a Fire Sale 8th option to the 10 food list<br><br>Misc<br><br>- Characters in Canada Crossing now invincible for a bit at the beginning of the round<br>- Dirtier Yallmart floors, as a test to maybe make the world more filthy<br>- Reduced items spawning behind immovable objects<br>- Fixed a particle effects issue when smashing trees and bushes<br>- More particle fixes<br>- Tweaks to some collision things<br>- Fix for a UI exploit that let you skip events<br>- AI followers should now get out the same side of the car as the player<br><br>- Ammo Emporium Dog no longer drops his claws on death<br>- Special boxing trainer no longer drops boxing gloves on death<br><br>- New code to make it so the game doesn't confuse Mechamountie for Mason<br>- Code optimizations<br>- Buffer overflow fix<br>- Many behind the scenes tweaks and memory leak fixes<br>- The bandit events for the ones that take everything and the weapon stealing ones tweaked to be slightly less harsh<br>- Overpowered and Endless mode added to game-info streak tracking<br>- Changes to how Fireproof works so it's statmod based instead of a Trait check. This will allow new methods to gain fireproof that doesn't eat up your Trait slot completely<br>- Checks to make sure previous fireproof things don't break with this change<br>- Fixed a crash that would happen if you replaced your playable character in a trading camp with a full team, when the playable character was the only character not resting<br>- Tweaked a hash table function which could lead to some crashes"},{"version_id":"842055358","version_name":"1.30","version_date":"","version_description":""}]