[{"version_id":"818164959","version_name":"1.0.1","version_date":"","version_description":""},{"version_id":"818194252","version_name":"1.0.2","version_date":"","version_description":""},{"version_id":"818325362","version_name":"1.0.3","version_date":"","version_description":""},{"version_id":"818410666","version_name":"1.0.4","version_date":"","version_description":""},{"version_id":"818456035","version_name":"1.0.5","version_date":"","version_description":""},{"version_id":"818620846","version_name":"1.0.6","version_date":"","version_description":""},{"version_id":"818821393","version_name":"1.1.0","version_date":"","version_description":""},{"version_id":"818979768","version_name":"1.1.1","version_date":"2016-09-22 18:32:04.000 +0800","version_description":"This update adds the new world of Zhey Auna! It will take a few days for it to show up in the daily &amp; community missions, as everyone must get this update first.\n\nStay tuned for a lot more great content updates coming this year!<br>\nPlease support us by leaving a review or by rating Phoenix II. We greatly appreciate it!"},{"version_id":"819168565","version_name":"1.1.2","version_date":"2016-10-07 08:45:45.000 +0800","version_description":"Some small improvements while we are working on a big content update coming this fall! Changes in this update:<br><br>* Zhey Auna has become a bit more grey to improve bullet legibility.<br>* Laser warnings and other game sounds can no longer be heard while in the menus.<br><br>Please support us by leaving a review or by rating Phoenix II. We greatly appreciate it!"},{"version_id":"819312445","version_name":"1.1.3","version_date":"2016-10-25 20:06:36.000 +0800","version_description":"This update lays some groundwork for our big update coming this fall! Stay tuned.<br><br>Some visible changes in this update:<br><br>* The ship detail interface now shows how many invaders you have destroyed with each ship! Share your highest number with us on Twitter @firigames or with #phoenix2.<br>* The time is now always shown on the leaderboards below each score. The time is used as a tie-breaker when two scores are equal. <br>* Kappa Drive lower levels have improved power particle attraction.<br><br>More balance changes will be coming in the future, but we will keep those for our big 2.0 update. If you enjoy Phoenix II, then please support us by leaving a review or a rating. We greatly appreciate it!"},{"version_id":"819779755","version_name":"2.0","version_date":"2016-12-08 12:46:18.000 +0800","version_description":"Phoenix II Mega 2.0 Update!<br><br>Get ready for our big 2.0 update. This update adds leagues, 10 new ships, new special abilities, balance changes and much more!<br><br>This update contains significant balance changes, especially around (offensive) special abilities. The goal of these changes is to make the abilities better in certain situations and worse in others. This prevents some abilities from always being the best and encourages players to find the right ship that matches the challenges of the mission.<br><br>New Features:<br><br>* Leagues: It turns out that the daily missions were a bit too hard for some, while not challenging enough for others. To address this issue each pilot has now been placed in a league and each league has its own unique daily mission. Pilots who complete the daily mission are promoted to a higher league the next day. Higher leagues have more challenging daily missions and give better rewards. All pilots will start in the lowest D league.<br>* New Ships and Special Abilities: 10 new ships to collect and explore. Each ship has its own unique weapon and at least one new special ability, such as the Chrono Field, Vorpal Lance and more.<br>* XP Rewards: You now always gain Experience Points for destroying Invaders, even if your high score is not improved. XP is awarded directly after each game.<br>* A great new music track has been added. You can switch tracks by toggling the music on and off.<br>* Improved mission generation algorithms.<br>* Invaders are now armed with new weaponry.<br>* New world: The Prometheus Array. Missions on it will appear in a few days.<br>* Haptic feedback support for iPhone 7. <br><br>Balance Changes:<br><br>* Laser Storm no longer prevents the ship’s weapon from firing. Its duration and damage have been reduced.<br>* Missile Swarm now launches more missiles and they are all fired at once. Damage has been reduced.<br>* Mega Laser firing duration has been reduced and it is no longer possible to move the beam. It deals the damage much more quickly and destroys all enemy bullets in its path.<br>* Mega Bomb blast radius has been increased and its damage has been reduced. This makes the Mega Bomb better against large groups of smaller enemies and worse against large ships.<br>* Barrier strength has been increased at lower levels.<br>* Your ship’s weapons now keep firing while Point Defense is active.<br>* Ships with spread weapons (such as the Jn'Dur, Gorthaur, Arietis, Heechi) have their damage slightly increased.<br>* Teleport energy cost has been removed. Teleporting in quick succession will slowly increase the time it takes for the Teleport to charge.<br>* The Kappa Drive has been upgraded with a Power Generator and will now generate power particles over time as well as attract them.<br><br>Other Changes:<br><br>* Mission debriefings are now shown directly after logging in. Here you also get to see if you are promoted to a higher league.<br>* Ships receiving damage to their hull will now flash red when hit. Hitting enemy armor flashes yellow and hitting shields flash blue."},{"version_id":"820080248","version_name":"2.0.1","version_date":"2016-12-14 15:17:32.000 +0800","version_description":"This small update fixes a few small bugs and adds missing in-game localization. It also restores Mega Laser to the original damage and charge times. It still destroys bullets in its path.<br><br>Phoenix II Mega 2.0 Update!<br><br>Get ready for our big 2.0 update. This update adds leagues, 10 new ships, new special abilities, balance changes and much more!<br><br>This update contains significant balance changes, especially around (offensive) special abilities. The goal of these changes is to make the abilities better in certain situations and worse in others. This prevents some abilities from always being the best and encourages players to find the right ship that matches the challenges of the mission.<br><br>New Features:<br><br>* Leagues: It turns out that the daily missions were a bit too hard for some, while not challenging enough for others. To address this issue each pilot has now been placed in a league and each league has its own unique daily mission. Pilots who complete the daily mission are promoted to a higher league the next day. Higher leagues have more challenging daily missions and give better rewards. All pilots will start in the lowest D league.<br>* New Ships and Special Abilities: 10 new ships to collect and explore. Each ship has its own unique weapon and at least one new special ability, such as the Chrono Field, Vorpal Lance and more.<br>* XP Rewards: You now always gain Experience Points for destroying Invaders, even if your high score is not improved. XP is awarded directly after each game.<br>* A great new music track has been added. You can switch tracks by toggling the music on and off.<br>* Improved mission generation algorithms.<br>* Invaders are now armed with new weaponry.<br>* New world: The Prometheus Array. Missions on it will appear in a few days.<br>* Haptic feedback support for iPhone 7. <br><br>Balance Changes:<br><br>* Laser Storm no longer prevents the ship’s weapon from firing. Its duration and damage have been reduced.<br>* Missile Swarm now launches more missiles and they are all fired at once. Damage has been reduced.<br>* Mega Laser firing duration has been reduced and it is no longer possible to move the beam. It deals the damage much more quickly and destroys all enemy bullets in its path.<br>* Mega Bomb blast radius has been increased and its damage has been reduced. This makes the Mega Bomb better against large groups of smaller enemies and worse against large ships.<br>* Barrier strength has been increased at lower levels.<br>* Your ship’s weapons now keep firing while Point Defense is active.<br>* Ships with spread weapons (such as the Jn'Dur, Gorthaur, Arietis, Heechi) have their damage slightly increased.<br>* Teleport energy cost has been removed. Teleporting in quick succession will slowly increase the time it takes for the Teleport to charge.<br>* The Kappa Drive has been upgraded with a Power Generator and will now generate power particles over time as well as attract them.<br><br>Other Changes:<br><br>* Mission debriefings are now shown directly after logging in. Here you also get to see if you are promoted to a higher league.<br>* Ships receiving damage to their hull will now flash red when hit. Hitting enemy armor flashes yellow and hitting shields flash blue."},{"version_id":"820411320","version_name":"2.0.2","version_date":"2017-01-18 18:15:26.000 +0800","version_description":"A small update with some bug fixes and balance changes. Stay tuned for our upcoming big update!<br><br>Balance Changes:<br><br>* Mega Laser beam width has been reduced.<br>* Missile Swarm damage is now at its intended level. This change is already in effect for the past week, as it was caused by a configuration error that we fixed remotely. Missile Swarm visuals are also improved.<br>* The time that your ship's weapons are disabled after deactivating Personal Shield has been greatly reduced.<br><br>Bug fixes and other changes:<br><br>* Fixes a bug that could cause a crash when switching stages.<br>* Fixes a bug that cause the wrong stage to be active after switching Firi accounts.<br>* Improves performance on iPad Mini 4."},{"version_id":"820627064","version_name":"2.0.3","version_date":"2017-01-23 20:35:12.000 +0800","version_description":"Fixes a bug that might cause laser weapons to do very large amounts of damage.<br><br>2.0.2<br><br>A small update with some bug fixes and balance changes. Stay tuned for our upcoming big update!<br><br>Balance Changes:<br><br>* Mega Laser beam width has been reduced. Damage and other properties are unchanged.<br>* Missile Swarm damage is now at its intended level. This change is already in effect for the past week, as it was caused by a configuration error that we fixed remotely. Missile Swarm visuals are also improved.<br>* The time that your ship's weapons are disabled after deactivating Personal Shield has been greatly reduced.<br><br>Bug fixes and other changes:<br><br>* Fixes a bug that could cause a crash when switching stages.<br>* Fixes a bug that cause the wrong stage to be active after switching Firi accounts.<br>* Improves performance on iPad Mini 4."},{"version_id":"820700141","version_name":"2.0.4","version_date":"2017-01-31 20:19:49.000 +0800","version_description":"Another update with some important bug fixes and improvements. Stay tuned for our big update coming in February.<br><br>* Adds a specific tutorial for every Zen Mode. The tutorial is started when you unlock the first Zen Mode of each type.<br>* Fixes a bug that caused ships with very fast firing weapons to do less damage than intended. Ships most affected by this fix are Dragonfly, Tillat'or and Atlas.<br>* Missile Swarm timeout now only lasts until all locked targets are gone, instead of waiting until every fired missile has been destroyed."},{"version_id":"820875114","version_name":"2.1","version_date":"2017-02-23 20:08:34.000 +0800","version_description":"Thank you for your continued support and feedback. We have another great update for you! <br><br>New Features:<br><br>* Five brand new ships to collect and upgrade.<br>* New Zen Mode: Reflex EMP.<br>* Three leagues even harder above S league: SS, SSS and SSSS. Enjoy!<br>* A timer is shown after each wave to let you know if you are faster or slower than your current high score.<br>* Invaders have new weapons at their disposal.<br><br>Balance Changes:<br>* Energy cost of Vorpal Lance's Charge Counter has been decreased.<br>* Chrono Field now deploys a field in which all bullets are slowed down. The duration of the field depends on the amount of energy used and the level of the ability. With this change, Chrono Field can now be combined with Zen Modes, creating a more interesting gameplay.<br>* iPhone and iPad now have identical gameplay. The areas in which the player and the enemies can move are the same and new waves fly in with identical timings. The small invisible barriers to the sides on iPad and on the bottom and on top on iPhone have been adjusted to make these areas identical.<br><br>Other Changes:<br><br>* Community missions now have an extra difficult 6th Act.<br>* D and C League missions now have four Acts. All other daily missions still have five Acts."},{"version_id":"821100436","version_name":"2.1.1","version_date":"2017-03-02 00:44:58.000 +0800","version_description":"Fixed an issue that could cause the game to become stuck in a time slowdown after activating a Zen Mode ability. Also increases the size of the Boomerangs to improve visibility. Boomerang hit circle size remains the same.<br><br>2.1:<br><br>Thank you for your continued support and feedback. We have another great update for you! <br><br>New Features:<br><br>* Five brand new ships to collect and upgrade.<br>* New Zen Mode: Reflex EMP.<br>* Three leagues even harder above S league: SS, SSS and SSSS. Enjoy!<br>* A timer is shown after each wave to let you know if you are faster or slower than your current high score.<br>* Invaders have new weapons at their disposal.<br><br>Balance Changes:<br>* Energy cost of Vorpal Lance's Charge Counter has been decreased.<br>* Chrono Field now deploys a field in which all bullets are slowed down. The duration of the field depends on the amount of energy used and the level of the ability. With this change, Chrono Field can now be combined with Zen Modes, creating a more interesting gameplay.<br>* iPhone and iPad now have identical gameplay. The areas in which the player and the enemies can move are the same and new waves fly in with identical timings. The small invisible barriers to the sides on iPad and on the bottom and on top on iPhone have been adjusted to make these areas identical.<br><br>Other Changes:<br><br>* Community missions now have an extra difficult 6th Act.<br>* D and C league missions now have four Acts. All other daily missions still have five Acts."},{"version_id":"821277191","version_name":"2.1.2","version_date":"2017-03-15 12:57:25.000 +0800","version_description":"A small bug fix update. Stay tuned for our big update coming at the end of the month!"},{"version_id":"821349992","version_name":"2.2","version_date":"2017-03-30 09:25:48.000 +0800","version_description":"New Features:<br><br>* 5 brand new ships to collect and upgrade, bringing the total to 60 ships! <br>* Leaderboards now show more of the top players and players near you. The white line separator can also tapped to show even more scores.<br><br>Balance Changes:<br><br>* The weapon damage of NC-150, Tempest &amp; Xaniea has been slightly increased.<br><br>We will release a new content update every month leading up to the 1 year anniversary of Phoenix II on July 28th! We have awesome things planned so stay tuned!"},{"version_id":"821917159","version_name":"2.3","version_date":"2017-04-27 13:38:32.000 +0800","version_description":"Phoenix II April Update! This update is part of our monthly updates leading up to the one year anniversary of Phoenix II in July.<br><br>New features:<br><br>* Phoenix Revives! A Phoenix Revive can be used to restart a mission without having to replay it from the beginning. You will be placed at the start of the highest act that you have reached in that mission. Revives are obtained by playing missions and can be purchased at the shop.<br>* Invaders have exciting new weapons! Mission generation was also improved to create more varied missions. <br><br>Other Changes:<br><br>* Improved the visuals of Mega Laser &amp; Mega Bomb to indicate the time it takes to charge the weapon.<br>* Improved the visuals of Energy particles to make them more distinguishable. <br><br>Bug fixes:<br><br>* Fixed the issue that made expanding a leaderboard impossible, even though more scores are on the leaderboard.<br>* Fixed a problem that allowed you to accidentally play expired missions.<br>* Added missing localization.<br><br>Stay tuned for our May update!"},{"version_id":"822067117","version_name":"2.4","version_date":"2017-05-30 12:24:24.000 +0800","version_description":"Our May update is here! This update is part of our monthly updates leading up to the one year anniversary of Phoenix II in July.<br><br>New features:<br>* A classic Phoenix HD ship has been added. The Corsair is armed with a Rocket Pod, a Missile Swarm and a Tracking Minigun.<br>* The invaders have arrived at the old world of Ceres Major. Missions in this world will become available once everyone has updated.<br>* From the community tab, we now link to external Phoenix II communities. If you have a community you would like to see added, contact us at the email phoenix2@firigames.com or through the social media.<br>* Tapping outside the revive dialog now speeds up the countdown. Tap multiple times to go even faster to the score screen.<br><br>Stay tuned for our second last June update, and then our massive 3.0 update coming in July to celebrate the one year anniversary of Phoenix II."},{"version_id":"822371044","version_name":"2.5","version_date":"2017-06-28 08:10:17.000 +0800","version_description":"Phoenix II June update! This update is part of our monthly updates leading up to the 1 year anniversary of Phoenix II in July next month.<br><br>New Features:<br>* The Trinity ship from Phoenix HD has been added and features its own custom Teleport ability.<br>* Two brand new ships to collect and upgrade: Antioch and Uhb.<br><br>Balance Changes:<br>* The Personal Shield no longer uses energy. It is activated after a very short charging time. The shield expires after a while or if the ship starts moving. This change was made so the Personal Shield is more in line with other Zen Modes and can be combined with Counter based abilities.<br>* The Chrono Field now phases your ship out while inside the field. While phased out, your ship cannot be hit by bullets or lasers.<br><br>Other improvements:<br>* Teleport has a new charging visual effect that indicates its progress.<br>* Invaders have a few new weapons.<br><br>Bug fixes:<br>* Claiming level up rewards is now possible on iOS 11 beta.<br><br>Stay tuned for our massive 3.0 update coming in July to celebrate the one year anniversary of Phoenix II."},{"version_id":"822721027","version_name":"3.0","version_date":"2017-07-27 10:20:52.000 +0800","version_description":"Welcome to the Phoenix II 1 year anniversary update. It has been a great first year, where you together played more than 120 million games in over 1 million unique missions! Thanks for your support and enjoy the update.<br><br>New features:<br>* All Auras and Zen modes have an Ultimate Upgrade rank added. Each Ultimate Upgrade makes the ability more versatile or effective.<br>* All weapons now have an Ultimate Upgrade rank added to increase the damage one step further.<br>* The entire ship interface has been re-designed to show detailed information about the weapons and abilities as you upgrade.<br>* Reworked the weapon types. A Shield Breaker weapon is now highly effective to take down the shields on an enemy. Weapons with Armour Piercing deal full damage to armoured Invaders. Finally, a weapon with High Impact has a a chance to deal critical damage to unprotected foes.<br>* Three new ships have been added: Wraith, X-81 and Scuuxun. Each has a combination of abilities that has not been seen before. <br><br>Game engine upgrades:<br>* Phoenix II now runs at an awesome 120fps on the new iPad Pro 10.5-inch and 12.9-inch. This makes the game super fluid and the controls even more responsive! <br>* Renders with a Wide Color gamut on iPhone 7 and iPad Pros. Bullets are deeper reds and all effects are more vibrant.<br><br>Balance changes:<br>* Enemy lasers are more effective on Barrier shields.<br>* Slightly increased damage of Vorpal Lance<br>* Mega Laser and Mega Bomb now have charge time increase after they are used, like Personal Shield and Reflex EMP. This increase recovers over time.<br>* Reduced Aurora rate of fire.<br>* The following ships had their weapon damage adjusted to match other ships with similar weapons: Proteus, Barret, 502-Q8, Heechi, Photurius, Wrackr.<br>* Njorün weapon damage was lower than intended; This has been fixed.<br><br>Bug fixes:<br> * Fixes the issue where Chrono Field, Phalanx and Barrier would not work correctly when activated during a teleport."},{"version_id":"823561241","version_name":"3.0.1","version_date":"2017-10-13 07:57:15.000 +0800","version_description":"A small bug fix update:<br><br>* Fixes graphical glitches, especially on iPad Pros.<br>* Improved visual effects for armoured &amp; shielded Invaders.<br><br>Stay tuned for our next content update coming soon!"},{"version_id":"824011556","version_name":"3.0.2","version_date":"2017-10-14 10:48:43.000 +0800","version_description":"A small bug fix update:<br><br>* Fixes graphical glitches, especially on iPad Pros.<br>* Improved visual effects for armoured &amp; shielded Invaders.<br><br>Stay tuned for our next content update coming soon!"},{"version_id":"824084801","version_name":"3.1","version_date":"2017-11-01 14:34:35.000 +0800","version_description":"This update adds support for the iPhone X. Thanks for your support and enjoy this update.<br><br>New features:<br>* Phoenix II is now ready for the iPhone X!<br>* A classic ship from Phoenix HD, the Shogun has returned! Its blades make short work of incoming invaders and the spectacular Blade Storm Aura is able to handle large formations swiftly. <br><br>Balance changes:<br>* Laser Storm deals slightly more damage in slightly less time.<br>* Increases strength of Phalanx Ultimate.<br><br>Bug fixes:<br>* Fixes an issue where lasers blocked by Barrier or Personal Shield would still add a grazing energy bonus to the player.<br>* EMP now destroys offscreen boomerang projectiles.<br>* Haptic feedback is now enabled on iPhone 8 and iPhone 8 Plus."},{"version_id":"824349118","version_name":"3.1.1","version_date":"2017-11-11 13:07:05.000 +0800","version_description":"A small bug fix update:<br><br>* Fixes issue where input on the bottom area of the screen could be unresponsive. This was especially noticeable on iPhone X.<br>* Small UI fixes for iPhone X.<br><br>Visual Changes:<br><br>* Point Defence now only shows lock-on reticles on projectiles that are currently targeted, instead of on all projectiles in range. Gameplay is unaffected.<br><br>Stay tuned for our next content update coming soon!"},{"version_id":"824464121","version_name":"3.2","version_date":"2017-12-21 08:49:09.000 +0800","version_description":"New features:<br>* Two new ships! NC-271 and Predator have joined the roster to fight the Invaders.<br>* Invaders have new weapons. These will start to show up in a few days.<br><br>Bug fixes:<br>* Fixes an issue where Mega Laser would destroy newly spawned bullets that were not in its path.<br>* Fixes an issue that caused an Ultimate Personal Shield to not reflect laser beams back in certain circumstances.<br><br>Other changes:<br>* Reduces screenshake of the main weapon of Hime, Heechi and Kada Veni."},{"version_id":"825872077","version_name":"3.3","version_date":"2018-02-04 13:03:11.000 +0800","version_description":"Welcome to a new year of Phoenix II updates! We have a lot of great updates planned this year. This update brings a slew of fixes as well as adding two new ships and the ability to inspect scores on the leaderboards. Thanks for your support and enjoy the update.<br><br>New Features:<br>* Leaderboard score information is now available. Tap on any score in a leaderboard to see details about the score, the ship that was used and the pilot.<br>* Redesigned Pilot tab to show your badges better.<br>* Two new ships! Lorilou and AB8/Klyn have joined the roster to fight the Invaders in their own unique ways.<br><br>Bug Fixes:<br>* Fixes a variety of issues related to sounds.<br><br>Other Changes:<br>* Reduces screenshake of the main weapon of Lokie and Barret.<br>* Player ships can no longer collide with turrets that have been destroyed."},{"version_id":"826021327","version_name":"4.2","version_date":"2018-12-20 09:32:44.000 +0800","version_description":"Welcome to our holiday update! First off are two new ships, which brings the total to 80 ships, doubling the amount since launch. The second big feature is the Mission Log, which shows the results of all missions you have ever played, all the way back to the launch of the game! And yes, all historical leaderboards you participated in can be viewed as well.<br><br>We wish you all happy holidays and are looking forward to another year of great Phoenix 2 updates with you. &lt;3&lt;3&lt;3<br><br>New features:<br>* 2 new ships join the fight, Nimbus and Widget.<br>* A Mission Log has appeared on the Pilot tab. View the mission results and leaderboards of every mission you have ever played.<br>* Tutorials for each ship’s primary special ability. These are also available for replay on the ship detail page.<br><br>Other changes:<br>* Reduced screenshake of Atlas and Arietis weapon impacts.<br>* Fusion Core explosion expands faster.<br>* Sentinel Apex has increased firing rate.<br><br>Bug fixes:<br>* Bullet Detonator Apex now has MIRV Defense enabled."},{"version_id":"826021327","version_name":"3.4.1","version_date":"2018-03-01 08:54:20.000 +0800","version_description":"Welcome to our second update of the year. This update adds greatly improved game recordings, a new world and new ships!<br><br>New features:<br>*  Greatly improved game recordings! You can now enable automatic game recordings from the play tab. Once enabled, all your games are automatically recorded, so that awesome high score run is always saved. The quality of the recordings is also dramatically improved. So go make those awesome recordings and share them through your favorite social media. These new game recordings require iOS 11.2.1 and a device with an A9 processor or better.<br>* A new world. The struggle against the Invaders expands to The Blight, a system of planets broken during the conflict. Missions will soon visit this new area. <br>* The Polaris and Icarus join the roster of available ships.<br><br>Bug fixes:<br>* Fixes small UI issues.<br>* Fixes colors of some background elements in Arcology CQ-6"},{"version_id":"826566913","version_name":"3.5","version_date":"2018-05-15 07:57:07.000 +0800","version_description":"The Phoenix II spring update is here! This update features new content, balancing, as well a slew of bug fixes. Stay tuned for exciting things while we move closer to the 2nd anniversary of Phoenix 2!<br><br>New features:<br>* The Mirage has arrived! One of the most popular ships from Phoenix HD returns, equipped with its epic Nightfury laser!<br>* Sound effects are added to the interface.<br><br>Balance changes:<br>* Missiles fired by the Missile Swarm Ultimate now only reacquire targets that were originally locked when the Missile Swarm was fired.<br>* Laser Moons MKII will fire on active turrets first, before considering other targets.<br>* Slightly increases the weapon damage of X-81 and Oran.<br>* Increases the weapon damage of NC-271 and slightly increases the bullet spread.<br>* Brings Mega Laser charge time increase and recovery more in line with Mega Bomb.<br>* Reduces Stun EMP maximum stun duration.<br><br>Bug fixes:<br>* Blast Damage of projectiles is no longer limited to a maximum of 8 targets. <br>* Fixes issue where the select mission button was pushed offscreen because of a long world name on iPhone 5S and SE.<br>* The Inner Lining of a Barrier now always collapses when the outer barrier collapses. This didn’t always happen under certain circumstances.<br>* Fixes a problem where under certain circumstances the time slowdown effect of firing an EMP would last longer than intended.<br>* Muting sounds now works as expected again in iOS 11.3.<br>* Fixes issue where loading more scores in a leaderboard could display scores of the wrong rank. <br>* Fixes issue where the mission debriefing contents can sometimes be displayed at the bottom of the screen.<br>* Fixes Japanese localization where Chinese text was shown instead."},{"version_id":"827387386","version_name":"3.6","version_date":"2018-07-11 07:47:33.000 +0800","version_description":"Another packed update with something for new players and veterans alike to enjoy. Next up is our massive update to celebrate the 2nd anniversary of Phoenix 2!<br><br>New features:<br>* The mission selection process has been revamped. Missions are selected from the Play tab now and show much more information.<br>* The ship selection tab now has sorting options to find your favourite ships more easily.<br>* Two new ships enter the roster, Marauder and Lyova!<br>* Sound engine improvements for better sounding projectile impacts. Especially noticeable for rapid firing weapons.<br>* New players will get two training missions to get familiar with the game before joining the battle in the daily missions.<br><br>Other changes:<br>* Phalanx now changes color as it becomes weaker.<br>* Trinity Teleport effect is now green.<br><br>Balance changes:<br>* Increased Ion Cannon Ultimate upgrade Blast Damage from 5 to 10.<br><br>Bug fixes:<br>* Fixed ships dealing High Impact damage in the preview, even when they have a different weapon damage type."},{"version_id":"827842815","version_name":"4.0","version_date":"2018-08-02 10:39:25.000 +0800","version_description":"Phoenix II was released 2 years ago so it is time to celebrate! This massive anniversary update introduces the amazing new Apex forms and a new mission type for everyone to enjoy! Thank you all for playing our game and sharing your greatest moments. Year 3, here we come!<br><br>New features:<br>* Introducing Apex forms. Each ship gets two exclusive Apex forms. Each Apex form has a unique new look and a modified weapon or ability to push the performance of your favourite ship even further!<br>* The new Specialist mission is now available. This mission can only be played with a specific set of ships, which is different every time. Specialist missions cycle every week and weekend. The mission during weekdays can be played with multiple ships from the selection of that week, while the Specialist mission in the weekend can only be played with a single specific ship.<br><br>Bug fixes:<br>* Point Defense now correctly targets the closest projectile first when firing."},{"version_id":"828370295","version_name":"4.0.1","version_date":"2018-08-28 14:02:20.000 +0800","version_description":"All of the content from our massive anniversary update has been localized to all languages that Phoenix II supports.<br><br>Balance changes:<br>* Slightly increases passive attraction power for Antigrav Apex.<br>* Tactical Super Moons now prefer targets in front of the player.<br>* Slightly increases damage of Corsair’s Railgun Apex.<br>* Adds a visual and audio cue when Serenity Apex is charged.<br>* Teleport charge time is not increased after using the second teleport of a Double Teleport Apex.<br>* Adds Fusion Core to Shield Breaker Mega Bomb Apex which deals regular damage.<br>* Slightly increases Yoth-Hola Laser Expansion Apex dps and firing rate.<br><br>Other changes:<br>* Revised some Apex descriptions."},{"version_id":"828773161","version_name":"4.0.2","version_date":"2018-10-09 15:50:20.000 +0800","version_description":"Another small bug fix update with improved support for new devices.<br><br>Bug fixes:<br>* Enables haptic feedback for new devices.<br>* Extended Range Mega Bomb Apex now has a Fusion Core.<br>* Ion Cannon projectiles do not stun all overlapping Invaders anymore.<br>* Sound should no longer break after receiving a call or a similar interruption."},{"version_id":"828892969","version_name":"4.0.3","version_date":"2018-10-12 06:08:27.000 +0800","version_description":"This update fixes a crash introduced in the previous update.<br><br>Phoenix II 4.0.2 update:<br><br>Bug fixes:<br>* Enables haptic feedback for new devices.<br>* Extended Range Mega Bomb Apex now has a Fusion Core.<br>* Ion Cannon projectiles do not stun all overlapping Invaders anymore.<br>* Sound should no longer break after receiving a call or a similar interruption."},{"version_id":"829281283","version_name":"4.1","version_date":"2018-11-14 16:23:19.000 +0800","version_description":"A big update with a little bit of everything! Support for the new iPads, a new ship, fixes, improvements and account support features!<br><br>New features:<br>* Support for 120 FPS and Wide Color on the new iPad Pros!<br>* A new ship arrived, the Qhelqod!<br>* Forgot the password of your Firi account? You can now request a sign-in link via email.<br>* Increased detail and resolution of the first 40 ships.<br><br>Bug fixes:<br>* Sonah Firestorm Spec B Apex now correctly targets active enemy turrets. As a result the missile pods are fixed in position for this Apex form.<br>* The Oran Meson Controller Apex is even more efficient."},{"version_id":"829451050","version_name":"4.2","version_date":"2018-12-20 09:32:44.000 +0800","version_description":"Welcome to our holiday update! First off are two new ships, which brings the total to 80 ships, doubling the amount since launch. The second big feature is the Mission Log, which shows the results of all missions you have ever played, all the way back to the launch of the game! And yes, all historical leaderboards you participated in can be viewed as well.<br><br>We wish you all happy holidays and are looking forward to another year of great Phoenix 2 updates with you. &lt;3&lt;3&lt;3<br><br>New features:<br>* 2 new ships join the fight, Nimbus and Widget.<br>* A Mission Log has appeared on the Pilot tab. View the mission results and leaderboards of every mission you have ever played.<br>* Tutorials for each ship’s primary special ability. These are also available for replay on the ship detail page.<br><br>Other changes:<br>* Reduced screenshake of Atlas and Arietis weapon impacts.<br>* Fusion Core explosion expands faster.<br>* Sentinel Apex has increased firing rate.<br><br>Bug fixes:<br>* Bullet Detonator Apex now has MIRV Defense enabled."},{"version_id":"830094390","version_name":"4.3","version_date":"2019-02-14 12:43:54.000 +0800","version_description":"A new year, another new update! This update brings improvements to your favorite gate, the Warp Gate. #praisethewarpgate<br><br>New features:<br>* The Warp Gate has been recalibrated and is now also capable of delivering an upgrade for a ship you already own or a Supply Drop.<br><br>Other changes:<br>* The Mission Log list now shows the ships you used in your missions.<br>* The minimum iOS version required is now iOS 11. All devices capable of running Phoenix II can be updated to iOS 11 or later."},{"version_id":"830307930","version_name":"4.3.1","version_date":"2019-02-22 08:41:55.000 +0800","version_description":"A new year, another new update! This update brings improvements to your favorite gate, the Warp Gate. #praisethewarpgate<br><br>New features:<br>* The Warp Gate has been recalibrated and is now also capable of delivering an upgrade for a ship you already own or a Supply Drop.<br><br>Other changes:<br>* The Mission Log list now shows the ships you used in your missions.<br>* The minimum iOS version required is now iOS 11. All devices capable of running Phoenix II can be updated to iOS 11 or later."},{"version_id":"830389115","version_name":"4.4","version_date":"2019-03-14 13:55:08.000 +0800","version_description":"Various tweaks and fixes were applied.<br><br>New features:<br>* Enjoy your ships in all their glory when checking ship details."},{"version_id":"830627567","version_name":"4.4.1","version_date":"2019-04-19 13:07:44.000 +0800","version_description":"A small bug fix update. Stay tuned for our next big update soon!<br><br>* Fixes issue where the next mission would not be correctly selected after completing a training mission.<br>* Lasers no longer create more than one reflection when using multiple special abilities with laser reflect at the same time.<br>* Fixes issue where logging in with your Firi account on another device could cause a session error on a device where you are already logged in."},{"version_id":"831269225","version_name":"4.5","version_date":"2019-05-11 10:54:28.000 +0800","version_description":"Another big update with even more love for the Warp Gate, tons of interface improvements, new content, tweaks, fixes and more to come soon!<br><br>New features:<br>* The Warp Gate now has its own tab. Delivery of credits and revives from the store are now also handled by the Warp Gate. :)<br>* The Play tab now has a simple to use quick-upgrade button that will upgrade your current ship without having to go to the ship details.<br>* Approaching the edge of the playable area is now indicated.<br>* Leveling up no longer requires a tap on the top bar. A new level up screen is presented automatically on level up.<br>* Receiving credits from playing missions is presented in a new rewards screen.<br>* You will soon be sent on missions to fight Invaders on the new world of Dovacoon Forge!<br><br>Bug fixes:<br>* Bullets will no longer incorrectly pass through an active Phalanx when flying at high speeds.<br>* Reviving into a dense bullet field no longer gives grazing energy.<br>* Tweaks Qhelqod projectiles to prevent them from passing past turrets they should hit."},{"version_id":"831280265","version_name":"4.5.1","version_date":"2019-05-15 06:46:28.000 +0800","version_description":"Another big update with even more love for the Warp Gate, tons of interface improvements, new content, tweaks, fixes and more to come soon!<br><br>New features:<br>* The Warp Gate now has its own tab. Delivery of credits and revives from the store are now also handled by the Warp Gate. :)<br>* The Play tab now has a simple to use quick-upgrade button that will upgrade your current ship without having to go to the ship details.<br>* Approaching the edge of the playable area is now indicated.<br>* Leveling up no longer requires a tap on the top bar. A new level up screen is presented automatically on level up.<br>* Receiving credits from playing missions is presented in a new rewards screen.<br>* You will soon be sent on missions to fight Invaders on the new world of Dovacoon Forge!<br><br>Bug fixes:<br>* Bullets will no longer incorrectly pass through an active Phalanx when flying at high speeds.<br>* Reviving into a dense bullet field no longer gives grazing energy.<br>* Tweaks Qhelqod projectiles to prevent them from passing past turrets they should hit."},{"version_id":"831317339","version_name":"4.5.2","version_date":"2019-05-24 07:52:38.000 +0800","version_description":"Another small update that should improve robustness when displaying ads and reduce ad-related crashes. These problems are really hard to test and reproduce so please contact us at our support email if you still experience any issues when viewing ads.<br><br>Version 4.5.0<br>Another big update with even more love for the Warp Gate, tons of interface improvements, new content, tweaks, fixes and more to come soon!<br><br>New features:<br>* The Warp Gate now has its own tab. Delivery of credits and revives from the store are now also handled by the Warp Gate. :)<br>* The Play tab now has a simple to use quick-upgrade button that will upgrade your current ship without having to go to the ship details.<br>* Approaching the edge of the playable area is now indicated.<br>* Leveling up no longer requires a tap on the top bar. A new level up screen is presented automatically on level up.<br>* Receiving credits from playing missions is presented in a new rewards screen.<br>* You will soon be sent on missions to fight Invaders on the new world of Dovacoon Forge!<br><br>Bug fixes:<br>* Bullets will no longer incorrectly pass through an active Phalanx when flying at high speeds.<br>* Reviving into a dense bullet field no longer gives grazing energy.<br>* Tweaks Qhelqod projectiles to prevent them from passing past turrets they should hit."},{"version_id":"831430868","version_name":"4.5.3","version_date":"2019-05-25 11:01:34.000 +0800","version_description":"Another small update that should improve robustness when displaying ads and reduce ad-related crashes. These problems are really hard to test and reproduce so please contact us at our support email if you still experience any issues when viewing ads.<br><br>Version 4.5.0<br><br>Another big update with even more love for the Warp Gate, tons of interface improvements, new content, tweaks, fixes and more to come soon!<br><br>New features:<br>* The Warp Gate now has its own tab. Delivery of credits and revives from the store are now also handled by the Warp Gate. :)<br>* The Play tab now has a simple to use quick-upgrade button that will upgrade your current ship without having to go to the ship details.<br>* Approaching the edge of the playable area is now indicated.<br>* Leveling up no longer requires a tap on the top bar. A new level up screen is presented automatically on level up.<br>* Receiving credits from playing missions is presented in a new rewards screen.<br>* You will soon be sent on missions to fight Invaders on the new world of Dovacoon Forge!<br><br>Bug fixes:<br>* Bullets will no longer incorrectly pass through an active Phalanx when flying at high speeds.<br>* Reviving into a dense bullet field no longer gives grazing energy.<br>* Tweaks Qhelqod projectiles to prevent them from passing past turrets they should hit."},{"version_id":"832117083","version_name":"5.0","version_date":"2019-07-25 13:37:06.000 +0800","version_description":"Welcome to the epic third anniversary update of Phoenix II. Time flies faster than a ship through the Warp Gate! Thank you for staying around with us all this time. This update features a lot of improvements, mostly with beginning players in mind, so be sure to tell all your friends about Phoenix II.<br><br>New features:<br>* The existing leagues have been replaced with a more extensive Rank system. Each Rank consists of different Leagues that need to be completed before promoting to the next Rank. This new Rank system with many more different daily missions gives beginning players a more gradual ramp in difficulty.<br>* Invaders have a variety of new weapons at their disposal. Expect new bullet patterns and watch out for the entirely new Doomsday class turrets.<br>* A total of 10 new ships are available for players to collect. Some of these ships have new abilities.<br>* New ships can now only be unlocked through the Warp Gate. The selection of available ships rotates often.<br>* Mission intel now provides some key information about each mission beforehand.<br>* A completely redesigned mission generator. Invaders will appear in new formations and configurations.<br><br>Other improvements:<br>* Redesigned score screen.<br>* Mission debriefings are now presented on the Pilot tab.<br><br>Gameplay Changes:<br>* Ion Warheads Missile Swarm Apex now stun turrets near the impact area of the missile, and not the entire ship anymore."},{"version_id":"832146059","version_name":"5.0.1","version_date":"2019-08-03 10:07:25.000 +0800","version_description":"New features:<br>* A third soundtrack has been added, called Anthem to the Stars. Toggle the Music icon to switch tracks.<br>* Banshee and Starless now have 2 Apex forms available.<br><br>Various tweaks and fixes were applied.<br><br><br>5.0<br><br>Welcome to the epic third anniversary update of Phoenix II. Time flies faster than a ship through the Warp Gate! Thank you for staying around with us all this time. This update features a lot of improvements, mostly with beginning players in mind, so be sure to tell all your friends about Phoenix II.<br><br>New features:<br>* The existing leagues have been replaced with a more extensive Rank system. Each Rank consists of different Leagues that need to be completed before promoting to the next Rank. This new rank system with many more different daily missions gives beginning players a more gradual ramp in difficulty.<br>* Invaders have a variety of new weapons at their disposal. Expect new bullet patterns and watch out for the entirely new Doomsday class turrets.<br>* A total of 10 new ships are available for players to collect. Some of these ships have new abilities.<br>* New ships can now only be unlocked through the Warp Gate. The selection of available ships rotates often.<br>* Mission intel now provides some key information about each mission beforehand.<br>* A completely redesigned mission generator. Invaders will appear in new formations and configurations.<br><br>Other improvements:<br>* Redesigned score screen.<br>* Mission debriefings are now presented on the Pilot tab.<br><br>Gameplay Changes:<br>* Ion Warheads Missile Swarm Apex now stun turrets near the impact area of the missile, and not the entire ship anymore."},{"version_id":"832262651","version_name":"5.0.2","version_date":"2019-08-15 06:11:08.000 +0800","version_description":"* Special ability tutorials are now triggered during missions on first play.<br>* Small tweaks and fixes."},{"version_id":"832397106","version_name":"5.0.3","version_date":"2019-08-23 08:38:16.000 +0800","version_description":"* Small tweaks and fixes.<br>* Mirage's Nightfury now properly beamfights Doomsday Lasers."},{"version_id":"832497932","version_name":"5.0.4","version_date":"2019-08-30 14:26:44.000 +0800","version_description":"Small tweaks and a notifications reminder to the Warp Gate."},{"version_id":"832719496","version_name":"5.0.5","version_date":"2019-09-18 15:09:46.000 +0800","version_description":"* Adds support for latest iOS version"},{"version_id":"832898397","version_name":"5.0.6","version_date":"2019-10-05 09:33:19.000 +0800","version_description":"* Fixes issue where aiming weapons could target bullets from MIRVs<br>* Improves visibility of Doomsday Laser warning area<br>* iOS 13 compatibility improvements"},{"version_id":"833218866","version_name":"5.1","version_date":"2020-02-11 10:18:17.000 +0800","version_description":"Incoming Transmission: Welcome to the new year and enjoy this epic new update. This update contains mostly features for new players, but tapping to speed up animations should appeal to everyone.<br><br>New features:<br>* Incoming transmissions: Various characters will now call in to inform you about your progress. For the best experience, play again from the beginning to get the proper introductions. Do save your progress first by creating a Firi account!<br>* You can now tap on the screen to speed up the animations. This works on the score screen, during dialogs and on mission briefings and debriefings.<br>* New prologue &amp; new training missions for new players. The new training missions will show up once the update has been rolled out.<br>* Primary ability tutorials now take place during missions.<br>* Impacts on Barrier now make a sound.<br><br>Bug fixes:<br>* This should fix some issues with ads that cannot be dismissed. Please let us know if you are still experiencing problems after this update."},{"version_id":"834677902","version_name":"5.1.1","version_date":"2020-02-12 10:15:35.000 +0800","version_description":"Incoming Transmission: Welcome to the new year and enjoy this epic new update. This update contains mostly features for new players, but tapping to speed up animations should appeal to everyone.<br><br>New features:<br>* Incoming transmissions: Various characters will now call in to inform you about your progress. For the best experience, play again from the beginning to get the proper introductions. Do save your progress first by creating a Firi account!<br>* You can now tap on the screen to speed up the animations. This works on the score screen, during dialogs and on mission briefings and debriefings.<br>* New prologue &amp; new training missions for new players. The new training missions will show up once the update has been rolled out.<br>* Primary ability tutorials now take place during missions.<br>* Impacts on Barrier now make a sound.<br><br>Bug fixes:<br>* This update fix some issues with ads that cannot be dismissed. Please let us know if you are still experiencing problems after this update."},{"version_id":"834843082","version_name":"5.1.2","version_date":"2020-02-25 10:03:04.000 +0800","version_description":"A few bug fixes in preparation for new waves of Invaders, armed with some new weapons."},{"version_id":"834937584","version_name":"5.1.3","version_date":"2020-03-11 11:37:47.000 +0800","version_description":"This update adds a toggle for leaderboards to only shows scores from pilots that used the same ship as you did. The update also contains a few minor bug fixes."},{"version_id":"835093265","version_name":"5.1.4","version_date":"2020-03-13 19:00:31.000 +0800","version_description":"Fixes a bug that would cause the game to crash when the specialist mission is viewed without having any of the specialist ships unlocked.<br><br>5.1.3:<br><br>This update adds a toggle for leaderboards to only shows scores from pilots that used the same ship as you did. The update also contains a few minor bug fixes."},{"version_id":"835182086","version_name":"5.1.5","version_date":"2020-03-21 08:30:07.000 +0800","version_description":"A few small bug fixes and enables 120 FPS on the new iPads.<br><br>5.1.3:<br><br>Adds a toggle for leaderboards to only shows scores from pilots that used the same ship as you did."},{"version_id":"835244687","version_name":"5.2","version_date":"2020-05-28 09:41:48.000 +0800","version_description":"Welcome to another update of Phoenix 2. This update features new ships and some balance changes.<br><br>New features:<br>* Three new ships join the fight, be on the lookout for the Jeria, Centurion and Stinger.<br>* New Apex abilities for Personal Shield and Goliath Missile.<br><br>Gameplay Changes:<br>* Focus Lance damage increased.<br>* Goliath Missile impact and blast damage increased.<br>* Ion Cannon was redesigned to give it more versatile gameplay. Ion Cannon projectiles now stun all turrets in their blast radius. Turrets out of range will not be stunned, even if that particular invader was hit. This makes Ion Cannon better against groups of small Invaders, while taking a bit more skill to completely stun a large Invader.<br>* Neni’s main weapon firing rate is increased.<br><br>Bug fixes:<br>*  Fixes specific crashes in Mega Bomb tutorial and the Mission Log."},{"version_id":"836259590","version_name":"5.2.1","version_date":"2020-06-04 07:46:23.000 +0800","version_description":"Bug fixes:<br>* Targets stunned by Ion Cannon now have their movement speed reduced.<br>* Fixes an issue where Blast damage would not be applied correctly.<br><br>Update 5.2<br>Welcome to another update of Phoenix 2. This update features new ships and some balance changes.<br><br>New features:<br>* Three new ships join the fight, be on the lookout for the Jeria, Centurion and Stinger.<br>* New Apex abilities for Personal Shield and Goliath Missile.<br><br>Gameplay Changes:<br>* Focus Lance damage increased.<br>* Goliath Missile impact and blast damage increased.<br>* Ion Cannon was redesigned to give it more versatile gameplay. Ion Cannon projectiles now stun all turrets in their blast radius. Turrets out of range will not be stunned, even if that particular invader was hit. This makes Ion Cannon better against groups of small Invaders, while taking a bit more skill to completely stun a large Invader.<br>* Neni’s main weapon firing rate is increased.<br><br>Bug fixes:<br>*  Fixes specific crashes in Mega Bomb tutorial and the Mission Log."},{"version_id":"836269779","version_name":"5.2.2","version_date":"2020-06-04 17:29:08.000 +0800","version_description":"Bug fixes:<br>* Targets stunned by Ion Cannon now have their movement speed reduced.<br>* Fixes an issue where Blast damage would not be applied correctly.<br>* Fixes an issue where ships on the leaderboards would not show correctly.<br><br>Update 5.2<br>Welcome to another update of Phoenix 2. This update features new ships and some balance changes.<br><br>New features:<br>* Three new ships join the fight, be on the lookout for the Jeria, Centurion and Stinger.<br>* New Apex abilities for Personal Shield and Goliath Missile.<br><br>Gameplay Changes:<br>* Focus Lance damage increased.<br>* Goliath Missile impact and blast damage increased.<br>* Ion Cannon was redesigned to give it more versatile gameplay. Ion Cannon projectiles now stun all turrets in their blast radius. Turrets out of range will not be stunned, even if that particular invader was hit. This makes Ion Cannon better against groups of small Invaders, while taking a bit more skill to completely stun a large Invader.<br>* Neni’s main weapon firing rate is increased.<br><br>Bug fixes:<br>*  Fixes specific crashes in Mega Bomb tutorial and the Mission Log."},{"version_id":"836388176","version_name":"5.2.3","version_date":"2020-06-13 08:46:16.000 +0800","version_description":"* Fixes some subtle crashes<br>* Optimizes app install &amp; download size"},{"version_id":"837907638","version_name":"5.3","version_date":"2020-09-24 08:47:04.000 +0800","version_description":"Welcome to a new update for Phoenix 2. This update will add support for new features introduced in iOS 14, as well new content such as the new Mistral ship.<br><br>New features:<br>* Introduces a new ship, the Mistral.<br>* Invaders have added the menacing Doomsday MIRV turret to their arsenal, beware!<br>* iPad Pro can now toggle between 60 fps and 120 fps.<br><br>Gameplay Changes:<br>* Laser Storm Ultimate will now target Sparrows as well as turrets first.<br>* Increases Mega Laser Apex ability Double Shot damage from 170 to 200.<br>* Reduces Yoth-Hola Apex ability Laser Expansion cooldown from 8 to 5 seconds.<br>* Increases Mega Bomb Apex ability Fast Charge recovery from ‘average’ to ‘fast’.<br><br>Bug fixes:<br>* Various game engine improvements, especially related to sound."},{"version_id":"837971843","version_name":"5.3.1","version_date":"2020-10-23 10:59:49.000 +0800","version_description":"A small bug fix update:<br>* Muted sounds now stay off after the app has restarted.<br>* Fixes several rare crashes."},{"version_id":"840993476","version_name":"5.3.2","version_date":"2021-03-25 08:10:04.000 +0800","version_description":"We are working hard on a new game, but a Phoenix 2 content update will be coming soon!<br><br>Don't forget to send your friends the Phoenix 2 App Clip URL for the quickest way to check the game out. Just send them the link firigames.com/phoenix2 and tap 'play' in the top banner.<br><br>This is a small update that removes the use of the advertising identifier. This might affect the number of ads you are able to see."},{"version_id":"841962754","version_name":"5.4","version_date":"2021-05-05 08:46:56.000 +0800","version_description":"The Warp Gate is active, a new update has arrived! Two new ships join the fight, both rocking the new Clover ATS Zen ability. Enjoy!<br><br>New features:<br>* Introduces two new ships, Esperon and Naya.<br>* Adds a new Zen Ability, the Clover ATS.<br><br>Gameplay Changes:<br>* The pink 'speed' lasers and their targeting beams have a more distinct appearance.<br>* A visual indicator is shown on the ship when an increased charge timer of a Zen ability has reset to 0."},{"version_id":"844306470","version_name":"5.5","version_date":"2021-09-28 12:21:25.000 +0800","version_description":"Hold on to your ship because this update will make it blast past those Invaders at a staggering 120FPS on your new iPhone 13 Pro! And there is more..<br><br>New features:<br>* Phoenix 2 now runs by default at 120FPS on the new iPhone 13 Pro and iPhone 13 Pro Max. You can switch between modes on the main menu.<br><br>Gameplay Changes:<br>* Clover ATS deals substantially more damage and takes a bit longer to recover.<br>* Kibarrax main weapon now waits between shots when charging its Zen.<br>* Normalized Blast damage for Havoc and Proteus weapons, causing it to slightly increase at higher ranks.<br>* Clover ATS Apex Ability Shield Breaker now deals the correct amount of damage.<br>* Slightly improves Esperon Crisis EMP Apex ability.<br>* Increases Naya’s Trident Apex ability damage from 30 to 39.6 and tweaks its firing pattern."},{"version_id":"844994207","version_name":"5.6","version_date":"2021-11-03 12:18:32.000 +0800","version_description":"Don’t forget to bring your Phoenix Revives on your next mission pilots! You read that correctly, this update reworks the Phoenix Revives along with several fixes and improvements.<br><br>New features:<br>* You now choose how many Phoenix Revives to bring before your mission. The revives will trigger automatically when your ship is destroyed, so make them count! The new Phoenix Revives are unlocked for players of level 10. Pilots keep the amount of revives they previously had or would have accumulated.<br>* Aura graphics have been redesigned to provide better visibility of the action.<br><br>Bug fixes:<br>* Prevents the game from slowing down on older devices."}]