[{"version_id":"819605257","version_name":"1.3","version_date":"2016-12-21 01:02:51.000 +0800","version_description":"Putty 3D 1.3 is here!<br><br>Thanks so much to everyone that sent their feedback, you’ve been instrumental in shaping this update (and future ones, you guys sent lots of feedback :) ).<br><br>So what’s new you ask? Here’s some of it:<br><br>- Option to export your work to OBJ and STL files, on iPhone 6, iPad Air 2 or newer devices. This is the big one. Now you can export your Putty models to your PC or Mac, to add detail, paint, animate or even 3D print. Go nuts! :)<br>- New brush shape option, to switch between a round and flat brush (which we like so much that we made it the new default).<br>- Improved camera and light controls.<br>- Added options to control the lighting complexity. Use the fast mode for added performance or the 3 point template for fancier lighting before you share your work.<br>- Ran out of space while sculpting? Now you can resize the sculpting volume to fit more stuff in.<br>- The pressure curve for the Apple Pencil and 3D Touch was adjusted to make it more comfortable to use. In a future update we plan to add more user control over this.<br>- Moved the Video Recording over to the main editing screen, making it easier to start and stop recording at any time.<br>- Lots of tiny fixes and adjustments.<br><br>We look forward to hearing what you think of the new features and changes, so please let us know at contact@putty3d.com.<br>Also, if you’re enjoying Putty 3D, please leave a review on the App Store, it helps us a lot!"},{"version_id":"821872848","version_name":"1.3.3","version_date":"2017-12-08 10:53:35.000 +0800","version_description":"- Support for iOS 11 and iPhone X<br>- Some small bug fixes and usability tweaks"},{"version_id":"829245614","version_name":"1.3.7","version_date":"2018-11-21 18:17:42.000 +0800","version_description":"Added support for the new iPad Pro and Apple Pencil"},{"version_id":"829440912","version_name":"1.3.8","version_date":"2019-11-20 10:39:51.000 +0800","version_description":"Compatibility update for iOS 13 and iPadOS"}]