[{"version_id":"818583339","version_name":"1.0","version_date":"2016-09-02 03:50:09.000 +0800","version_description":""},{"version_id":"819239741","version_name":"1.1","version_date":"2016-10-19 11:11:24.000 +0800","version_description":"• Audio Units support (AUv3) added. Now you can use Poison-202 as a plugin inside Cubasis, AUM, Garage Band, ModStep and other hosts;\n• Virtual Midi sources support added;\n• Background Audio enable/disable option added;\n• IAA transport bar added with Rewind, Play/Stop, Record and Host buttons;\n• Hold button (with latch) is added;\n• Midi controller CC64 (Hold Pedal) is now supported;\n• special Hold Arpeggiator mode (play one key to transpose current pattern, 2 or more keys to assign new pattern);\n• 10 new factory presets added;\n• \"stolen notes\" bug fixed;\n• hanging notes bug fixed;\n• fixed bug when on-screen keys sometimes stop playing when dragging fingers fast in Solo mode;\n• added option to select audio buffer size: Optimal (depending on device type), 128, 256, 512 or 1024 samples;\n• fixed bug when turning on Reverb or other effect, previous effect's tail was heard;\n• sample rate selection algorithm improved, bugs fixed;\n• maximum polyphony value is limited depending on device type for better performance;\n• Patch Selector: additional bank selection bar added to speed up switching between banks;\n• now you can hold the next/prev patch buttons for fast forward/backward scrolling of patches;\n• new knob parameter added: \"velocity to cross modulation\". Some of the factory presets were tuned with this parameter to better react on velocity changes, making loud notes sound \"brighter\", and vice versa;\n• new Arpeggiator parameter added: Note Repeat;\n• smooth parameter change algorithm added for Pitch Bend, Modulation Wheel and Filter Cutoff parameters;\n• sound clicks removed, which could appear when switching between patches;\n• other improvements and bug fixes.\n\nNote if you are updating from version 1.0: After this update, please run Poison-202 standalone before running Audio Unit version. This will keep safe your previously created user patches. It needs to be done only once."},{"version_id":"819875396","version_name":"1.2","version_date":"2016-11-29 07:34:57.000 +0800","version_description":"• added Midi Learn feature. To enter it, tap 3 times on any knob or fader control. When done, tap WRITE button to save changes.\n• added ability to Export / Import user preset sound banks using iTunes File Sharing system (look in Settings page);\n• added ability to merge user presets banks;\n• maximum number of user presets is raised to 300;\n• added \"Poison-202\" Virtual Midi In Port;\n• 10 new patches added to factory Bank B;\n• added new Bank C with 17 drum patches;\n• added background audio idle timer (adjustable from Settings page);\n• added default midi mapping (can be changed using Midi Learn);\n• fixed: audio units midi program change event issue;\n• fixed: issue with midi note off event, appeared when working with Geo Synth;\n• fixed: preset number related issues in audio units, which could cause crashes under Garage Band;\n• master volume and patch gain changes are now interpolated (no clicks);\n• delay time parameter change is now interpolated;\n• other minor improvements."},{"version_id":"819981298","version_name":"1.2.1","version_date":"2016-12-06 01:19:03.000 +0800","version_description":"1.2.1:\n• bug fix to the 1.2 update: user presets saving issue fixed.\n\n1.2:\n• added Midi Learn feature. To enter it, tap 3 times on any knob or fader control. When done, tap WRITE button to save changes.\n• added ability to Export / Import user preset sound banks using iTunes File Sharing system (look in Settings page);\n• added ability to merge user presets banks;\n• maximum number of user presets is raised to 300;\n• added \"Poison-202\" Virtual Midi In Port;\n• 10 new patches added to factory Bank B;\n• added new Bank C with 17 drum patches;\n• added background audio idle timer (adjustable from Settings page);\n• added default midi mapping (can be changed using Midi Learn);\n• fixed: audio units midi program change event issue;\n• fixed: issue with midi note off event, appeared when working with Geo Synth;\n• fixed: preset number related issues in audio units, which could cause crashes under Garage Band;\n• master volume and patch gain changes are now interpolated (no clicks);\n• delay time parameter change is now interpolated;\n• other minor improvements."},{"version_id":"820645979","version_name":"1.3","version_date":"2017-01-23 23:50:03.000 +0800","version_description":"• 100 new haQ attaQ presets designed by Jakob haQ added to banks C and D;\n• 3 new parameters added on the LFO/FX page: Tempo Delay, LFO1 and LFO2 Tempo Sync. Now delays and LFO's can be synced to the tempo (arpeggiator tempo in standalone version, host tempo in Audio Units version);\n• \"Reset MIDI CC Mapping to defaults\" function added (on Settings page);\n• minor optimizations and improvements."},{"version_id":"821287650","version_name":"1.4","version_date":"2017-03-14 01:58:05.000 +0800","version_description":"• Export bank file format updated for compatibility with the upcoming VST/AU version of Poison-202;\n• 33 new cool presets added;\n• Banks C and D swapped for compatibility with the upcoming VST/AU version of Poison-202. Now Bank D is for the Drums;\n• added Arabic quarter-tone micro tuning option with 7 different modes and ability to switch it on/off via midi CC#69 (adjusted from the Settings Page);\n• some of the old presets have been edited for better sounding;\n• fixed graphical bug, appeared when using Poison-202 as an audio unit under AUM on iPad devices;\n• fixed bug, which did not allow synching of some global settings between standalone app and audio units."},{"version_id":"821593286","version_name":"2.0","version_date":"2017-04-23 23:30:14.000 +0800","version_description":"• Audiobus support added with state-saving;\n• XFM modulation engine improved: cleaner XFM-modulated sound achieved;\n• XFM modulation is now interpolated (smooth changes, no micro-steps) when controlling it with Modulation Wheel;\n• bug fixed that could cause issues with certain hosts with large audio buffer size (e.g. Multitrack Studio app);\n• fix: some factory patches were transposed to normal pitch;\n• new Poison-202 app icon;\n• new factory bank with 100 patches added: Essentials Soundpack by Fabio Ribeiro - Brazilian producer and keyboardist with the band \"Remove Silence\". The collection contains lots of classic sounds from the 70's and 80's, modern and evolving textures, leads, basses, pads and sound effects. It also contains some famous patches from artists such as Rick Wakeman, Pink Floyd, Uriah Heep, Black Sabbath, Triumvirat, and more;\n• plus, special opportunity for all current Poison-202 users to get 50% discount coupon to buy the newly released VSTi/AU version of Poison-202 for Mac!"},{"version_id":"824010995","version_name":"2.1","version_date":"2017-10-14 05:19:25.000 +0800","version_description":"- bug fixed, which could cause improper storing of the LFO1 Rate parameter value in Poison Audio Units;\n- bug fixed, which could led Poison Audio Units to crash when using with Garage Band Live Loops;\n- 11 new presets added (presets C90 - C99, and E30).\n\nP.S. Respect to everyone for your great reviews on the App Store!"},{"version_id":"825704419","version_name":"2.2","version_date":"2018-01-21 07:02:03.000 +0800","version_description":"- supported AudioBus SDK updated to version 3.0.3;\n- added \"Random\" button (on the Patch page of the standalone currently): now you can randomize current patch with built-in pseudo randomizer to achieve interesting unpredictable sounds;\n- added support of Files.app on iOS 11 to ease access to imported/exported p202 user bank files, located in Documents folder;\n- added support of iOS share sheet to ease importing and exporting of p202 user bank files from external locations;\n- fixed crash on some devices with iOS 11 when locking the screen/fetching app to the background;\n- fixed bug when playing patch in Solo mode, some notes sometimes could rip off without release;\n- other minor improvements."},{"version_id":"825740333","version_name":"2.3","version_date":"2018-02-26 03:59:41.000 +0800","version_description":"- 50 new preset patches added into Bank E;\n- \"Random\" button is now visible in the AU also, not only in standalone mode;\n- fixed issue, when double tapping the FX control knobs was not resetting effect's parameter value."},{"version_id":"826189147","version_name":"2.4","version_date":"2018-03-07 02:43:15.000 +0800","version_description":"In this version (2.4):\n- iPhone X display support added;\n- fixed issue with midi jitter (inaccurate timing of incoming midi events) when playing Poison-202 using Midi Input from another app or midi controller device, as well as when it's connected to the Inter-App Audio host (especially noticeable, if you use large audio buffer sizes). By doing this, we are preparing to support our upcoming Groove Rider GR-16 app update, which will include support of Midi Output ports;\n- Discount spring offer for Mac version of Poison-202 VSTi/AU plug-in started! To obtain it, check out the bottom of the Settings page inside the app.\n\nIn previous version (2.3):\n- 50 new preset patches added into Bank E;\n- \"Random\" button is now visible in the AU also, not only in standalone mode;\n- fixed issue, when double tapping the FX control knobs was not resetting effect's parameter value."},{"version_id":"827800809","version_name":"2.4.2","version_date":"2018-07-10 01:15:32.000 +0800","version_description":"- for iPhone X, when app running as standalone, changed behavior of the home bar. Now it will not switch between apps on first occasional touch or swipe;\n- Bluetooth Midi Devices dialog added (new button on the Settings page);\n- minor bug fixes."},{"version_id":"828676106","version_name":"2.4.3","version_date":"2018-09-22 13:57:07.000 +0800","version_description":"- fix for the screen edge touches for the standalone app version. Now, if you tap the controls (or keys), which are close to the right (or left) edge of the screen, they will work without a delay."},{"version_id":"828845088","version_name":"2.4.4","version_date":"2018-10-17 04:28:35.000 +0800","version_description":"- fixed bug when the first note was rendered silent when using \"Freeze audio\" function in Cubasis and Garage Band apps with Poison-202 Audio Unit."},{"version_id":"830827924","version_name":"2.4.5","version_date":"2019-04-03 19:28:19.000 +0800","version_description":"- important bug fixes and stability improvements for the Audio Unit version;\n- added push notification service for notifying about JimAudio news and special offers."},{"version_id":"834697281","version_name":"2.4.6","version_date":"2020-02-14 08:29:34.000 +0800","version_description":"- added support for the new devices screen resolutions, especially iPad 11\", 12.9\" and iPhone 11 Pro Max. Graphics on these devices now looks crisper;\n- 5 presets added to factory Bank E;\n- minor bug fixes."},{"version_id":"835603417","version_name":"2.4.7","version_date":"2020-04-21 20:42:53.000 +0800","version_description":"- fixed crash upon entering \"Bluetooth Midi Devices\" configuration menu;\n- maximum supported buffer size is increased to 2048."},{"version_id":"837782839","version_name":"2.5.0","version_date":"2020-09-17 03:00:04.000 +0800","version_description":"- meet the new redesigned Settings page (in standalone app): now it slides on top of the main interface, without switching to a separate screen;\n- new redesigned knobs with circular value indicator and dynamical knob control for adjusting values more precisely;\n- Tags system added. Now each preset has its own set of textual tags to help to organize presets into groups like Bass, Lead, Guitar etc.;\n- tags for user presets can be edited manually by swiping left over the preset name in the patch selector and tapping EDIT button (in standalone app only);\n- Patch Selector: two tabs added (\"Banks\" and \"Tags\") to switch between two preset listing modes;\n- now you can tap Next and Previous patch button without closing Patch Selector;\n- scrolling the list of presets in the Patch Selector now works faster;\n- Share preset function added (in Settings->Utilities) to share preset or bank without having to save it to the Files;\n- now you are allowed to save (export) or share a single preset that you need (not just a full bank);\n- swipe left in the \"Load User Bank\" file list dialog to manually delete unnecessary bank files from Poison's Documents folder (no need to use Files.app);\n- in the FX selector, you can now select an effect for editing by simply tapping on a corresponding led, instead of using Select button;\n- minor bug fixes.\n\nAnd a special addition:\n\n- introducing new factory Bank F with 100 incredible experimental patches, created by sks2002, which were used for his tracks! The presets were also processed and mastered by Jim Pavloff;\n- 8 new factory presets added to Bank E: E86-E93, be sure to check them out!\n- some of the original factory presets were modified to sound better (A23, A25, A72, A73, A92, A96, E41, E45 and E84)."},{"version_id":"837839938","version_name":"2.5.1","version_date":"2020-09-18 23:22:47.000 +0800","version_description":"v2.5.1 (quick fix):\n- fixed issue with controlling oscillator \"Pitch\" knob in the AUv3 after recent update.\n\nv2.5:\n- meet the new redesigned Settings page (in standalone app): now it slides on top of the main interface, without switching to a separate screen;\n- new redesigned knobs with circular value indicator and dynamical knob control for adjusting values more precisely;\n- Tags system added. Now each preset has its own set of textual tags to help to organize presets into groups like Bass, Lead, Guitar etc.;\n- tags for user presets can be edited manually by swiping left over the preset name in the patch selector and tapping EDIT button (in standalone app only);\n- Patch Selector: two tabs added (\"Banks\" and \"Tags\") to switch between two preset listing modes;\n- now you can tap Next and Previous patch button without closing Patch Selector;\n- scrolling the list of presets in the Patch Selector now works faster;\n- Share preset function added (in Settings->Utilities) to share preset or bank without having to save it to the Files;\n- now you are allowed to save (export) or share a single preset that you need (not just a full bank);\n- swipe left in the \"Load User Bank\" file list dialog to manually delete unnecessary bank files from Poison's Documents folder (no need to use Files.app);\n- in the FX selector, you can now select an effect for editing by simply tapping on a corresponding led, instead of using Select button.\n\nAnd a special addition:\n\n- introducing new factory Bank F with 100 incredible experimental patches, created by sks2002, which were used for his tracks! The presets were also processed and mastered by Jim Pavloff;\n- 8 new factory presets added to Bank E: E86-E93, be sure to check them out!\n- some of the original factory presets were modified to sound better (A23, A25, A72, A73, A92, A96, E41, E45 and E84)."},{"version_id":"839212531","version_name":"2.5.2","version_date":"2020-11-16 07:17:10.000 +0800","version_description":"- fixed AUv3 crash upon load in some audio host apps;\n- in Scale play mode, root notes on the keyboard are now marked with red color for your comfort;\n- now you can examine current parameter values just by tapping desired knob or fader;\n- Audiobus SDK updated to v3.0.12;\n- minor bug fixes and iOS 14 support."},{"version_id":"839221391","version_name":"2.5.3","version_date":"2020-11-17 03:46:57.000 +0800","version_description":"In this update:\n- a quick fix for iPhone 12 Pro Max display resolution support.\n\nIn previous 2.5.2 update:\n- fixed AUv3 crash upon load in some audio host apps;\n- in Scale play mode, root notes on the keyboard are now marked with red color for your comfort;\n- now you can examine current parameter values just by tapping desired knob or fader;\n- Audiobus SDK updated to v3.0.12;\n- minor bug fixes and iOS 14 support."},{"version_id":"840678372","version_name":"2.5.4","version_date":"2021-03-02 01:04:31.000 +0800","version_description":"Bug fixed for the new iPad Air (4th gen) display resolution: interface did not fully fit the screen vertically."}]