[{"version_id":"818889761","version_name":"4.3","version_date":"2016-11-14 19:05:05.000 +0800","version_description":"New: instant arrival boards, better route maps and train trip tracking<br><br>INSTANT ARRIVAL BOARDS<br>If you're like us, you might have a couple of favourite routes in the morning - each going from different stops and stations. It was a pain tapping one station, looking at its arrivals board, then coming back to the map and doing the same again and again.<br><br>So we've made it easier. Tap on a stop or station on the map and we'll show you the name of the stop, the routes that stop there and the next five arrivals. If you want to see further into the future, just tap on the bubble to bring up the full arrival board. Easy!<br><br>BETTER ROUTE MAPS<br>In the list view, we'll show you all connections at each stop - color-coded to make life easier.<br><br>NEW TRAIN TRIP TRACKING<br>We've re-engineered train times - just tap on a train arrival to bring up a nice, easy-to-follow list with a moving train icon.<br><br>Finally... if you can spare a moment, and you like this app, help us out and leave a review on the App Store. It helps other people find the app and helps fund future development. Thanks!"},{"version_id":"819776519","version_name":"4.4","version_date":"2017-01-26 05:02:59.000 +0800","version_description":"NEW: sat-nav for buses and trains, faster search, privacy options and a better train live progress screen...<br><br>SATNAV FOR BUSES AND TRAINS<br>Now you can get full step-by-step directions when you plan a trip. When you bring up a trip, you’ll see a new purple arrow icon. Tap on it and get full directions which update as you move through your journey. Even better, we’ve added an ‘On Trip’ button on the home screen so you can always get back to your current trip.<br><br>FASTER SEARCH<br>We’ve worked hard to make searching for places, stops and stations faster.<br><br>PRIVACY OPTIONS<br>In the More tab, we’ve added new options to erase your search history and to erase all your personal settings (Favorites, Recent Trips etc.) from the app.<br><br>BETTER TRAIN LIVE PROGRESS SCREEN<br>We’ve added duration and the train operator to the train Live Progress screen for your convenience."},{"version_id":"823455105","version_name":"4.5","version_date":"2017-12-01 21:32:18.000 +0800","version_description":"iPhone X support comes alive in this release, along with offline network maps - find them in the Routes tab. Once they're downloaded, you can view them anytime - even in Airplane Mode."},{"version_id":"825634343","version_name":"4.6","version_date":"2018-01-15 22:50:56.000 +0800","version_description":"It's our first release of 2018! This time we've split up the app's departure boards into three tabs: Now (for departure coming up in the next hour), Later (for seven-day timetables) and Map (to see where the station is, along with all station entrances nearby). We hope you enjoy it!"},{"version_id":"825846431","version_name":"4.7","version_date":"2018-02-01 18:45:53.000 +0800","version_description":"We've made dozens of improvements throughout the app to make it easier to use on your commute. We hope you enjoy it!"},{"version_id":"825885378","version_name":"4.8","version_date":"2018-02-05 22:09:55.000 +0800","version_description":"This release includes a fix for location tracking, as well as many other improvements."},{"version_id":"826111639","version_name":"4.9","version_date":"2018-02-27 16:01:09.000 +0800","version_description":"We've added some great new features in this version, including a live ETA to get to your home or work on the app's home screen, as well as many other improvements throughout the app. We hope you enjoy it!"},{"version_id":"826177101","version_name":"4.9.1","version_date":"2018-03-06 16:12:34.000 +0800","version_description":"This release contains a number of enhancements and bug fixes. We hope you enjoy it!"},{"version_id":"826689981","version_name":"4.9.2","version_date":"","version_description":""},{"version_id":"826695355","version_name":"4.9.3","version_date":"2018-04-17 02:36:13.000 +0800","version_description":"There was a language issue with the last release - sorry about that, it's fixed with this update."},{"version_id":"826772007","version_name":"4.9.4","version_date":"2018-04-23 21:42:29.000 +0800","version_description":"This release includes several fixes and enhancements. We hope you enjoy it!"},{"version_id":"826807529","version_name":"4.9.5","version_date":"2018-04-26 00:51:50.000 +0800","version_description":"This release includes several fixes and enhancements. We hope you enjoy it!"},{"version_id":"827165760","version_name":"4.10","version_date":"2018-05-18 02:07:11.000 +0800","version_description":"Hi everyone - we've added two great new features with this release: now, subway arrival boards will be split by line and direction (finally!) and we've introduced Service Alerts on the Nearby screen. We hope you enjoy the latest update!"},{"version_id":"827217468","version_name":"4.10.1","version_date":"2018-05-22 20:54:29.000 +0800","version_description":"This release includes several fixes and enhancements. We hope you enjoy it!"},{"version_id":"829148921","version_name":"4.10.2","version_date":"2018-11-03 00:37:57.000 +0800","version_description":"Thanks for using our app! This release brings bug fixes to help make your commute just a little easier."},{"version_id":"829188781","version_name":"4.10.3","version_date":"2018-11-06 21:59:22.000 +0800","version_description":"Thanks for using our app! This release brings bug fixes to help make your commute just a little easier."},{"version_id":"829716814","version_name":"4.11","version_date":"2018-12-21 14:13:39.000 +0800","version_description":"This is a big release for us – we’re taking trip planning to the next level. You’re going to want to read this one!<br><br>LIVE TRIP PLANNING<br><br>So here’s the problem with trip planning: as soon as you ask for directions, they’re stale. Buses and trains get delayed, or you might miss your connection. Even though the trip details are ‘live’ when we send them to you, as soon as a minute passes, they might not be accurate any more.<br><br>So we’ve added live departure boards to each stage of your trip. These update every thirty seconds to make sure you know exactly when your bus or train will arrive. Best of all, they keep working even after your trip has finished – they’ll keep showing the next arrivals days and weeks after you got those directions, which brings us to…<br><br>SAVE YOUR TRIP FOR LATER<br><br>Okay, that’s already part of the app. But now it’s a whole lot more useful. When you tap on the star icon at the top of the trip itinerary screen, you can give that trip a name (‘Commute to Work’, for example). Now, instead of asking for a fresh set of directions every day, you can just tap on your saved trip and see live departure times for each stage of your trip, day after day.<br><br>This isn’t the kind of thing you want to keep to yourself, so we’ve introduced…<br><br>SHARE YOUR TRIP<br><br>Now you can send a link to anyone using Messages, WhatsApp, email and more – even if they don’t have the app. Anyone with an Internet connection can view the trip you’ve sent to them – a great way of letting someone know when you’ll arrive (or even helping someone from out of town find their way). Just tap on the new Share icon on the top-right of the trip itinerary screen.<br><br>Finally, we've updated the subway departure board to give you more departures in less space.<br><br>More to come very soon!"},{"version_id":"829857849","version_name":"4.12.1","version_date":"2019-01-11 23:45:28.000 +0800","version_description":"In this release, we’ve made a number of changes and enhancements, including:<br><br>NEW: You can now choose your preferred routing mode when planning a trip – so you can choose the fastest way to get there, or minimize walking or transfers instead.<br>NEW: Platform numbers now appear as part of a trip itinerary where available<br>FIX: Visual changes to the Trip Details screen<br>FIX: push notifications now work correctly on all devices<br>FIX: sometimes the app would crash when tapping on the Live Directions button – this has been fixed.<br><br>Enjoy our app? Give us a five-star rating in the App Store. We would love to hear your ideas and suggestions, so send us feedback to talk@totaltransitapp.com"},{"version_id":"830194292","version_name":"5.2","version_date":"2019-05-04 13:00:56.000 +0800","version_description":"New in this release: improved search, a new Help section and you can now share your trip with anyone - even if they don't have the app."},{"version_id":"831506322","version_name":"5.3","version_date":"2019-07-02 18:32:29.000 +0800","version_description":"Hello everyone – it’s time for a new release! This time, we’ve added the ability to save your daily routes for quick access, and we’ve added service alerts throughout the app – on arrival boards, route maps and the Live Tracking screen.<br><br>As you move through the app, you’ll see what issues your local routes are facing today – on the Routes screen, you’ll see a green tick if everything’s good, or a warning sign if there’s going to be trouble on your line.<br><br>We’ve also added some features to further protect your privacy – all usage statistics are anonymous, and sent to our own servers instead of third-party analytics tools. What this means for you is that none of your usage data (which screens you look at, which city you’re in, etc.) gets shared with anyone else. This process will be complete by October 2019.<br><br>You can also disable usage tracking as well (you can find the switch in the More screen). Now the only information that’s shared is with our advertising partners – and if you upgrade to our Premium edition (again, you can do that in the More screen), you can go ad-free and use the app in complete privacy. We have never stored details of which trips you take without your permission – and we never will.<br><br>Finally, we want to thank each and every one of you for choosing our app to make your commute easier. We read every email and message you send us, and we have a whole lot of new features to bring to you this summer and beyond."},{"version_id":"832225159","version_name":"2019.8","version_date":"2019-08-01 19:03:12.000 +0800","version_description":"In this release, we’re excited to introduce our new dashboard for the Explore screen, with service alerts, nearby stations, your favorites and more all at your fingertips as soon as you open the app. Best of all, you can change it to your liking: just tap on the up arrow button to the top-right of each section to move them up one place in the list. <br><br>Improved! <br>• You can now set your start screen from the settings panel in More <br>• We’ve changed the names and icons on the tab bar to make it clearer where everything is <br><br>Fixed! <br>• Native app resolution for iPhone XR and iPhone XS Max <br>• The Live Tracking map now fills the whole screen on certain iPhone models <br>• Sometimes the app would stop tracking your location if it had been closed and then reopened – that’s fixed now. <br><br>More coming soon – see you next time!"},{"version_id":"832555073","version_name":"2019.9","version_date":"2019-08-29 19:17:29.000 +0800","version_description":"In this release, we've made some improvements to the Explore screen - now you can see more subway and metro times for each stop, and train stations now show more detailed information like status updates and platform numbers."},{"version_id":"832681882","version_name":"2019.10","version_date":"2019-09-14 02:14:57.000 +0800","version_description":"In this release, we've added support for Dark Mode. We've made sure that every screen looks great with subtle tones and new route colors that really pop out of the screen for quick and easy navigation. We hope you enjoy it!"},{"version_id":"833114761","version_name":"2019.11.3","version_date":"","version_description":""},{"version_id":"833421514","version_name":"2019.11.4","version_date":"","version_description":""},{"version_id":"833605620","version_name":"2019.12","version_date":"2019-11-14 22:13:21.000 +0800","version_description":"In this release, we've updated Live Tracking so you can choose any departure from now until the end of the day. We've also made some changes to make the app easier to use on small screens.<br><br>Until next time, happy commuting!"},{"version_id":"834085686","version_name":"2019.13","version_date":"2019-12-20 00:24:45.000 +0800","version_description":"In this release, we've introduced our new Apple Watch app, which lets you quickly see all the departures around you."},{"version_id":"835023222","version_name":"2020.1.4","version_date":"2020-03-12 15:19:09.000 +0800","version_description":"New in this release: new dashboard with quick search buttons and departure boards, faster startup, what3words search and several bug fixes.<br><br>NEW DASHBOARD<br>We've updated the dashboard to make it quick and easy to see departures near you, along with buttons for your saved places.<br><br>FASTER STARTUP<br>We started this app back in 2013, and it's picked up a lot of cruft along the way. We took some time out to rebuild the app from scratch and leave out anything that wasn't necessary. Now, the app should open faster than it did before.<br><br>WHAT3WORDS SEARCH<br>If you're looking for directions to a very specific place (say, the arrivals entrance at an airport, or the ticket stall at a stadium) putting in the address can sometimes send you to a different part of the building. Well now that hassle is over - if you know the three-word address for that location from what3words we'll get you directions to that exact spot!<br><br>Finally, you can now vote for the next feature we build (or add your own to the list) - just tap on the More tab to find out more.<br><br>Until next time, happy commuting!"},{"version_id":"835326863","version_name":"2020.2.2","version_date":"2020-03-31 16:50:49.000 +0800","version_description":"You voted, we listened: introducing Line Status Alerts!<br><br>You'll find a couple of new options in the Settings tab (we changed it to Settings because... well, that's really what its used for now), where you'll find Line Status Alerts. Switch it to Commute Only (for alerts between 7AM-9AM and 5PM-7PM on weekdays) or Always, and we'll send you alerts when your favorite lines are having issues. Don't know how to save lines? It's easy, just open a route map and tap on the star icon on the top-right corner.<br><br>We've also added the first of our new Premium features - up until now, the Premium version of the app just removed ads, but we wanted to reward customers with great new features. In this release, we've added Commute Alerts and Custom App Icons, exclusively for Premium customers. If you want to go Premium, just go to the Settings tab and purchase Whiz Premium. It's a one-off purchase - no subscriptions. You'd be helping us continue development of the app, and there a lot of great new Premium features coming out this year.<br><br>COMMUTE ALERTS<br>Switch on Commute Alerts in the Settings tab and we'll send you a notification each weekday at 8AM and 5PM letting you know about any issues on your saved lines.<br><br>CUSTOM APP ICONS<br>Match the app icon to your tastes with over a dozen colors to choose from.<br><br>Until next time!"},{"version_id":"836123715","version_name":"2020.4.1","version_date":"2020-05-26 15:18:02.000 +0800","version_description":"In this release, we've fixed some bugs with search and departure boards."}]