[{"version_id":"828670852","version_name":"2.1.15","version_date":"2019-09-19 02:23:18.000 +0800","version_description":"New in SEB 2.1.15:<br>• Now allowing to run on iOS 13 by default.<br>• Client settings with a quit password now allow to reconfigure when the exam isn't running.<br>• Tapping Cancel in the \"No Kiosk Mode Available\" alert now displays the \"Exam Session Finished\" alert instead of asking to activate AAC Single App Mode immediately again.<br>• Fixed that a Quit Link with a trailing slash didn't work.<br>• Now clearing cookie store when starting SEB, to prevent that some authentication logins persist.<br><br>New in SEB 2.1.14:<br>‪• The Browser Exam Key and the new Config Key hash values are generated by SEB for iOS and sent with HTTP requests. Compatible assessment systems can use these values to verify that an exam is accessed with an approved version of SEB and deny access if a regular browser is used, if SEB is used with wrong settings or if a manipulated version of SEB is used.<br>• SEB 2.1.14 fixes an issue in SEB 2.1.13 which occurred when checking the app integrity and for creating the Browser Exam Key.<br>‪• ‬SEB for iOS now supports the URL filter feature to restrict access to websites/pages/web resources. Use the desktop versions of SEB to generate config files containing such URL filter rules.<br>‪• ‬SEB now uses the full native resolution when running on iPad Pro devices with Face ID.<br>‪• ‬SEB now supports Slide Over and Split View when not running in Single App Mode (for open book exams or when using SEB together with other apps in exams on managed devices).<br>‪• ‬On iPad devices supporting picture in picture video (PiP), video plays in a movable and resizable overlay window. If not running SEB in Single App Mode (open book exams, using other apps in exams on managed devices), PiP video keeps playing even if switching to other apps.<br>‪• ‬Added options to allow media auto play and to control if video can be played inline on a web page or only in full screen. <br>‪• ‬SEB for iOS now optionally supports downloading website generated files (using the data: scheme) . This feature allows saving encrypted exam results in case network connection fails. Such downloaded files can be accessed in the Files app (\"On My iPad/iPhone\" location) and with iTunes.<br>‪• ‬Added support for encrypting SEB config files with identity certificates. These certificates have to be distributed to exam devices by embedding them into a client config file. SEB exam config files encrypted with this certificate can afterwards be opened without students having to enter an SEB exam settings password.<br>‪• ‬New identity certificates for encrypting and decrypting config files can easily be created in the built-in settings editor. They can even be automatically created and auto-selected for encrypting exam configs.<br>‪• ‬Added iOS 13 to the \"Allow Running on iOS Beta\" option.<br>‪• ‬Added options for links requesting to open in new tab: open in same or new tab, always block or block when on another server.<br>‪• ‬The Quit Link feature can now optionally restart an exam session instead of quitting it.<br>‪• ‬Exam sessions can now optionally be reconfigured before having to first quit the running exam session.<br>‪• ‬Clearing of session cookies can now optionally be disabled, allowing users to stay logged in if they already were in a previous session.<br>‪• ‬Deep linking for exams now also works with sebs:// links (in addition to Universal Links).<br>‪• ‬SEB for iOS now saves log files, which can help when analyzing issues. Those logs can be emailed to the SEB developers or to an exam administrator. <br>‪• ‬Improved reliability of MDM Managed Configuration, important for iPads owned, deployed and managed by an institution.<br>‪• ‬Stability and security improvements."},{"version_id":"828670852","version_name":"2.1.12","version_date":"2018-09-25 19:16:04.000 +0800","version_description":"• SEB is now running on iOS 12.<br>• Supports full screen size on all new iPhone devices.<br>• The Initial Configuration Assistant now allows to search the local network for SEB settings by just tapping a button (when an institution supports this feature). <br>• Improved information for users in some of the dialogs displayed when configuring SEB and finishing an exam.<br>• QR codes can now contain an optional query string, for example to identify a specific user or exam.<br>• Specific assessment systems can be accessed using Universal Links: <br>   • A regular web link to a supported system opens directly in SEB. <br>   • If the user doesn’t have SEB installed yet, the link opens in Safari and a smart banner shows a button to install SEB from the App Store.<br>   • Using deep linking, SEB can open direct links to all pages of a website. <br>   • Universal Links also work with QR codes: You can print one QR code which users can scan with the camera app (starting with iOS 11). This will then allow examinees to install SEB and start an exam on your system with just one QR code.<br>• On supported systems, users can log in with their passwords saved in iCloud Keychain. <br>• The title of the currently visible webpage tab is displayed underlined in the left side menu. <br>• Fixed a hyperlink compatibility issue. This solves problems with some website features previously not working in SEB for iOS.<br>• Fixed a security issue when accessing the settings editor.<br>• SEB for iOS now can use embedded TLS and CA server certificates and certificate pinning for higher security when accessing exam servers. Use config files saved in the SEB versions for supported desktop platforms.<br>• You can configure a minimal required iOS version. SEB will then refuse to run on an older iOS version, for example for security reasons and to ensure availability of latest web technologies in the iOS WebKit browser engine.<br>• New setting for a browser user agent suffix, which is appended to all regular user agent strings.<br>• Stability and security improvements."},{"version_id":"831976248","version_name":"2.1.13","version_date":"2019-08-26 10:04:31.000 +0800","version_description":"• The Browser Exam Key and the new Config Key values are generated by SEB for iOS and sent with all HTTP requests (if enabled in Settings/Exam Session). Compatible assessment systems can use these values to verify if an exam is accessed with an approved version of SEB and deny access if a regular browser is used, if SEB is used with wrong settings or if a manipulated version of SEB is used.<br>• SEB for iOS now supports the URL filter feature to restrict access to websites/web pages/web resources. Use the desktop versions of SEB to generate config files containing URL filter rules.<br>• SEB 2.1.13 uses the full native resolution when running on iPad Pro devices with Face ID.<br>• SEB now supports Slide Over and Split View when not running in Single App Mode (for open book exams or when using other apps in exams on managed devices).<br>• Added option \"Allow Picture in Picture Video\". On iPad devices supporting PiP, the video plays in a movable and resizable overlay window. If not running SEB in Single App Mode (open book exams, using other apps in exams on managed devices), PiP video keeps playing even if switching to other apps.<br>• Added option to allow media auto play. By default media doesn't auto play, unless you allow it with the option Settings/Browser Features/Media Autoplay.<br>• Added options to control if video can be played inline on a web page or only in full screen. There are two separate settings for \"Allow Inline Playback on iPad\" (enabled by default) and \"Allow Inline Playback on iPhone\" (disabled by default) in Settings/Browser Features. By disabling this option, HTML5 video players are forced to use the iOS user interface for controlling playback. <br>• SEB for iOS now saves log files, which can help when analyzing issues. Those logs can be emailed to the SEB developers or to an exam administrator.<br>• Setting for log level is now functional (Settings/Security/Logging/Log Level).<br>• Improved reliability of MDM Managed Configuration, important for iPads owned, deployed and managed by institutions.<br>• Added iOS 13 to the \"Allow Running on iOS Beta\" option.<br>• SEB for iOS now optionally supports downloading files (Settings/Downloads/Allow Downloading). Currently only website generated files (using the data: scheme) can be downloaded. This feature is meant for saving encrypted exam results in case network connection fails. Those files can be accessed in the Files app (\"On My iPad/iPhone\" location) and by using iTunes.<br>• Support for encrypting config files with identity certificates. These have to be distributed by embedding them into a client config file.<br>• New identities for encrypting and decrypting config files can easily be created in Settings/Network/Certificates/Choose Identity.<br>• Identity certificates for decrypting SEB exam configs can be embedded into client configs. <br>• Added option to automatically create and embed an identity (Settings/Config File/Create &amp; Embed Identity, available when editing client config files). <br>• Option to auto-select latest created or imported identity for encrypting exam configs (Settings/Config File/Auto-Select Identity).<br>• Added options for links requesting to open in new tab (see Settings/Browser Features), compatible with SEB for macOS.<br>• The Quit Link feature can now optionally restart an exam session instead of quitting it (Settings/Exam Session/Restart Instead of Quitting).<br>• Exam sessions can now optionally be reconfigured before having to first quit the running exam session (Settings/Exam Session/Allow Reconfiguring).<br>• Clearing of session cookies can now optionally be disabled, allowing users to stay logged in if they already were in a previous session (Settings/Exam Session).<br>• Deep linking for exams now also works with sebs:// links (in addition to Universal Links, see Settings/Exam Session/Allow Deep Linking for Exams)).<br>• Various bug fixes."},{"version_id":"832525009","version_name":"2.1.14","version_date":"2019-08-27 08:07:05.000 +0800","version_description":"‪• The Browser Exam Key and the new Config Key hash values are generated by SEB for iOS and sent with HTTP requests (if enabled in Settings/Exam Session). Compatible assessment systems can use these values to verify that an exam is accessed with an approved version of SEB and deny access to the exam if a regular browser is used, if SEB is used with wrong settings or if a manipulated version of SEB is used.<br>• SEB 2.1.14 fixes an issue in SEB 2.1.13 when checking the app integrity for creating the Browser Exam Key, which lead to a false positive alert.<br>• SEB for iOS now supports the URL filter feature to restrict access to websites/pages/web resources. Use the desktop versions of SEB to generate config files containing such URL filter rules.<br>• SEB now uses the full native resolution when running on iPad Pro devices with Face ID.<br>• SEB now supports Slide Over and Split View when not running in Single App Mode (for open book exams or when using other apps in exams on managed devices).<br>• On iPad devices supporting picture in picture video (PiP), the video plays in a movable and resizable overlay window. If not running SEB in Single App Mode (open book exams, using other apps in exams on managed devices), PiP video keeps playing even if switching to other apps.<br>• Added options to allow media auto play and to control if video can be played inline on a web page or only in full screen. <br>• SEB for iOS now optionally supports downloading website generated files (using the data: scheme). This feature allows saving encrypted exam results in case the network connection fails. Those files can be accessed in the Files app (\"On My iPad/iPhone\" location) and with iTunes.<br>• Added support for encrypting SEB config files with identity certificates. These certificates have to be distributed by embedding them into a client config file, afterwards SEB exam config files can be encrypted with this certificate and students don't need to enter an SEB settings password when starting exams.<br>• New identities for encrypting and decrypting config files can easily be created in the built-in settings editor. They can even be automatically created and auto-selected for encrypting exam configs.<br>• Added iOS 13 to the \"Allow Running on iOS Beta\" option.<br>• Added options for links requesting to open in new tab (open in same or new tab, always block or block when on another server).<br>• The Quit Link feature can now optionally restart an exam session instead of quitting it.<br>• Exam sessions can now optionally be reconfigured before having to first quit the running exam session.<br>• Clearing of session cookies can now optionally be disabled, allowing users to stay logged in if they already were in a previous session.<br>• Deep linking for exams now also works with sebs:// links (in addition to Universal Links).<br>• SEB for iOS now saves log files, which can help when analyzing issues. Those logs can be emailed to the SEB developers or to an exam administrator. <br>• Improved reliability of MDM Managed Configuration, important for iPads owned, deployed and managed by an institution.<br>• Stability and security improvements."},{"version_id":"832826976","version_name":"2.1.15","version_date":"2019-09-19 02:23:18.000 +0800","version_description":"New in SEB 2.1.15:<br>• Now allowing to run on iOS 13 by default.<br>• Client settings with a quit password now allow to reconfigure when the exam isn't running.<br>• Tapping Cancel in the \"No Kiosk Mode Available\" alert now displays the \"Exam Session Finished\" alert instead of asking to activate AAC Single App Mode immediately again.<br>• Fixed that a Quit Link with a trailing slash didn't work.<br>• Now clearing cookie store when starting SEB, to prevent that some authentication logins persist.<br><br>New in SEB 2.1.14:<br>‪• The Browser Exam Key and the new Config Key hash values are generated by SEB for iOS and sent with HTTP requests. Compatible assessment systems can use these values to verify that an exam is accessed with an approved version of SEB and deny access if a regular browser is used, if SEB is used with wrong settings or if a manipulated version of SEB is used.<br>• SEB 2.1.14 fixes an issue in SEB 2.1.13 which occurred when checking the app integrity and for creating the Browser Exam Key.<br>‪• ‬SEB for iOS now supports the URL filter feature to restrict access to websites/pages/web resources. Use the desktop versions of SEB to generate config files containing such URL filter rules.<br>‪• ‬SEB now uses the full native resolution when running on iPad Pro devices with Face ID.<br>‪• ‬SEB now supports Slide Over and Split View when not running in Single App Mode (for open book exams or when using SEB together with other apps in exams on managed devices).<br>‪• ‬On iPad devices supporting picture in picture video (PiP), video plays in a movable and resizable overlay window. If not running SEB in Single App Mode (open book exams, using other apps in exams on managed devices), PiP video keeps playing even if switching to other apps.<br>‪• ‬Added options to allow media auto play and to control if video can be played inline on a web page or only in full screen. <br>‪• ‬SEB for iOS now optionally supports downloading website generated files (using the data: scheme) . This feature allows saving encrypted exam results in case network connection fails. Such downloaded files can be accessed in the Files app (\"On My iPad/iPhone\" location) and with iTunes.<br>‪• ‬Added support for encrypting SEB config files with identity certificates. These certificates have to be distributed to exam devices by embedding them into a client config file. SEB exam config files encrypted with this certificate can afterwards be opened without students having to enter an SEB exam settings password.<br>‪• ‬New identity certificates for encrypting and decrypting config files can easily be created in the built-in settings editor. They can even be automatically created and auto-selected for encrypting exam configs.<br>‪• ‬Added iOS 13 to the \"Allow Running on iOS Beta\" option.<br>‪• ‬Added options for links requesting to open in new tab: open in same or new tab, always block or block when on another server.<br>‪• ‬The Quit Link feature can now optionally restart an exam session instead of quitting it.<br>‪• ‬Exam sessions can now optionally be reconfigured before having to first quit the running exam session.<br>‪• ‬Clearing of session cookies can now optionally be disabled, allowing users to stay logged in if they already were in a previous session.<br>‪• ‬Deep linking for exams now also works with sebs:// links (in addition to Universal Links).<br>‪• ‬SEB for iOS now saves log files, which can help when analyzing issues. Those logs can be emailed to the SEB developers or to an exam administrator. <br>‪• ‬Improved reliability of MDM Managed Configuration, important for iPads owned, deployed and managed by an institution.<br>‪• ‬Stability and security improvements."},{"version_id":"835720082","version_name":"2.1.16","version_date":"2020-05-02 11:13:18.000 +0800","version_description":"• Improved accessibility when using VoiceOver.<br>• Now supporting hardware keyboard shortcuts (Ctrl-Tab/Shift-Ctrl-Tab) to switch browser tabs.<br>• Added keyboard shortcut Cmd-M to toggle left side menu (show/hide).<br>• Improved reconfiguration with MDM Managed App Configuration, to facilitate deployment of SEB settings.<br>• Added new option to lock SEB when it's attempted to capture the screen.<br>• Added new option to lock SEB when closing an iPad case on iOS &lt;13, as the displayed iOS lock screen could contain a cheat sheet. <br>• Implemented separate settings to clear cookies when starting/ending session. This allows users to stay logged-in, for example when starting an exam with individual settings in some learning management and exam systems.<br>• Fixed issues when calculating the Config Key hash with specific settings. Compatible assessment systems can use this hash value to automatically verify that an exam is accessed with correct settings.<br>• Allow to open SEB config files from iCloud Drive (using Files app).<br>• Fixed URL filter didn't treat query strings consistently between SEB versions on other platforms.<br>• Fixed client configuration encrypted with password wasn't compatible between SEB versions on some platforms.<br>• Fixed setting Browser Features / \"Show URLs: Always\" couldn't be selected in In-App-Settings and activating this option wasn't showing the page URL in the side menu.<br>• If checking server trust with embedded certificates, resources in subdomains of already trusted domains are now trusted as well, according to behavior in other web browsers."},{"version_id":"837808218","version_name":"2.1.17","version_date":"2020-09-20 00:09:23.000 +0800","version_description":"• SEB 2.1.17 runs by default on iOS 14, removed check for running on iOS beta.<br>• Scroll lock button for better usability while using some drag-and-drop and drawing question types<br>• Now displaying disclaimer about the requirement to add an issue description before sending log files in the integrated mail composer.<br>• Now writing SEB and iOS version and device info into log files.<br>• Error message in case AAC couldn't be started properly and device needs to be restarted will only show on iOS versions older than iOS 13.0.<br>• Fixed that a different Config Key was calculated on iOS 9/10 than on iOS 13/14 with some rare configuration files containing a deprecated setting.<br>• Fixed that SEB assumed an opened URL could be a Universal Link if decrypting the config from that URL failed.<br>• Fixed a common crash when the \"Search Network\" button in the Initial Configuration Assistant is tapped."}]