[{"version_id":"822791523","version_name":"1.8.2","version_date":"2017-07-10 08:09:00.000 +0800","version_description":"George Go již umí načíst QR kód nebo složenku, abyste mohli zaplatit bez zdlouhavého opisování."},{"version_id":"824681497","version_name":"2.1.2","version_date":"2017-11-28 21:34:04.000 +0800","version_description":"George Go už umí šablony plateb. Prostě jenom vyberete a zaplatíte. Také jsme upravili potvrzovací obrazovky, jsou teď přehlednější.<br><br>Něco nefunguje jak má? Neváhejte mi napsat na george@csas.cz.<br>Váš George"},{"version_id":"825397961","version_name":"2.3.1","version_date":"2018-01-03 11:47:32.000 +0800","version_description":"Placení je zase o kus jednodušší - prostě vytvoříte kopii už zadané platby a odešlete. George Go Vám ukáže také Vaše investice, stavební spoření nebo penzijní produkty. Mimochodem, vyzkoušeli jste si už George Go i na iPadu?  <br><br>Něco nefunguje jak má? Neváhejte mi napsat na george@csas.cz.<br>Váš George"},{"version_id":"825729298","version_name":"2.5.0","version_date":"2018-03-17 13:11:14.000 +0800","version_description":"Nyní v přehledu plateb snadno dohledáte nezaúčtované platby kartou. George Go Vám je pěkně všechny ukáže a hned tak vidíte, kde jste utráceli. Také jsme opravili několik drobností. <br>Něco nefunguje jak má? Neváhejte nám napsat na george@csas.cz.<br>A děkujeme, že používáte George!<br>Vaše Česká spořitelna"},{"version_id":"825729298","version_name":"2.4.0","version_date":"2018-01-29 19:51:19.000 +0800","version_description":"Tentokrát jsme pouze vylepšili a opravili několik drobností. <br>Něco nefunguje jak má? Neváhejte nám napsat na george@csas.cz.<br>A děkujeme, že používáte George!<br>Vaše Česká spořitelna"},{"version_id":"826329924","version_name":"2.5.0","version_date":"2018-03-17 13:11:14.000 +0800","version_description":"Nyní v přehledu plateb snadno dohledáte nezaúčtované platby kartou. George Go Vám je pěkně všechny ukáže a hned tak vidíte, kde jste utráceli. Také jsme opravili několik drobností. <br>Něco nefunguje jak má? Neváhejte nám napsat na george@csas.cz.<br>A děkujeme, že používáte George!<br>Vaše Česká spořitelna"},{"version_id":"826827549","version_name":"2.6.1","version_date":"2018-04-30 05:29:21.000 +0800","version_description":"Připravili jsme 3 nové funkce: George Vám třídí platby a Vy tak máte přehled, za co utrácíte. Kategorie si pak můžete upravit, jak je libo. Kreditku nyní splatíte snadněji – stačí jen vybrat částku a odeslat. A také už uvidíte své Flexi životní pojištění. <br><br>Líbí se vám George v mobilu? Dejte mu, prosím, pěkné hodnocení. Něco nefunguje jak má? Neváhejte nám napsat na george@csas.cz. A děkujeme, že používáte George!<br>Vaše Česká spořitelna"},{"version_id":"828264819","version_name":"2.8.2","version_date":"2018-09-27 10:27:04.000 +0800","version_description":"Novinky, které si pro Vás tentokrát George připravil:<br>• Vyzkoušejte nové grafy, na první pohled tak budete mít přehled o Vašich financích.<br>• Jednoduše můžete čerpat a splácet Peníze na klik, pokud je máte sjednané.<br>• Nově lze dobíjet kredit mobilních telefonů.<br>• Určitě také navštivte nový Obchod, abyste věděli kam zajít, když bude potřeba. <br>• A protože je pro nás zabezpečení aplikace nejvyšší prioritou, připravili jsme nové přihlašovací obrazovky.<br><br>Líbí se vám George v mobilu? Dejte mu, prosím, pěkné hodnocení. Něco nefunguje jak má? Neváhejte nám napsat na george@csas.cz. A děkujeme, že používáte George!<br>Vaše Česká spořitelna"},{"version_id":"828847908","version_name":"2.9.2","version_date":"2018-10-10 13:16:03.000 +0800","version_description":"Co nového tentokrát? Zejména technické úpravy, ale také nové hodnocení aplikace.<br>Děkujeme, že používáte George!<br>Vaše Česká spořitelna"},{"version_id":"829057583","version_name":"2.10.2","version_date":"2018-10-31 06:07:50.000 +0800","version_description":"Změnili jsme název aplikace. Z George Go je nově George. Přidali jsme také už avizované dobíjení kreditu předplacených SIM karet. A George dovede posílat push zprávy, které vás budou upozorňovat na důležité události nebo poskytovat užitečné tipy. Stačí je jen povolit.<br><br>Děkujeme, že používáte George!<br>Vaše Česká spořitelna"},{"version_id":"829158981","version_name":"2.10.3","version_date":"2018-11-06 12:42:43.000 +0800","version_description":"Co nového? Opravili jsme focení QR kódu pro placení. Omlouváme se za případné komplikace, teď už to zase jede, jak má!<br>D​ěkujeme, že používáte George!<br>Vaše Česká spořitelna"},{"version_id":"829264844","version_name":"2.10.5","version_date":"2018-11-13 20:56:06.000 +0800","version_description":"Občas je potřeba trochu uklidit a srovnat věci na svá místa - tato verze obsahuje opravy hlášek a textů. Děkujeme, že používáte George!<br>Vaše Česká spořitelna"},{"version_id":"829654806","version_name":"2.11.0","version_date":"2019-01-21 21:20:41.000 +0800","version_description":"Kromě drobných oprav a vylepšení Vám George může nově do aplikace také posílat tipy a triky, které budou určené jen a pouze pro Vás. Takové, které Vám usnadní bankování, ušetří čas nebo peníze. <br>Děkujeme, že používáte George!<br>Vaše Česká spořitelna"},{"version_id":"830708505","version_name":"2.13.2","version_date":"2019-03-22 20:43:15.000 +0800","version_description":"Nově si můžete zkontrolovat všechny Vaše kontaktní údaje, které jste nám dali k dispozici. A když nebudou sedět, hned si je přímo v mobilu, v menu “Nastavení”, upravte. Budeme tak vědět, že Vám neuteče žádná důležitá informace. Zapomenete sem tam PIN ke své platební kartě? Nevadí, George Vám teď PIN dovede ukázat. A zkuste ještě jednu novinku - jestli Váš iPhone umí “3D touch” - než otevřete George, stiskněte a podržte ikonu George, objeví se Vám nabídka na přepočet částky z cizí měny na korunu. Na dovolené se bude hodit.<br><br>Děkujeme, že používáte George!<br>Vaše Česká spořitelna"},{"version_id":"831057148","version_name":"2.14.1","version_date":"2019-04-22 18:41:36.000 +0800","version_description":"Co nového tentokrát? Opravili jsme platby pomocí QR kódu a mnoho dalších technických úprav a vylepšení.<br><br>Děkujeme, že používáte George!<br>Vaše Česká spořitelna"},{"version_id":"831705942","version_name":"19.19.2","version_date":"2019-06-25 21:44:18.000 +0800","version_description":"S novou verzí George už Vám nikdy nic neuteče! Naučil se posílat Informační zprávy o změnách zůstatku, příchozích a odchozích platbách a platbách kartou. Aktivaci provedete jednoduše v Georgi na Vašem počítači v menu Nastavení. Nově Vám také George zobrazí užitečné rady a tipy, které budou určené jen pro Vás. Opravili jsme také nahlášené chyby a provedli drobná vylepšení v podobě změny fontu a barvy písma. Dejte nám vědět jak se líbí. \n<br>Děkujeme, že používáte George!\n<br>Vaše Česká spořitelna"},{"version_id":"832089939","version_name":"19.23.1","version_date":"2019-07-30 08:58:11.000 +0800","version_description":"Čekáte platbu? Teď už nemusíte kontrolovat Váš účet pětkrát denně. Nastavte si zasílání mobilních upozornění přímo v aplikaci, a George Vás upozorní vždy, když se změní zůstatek na účtu, zaplatíte kartou nebo třeba vyberete hotovost z bankomatu.<br>Opravili jsme nahlášené chyby, drobně jsme také vylepšili transakční historii, kde nyní rozlišíte mezi běžnou a mobilní platbou, a lehkým redesignem prošel i font písma. Dejte nám vědět jak se líbí.<br>Děkujeme, že používáte George! <br>Vaše Česká spořitelna"},{"version_id":"833013119","version_name":"19.35.0","version_date":"2019-10-10 11:30:48.000 +0800","version_description":"Nová verze přináší spoustu novinek! Pokud potřebujete poslat potvrzení o provedení platby, nově ho z mobilu vygenerujete i ve formátu PDF. K provedené platbě v transakční historii si navíc můžete přidat poznámku nebo #hashtag, takže už nikdy nebudete přemýšlet, za co jste to platili. A jednoduše si platbu vyhledáte třeba podle čísla účtu - zadejte ho klidně ve formátu \"číslo účtu/kód banky\". Pravidelné platby si můžete také jednoduše uložit mezi šablony.\n<br>Registrace do aplikace je teď o mnoho jednodušší, stačí zadat uživatelské jméno a potvrdit přihlášení v George klíč, o zbytek se postarají aplikace mezi sebou."},{"version_id":"834262040","version_name":"19.47.19","version_date":"2020-01-14 19:21:00.000 +0800","version_description":"Bankomaty a pobočky máme skoro na každém rohu. Abychom vám ale jejich hledání usnadnili, přidali jsme do George jejich vyhledávač. Dozvíte se tam otevírací dobu, zda je pobočka bezbariérová nebo jestli v ní třeba naleznete vkladomat. Nově si také můžete přidat kartu do Apple Pay přímo z George. Plaťte mobilem a kartu můžete nechat doma. Na přehledové obrazovce teď také rychle zjistíte, na kolik s námi můžete dosáhnout - ať už přemýšlíte nad hypotékou nebo třeba kontokorentem. A samozřejmě jsme nezapomněli opravit ani nahlášené chyby. Tak vše nejlepší do nového roku!"},{"version_id":"834819975","version_name":"20.03.12","version_date":"","version_description":""},{"version_id":"835210755","version_name":"20.07.7","version_date":"","version_description":""},{"version_id":"835712028","version_name":"20.11.16","version_date":"2020-04-28 19:19:37.000 +0800","version_description":"Světová pandemie se nevyhnula ani Georgi. V posledním týdnu nám jeho stav dělal trochu starosti, proto jsme se rozhodli vzít si ho na paškál. V nové verzi jsme opravili nahlášené chyby a provedli drobná vylepšení. Už v příští verzi se ale můžete těšit na jednu novou funkčnost, po které jste dlouho volali. Hádejte, co to bude?"},{"version_id":"836110567","version_name":"20.15.12","version_date":"2020-05-26 09:17:16.000 +0800","version_description":"Ať už šetříte na dovolenou (u Mácháče) nebo na nové auto, s novou verzí George získáte neustálý přehled o tom, kolik už jste ušetřili. Mobilní George se totiž konečně dočkal spořicích obálek! Odteď z nich můžete vybírat peníze dle libosti. Druhou novinkou je možnost volání na naší klientskou linku přímo z aplikace. Díky tomu budeme vědět, že jste to Vy a nebude potřeba Vaši identitu dál složitě ověřovat. A jako vždy jsme také nezapomněli opravit nahlášené chyby a provést různá drobná vylepšení."},{"version_id":"836779630","version_name":"20.23.26","version_date":"2020-07-14 06:28:42.000 +0800","version_description":"Platíte často kartou? S novou verzí George můžete za své nákupy získávat peníze zpět! Aktivujte si odměnový program Moneyback v aplikaci pod záložkou Profil a ušetřete. Nabídky a bonusy se pravidelně obměňují, proto je nezapomeňte občas zkontrolovat. Věříme, že vám tato novinka udělá radost! Kromě toho jsme opravili i nahlášené chyby. Krásné léto! Vaše Česká spořitelna"},{"version_id":"837391354","version_name":"20.27.17","version_date":"2020-08-18 19:03:38.000 +0800","version_description":"Marně přemýšlíte, kdy jste si naposledy kupovali roční kupón na MHD, nebo zda jste už Pepovi poslali peníze za pivo? Nová verze George přináší vylepšené vyhledávání, se kterým tyto platby najdete raz dva. Vyhledávejte podle data, částky nebo klíčových slov.<br><br>Kromě toho jsme opět opravili i nahlášené drobné vady na kráse a provedli designová vylepšení.&nbsp;<br><br>Krásné léto Vám přeje George a Česká spořitelna"},{"version_id":"839463425","version_name":"20.43.24","version_date":"2020-12-07 07:32:21.000 +0800","version_description":"Nakupujete vánoční dárky ze zahraničí? Pak vás jistě potěší, že SEPA platby nově odešlete i z aplikace. Za pár dní si v Obchodě vytvoříte virtuální kartu, která se hodí pro ještě bezpečnější nakupování online, nebo placení mobilem a hodinkami.<br><br>A vy, co u nás používáte platební kartu k Penězům na klik, ji nově uvidíte přímo v aplikaci.<br><br>Krásné předvánoční období přeje<br>Česká spořitelna"},{"version_id":"840065408","version_name":"20.43.24","version_date":"2020-12-07 07:32:21.000 +0800","version_description":"Nakupujete vánoční dárky ze zahraničí? Pak vás jistě potěší, že SEPA platby nově odešlete i z aplikace. Za pár dní si v Obchodě vytvoříte virtuální kartu, která se hodí pro ještě bezpečnější nakupování online, nebo placení mobilem a hodinkami.<br><br>A vy, co u nás používáte platební kartu k Penězům na klik, ji nově uvidíte přímo v aplikaci.<br><br>Krásné předvánoční období přeje<br>Česká spořitelna"},{"version_id":"840065409","version_name":"20.47.23","version_date":"","version_description":""},{"version_id":"840606830","version_name":"21.02.13","version_date":"2021-03-01 14:31:36.000 +0800","version_description":"Investujete s Georgem? Pak budete mít určitě radost, že v aplikaci nově uvidíte graf znázorňující výkonnost vašeho portfolia.<br>Další novinkou potěšíme podnikatele a firmy: přes aplikaci je nyní možné kompletně zadávat platby, vyžadující potvrzení více osob.<br>Poslední změnu najdete v detailu produktu, kde je dole nový panel, odkud můžete začít vyhledávat, podívat na graf vašich příjmů a výdajů nebo zadat novou platbu. Vše přehledně na jednom místě.<br><br>Vaše Česká spořitelna"},{"version_id":"840791055","version_name":"21.06.18","version_date":"2021-03-29 17:42:53.000 +0800","version_description":"V nové verzi aplikace najdete pod záložkou Kontakty vizitku svého osobního bankéře, spolu s možností mu zavolat nebo napsat e-mail. Potřebujete s něčím poradit? Využijte to!<br>Také jsme zajistili, že všichni šťastní majitelé krásných vozů nově uvidí v George své autopojištění. Kromě toho jsme jako vždy opravili nahlášené chyby a provedli drobná vylepšení.<br><br>Pěkné jaro přeje<br>Česká spořitelna"},{"version_id":"841749463","version_name":"21.10.21","version_date":"2021-04-27 09:58:17.000 +0800","version_description":"Potřebujete odeslat žádost o čerpání hypotéky, změnit termín nebo výši splátky úvěru, případně upravit příspěvek na penzijní spoření? Od této verze už to zvládnete na pár kliků i z mobilní aplikace.<br><br>Spravujte své finance za chodu!<br>Vaše Česká spořitelna"},{"version_id":"843420198","version_name":"21.22.26","version_date":"2021-08-04 10:29:32.000 +0800","version_description":"Nová verze George přináší spoustu novinek! Slevový program Moneyback nyní kromě cashbacku, nabízí i odměny a kupóny. Čekají tam jen na vás.<br>Pokud si odkládáte své úspory na spořicí účet, můžete si nyní v aplikaci založit spořicí obálky a do nich si finance přehledně roztřídit. Jaké bude jejich jméno? Auto, dovolená nebo třeba svatba?<br>A poslední novinkou potěšíme ty, kteří rádi platí virtuální kartou - při vytváření si nyní můžete vybrat ze 4 různých barevných designů. Omrkněte je, jsou krásné!<br><br>Pěkné léto<br>Vaše Česká spořitelna"},{"version_id":"845119525","version_name":"21.38.20","version_date":"","version_description":""}]