[{"version_id":"819666610","version_name":"3.0","version_date":"","version_description":""},{"version_id":"825929269","version_name":"3.0.1","version_date":"2018-02-09 00:52:42.000 +0800","version_description":"OmniOutliner 3 for iOS brings structured writing to a wider audience with the introduction of OmniOutliner Essentials and adds highly-anticipated features to OmniOutliner Pro.<br><br>OmniOutliner Essentials is a brand new edition of OmniOutliner for iOS: A svelte, focused, and extremely affordable outlining app that puts the focus on your content and whatever task you’re working on—not on the tool you’re using.<br><br>• Free Downloads — OmniOutliner for iOS is now a free download in the App Store. This change allows us to offer a two week trial, discounted upgrades to customers who bought previous versions of OmniOutliner, and a free read-only mode.<br>• Dark Mode — OmniOutliner’s UI adapts to match your document’s background color.<br>• Drag and Drop — Text can be dragged to documents. Rows can be dragged between documents or to other apps.<br>• Keyword Filtering — Filter the outline by keyword via the new Filter icon in the toolbar.<br>• Simplified Inspector — Access simple document and text styling options via the redesigned Essentials Inspector.<br>• Improved Outline View — Row handles and Status Checkboxes now follow the row indentation level.<br>• Recent Documents — View recently edited documents all in one place, regardless of whether they’re saved locally or synced via another service like OmniPresence or iCloud.<br>• Templates — Choose a template or apply a theme to an existing document using OmniOutliner’s new Template Picker.<br>• Printing — Documents can now be printed via the new Print option in the Share menu.<br>• PDF — Send a PDF copy of your document using the new PDF format option.<br>• 1Password — 1Password integration is available for OmniPresence account setup.<br>• New File Format — OmniOutliner 3 for iOS adopts the new .ooutline format introduced by OmniOutliner 5 for Mac: a flat (zipped) file that is more compatible with third-party cloud sync platforms.<br>• OPML Mode — When editing OPML files, features not supported by the file format are hidden or disabled.<br>• Pro Document Compatibility — Documents containing Pro features are fully viewable in Essentials, along with an option to import a copy that removes all Pro styling and content.<br><br>OmniOutliner Pro 3 includes all of the great new features of Essentials, everything good from OmniOutliner 2, and all of this:<br><br>• Omni Automation — Cross-platform scripting with JavaScript.<br>• Focusing — A Section List has been added to give you an overview of your document and the ability to focus on certain areas.<br>• Status Bar — When focused or filtered, a status bar appears to remind you that content is hidden and provide easy access to your full outline.<br>• Drag and Drop — In addition to text, images and other files can be dragged to documents.<br>• Filters — Create and save keyword filters. If you’re syncing with OmniOutliner 5 Pro for Mac, you can also apply advanced filters created in the Mac edition of OmniOutliner.<br>• Optimized Inspector — The Contents and Text Style Inspectors now open in a unified view on smaller iOS devices and as a unified sidebar on larger iOS devices, allowing for improved access to inspector contents. When space is available, the Inspector sidebar now persists on the screen, making it easier to make multiple changes to your document.<br>• Outline Column — The outline column can now be placed anywhere in a multi-column document.<br>• Excel Export — Export to the Excel (xlsx) format.<br>• PowerPoint Export — PowerPoint export now places embedded images on corresponding slides. You’ll need to manually re-position them, though.<br>• Password Encryption — Add a password to secure your documents with AES-256 encryption.<br>• New File Format — While .ooutline files are zipped by default, package files are still available for scenarios where that makes more sense, like for version control. Note— The previous .oo3 format can still be opened and edited but features requiring the new format will be disabled.<br>• OPML Mode — Edit metadata for OPML files and set text encoding in the Document inspector."},{"version_id":"827463499","version_name":"3.1.1","version_date":"2018-07-12 21:19:53.000 +0800","version_description":"OmniOutliner 3.1.1 is a minor update focused on stability, performance, and bug fixes.<br><br>• Paste: Rich text copied from other applications can be pasted.<br>• Filters: Improved the speed of applying filters.<br>• Batch Find: Improved the scrolling behavior of the outline view when selecting a Batch Find result.<br>• Outline View: Fixed cases where the Row and Note text appears stretched or smeared after scrolling into view.<br>• Outline View: Rows created by the Split Row function remain visible when moved within the outline hierarchy.<br>• Localizations: Added and corrected some translations.<br>• External Documents: Fixed a permissions error when trying to open a file that had not finished downloading from iCloud.<br>• Exports: Documents specifying colors in the HSB format are exportable to the XSLX format.<br>• Interface: The sidebar appears with the correct theme while document previews are generating in the background.<br>• Animations: Removed the outline view animation for Focusing and Unfocusing.<br>• Undo: Fixed a few cases of actions not properly closing their Undo group. <br>• Reference Manual: The English version of the Reference Manual is available from the App Menu for every localization. A translated version will be coming soon.<br>• Stability: The required note and status column are automatically added to documents missing them.<br>• Stability: Fixed a crash due to installing a renamed plug-in over the original.<br>• Stability: Fixed a crash when opening files from DEVONthink To Go.<br>• Stability: Fixed a crash when grouping rows in Edit Mode while a filter is applied.<br><br>We appreciate that you're taking the time to read these release notes. If you are enjoying OmniOutliner, please consider rating it in the App Store!<br><br>If you have any feedback or questions, we'd love to hear from you! The Omni Group offers free tech support: you can reach us by email at omnioutliner@omnigroup.com, by phone at 1-800-315-6664 or +1-206-523-4152, or on twitter at @omnioutliner.<br><br>Thank you!"},{"version_id":"828182034","version_name":"3.2","version_date":"2018-08-13 17:02:07.000 +0800","version_description":"OmniOutliner 3.2 adds localized Reference Manuals for German, Spanish, French, Japanese, Dutch, Italian, Russian, Chinese (Simplified), Portuguese (Brazil), and Korean.<br><br>We appreciate that you're taking the time to read these release notes. If you are enjoying OmniOutliner, please consider rating it in the App Store!<br><br>If you have any feedback or questions, we'd love to hear from you! The Omni Group offers free tech support: you can reach us by email at omnioutliner@omnigroup.com, by phone at 1-800-315-6664 or +1-206-523-4152, or on twitter at @omnioutliner.<br><br>Thank you!"},{"version_id":"828587161","version_name":"3.3","version_date":"2018-09-18 19:09:15.000 +0800","version_description":"• Siri Shortcuts: Added support for Siri Shortcuts. As you create new documents or open existing documents, Siri will keep track of your actions and start suggesting these activities to you based on observed patterns. These suggestions can appear in Spotlight, on the lock screen, and in Siri Settings.<br>• Printing &amp; PDF: When the outline column is set to Autosize, its width will be adjusted to try and best fit the content to the page. Manually set a width on the outline column to maintain that size. When an outline is too wide for the page, it will be scaled down to fit. <br>• Printing, PDF &amp; HTML Export: Colors specified in HSV work correctly.<br>• Printing, PDF &amp; HTML Export: Settings not used on iOS—such as attachment visibility, row padding, and gutter color–are ignored.<br>• Printing, PDF &amp; HTML Export: Numerous other fixes and changes to improve the layout and appearance of documents when printed or exported to PDF or HTML.<br><br>We appreciate that you're taking the time to read these release notes. If you are enjoying OmniOutliner, please consider rating it in the App Store!<br><br>If you have any feedback or questions, we'd love to hear from you! The Omni Group offers free tech support: you can reach us by email at omnioutliner@omnigroup.com, by phone at 1-800-315-6664 or +1-206-523-4152, or on twitter at @omnioutliner.<br><br>Thank you!"},{"version_id":"828750621","version_name":"3.3.1","version_date":"2018-10-01 18:04:13.000 +0800","version_description":"• Siri Shortcuts: Siri Shortcuts are offered for creating new documents from the built-in templates. <br>• Outline View: On iOS 12, rows grow in height while typing if the text wraps to another line.<br><br>If you have any feedback or questions, we’d love to hear from you! The Omni Group offers free tech support; you can email omnioutliner@omnigroup.com, call 1–800–315–6664 or 1–206–523–4152, or tweet @OmniOutliner.<br><br>If OmniOutliner empowers you, we would appreciate an App Store review. Your review will help other people find OmniOutliner and make them more productive too."},{"version_id":"829203082","version_name":"3.3.2","version_date":"2018-11-07 22:56:31.000 +0800","version_description":"• Compatibility: Added support for the new iPad screen sizes and hardware changes.<br><br>If you have any feedback or questions, we’d love to hear from you! The Omni Group offers free tech support; you can email omnioutliner@omnigroup.com, call 1–800–315–6664 or 1–206–523–4152, or tweet @OmniOutliner.<br><br>If OmniOutliner empowers you, we would appreciate an App Store review. Your review will help other people find OmniOutliner and make them more productive too."},{"version_id":"830757754","version_name":"3.3.3","version_date":"2019-04-01 17:06:13.000 +0800","version_description":"• Siri Shortcuts: Siri shortcuts are now localized.<br>• Section List: Fixed cases where deleting rows would not immediately remove them from the Section List leading to a crash.<br>• Inspector: The column format control is hidden for the Note column as changing the type is not supported.<br>• Stability: Potential fix for a crash involving OmniOutliner files saved in nested folders syncing via OmniPresence.  <br>• Stability: Sections can be quickly collapsed and expanded in succession with a keyboard without crashing.<br>• Stability: Custom Duration column configurations can be reselected without crashing.<br>• Stability: Dropping text into the Document Picker no longer crashes.<br>• Stability: Creation of multiple columns via a paste can be undone without crashing.<br>• Stability: A sorted column can be converted to a different type and immediately edited without crashing.<br>• Stability: Fixed a crash on iPhones or compact split screen mode when interacting with the Inspector immediately after applying a theme.<br>• Stability: The save sheet for converting an .oo3 file to the .ooutline format can be cancelled without crashing.<br>• Stability: Fixed a potential crash when applying a filter after having modified content to no longer match the filter criteria.<br><br>If you have any feedback or questions, we’d love to hear from you! The Omni Group offers free tech support; you can email omnioutliner@omnigroup.com, call 1–800–315–6664 or 1–206–523–4152, or tweet @OmniOutliner.<br><br>If OmniOutliner empowers you, we would appreciate an App Store review. Your review will help other people find OmniOutliner and make them more productive too."},{"version_id":"831793679","version_name":"3.3.4","version_date":"2019-07-22 17:54:28.000 +0800","version_description":"Fixed a crash when OmniOutliner launched on a device running iOS 13.<br><br>If you have any feedback or questions, we’d love to hear from you! The Omni Group offers free tech support; you can email omnioutliner@omnigroup.com, call 1–800–315–6664 or 1–206–523–4152, or tweet @OmniOutliner.<br><br>If OmniOutliner empowers you, we would appreciate an App Store review. Your review will help other people find OmniOutliner and make them more productive too."},{"version_id":"832814848","version_name":"3.3.5","version_date":"2019-09-19 17:23:49.000 +0800","version_description":"• Text Editing: Text insertion pointer can be moved via touch gestures on iOS 13.<br>• Text Editing: Rows grow in height when text wraps to a new line on iOS 13.<br>• General: Improves general file compatibility with iOS 13.<br><br>If you have any feedback or questions, we’d love to hear from you! The Omni Group offers free tech support; you can email omnioutliner@omnigroup.com, call 1–800–315–6664 or 1–206–523–4152, or tweet @OmniOutliner.<br><br>If OmniOutliner empowers you, we would appreciate an App Store review. Your review will help other people find OmniOutliner and make them more productive too."},{"version_id":"833728682","version_name":"3.4.2","version_date":"2019-11-25 21:10:09.000 +0800","version_description":"• Print: Files without attachments can be printed.<br>• PDF Export: Files without attachments can be exported to PDF.<br><br>If you have any feedback or questions, we’d love to hear from you! The Omni Group offers free tech support; you can email omnioutliner@omnigroup.com, call 1–800–315–6664 or 1–206–523–4152, or tweet @OmniOutliner.<br><br>If OmniOutliner empowers you, we would appreciate an App Store review. Your review will help other people find OmniOutliner and make them more productive too."},{"version_id":"833911339","version_name":"3.4.3","version_date":"2019-12-12 20:52:24.000 +0800","version_description":"• Localizations: The localized reference manuals have been updated for v3.4.<br>• Siri Shortcuts: Restored the Siri Shortcuts for opening documents.<br>• Unlocking: Fixed a bug where the + button would not show the template picker if that button was tapped while in Free Reader mode before unlocking the app with the trial, or Essentials, or Pro.<br>• Free Reader Mode: When in Free Reader mode, tapping the + button to create a new document will open in the in-app purchase window.<br><br>If you have any feedback or questions, we’d love to hear from you! The Omni Group offers free tech support; you can email omnioutliner@omnigroup.com, call 1–800–315–6664 or 1–206–523–4152, or tweet @OmniOutliner.<br><br>If OmniOutliner empowers you, we would appreciate an App Store review. Your review will help other people find OmniOutliner and make them more productive too."},{"version_id":"834485260","version_name":"3.4.4","version_date":"2020-01-29 00:42:11.000 +0800","version_description":"• Data Corruption: Changed how LinkBack data is stored to avoid corruption on save when running iOS 13. This does not fix files already corrupted by the bug, which presents itself with error details that start with \"Error Domain=NSCocoaErrorDomain Code=3840 \"Unexpected character...\". Our Support team is available at omnioutliner@omnigroup.com or by phone Mon - Fri, 10am - 5pm Pacific at 1 (206) 523-4152 to help you recover your files.<br><br>If you have any feedback or questions, we’d love to hear from you! The Omni Group offers free tech support; you can email omnioutliner@omnigroup.com, call 1–800–315–6664 or 1–206–523–4152, or tweet @OmniOutliner.<br><br>If OmniOutliner empowers you, we would appreciate an App Store review. Your review will help other people find OmniOutliner and make them more productive too."},{"version_id":"834556062","version_name":"3.4.5","version_date":"2020-02-05 23:17:30.000 +0800","version_description":"• Fixed a crash with tapping on the OmniPresence toolbar button when the local OmniPresence folder can not be located.<br><br>Changes in 3.4.4:<br>• Data Corruption: Changed how LinkBack data is stored to avoid corruption on save when running iOS 13. This does not fix files already corrupted by the bug, which presents itself with error details that start with \"Error Domain=NSCocoaErrorDomain Code=3840 \"Unexpected character...\". Our Support team is available at omnioutliner@omnigroup.com or by phone Mon - Fri, 10am - 5pm Pacific at 1 (206) 523-4152 to help you recover your files.<br><br>If you have any feedback or questions, we’d love to hear from you! The Omni Group offers free tech support; you can email omnioutliner@omnigroup.com, call 1–800–315–6664 or 1–206–523–4152, or tweet @OmniOutliner.<br><br>If OmniOutliner empowers you, we would appreciate an App Store review. Your review will help other people find OmniOutliner and make them more productive too."},{"version_id":"834710817","version_name":"3.4.6","version_date":"2020-02-26 20:30:38.000 +0800","version_description":"• Batch Find: The selected row from a Batch Find search, when on an iPhone or used in equivalent compact mode on iPad, does not end up with a bad editor state.<br><br>If you have any feedback or questions, we’d love to hear from you! The Omni Group offers free tech support; you can email omnioutliner@omnigroup.com, call 1–800–315–6664 or 1–206–523–4152, or tweet @OmniOutliner.<br><br>If OmniOutliner empowers you, we would appreciate an App Store review. Your review will help other people find OmniOutliner and make them more productive too."},{"version_id":"835153400","version_name":"3.5","version_date":"2020-03-18 18:26:21.000 +0800","version_description":"• Licensing: Site licensing and team subscriptions are now available for OmniOutliner. Please contact sales@omnigroup.com if you are interested in learning more about the available licensing options.<br>• Linked Resource Folders: Give OmniOutliner permission to folders stored locally or in iCloud Drive to access your templates saved within them. Compatible file providers such as Working Copy can be used as well! Select the Configure Resource Locations option in Settings to add folders.<br>• Intro Video: The intro video no longer references starting the trial, since some people will be watching that video after having already purchased the app.<br>• URL Scheme: Made some future-proofing improvements to OmniOutliner's URL scheme<br>• Unfocus: When unfocusing, OmniOutliner will restore the current scroll position.<br>• OPML: Fixed an issue where OPML files wouldn't open when CarbonFin Outliner was set to be the default app for those files.<br><br>If you have any feedback or questions, we’d love to hear from you! The Omni Group offers free tech support; you can email omnioutliner@omnigroup.com, call 1–800–315–6664 or 1–206–523–4152, or tweet @OmniOutliner.<br><br>If OmniOutliner empowers you, we would appreciate an App Store review. Your review will help other people find OmniOutliner and make them more productive too."},{"version_id":"837740998","version_name":"3.6","version_date":"2020-09-16 22:53:39.000 +0800","version_description":"• Unified Trials: We’ve unified trials in OmniOutliner 3.6 to use a single, simple approach: you sign up for a trial, it lasts for two weeks, and then it ends without charging you.<br>• Omni Automation [PRO]: OmniOutliner now recognizes simple plug-ins that use the `.omnioutlinerjs` file extension.<br>• Keyboard Shortcuts: Fixed multiple instances of keyboard shortcuts failing to work after taking such actions as Focusing, Filtering, and switching apps.<br>• Templates: Templates are immediately visible and usable when synced to the device.<br>• File Previews: OmniOutliner file previews are more reliably shown in the file picker.<br>• Permissions: When running a beta OS, OmniOutliner will only ask for local network permissions when an OmniPresence account is configured. This access is used for notifying OmniOutliner on other iOS &amp; iPadOS devices and OmniPresence on the Mac when there are changes to download.<br><br>If you have any feedback or questions, we’d love to hear from you! The Omni Group offers free tech support; you can email omnioutliner@omnigroup.com, call 1–800–315–6664 or 1–206–523–4152, or tweet @OmniOutliner.<br><br>If OmniOutliner empowers you, we would appreciate an App Store review. Your review will help other people find OmniOutliner and make them more productive too."}]