[{"version_id":"820823794","version_name":"1.1.2","version_date":"2017-02-06 20:06:22.000 +0800","version_description":"- Now you can expand album/artist summary if it's too long to display<br>- Huge improvement on startup time, it now scans really fast even if you have a massive music library<br>- Fix minor animation glitches and flickers, animations never looked better before<br><br>If you like Eavescrob or you have any suggestions, please consider writing a review and it'll keep me making this app better. Feel free to contact me if you have any questions."},{"version_id":"822846181","version_name":"2.0.0","version_date":"2017-07-11 17:33:47.000 +0800","version_description":"# BIG UPDATE #<br>Introducing Eavescrob 2.0:<br><br># Discover Music<br>- Now you can view similar songs and artists<br>- Top songs and albums are available for artists now<br>- Click a tag to see its top songs, albums and artists<br>- Added shortcut to see your weekly listening report on Last.fm<br><br># Connect with Friends<br>- Tap on your avatar to see what your friends have been listening to<br>- Use the iMessage extension to share your recent scrobbles and see your friend's recent activities<br><br># Apple Watch Support<br>- It's even more awesome to view your listening history, upload scrobbles and love your now-playing song on your wrist<br><br># Enhanced Widget<br>- Now you can see, love and unlove your current playing song directly from Today Widget<br><br># Background Scrobbling<br>- Enable 'Auto Scrobble' in 'More' to get your pending scrobbles uploaded as soon as possible<br>- Auto scrobbling happens every time you open Eavescrob on your phone or watch, or when a Background App Refresh was triggered by the system<br><br>If you like Eavescrob or you have any suggestions, please consider writing a review and it'll keep me making this app better. Feel free to contact me if you have any questions."},{"version_id":"824405557","version_name":"2.0.1","version_date":"2017-11-14 23:39:05.000 +0800","version_description":"- Fully compatible with iPhone X and iOS 11<br>- Minor improvements and animation refinements<br><br>More features are coming in the next update.<br>If you like Eavescrob or you have any suggestions, please consider writing a review and it'll keep me making this app better. Feel free to contact me if you have any questions."},{"version_id":"829587200","version_name":"2.1.0","version_date":"2018-12-12 18:41:01.000 +0800","version_description":"- Background scrobbling is now separate from auto scrobbling<br>- Watch app now shows pending count, use force touch to upload pending scrobbles<br>- Improvements on today widget<br>- Scrobbling for podcasts can be enabled in the setting panel now<br>- Repeat count can be disabled in the setting panel now<br>- Support for the latest iPhone models<br>- Bugfixes and stability improvements<br><br>New features are coming in the next update.<br>If you like Eavescrob or you have any suggestions, please consider writing a review and it'll keep me making this app better. Feel free to contact me if you have any questions."},{"version_id":"830560399","version_name":"2.1.1","version_date":"2019-03-11 15:17:40.000 +0800","version_description":"- fix for incorrect user play count and loved status"}]