[{"version_id":"821835386","version_name":"1.0","version_date":"2017-04-27 03:48:35.000 +0800","version_description":""},{"version_id":"821955086","version_name":"1.0.1","version_date":"2017-05-11 07:32:01.000 +0800","version_description":"NEW FEATURES AND IMPROVEMENTS:<br>- Added support for base64 image data input when using x-callback-url.<br>- The scene description button (when VoiceOver is ON, in camera screen) now has a short label for easier discovery.<br>- For VoiceOver users, the volume down (physical) button now triggers scene description while volume up button triggers shooting.<br>- Added support for VoiceOver two-finger scrub gesture (Z shaped gesture) to go back to the camera screen.<br><br>BUG FIXES:<br>- Fixed a bug that could prevent the app from using system language as default OCR language and that would use English instead.<br>- Fixed a bug that could decrease the OCR accuracy when the camera stabilization was on.<br>- Addressed an issue that could cause x-callback-url to fail, including clipboard input."},{"version_id":"822263256","version_name":"1.0.2","version_date":"2017-05-24 14:36:59.000 +0800","version_description":"Fixed a crash that could occur when entering application settings."},{"version_id":"822852236","version_name":"1.0.3","version_date":"2017-07-13 07:43:54.000 +0800","version_description":"Fixed issues when editing recognized text for an upcoming version of iOS."},{"version_id":"823377541","version_name":"1.1","version_date":"2017-09-19 09:24:49.000 +0800","version_description":"NEW FEATURES<br><br>- Optimized for iOS 11.<br>- Added support for iOS 11 Drag and Drop on iPad<br>- Importing / processing a picture: Drop a picture into Prizmo Go to recognize the text in it.<br>- Exporting text: recognized text can be exported to another app by dragging highlighted text directly from the picture or alternatively by dragging from the \"Copy\" button in the toolbar.<br><br><br>ENHANCEMENTS<br><br>- Added Greek localization.<br>- Fixed a bug that could cause the spoken word highlighting to be incorrectly displayed when reading the text aloud.<br><br><br>WORKFLOW<br><br>Prizmo Go supports iOS 11 Drag &amp; Drop both for processing the dropped image and to export recognized text to other apps on iPad."},{"version_id":"823800668","version_name":"1.1.1","version_date":"2017-10-02 12:15:11.000 +0800","version_description":"iOS 11-related bug fixes."},{"version_id":"823953066","version_name":"1.1.2","version_date":"2017-10-10 08:27:21.000 +0800","version_description":"Fixed a bug that would crash the app at launch on 32-bit devices."},{"version_id":"824228583","version_name":"1.2","version_date":"2017-11-03 08:28:59.000 +0800","version_description":"Updated to support iPhone X."},{"version_id":"826026943","version_name":"2.0","version_date":"2018-02-22 07:29:25.000 +0800","version_description":"Prizmo Go 2.0 brings handwriting recognition (English only), translation to 59 languages, and a new, more powerful, built-in neural network-based OCR in more languages."},{"version_id":"826110193","version_name":"2.2.2","version_date":"2019-01-15 08:40:54.000 +0800","version_description":"iOS 12-related bug fixes."},{"version_id":"826110193","version_name":"2.0.1","version_date":"2018-02-27 14:07:45.000 +0800","version_description":"- Fixed a bug that could reset user changes in the recognized text.<br>- Improved localization for a number of languages.<br><br>Prizmo Go 2.0 brings handwriting recognition (English only), translation to/from 41 languages, and a new, more powerful, built-in neural network-based OCR in more languages."},{"version_id":"826404382","version_name":"2.0.2","version_date":"2018-03-26 13:23:49.000 +0800","version_description":"Fixed a display issue in the In-app purchase view."},{"version_id":"826916572","version_name":"2.0.3","version_date":"2018-05-07 10:23:11.000 +0800","version_description":"- Complete Greek localization (thank you Irene and co.).<br>- Fixed a bug that could prevent the overlay indicating the text detection orientation to be displayed over the camera preview after the first shoot.<br>- Fixed a bug where the detected text highlighting over the camera preview could stay visible when Voice Over was activated.<br>- Improved OCR document layout determination (text blocks)."},{"version_id":"827546748","version_name":"2.0.4","version_date":"2018-06-21 10:38:47.000 +0800","version_description":"- Export of whole text (long press on share button) now offers the same layout as when manual text selection is used.<br>- Fixed a bug that caused handwriting text recognition to fail in some cases due to a network error.<br>- Fixed a bug where pictures could be saved in the photos library with a wrong orientation.<br>- Updated the crash reports framework."},{"version_id":"827991927","version_name":"2.0.5","version_date":"2018-07-31 07:36:51.000 +0800","version_description":"- Updated translation integration for future proofing.<br>- Optimization &amp; bug fixes."},{"version_id":"828700391","version_name":"2.1","version_date":"2018-10-04 12:39:47.000 +0800","version_description":"iOS 12 FEATURES<br>- Prizmo Go now features Siri Shortcuts integration. You can trigger Prizmo Go actions using Siri, namely text copying to clipboard, text readout, and text translation: \"Hey Siri, translate this text\"<br>- Minor fixes and enhancements for iOS 12.<br>- Updated for new iPhone sizes (including iPhone XS Max and more).<br><br>OTHER<br>- Prizmo Go now features a simplified purchase model. Cloud OCR units can't be purchased anymore, Cloud OCR (plus translation) is now only available as part of the Premium Plan subscription. Cloud OCR units that have been purchased previously remain valid until consumed. <br>- Free trial for Cloud OCR is now more easily accessed. It is available within the app, and will let you assess Cloud OCR performance with ten complimentary invocations."},{"version_id":"828823264","version_name":"2.1.1","version_date":"2018-10-04 18:01:22.000 +0800","version_description":"iOS 12 FEATURES<br>- Prizmo Go now features Siri Shortcuts integration. You can trigger Prizmo Go actions using Siri, namely text copying to clipboard, text readout, and text translation: \"Hey Siri, translate this text\"<br>- Minor fixes and enhancements for iOS 12.<br>- Updated for new iPhone sizes (including iPhone XS Max and more).<br><br>OTHER<br>- Prizmo Go now features a simplified purchase model. Cloud OCR units can't be purchased anymore, Cloud OCR (plus translation) is now only available as part of the Premium Plan subscription. Cloud OCR units that have been purchased previously remain valid until consumed. <br>- Free trial for Cloud OCR is now more easily accessed. It is available within the app, and will let you assess Cloud OCR performance with ten complimentary invocations."},{"version_id":"829425845","version_name":"2.2","version_date":"2018-12-10 13:38:13.000 +0800","version_description":"Updated for the new iPad Pro<br>- Handling of new iPad Pro display sizes (11\" and 12.9\")"},{"version_id":"829843115","version_name":"2.2.1","version_date":"2019-01-10 09:16:46.000 +0800","version_description":"iOS 12-related bug fixes."},{"version_id":"829922804","version_name":"2.2.2","version_date":"2019-01-15 08:40:54.000 +0800","version_description":"iOS 12-related bug fixes."},{"version_id":"833009903","version_name":"3.0","version_date":"2019-10-08 08:15:59.000 +0800","version_description":"# Optimized for iOS 13, and more.<br>Prizmo Go 3.0 is fully optimized for iOS 13. Dark Mode is supported, and Prizmo Go also provides a new icon theme based on iOS 13 SF Symbols. Other iOS 13 features include support for highly accurate Apple OCR, Shortcuts Actions (Shortcuts app), Core ML-based document orientation detection, and the new iOS 13 Voice Control feature. Finally, Prizmo Go 3.0 also features specific processing for curved text.<br><br># Curved Text Recognition<br>Prizmo Go now provides curved text recognition. Text from curved book or magazine pages receives specific processing both for improved OCR accuracy and superior finger-based text selection directly on the image. Text overlay now gently osculates curved contents.<br><br># Dark Mode and SF Symbols (iOS 13)<br>Prizmo Go got a facelift to support the new Dark Mode of iOS 13, and to be coherent with iOS 13 new visual language with updated SF Symbols-compliant user interface.<br><br># Shortcuts Action (iOS 13)<br>Prizmo Go now features a Shortcuts Action with input parameters to recognize the text of an input image. To use the action in Shortcuts app, connect \"Wait to return\" and \"Get clipboard\" blocks after Prizmo Go's action. Clipboard is used as a workaround to iOS extension memory constraint. Prizmo Go's X-Callback-URL API remains available in addition to this Shortcuts Action.<br><br># Apple OCR (iOS 13)<br>Prizmo Go 3.0 brings support for Apple OCR (iOS 13 required). You can enable Apple OCR from Prizmo Go ’s OCR settings (Settings ▸ Use Apple OCR), and it will be used when English on-device OCR is picked from the list. Apple OCR brings improved accuracy in most situations. Apple OCR is available without limitations to both Export Pack owners and Premium Plan subscribers.<br><br># New Languages with On-device OCR<br>Five new languages are supported by the on-device OCR (previously only supported by the Cloud OCR): Arabic, Chinese (Simplified), Chinese (Traditional), Hebrew, and Japanese.<br><br># Orientation Detection with Machine Learning / Core ML<br>Prizmo Go has been trained to recognize the document orientation when taking a picture ( Latin alphabet only at this time). It means that if you take a picture of a text that has been rotated (left, right, or upside down), Prizmo Go will automatically restore the appropriate orientation. To activate this feature, tap the Compass button in the camera view.<br><br># Accessibility (iOS 13)<br>Support for new accessibility feature: Voice Control."},{"version_id":"833107457","version_name":"3.0.1","version_date":"2020-01-20 08:27:46.000 +0800","version_description":"- Improved x-callback-url and Shortcuts Action handling by allowing to re-take the picture before returning to the calling application.<br>- added Capture Chime preference to enable/disable capture sounds (Settings ▸ Camera ▸ Capture Chime).<br>- Fixed a bug where the camera preview could stop working in some situations.<br>- Fixed glitches in the user interface for right-to-left languages."},{"version_id":"836260398","version_name":"3.0.2","version_date":"2020-06-11 07:32:04.000 +0800","version_description":"• Modernization for latest OS &amp; bug fixes"},{"version_id":"838299037","version_name":"3.0.3","version_date":"2020-10-23 07:55:56.000 +0800","version_description":"- Added support for new iPhone (late 2020) screen sizes.<br>- Fixed a start-up crash that could occur in specific app installation situations."},{"version_id":"838383532","version_name":"3.0.4","version_date":"2020-10-27 16:59:48.000 +0800","version_description":"Fixed an imaging subsystem crash that could randomly occur while shooting or editing."},{"version_id":"838502671","version_name":"3.0.5","version_date":"2020-11-05 15:26:15.000 +0800","version_description":"- Improved handling of user privacy with support for photo albums security constraints of iOS 14.<br>- Fixed a bug where selecting a picture in Photos picker could fail on iOS 14."},{"version_id":"840370664","version_name":"3.1","version_date":"2021-02-08 11:27:30.000 +0800","version_description":"Prizmo Go 3.1 is an important update that improves OCR processing.<br><br>- Apple OCR is now the default on-device OCR when the requested language is available. Apple OCR provides superior accuracy &amp; performance on latest generation iPhone and iPad with machine learning capabilities.<br>- Apple OCR is updated to take advantage of iOS 14 latest OCR advances: better accuracy and language support beyond English now totalling 8 languages (English, Simplified &amp; Traditional Chinese, French, German, Italian, Portuguese, Spanish). Other languages (28 in total) are still processed with the alternative high-performance on-device OCR with machine learning.<br>- OCR selection is now exposed in \"Settings &gt; Advanced OCR Selection\" and lets the user control which OCR engine is chosen when multiple options exist. This setting provides additional control for specific situations.<br>- Cloud OCR has been upgraded for better text recognition accuracy, both for print &amp; handwriting."},{"version_id":"840797047","version_name":"3.1.1","version_date":"2021-03-11 08:08:08.000 +0800","version_description":"Updated some missing localizations in various languages."},{"version_id":"840941312","version_name":"3.1.2","version_date":"2021-03-18 08:26:54.000 +0800","version_description":"Fixed a crash at app launch on iOS 12."}]