[{"version_id":"824069083","version_name":"3.11.4","version_date":"2017-10-19 01:54:45.000 +0800","version_description":"• Cleaner look to the map. Introducing clusters on map view, zooming out will produce clusters of people on the map, zoom in again to see the individual profiles.<br>• Bug fixes and performance improvements."},{"version_id":"825148777","version_name":"3.21","version_date":"2019-10-31 22:54:13.000 +0800","version_description":"• The 'Too Hot' image (flame icon) indicates that a person has photos that are not suitable for the app and are not viewable on the app.<br>• Bug fixes and performance improvements"},{"version_id":"825148777","version_name":"3.20","version_date":"2019-08-28 18:06:48.000 +0800","version_description":"• We've made a couple of fields mandatory to help guys find you when they're searching for Mr. Right.<br>• We've fixed a bug where users could not see a private photo but could still like it."},{"version_id":"825148777","version_name":"3.19","version_date":"2019-05-15 09:05:38.000 +0800","version_description":"• Full-screen profile photos are now available. Upload a new photo and show yourself off.<br>• We've made some updates to the code to load the grid and photos faster."},{"version_id":"825148777","version_name":"3.11.5","version_date":"2017-12-02 18:13:05.000 +0800","version_description":"Thank you for using GuySpy! Here’s what you will find in this new version:<br>• Using the Hide My Location feature will remove your profile from the map. You'll still show up in the grid of guys, but users will no longer be able to see your exact location. If you wish to share your location privately simply send it via a private chat message.<br>• To improve your experience using GuySpy, we have implemented email address verification for new and existing members. <br>• We have fixed Travel Mode so you'll see the correct guys displayed in the location you've chosen.   <br>• Bug fixes and performance improvements."},{"version_id":"826124615","version_name":"3.12","version_date":"2018-02-28 17:35:29.000 +0800","version_description":"We constantly update the app to make it better and faster for you! Get the latest version for all available features and improvements. Thanks for using GuySpy!"},{"version_id":"826318453","version_name":"3.13","version_date":"2018-03-15 21:04:30.000 +0800","version_description":"We constantly update the app to make it better and faster for you! Get the latest version for all available features and improvements. Thanks for using GuySpy!"},{"version_id":"827678981","version_name":"3.15","version_date":"2018-06-27 16:44:26.000 +0800","version_description":"• Introducing Private Photos - Now you can have up to 5 private and 5 public photos.<br>• New Notifications make it easier to connect with more guys - Get notified when someone gives you access to their private photos, your buddy comes online, someone likes your photos, someone sends you a buddy request and when your favorites come online."},{"version_id":"828021541","version_name":"3.16","version_date":"2018-08-01 15:48:00.000 +0800","version_description":"• New Notifications make it easier to connect with guys. Get notified when someone gives you access to their private photos; your buddy comes online; someone likes your photos; someone sends you a buddy request and when your favorites come online.<br>• Bug fixes and performance improvements."},{"version_id":"828941567","version_name":"3.17","version_date":"2018-10-18 15:19:01.000 +0800","version_description":"We constantly update the app to make it better and faster for you! Get the latest version for all available features and improvements. Thanks for using GuySpy!"},{"version_id":"830193796","version_name":"3.18","version_date":"2019-02-27 20:14:42.000 +0800","version_description":"With the map feature open to privacy concerns, particularly from our users in smaller communities, we've taken the decision to remove the map function from our app. We've also fixed searching by location."}]