[{"version_id":"820906468","version_name":"0.9.0","version_date":"2017-07-01 12:06:31.000 +0800","version_description":""},{"version_id":"823381876","version_name":"0.9.6","version_date":"2017-08-25 06:09:35.000 +0800","version_description":"NEW WEAPONS – Pick up a powerful shotgun &amp; burn enemies with a flamethrower<br>GAMEPLAY BALANCE – More challenging missions. Don't let your guard down!<br>NEW INTERFACE DESIGN –  new galaxy map &amp; redesigned menus<br>NEW TITLE – Space Pioneer. (Previously known as Outer Pioneer)<br>BUGS FIXES &amp; IMPROVEMENTS – we continue to improve the game<br><br>Got feedback? We’re happy to hear from you: support@vividgames.com"},{"version_id":"824297055","version_name":"0.9.11","version_date":"2017-11-09 14:08:41.000 +0800","version_description":"BASE BUILDING - Build your own space base and upgrade your buildings to get special bonuses.<br>BASE DEFENSE - Aliens want to destroy your shiny new base! Set up defenses and kick them out.<br>NEW ARMORS - With your new armory comes new perks: get the shiniest space suits in the galaxy.<br>NEW ROBOT - The robot factory allows you to customize your robot companion. He loves it.<br>GAMEPLAY BALANCE - We're listening to feedback and improving the game.<br><br>Got feedback? We’re happy to hear from you: support@vividgames.com"},{"version_id":"826577248","version_name":"0.9.29","version_date":"2018-04-27 09:13:44.000 +0800","version_description":"HORDE MODE - Grab your gear and stand against waves of aliens for unique rewards<br>NEW SKILLS TREE - We’ve redesigned the skills and weapons system to make it clearer<br>STRONGER UPGRADE SYSTEM - Each upgrade now makes you significantly stronger<br>REDESIGNED MISSIONS - Now with additional story, polish, hand-crafted maps...<br>REBALANCED MISSIONS REWARDS - You now get more rewards from tougher missions<br>Got feedback? We’re happy to hear from you: support@vividgames.com"},{"version_id":"827208485","version_name":"1.0.0","version_date":"2018-05-26 14:48:42.000 +0800","version_description":"(ALMOST) UNIVERSAL TRANSLATOR - Space Pioneer is now available in 15 languages.<br> BETTER SOUNDS - We upgraded our sound effects to better render the silence of space.<br> BETTER SETTINGS - Our new options screen contains even more buttons than before!<br> PERFORMANCE UPGRADES - Our engineers have rebalanced the game by hitting it very hard with a wrench. It will run better now.<br> Got feedback? We’re happy to hear from you: support@vividgames.com"},{"version_id":"827354128","version_name":"1.0.1","version_date":"2018-05-30 20:50:15.000 +0800","version_description":"(ALMOST) UNIVERSAL TRANSLATOR - Space Pioneer is now available in 15 languages.<br>BETTER SOUNDS - We upgraded our sound effects to better render the silence of space.<br>BETTER SETTINGS - Our new options screen contains even more buttons than before!<br>PERFORMANCE UPGRADES - Our engineers have rebalanced the game by hitting it very hard with a wrench. It will run better now.<br>Got feedback? We’re happy to hear from you: support@vividgames.com"},{"version_id":"827755328","version_name":"1.0.5","version_date":"2018-07-11 10:07:11.000 +0800","version_description":"Alien activity has increased in the sector. All Space Pioneer personnel is authorized for use of new equipment:<br>NEW GEAR - Freezing Grenades, Laser Turrets and Stimpacks will help you slow down and control the hordes.<br>NEW WEAPONS - Plasma Emitter, Pulse Carabine, Ray Gun, Energy Shotgun will provide additional firepower and new strategies.<br>PERFORMANCE UPGRADES - Our engineering department has improved our communication network, it will now run smoother.<br>Got feedback? We’re happy to hear from you: support@vividgames.com"},{"version_id":"828004594","version_name":"1.1.0","version_date":"2018-08-01 10:49:27.000 +0800","version_description":"To all pioneers: in order to encourage alien extermination, the federation has graciously decided to organise MULTIPLAYER competitions. Starting today, your horde mode performances will be timed against others’. The galaxy’s finest will be rewarded with extravagant prizes, as well as the privilege to prove their superiority.<br>In addition, seasonal ranks have been introduced. Pioneers who reach high ranks will be given access to powerful new pieces of equipment, such as the coin-grabbing DRONE, a strategic DECOY or the incredibly powerful FLYING DISK."},{"version_id":"828348518","version_name":"1.2.0","version_date":"2018-08-27 07:50:08.000 +0800","version_description":"To all pioneers: the Federation has introduced a brand new TROPHY ROOM to celebrate your alien hunting achievements, with UNIQUE REWARDS. <br>Each time you reach a trophy objective, the corresponding trophy will be unlocked in your private trophy room and a reward will be available. Be warned, the rare gold trophies are quite challenging to obtain."},{"version_id":"828679459","version_name":"1.3.0","version_date":"2018-10-07 09:19:20.000 +0800","version_description":"This is an emergency broadcast: Xeldar is launching a counter-attack with his NEW BOSSES. The lightning-fast Cosmofrog, the explosive Bomber and the freezing Rhino have been sighted on several planets. These monsters are stronger than anything you have faced before, so you will need to use new strategies. Pioneers, you must defeat these new threats. The universe is counting on you."},{"version_id":"829061081","version_name":"1.4.0","version_date":"2018-10-27 13:19:10.000 +0800","version_description":"Pioneers, the new solo campaign is live. Explore the new chapters, defeat the bosses and go kick Xeldar’s butt once and for all. Other features include:<br>- A brand new type of planet, with golems, dragon and other dangerous enemies<br>- A new, chapter-based galaxy map for easier navigation<br>- A new mode: after you’re done with the campaign, go try the endless mode for more planets to explore."},{"version_id":"829119753","version_name":"1.4.1","version_date":"2018-10-31 18:40:12.000 +0800","version_description":"Gather round pioneers, it’s time for a story: dive into a new solo campaign with chapters and finally defeat Xeldar for good. Explore the lava planets filled with new monsters such as golems, dragons and salamanders. And once you’re done saving the universe, go try the endless mode for even more exploration.<br>In addition, we cleaned up and did some bugfixing so you can do some alienfixing."},{"version_id":"829403681","version_name":"1.5.0","version_date":"2018-11-28 11:30:04.000 +0800","version_description":"Being a pioneer comes with its perks, like free stuff. From now on, all you have to do is show up and you can get your FREE daily login bonus. Also new: daily challenges - these are limited time contracts with specific conditions and rewards such as a shiny space sword and a less shiny space HAMMER!<br>Finally we’ve rebalanced the tournaments - now you’ll be put in groups with people of your level."},{"version_id":"829449948","version_name":"1.5.1","version_date":"2018-11-29 15:40:53.000 +0800","version_description":"Being a pioneer comes with its perks: from now on, show up daily and you can get your FREE login bonus. Also new: daily challenges - limited time contracts with specific conditions and rewards such as a shiny space sword and a less shiny space HAMMER!<br>Finally, we located and “fixed” a bunch of bugs. With lasers and grave prejudice. - Your local galactic federation, working to keep space bug-free."},{"version_id":"829619583","version_name":"1.10.4","version_date":"2019-09-12 07:48:55.000 +0800","version_description":"The Federation was recently informed that some pioneers were experiencing data loss related to connecting and disconnecting their game with their Facebook account. This anomaly is now fixed, your accounts are safe."},{"version_id":"829619583","version_name":"1.8.1","version_date":"2019-03-25 08:09:12.000 +0800","version_description":"We have beefed the multiplayer features - they now contain more ranks and special rewards:<br>- Play as brand new CLASSES: Heavy the impervious tank, and Light, the swift glass canon.<br>- Asynchronous CO-OP MULTIPLAYER. Team up with other pioneers to defend your space base against endless hordes.<br>- If you think coop is lame, then go duke it out FREE-FOR-ALL DEATHMATCH mode!"},{"version_id":"829619583","version_name":"1.6.0","version_date":"2018-12-19 07:45:57.000 +0800","version_description":"As is Federation tradition at this time of year, we will provide you with special treats. A new Winter Event is now playable and a brand new calendar will be distributed. The max level of your space base buildings has been raised and the chest factory has been unlocked: in it you can craft chests using crystals. And don’t forget to go get our latest weapon: the Tiger’s Roar and its sonic blast."},{"version_id":"830074144","version_name":"1.7.0","version_date":"2019-01-29 11:47:11.000 +0800","version_description":"Pioneers, mysterious buildings of a very advanced civilisation have been discovered. We need your support to push the alien hordes back in this new event - join the fight!<br>Our engineers have already restored a prototype weapon found in these ruins: the Dragon’s Breath. A large supply of “fireworks” explosives was also discovered, you can use them as gear. They pack quite a punch, so be careful."}]