[{"version_id":"820956429","version_name":"1.0.0","version_date":"2017-04-24 11:04:10.000 +0800","version_description":""},{"version_id":"822286158","version_name":"1.1.0","version_date":"2017-05-29 10:52:16.000 +0800","version_description":"We’ve just released an update for our new iOS app! The version 1.1.0 is here. We decided to focus on the most critical issues such as app crashes and Google Sign-In issues. We’ve also reduced traffic consumption and battery drain. Never a bad thing, right? <br>We really appreciate all the feedback and excitement for the TradingView mobile app as. The upcoming releases will focus on further improvements such as app stability, app speed and new social features and functions.<br>Below is the complete list of fixes and improvements.<br>• Fixed an issue with Google Sign-In<br>• Fixed the new watchlist bug (app used to crash when a new watchlist was created)<br>• Fixed the watchlist symbol bug (app used to crash when a new symbol in a watchlist was selected)<br>• Fixed the new message bug (app used to crash when a new message was received)<br>• Fixed the way some links in chats were displayed<br>• Fixed the functionality of system messages<br>• Fixed the incorrect display of user reputation<br>• Fixed the background display issue in user profile picture<br>• Fixed the issue of sending chat messages with specific symbols<br>• Fixed the issue of incorrect selection of the current watchlist<br>• Added the feature to hide watchlists by touching outside the watchlist<br>• Reduced the consumption of traffic and device battery while working with watchlists"},{"version_id":"822459088","version_name":"1.2.0","version_date":"2017-06-27 16:26:44.000 +0800","version_description":"We made the app more stable - always a good thing, right? <br> <br>Below is the complete list of fixes and improvements.<br> <br>• Fixed a crash when sending and receiving screenshots simultaneously <br>• Fixed incorrect previews of charts and ideas<br>• Fixed issue with special symbols in messages<br>• Fixed chat scrolling issue (inability to scroll the chat to the end)<br>• Fixed incorrect timestamp for last received message<br>• Added an animation for chat updates<br>• Improved how the last chat message looks"},{"version_id":"822724461","version_name":"1.3.0","version_date":"2017-09-25 11:32:50.000 +0800","version_description":"Meet the new Ideas Section in the mobile app! You can now follow popular ideas on the go.<br><br>We’ve also improved functionality of watchlists and chats, and the app is now faster. And we are just getting started :) Stay tuned for more updates, we’ve got some great new features coming soon!"},{"version_id":"823895816","version_name":"1.3.1","version_date":"2017-10-05 11:29:54.000 +0800","version_description":"App stability improved."},{"version_id":"823920520","version_name":"1.3.2","version_date":"2017-10-09 11:08:43.000 +0800","version_description":"Fib Speed Resistance Fan drawing fixed."},{"version_id":"824364755","version_name":"1.3.3","version_date":"2018-01-16 15:13:06.000 +0800","version_description":"Fixed a number of bugs caused by iOS11."},{"version_id":"825759893","version_name":"1.3.4","version_date":"2018-01-24 21:40:29.000 +0800","version_description":"Fixed the chart symbol reset during an unstable internet connection."},{"version_id":"825812765","version_name":"1.5.0","version_date":"2018-04-12 14:43:59.000 +0800","version_description":"- Added the ideas stream.<br>- User profile design has been changed. You can now see the ideas published by the user.<br>- Tab icons were changed along with many other graphic elements.<br>- App icon as well as the loading screen has been updated.<br>- We updated the design of the symbol search filter. Icons for crypto assets were added.<br>- Minor graphical errors that used to appear during the log in and registration were fixed.<br>- Fixed an issue that was causing video ideas to be displayed incorrectly.<br>- Added the Lock all drawings feature that can be used while working with the chart.<br>- Fixed a number of issues that were making the app crash.<br>- Lots of minor fixes and improvements were implemented."},{"version_id":"825812765","version_name":"1.4.0","version_date":"2018-02-13 11:25:28.000 +0800","version_description":"Meet the new, even more perfect version of our app - still warm from the iOS development furnace. Drop it like it's HOT!<br><br>We worked tirelessly throughout the nights, and renewed the design of pretty much the whole thing. It's awesome and we are proud of the results that we were able to achieve. Especially our lead dev is still enchanted by the scrolling title at the top... we can't make him snap out of it... Oh well. Come check it out!<br><br>In addition to a redesign we made a bunch of fixes and improvements (spoiler alert - there are no alerts in this version).<br><br>- Fixed a number of bugs caused by iOS11. Dear Apple, our testers send their warmest greetings to your testers.<br>- Added support for iPhone X. We actually don't have one, so if you know someone who stood in line and loves the whole green line thing - let us know how everything looks please.<br>- Fixed crashes with watchlists and when losing the internet connection. At least we hope so.<br>- Fixed an issue with symbols not loading in watchlists from time to time. Dumb bug - we are ashamed, really. We punished the tester who let it slide - he got a sticker with sad puppy eyes.<br>- Added support for a new chart called Base Line. Before you couldn't switch to it, now you can. We are beyond amazing.<br>- Fixed a bug during which the Connection Error screen didn't go away when the connection appeared, and the spinner kept on spinnin'. Forever. You could listen to \"You Spin Me Round\" while watching, so that was kind of cool.<br>- Improved overall stability and fixed a bunch of other bugs. Of course, we also added new ones - gotta have something to do in the next version."},{"version_id":"825991427","version_name":"1.4.1","version_date":"2018-03-15 22:17:38.000 +0800","version_description":"Many thanks for your feedback as it helps us improve the app. We've redesigned the Watchlist - it fits more symbols now.<br>Incorrect price values in some symbols were fixed.<br>Custom intervals that are included in the web version are now correctly displayed in the app as well.<br>Fixed a number of issues that were causing app crashes when working with Watchlists and Ideas.<br>Some minor bugs were fixed and some minor improvements were made."},{"version_id":"826334195","version_name":"1.4.2","version_date":"2018-03-16 21:52:02.000 +0800","version_description":"Fixed application crash, caused by the screen rotation."},{"version_id":"826462926","version_name":"1.4.3","version_date":"2018-04-03 22:30:48.000 +0800","version_description":"Fixed the issue when it was difficult to open Settings through the Gear icon."},{"version_id":"826616840","version_name":"1.5.0","version_date":"2018-04-12 14:43:59.000 +0800","version_description":"- Added the ideas stream.<br>- User profile design has been changed. You can now see the ideas published by the user.<br>- Tab icons were changed along with many other graphic elements.<br>- App icon as well as the loading screen has been updated.<br>- We updated the design of the symbol search filter. Icons for crypto assets were added.<br>- Minor graphical errors that used to appear during the log in and registration were fixed.<br>- Fixed an issue that was causing video ideas to be displayed incorrectly.<br>- Added the Lock all drawings feature that can be used while working with the chart.<br>- Fixed a number of issues that were making the app crash.<br>- Lots of minor fixes and improvements were implemented."},{"version_id":"826721700","version_name":"2.0.0","version_date":"2018-05-13 21:00:53.000 +0800","version_description":"We’ve got some good news for you! Many of you have been waiting for this since the very beginning of our iOS app release. Your patience has been rewarded. TradingView natively supports iPad now!<br>All app features are available on the iPad now, but that’s just the beginning. We are going to develop and improve the tablet app in the future.<br>Your feedback is vitally important right now as it will help us find and fix issues in a timely manner.<br>Aside from the native iPad support this update also includes the following:<br>— Graphical fixes. We made sure that all elements are displayed correctly on the iPad.<br>— Fixed an issue with the incorrect display of the message input field on the chat screen.<br>— Fixed an issue that was causing the app to work incorrectly when deleting all watchlists.<br>— Added a warning message about possible obsolete data in the watchlist when rotating the app.<br>— Added the Education sign to the respective ideas.<br>— Fixed an issue with the size of the chart when changing the screen orientation.<br>— A number of other fixes and improvements have been implemented."},{"version_id":"827144267","version_name":"2.0.1","version_date":"2018-05-24 10:39:34.000 +0800","version_description":"— 重新设计了发送消息对话框。<br>— 更改了注册表格，以使其符合通用数据保护条例（GDPR）。<br>— 提升了app的整体稳定性。"},{"version_id":"827460552","version_name":"2.1.0","version_date":"2018-06-11 21:00:46.000 +0800","version_description":"引入横向浏览 - 现在比以往更容易使用 iPad app!<br>以下是我们所做的其他改进。<br>- 在浏览观点时，您现在可以享受无缝体验。向右/向左滑动即可切换观点。<br>- 价格变化现在显示为百分比和绝对数值。<br>- 改善app的整体稳定性。"},{"version_id":"827678831","version_name":"2.1.1","version_date":"2018-06-27 21:20:28.000 +0800","version_description":"- Fixed an issue that was preventing watchlist updates.<br>- Fixed a number of critical issues that were causing the app to crash.<br>- Lots of minor fixes and improvements were implemented."},{"version_id":"827797091","version_name":"2.2.0","version_date":"2018-07-11 17:07:11.000 +0800","version_description":"We are immensely grateful for all the feedback as it helps us to develop the app further and add more features. We've introduced the dark theme in our latest update, something that you guys have been asking for. Go ahead and give a try, we are sure that you'll like it!"},{"version_id":"827975262","version_name":"2.2.1","version_date":"2018-07-25 17:59:11.000 +0800","version_description":"- We improved the stability of the app when there is no internet connection.<br>- Fixed graphical issues that were happening during the screen orientation change.<br>- Fixed an issue that was causing the idea like counter to work incorrectly.<br>- Fixed a number of issues that were making the app crash.<br>- Other fixes and improvements were implemented."},{"version_id":"828161387","version_name":"2.2.2","version_date":"2018-08-16 12:23:39.000 +0800","version_description":"Thank you so much for your feedback! We analyze each and every review on a regular basis and are going to surprise you with some cool new features soon! In the meantime, take a look at the fixes and updates below.<br>-Theme color can be changed without logging in now<br>-In-app rating is now possible<br>-Fixed an issue that was causing the chart to work incorrectly when selecting wrong time interval"},{"version_id":"828305459","version_name":"2.3.0","version_date":"2018-10-09 10:58:19.000 +0800","version_description":"On behalf of the entire TradingView team we would like to express our appreciation to everyone for the feedback, help, and suggestions on how to improve the App, this is a huge contribution to our development!<br><br>We are happy to announce the new version of the App with Push notifications for alerts! We had plenty of requests to implement this specific feature and we hope that you guys will appreciate it.<br>While creating your alert, enable Notify on App and press OK to save your preference. You will receive a push notification on your phone when certain criteria are met. Note that you need to allow push notifications for the TradingView App. You can also continue receiving notifications via mail if you prefer the old-fashioned way. Looking forward for your feedback and stay tuned for more updates!"},{"version_id":"828997104","version_name":"2.7.3","version_date":"2019-07-10 16:59:59.000 +0800","version_description":"Improved overall stability - we fixed quite a few errors that were causing the app to crash as well many graphics &amp; UI issues."},{"version_id":"828997104","version_name":"2.7.7","version_date":"2019-09-19 19:49:38.000 +0800","version_description":"Overall stability of the app (including errors that were causing app to crash) was improved."},{"version_id":"828997104","version_name":"2.7.9","version_date":"2019-10-18 20:43:50.000 +0800","version_description":"Last but not least, we’ve changed the way charts are saved in the new version - last used chart is now saved on your device automatically regardless of what you opened on any other device."},{"version_id":"828997104","version_name":"2.7.2","version_date":"2019-05-22 23:34:42.000 +0800","version_description":"We update the app on a regular basis to make it better for you. Here’s what’s new:<br>- Fixed an issue with an incorrect display of market status when using a dark theme<br>- You can now double tap to like ideas<br>- App size has been reduced<br>- You can now pull to refresh your own and someone else’s profile<br>- Fixed a number of issues that were causing the app to crash"},{"version_id":"828997104","version_name":"2.5.3","version_date":"2018-12-20 16:33:10.000 +0800","version_description":"Get some holiday cheer with this update of the TradingView app! Grab some hot chocolate and try to spot a secret fun feature - you might get snowed in! Next update will be in 2019 - enjoy the holidays everyone!"},{"version_id":"828997104","version_name":"2.5.4","version_date":"2019-01-10 03:03:34.000 +0800","version_description":"We are out of snow which is why this feature is no longer available."},{"version_id":"828997104","version_name":"2.4.0","version_date":"2018-10-24 11:12:55.000 +0800","version_description":"The new version includes the following changes:<br>- You can now set alerts on the chart as well as undo or repeat an action<br>- We have improved the display of the idea list when the dark theme is enabled.<br>- Minor design changes. TradingView’s new blue color is now available in the iOS app.<br>- Fixed message related bugs in the chat. These were causing the app to crash and messages to disappear."},{"version_id":"829102046","version_name":"2.5.0","version_date":"2018-11-19 11:35:47.000 +0800","version_description":"We are happy to announce the latest update of the app. The following changes were made:<br>- Landscape mode is now available on all screens.<br>- Fixed an issue that was causing certain elements of the app to be displayed incorrectly during an incoming call.<br>- Fixed bugs and issues that were harming the UI or were causing the app to close."},{"version_id":"829405934","version_name":"2.5.1","version_date":"2018-11-29 10:47:44.000 +0800","version_description":"- Improved watchlists. You can sort them by various parameters now.<br>- Saved time frames were moved to a separate screen. We've made switching between time frames easier.<br>- Some minor improvements and fixes were made.<br>Love the app? Rate us then! Your feedback helps us improve!"},{"version_id":"829653697","version_name":"2.5.2","version_date":"2018-12-17 08:18:41.000 +0800","version_description":"- Overall stability has been improved. We've fixed a number of issues that were causing the app to crash.<br>- New drawing tools were added - Cross Line &amp; Date and Price Range.<br>- Fixed an issue that was making it impossible to select a drawing tool on the chart.<br>- Some additional improvements and fixes were made.<br><br>Love the app? Rate us then! Your feedback helps us improve!"},{"version_id":"829714270","version_name":"2.5.3","version_date":"2018-12-20 16:33:10.000 +0800","version_description":"Get some holiday cheer with this update of the TradingView app! Grab some hot chocolate and try to spot a secret fun feature - you might get snowed in! Next update will be in 2019 - enjoy the holidays everyone!"},{"version_id":"829895038","version_name":"2.5.4","version_date":"2019-01-10 03:03:34.000 +0800","version_description":"We are out of snow which is why this feature is no longer available."},{"version_id":"829947063","version_name":"2.6.0","version_date":"2019-01-31 17:28:40.000 +0800","version_description":"Here is what's new:<br>- New languages were added.<br>- Drawing tools can be hidden with a single button now.<br>We worked hard on these improvements and hope that you'll enjoy them. Thanks for choosing TradingView!"},{"version_id":"830168939","version_name":"2.6.1","version_date":"2019-02-04 08:58:21.000 +0800","version_description":"- some localisation fixes"},{"version_id":"830198409","version_name":"2.6.2","version_date":"2019-02-18 09:34:16.000 +0800","version_description":"Sometimes you just need to relax and chat with your family &amp; friends using WhatsApp. Our free TradingView stickers will add more fun to those conversations. Go ahead and check them out!"},{"version_id":"830470105","version_name":"2.6.3","version_date":"2019-03-09 10:42:01.000 +0800","version_description":"The latest update includes:<br>- Various stability improvements and bug fixes"},{"version_id":"830822527","version_name":"2.7.0","version_date":"2019-04-07 21:00:09.000 +0800","version_description":"We listen to your feedback and keep adding new features! You are now able to share your ideas &amp; follow ideas published by millions of traders from all over the world. Here what's new:<br>- A new symbol page that includes new &amp; popular ideas<br>- An ability to publish ideas"},{"version_id":"830952186","version_name":"2.7.1","version_date":"2019-04-11 23:50:21.000 +0800","version_description":"We hope that spring has already come to your place! If it hasn't, try to cheer yourself up with our update:<br>- the TradingView stickers are now available not only in WhatsApp, but also in Telegram;<br>- corrected the instrument description at the ideas viewing screen;<br>- solved the problem with displaying the instrument name on the quotes screen;<br>- localized lists of quotes for new users of the application;<br>- eliminated the error, that made viewing the user's ideas impossible."},{"version_id":"831374251","version_name":"2.7.2","version_date":"2019-05-22 23:34:42.000 +0800","version_description":"We update the app on a regular basis to make it better for you. Here’s what’s new:<br>- Fixed an issue with an incorrect display of market status when using a dark theme<br>- You can now double tap to like ideas<br>- App size has been reduced<br>- You can now pull to refresh your own and someone else’s profile<br>- Fixed a number of issues that were causing the app to crash"},{"version_id":"831860099","version_name":"2.7.3","version_date":"2019-07-10 16:59:59.000 +0800","version_description":"Improved overall stability - we fixed quite a few errors that were causing the app to crash as well many graphics &amp; UI issues."},{"version_id":"832130359","version_name":"2.7.4","version_date":"2019-07-26 21:38:52.000 +0800","version_description":"We worked around the clock and made the following changes to the app:<br>- Added the ability to open a chart from a push notification<br>- Added the chart properties button;<br>- Improved overall stability - we fixed quite a few errors that were causing the app to crash as well as many graphics &amp; UI issues."},{"version_id":"832524607","version_name":"2.7.5","version_date":"2019-08-27 18:24:14.000 +0800","version_description":"This update includes the following fixes &amp; improvements:<br>- A number of issues that were happening when using iOS 13 were fixed;<br>- Overall stability of the app (including errors that were causing app to crash) was improved."},{"version_id":"832726725","version_name":"2.7.6","version_date":"2019-09-14 10:56:29.000 +0800","version_description":"Overall stability of the app (including errors that were causing app to crash) was improved."},{"version_id":"832829419","version_name":"2.7.7","version_date":"2019-09-19 19:49:38.000 +0800","version_description":"Overall stability of the app (including errors that were causing app to crash) was improved."},{"version_id":"833096195","version_name":"2.7.8","version_date":"2019-10-11 04:50:03.000 +0800","version_description":"With our new app version we tried to make you a little happier this fall:<br>- made small, but necessary changes on the registration page and in the symbol search;<br>- fixed bug on the chart screen, that led to the opening of the full screen mode on iPad;<br>- added new “Share app” and “Twitter” buttons in the settings."},{"version_id":"833220102","version_name":"2.7.9","version_date":"2019-10-18 20:43:50.000 +0800","version_description":"Last but not least, we’ve changed the way charts are saved in the new version - last used chart is now saved on your device automatically regardless of what you opened on any other device."},{"version_id":"833385360","version_name":"2.8.0","version_date":"2019-10-31 13:29:03.000 +0800","version_description":"Hi! We've got something to warm you on this chilly day of fall — new TradingView app version with the Ideas page updated! It's easier now to view and comment posts.<br>Please note that the future app versions won't support iOS 10. This lets us add new functions and improve the existing ones much faster."},{"version_id":"833419853","version_name":"2.8.1","version_date":"2019-11-12 15:15:39.000 +0800","version_description":"Lots of minor fixes and improvements were implemented."},{"version_id":"833578781","version_name":"2.8.2","version_date":"2019-11-14 17:03:39.000 +0800","version_description":"Lots of minor fixes and improvements were implemented."},{"version_id":"833688185","version_name":"2.8.3","version_date":"2019-11-24 21:00:34.000 +0800","version_description":"Lots of minor fixes and improvements were implemented."},{"version_id":"833836405","version_name":"2.8.4","version_date":"2019-12-04 11:19:35.000 +0800","version_description":"Days became shorter and colder with the onset of winter. But we enjoy the snow, Christmas vibes and the TradingView app update, which includes:<br>• Pine script code can now be copied from the idea you like.<br>• The idea publishing date is fixed.<br>• The animation of idea closing is fixed.<br>• Screen rotation issues are resolved.<br>• Fixed issues that could come up when you update the list of comments to an idea."},{"version_id":"834086563","version_name":"2.9.0","version_date":"2019-12-20 18:12:02.000 +0800","version_description":"Jingle bells, jingle bells, jingle all the way, oh, what fun it is to… check your yearly returns, watch the Santa rally, and enjoy gifts. We have a gift for you — the new version of the TradingView app! Besides several fixes and improvements, a holiday surprise is waiting.<br>• We added a Watchlist widget to the Today View.<br>• All published ideas (from any local website version) are now displayed on your mobile profile.<br>• We fixed a bug when the notification badge on the app icon was not removed after opening the app.<br>• We removed shade in the charts tab.<br>As the new year approaches, we say goodbye to iOS 10, as it will no longer be supported. It is a big step for us towards new updates.<br><br>Merry Christmas and a Happy New Year! 2020 will be an exciting time for new updates, features, and releases on the TradingView mobile app."},{"version_id":"834172677","version_name":"2.9.1","version_date":"2020-01-01 21:05:42.000 +0800","version_description":"Jingle bells, jingle bells, jingle all the way, oh, what fun it is to… check your yearly returns, watch the Santa rally, and enjoy gifts. We have a gift for you — the new version of the TradingView app! Besides several fixes and improvements, a holiday surprise is waiting.<br>• We added a Watchlist widget to the Today View.<br>• All published ideas (from any local website version) are now displayed on your mobile profile.<br>• We fixed a bug when the notification badge on the app icon was not removed after opening the app.<br>• We removed shade in the charts tab.<br>As the new year approaches, we say goodbye to iOS 10, as it will no longer be supported. It is a big step for us towards new updates.<br><br>Merry Christmas and a Happy New Year! 2020 will be an exciting time for new updates, features, and releases on the TradingView mobile app."},{"version_id":"834364845","version_name":"2.9.2","version_date":"2020-01-16 21:51:15.000 +0800","version_description":"Already missing Boxing Day? Well, we have a few up our sleeves for you.<br>Meet our updated iOS app version with:<br>• fixed the way forex instruments are displayed in Today View widget;<br>• fixed the displaying of comments and ideas;<br>• images in chats are now opened in the app, no need to open your browser anymore;<br>• ideas with non-Latin characters are now compliant with the iPad."},{"version_id":"834527012","version_name":"2.9.3","version_date":"2020-01-29 21:41:40.000 +0800","version_description":"Tesla shares may set new records, but we are not far behind! We have updated our app and it is now equipped with the following new features and fixes:<br>• Views are now updated when you click on the idea card.<br>• Expanded click space on the idea card.<br>• Fixed app crashes for some users.<br>• Fixed chart blinking when loading in a dark theme.<br>• Fixed the issue where a pricing page would open instead of a chart."},{"version_id":"834618473","version_name":"2.9.4","version_date":"2020-02-16 21:06:24.000 +0800","version_description":"We like to think that you're out there waiting for our app updates as eagerly as you are a Game of Thrones series finale remake. Take a look to see what we've added!<br>• We've fixed the chart's ability to load on the idea screen;<br>• We've fixed visual errors on the authorization screen;<br>• We've made small visual changes to the list of quotes, chat, and list of ideas screens."},{"version_id":"834992714","version_name":"2.9.5","version_date":"2020-03-10 22:30:22.000 +0800","version_description":"Spring has come, and soon it will be warm and sunny again. But we couldn't wait for it to warm up before giving you an update of the TradingView app, so enjoy!<br>• We've added an interactive chart on the ideas page in iPhone in landscape mode.<br>• A measure tool and an eraser now appear among the other drawing tools.<br>• We've fixed resetting the chart settings for unauthorized users when putting the app in the background.<br>• Changed the order of tabs on the list of ideas screen."},{"version_id":"835181541","version_name":"2.10.0","version_date":"2020-04-02 00:33:35.000 +0800","version_description":"Not even a global pandemic can stop us from improving our app, except we are taking breaks to excessively wash our hands.<br>In our new version:<br>• we've added the ability to create an account using the \"Sign in with Apple\" function; and<br>• we made a new interface for editing your profile.<br>Take care of yourselves, be safe, and stay at home."},{"version_id":"835440535","version_name":"2.11.0","version_date":"2020-04-08 11:54:53.000 +0800","version_description":"Not even a global pandemic can stop us from improving our app, except we are taking breaks to excessively wash our hands.<br>In our new version:<br>• we've added the ability to create an account using the \"Sign in with Apple\" function;<br>• we made a new interface for editing your profile; and<br>• we've added the ability to login with 2 factor authentication.<br>Take care of yourselves, be safe, and stay at home."},{"version_id":"835567160","version_name":"2.12.0","version_date":"2020-04-16 18:24:07.000 +0800","version_description":"We just can't be stopped! We continue working hard to improve our TradingView app for you with all of our strength and resources. What have we added? Let's take a look:<br>• A new menu item, \"Delete.\" Now you can easily and quickly delete all drawings and indicators on your chart.<br>• Another new menu item addition, \"Object tree.\"<br>• A new section with information on used third party libraries.<br>• Fixed a few errors on the authorization screen."},{"version_id":"835754765","version_name":"2.13.0","version_date":"2020-05-01 12:32:52.000 +0800","version_description":"As the weather heats up and our moods gradually improve, our TradingView team is trying to keep up with producing new quality app releases.<br>What's new this time? Let's see:<br>• the app is now available in India;<br>• the panel on the ideas screen is now pinned so you can quickly rate, share, or go to comments with a simple click;<br>• we corrected a problem with opening links in-text; and<br>• other minor fixes in the user interface.<br>Please take care and stay at home."},{"version_id":"836072673","version_name":"2.14.0","version_date":"2020-05-24 21:06:33.000 +0800","version_description":"Waiting for summer to kick off, moving forward and fixing bugs, all while trying to improve the app user-experience.<br>• Added the ability to close ideas by swiping right.<br>• Added a context menu by tapping on messages in chats and comments.<br>• Fixed an issue with password auto-fill when using two-factor authentication.<br>• Made other minor fixes and general interface improvements."},{"version_id":"836257585","version_name":"2.14.1","version_date":"2020-06-03 23:15:58.000 +0800","version_description":"Made minor fixes and general improvements."},{"version_id":"836337867","version_name":"2.15.0","version_date":"2020-06-23 14:46:44.000 +0800","version_description":"The wait is over, folks. Summer is finally here, the sun is shining bright, and now you can manage your alerts in the TradingView app! <br>But that's not all we've got for you: <br> • We've added \"Anchored VWAP\" and the \"Arrow Marker\" drawing tools;<br> • We've fixed several issues on various screens, including the stock list, profile editing, and Ideas. <br>Please note: we will no longer be supporting iOS 11 and iOS 12 in the next version of our app. This will allow us to not only release new features faster, but provide you with updates more often. For those of you who can't upgrade to iOS 13, the current version of the app will still be available."},{"version_id":"836581329","version_name":"2.15.1","version_date":"2020-06-26 23:51:11.000 +0800","version_description":"The wait is over, folks. Summer is finally here, the sun is shining bright, and now you can manage your alerts in the TradingView app! <br>But that's not all we've got for you: <br> • We've added \"Anchored VWAP\" and the \"Arrow Marker\" drawing tools;<br> • We've fixed several issues on various screens, including the stock list, profile editing, and Ideas. <br>Please note: we will no longer be supporting iOS 11 and iOS 12 in the next version of our app. This will allow us to not only release new features faster, but provide you with updates more often. For those of you who can't upgrade to iOS 13, the current version of the app will still be available."},{"version_id":"836745865","version_name":"2.15.2","version_date":"2020-07-08 14:15:05.000 +0800","version_description":"The wait is over, folks. Summer is finally here, the sun is shining bright, and now you can manage your alerts in the TradingView app! <br>But that's not all we've got for you: <br> • We've added \"Anchored VWAP\" and the \"Arrow Marker\" drawing tools;<br> • We've fixed several issues on various screens, including the stock list, profile editing, and Ideas. <br>Please note: we will no longer be supporting iOS 11 and iOS 12 in the next version of our app. This will allow us to not only release new features faster, but provide you with updates more often. For those of you who can't upgrade to iOS 13, the current version of the app will still be available."},{"version_id":"836777989","version_name":"2.16.0","version_date":"2020-07-21 01:01:53.000 +0800","version_description":"Summer is in full swing, but don’t expect that to stop us from updating and improving our app. Here’s what we’ve got for you:<br>• Added logos of instruments on the watchlist and instrument screens.<br>• Fixed bugs with animation and date display on the Idea screen.<br>• Improved user interface and fixed logical errors on the alert management screen.<br>Please note: we will no longer be supporting&nbsp;iOS&nbsp;11 and&nbsp;iOS&nbsp;12 in the next version of our app. This will allow us to not only release new features faster, but provide you with updates more often. For those of you who can’t upgrade to&nbsp;iOS&nbsp;13, the current version of the app will still be available"},{"version_id":"836968786","version_name":"2.16.1","version_date":"2020-07-23 16:48:40.000 +0800","version_description":"Summer is in full swing, but don’t expect that to stop us from updating and improving our app. Here’s what we’ve got for you:<br>• Added logos of instruments on the watchlist and instrument screens.<br>• Fixed bugs with animation and date display on the Idea screen.<br>• Improved user interface and fixed logical errors on the alert management screen.<br>Please note: we will no longer be supporting&nbsp;iOS&nbsp;11 and&nbsp;iOS&nbsp;12 in the next version of our app. This will allow us to not only release new features faster, but provide you with updates more often. For those of you who can’t upgrade to&nbsp;iOS&nbsp;13, the current version of the app will still be available."},{"version_id":"837183247","version_name":"2.16.2","version_date":"2020-08-02 01:35:48.000 +0800","version_description":"As many people try and cool off from the summer heat and enjoy socially-distanced staycations, our team continues to work hard and update our app. In this new version, we have some special surprises (hopefully good ones) with a new toolbar on the chart. In addition, we've:<br>• fixed problems with displaying text on the Ideas screen;<br>• stopped the app from crashing when rotating the device on the notification screen; and<br>• fixed the incorrect display of the list of Ideas on the profile screen."},{"version_id":"837415973","version_name":"2.17.0","version_date":"2020-08-20 16:50:49.000 +0800","version_description":"TradingView is not just charts, charts, and more charts — we're also a social network for traders and investors. In this update, we've added the ability to follow users and their posts. But don't think we've forgotten about improving charts. Here's what we've done:<br>• returned full screen mode;<br>• changed the size of the toolbar; and<br>• added the ability to switch symbols on the chart."},{"version_id":"837591024","version_name":"2.18.0","version_date":"2020-09-13 18:07:17.000 +0800","version_description":"Seasonal changes always bring new opportunities and chances to improve for the better. That's exactly how it works with our app. Check below for our new upgrades.<br>• We've added pre- and post-market data for instruments in watchlists;<br>• We've added the ability to subscribe to a user on the idea screen;<br>• We've improved the lower panel on the chart screen; and<br>• We've fixed a number of bugs and improved performance overall."},{"version_id":"837816342","version_name":"2.18.1","version_date":"2020-10-05 06:04:48.000 +0800","version_description":"We know you've been waiting for them, now they’re ready. Get widgets for iOS 14 and watch quotes right from your home-screen – following the markets has never been this simple. <br>But there's more to this update, including:<br>• Added hints on the chart screen<br>• The new ability to disable symbol logos in the watchlist<br>• Other minor changes and improvements to the app"},{"version_id":"838280773","version_name":"2.19.0","version_date":"2020-10-21 09:07:13.000 +0800","version_description":"The world is full of extraordinary events right now, and one of them must certainly be our latest app update. We’ve been busy adding tons of new feature for you, including:<br>• Bar Replay on the charts<br>• a button to scroll to the last idea’s comments<br>• our Refer a Friend option<br>But there’s more – we've updated our iOS14 widgets, so you can now:<br>• select the watchlists you'd like displayed<br>• toggle between percentage and absolute price changes"},{"version_id":"838402287","version_name":"2.20.0","version_date":"2020-11-07 22:06:41.000 +0800","version_description":"To celebrate the fast approaching end of 2020, we made a bet on how many app improvements we’d ship before the New Year. For this latest update we’ve:<br>• Added flagged lists support<br>• Simplified switching between symbols on the chart<br>• Added magnet mode on the chart<br>• Other minor tweaks and improvements."},{"version_id":"839048435","version_name":"2.21.0","version_date":"2020-11-17 23:48:06.000 +0800","version_description":"To celebrate the fast approaching end of 2020, we made a bet on how many app improvements we’d ship before the New Year. For this latest update we’ve:<br>• Added flagged lists support<br>• Simplified switching between symbols on the chart<br>• Added magnet mode on the chart<br>• Other minor tweaks and improvements."},{"version_id":"839431417","version_name":"2.22.0","version_date":"2020-12-11 01:45:53.000 +0800","version_description":"Screening through the glow, in a multi-monitor way, over the markets we go, charting all the way. In this nearly-Holidays update, we’ve completely redesigned two menus:<br>• chart types selection<br>• list of drawing tools<br>We hope you like these merry new menus and their improved functionality this festive season — a little present from us to you."},{"version_id":"839705893","version_name":"2.23.0","version_date":"2020-12-22 19:49:15.000 +0800","version_description":"Screening through the glow, in a multi-monitor way, over the markets we go, charting all the way. In this nearly-Holidays update, we’ve added support for spreads in the search field, and completely redesigned three menus:<br>• chart types selection<br>• list of drawing tools<br>• intervals selection on the chart<br>We hope you like this merry new version and the improved functionality this festive season — a little present from us to you."},{"version_id":"840005192","version_name":"2.24.0","version_date":"2021-01-14 16:28:19.000 +0800","version_description":"New year, back to work, lots to do. So we'll keep this short:<br>Our first app update in 2021 offers:<br>• drag and drop symbols in your watchlists — no need to enter Edit Mode now.<br>• two new drawing tools: Highlighter and Fixed Range Volume Profile.<br>• phone number verification is now available in app."},{"version_id":"840194047","version_name":"2.24.1","version_date":"2021-01-26 22:38:20.000 +0800","version_description":"We continue on improving our handy app. In this new version, we've:<br>• changed the watchlist edit mode<br>• fixed several issues that sometimes happened when you deleted symbols from the list"},{"version_id":"840405547","version_name":"2.24.2","version_date":"2021-02-09 01:58:46.000 +0800","version_description":"We continue on improving our handy app. In this new version, we've:<br>• changed the watchlist edit mode<br>• fixed several issues that sometimes happened when you deleted symbols from the list"},{"version_id":"840508773","version_name":"2.25.0","version_date":"2021-03-01 10:24:54.000 +0800","version_description":"And we think it's gonna be a long, long time<br>'Til touchdown brings us 'round again to find<br>we're not the platform they think we are at home, <br>Oh, no, no, no<br>We’ve got a rocket plan: <br>Rocket plan, turning out features, oh, how we’ve grown.<br><br>To help you get to the moon, in this update we’ve added –&gt; <br>• Fixed issues with watchlist editing<br>• Added the ability to quickly switch timeframes on the chart screen<br>• Added stay in drawing mode feature<br>• Changed the toolbars on the chart screen"},{"version_id":"840745661","version_name":"2.25.1","version_date":"2021-03-10 21:44:41.000 +0800","version_description":"And we think it's gonna be a long, long time\n<br>'Til touchdown brings us 'round again to find\n<br>we're not the platform they think we are at home, \n<br>Oh, no, no, no\n<br>We’ve got a rocket plan: \n<br>Rocket plan, turning out features, oh, how we’ve grown.\n<br>\n<br>To help you get to the moon, in this update we’ve added –&gt; \n<br>• Fixed issues with watchlist editing\n<br>• Added the ability to quickly switch timeframes on the chart screen\n<br>• Added stay in drawing mode feature\n<br>• Changed the toolbars on the chart screen"},{"version_id":"840919103","version_name":"2.26.0","version_date":"2021-03-21 08:06:39.000 +0800","version_description":"Good tidings we bring again — the new app version is going to leave the previous one in the shade. <br>Check it out, we’ve:<br>• Fixed issues with Facebook log-ins<br>• Added a new “Price Note” drawing tool<br>• Fixed errors in playing video ideas (now the video player will never let you down) <br>• Added a new function so you can open symbol info right from the watchlist by just clicking on the symbol."},{"version_id":"841157140","version_name":"2.27.0","version_date":"2021-04-05 03:02:44.000 +0800","version_description":"Nothing special, just another TradingView app update with more functions and fewer bugs.\n<br>Once again, we couldn't help but redesign chart toolbars. A day may come when we stop doing this, but that is not this day.\n<br>• We've added a new drawing tool ‘Signpost' and made the date range in the chart toolbar easier to access\n<br>• You can now create Siri shortcuts — so you open the required symbols quickly\n<br>• We've added symbol indexing — now you can search any symbol on your device\n<br>• The symbol and the timeframe of the opened chart are now displayed in chats when you send a message\n<br>• Symbols added to watchlists are now highlighted and the list is scrolled to show them. You can also sort symbols by flags now\n<br>• Finally, we've fixed sudden app crashes and made some other minor changes."},{"version_id":"841250207","version_name":"2.28.0","version_date":"2021-04-18 03:09:55.000 +0800","version_description":"New version — new changes in the toolbar. We promise that we'll stop doing this one day, but not today — because we want to make our app the best that it can be. And here is the full list of changes:\n<br>• We’ve added symbol logos to the chart symbol tool selection.\n<br>• We’ve fixed the sound issues that happened when you watched video ideas.\n<br>• You can now delete sections in watchlists through the contextual menu.\n<br>• We’ve added new drawing tools: Path, Gann Square Fixed and Info Line. \n<br>• Only your favorite intervals and the current one will now be displayed in the interval selection menu."},{"version_id":"841836504","version_name":"2.29.0","version_date":"2021-05-16 03:09:39.000 +0800","version_description":"The toolbar remains unchanged (for now), but we simply couldn’t resist redesigning the user profile section. We’ve also:<br>• Added the ideas list from the “Editor’s picks” section and improved switching between lists<br>• Incorporated a password reset option from the app"},{"version_id":"842419216","version_name":"2.29.1","version_date":"2021-06-02 22:49:49.000 +0800","version_description":"Made minor fixes and general improvements."},{"version_id":"842518120","version_name":"2.30.0","version_date":"2021-06-15 08:09:37.000 +0800","version_description":"Good tidings we bring again — the new app version is going to leave the previous one in the shade.<br>Check it out, we’ve:<br>• added a quick preview of charts and symbol info right in the watchlist<br>• added Menu tab for a quick access to your profile and all app settings"},{"version_id":"842672069","version_name":"2.30.1","version_date":"2021-06-16 01:01:48.000 +0800","version_description":"Good tidings we bring again — the new app version is going to leave the previous one in the shade.<br>Check it out, we’ve:<br>• added a quick preview of charts and symbol info right in the watchlist<br>• added Menu tab for a quick access to your profile and all app settings"},{"version_id":"842691113","version_name":"2.30.2","version_date":"2021-06-18 00:12:29.000 +0800","version_description":"Good tidings we bring again — the new app version is going to leave the previous one in the shade.<br>Check it out, we’ve:<br>• added a quick preview of charts and symbol info right in the watchlist<br>• added Menu tab for a quick access to your profile and all app settings"},{"version_id":"842723164","version_name":"2.30.3","version_date":"2021-06-20 22:25:14.000 +0800","version_description":"Good tidings we bring again — the new app version is going to leave the previous one in the shade.<br>Check it out, we’ve:<br>• added a quick preview of charts and symbol info right in the watchlist<br>• added Menu tab for a quick access to your profile and all app settings"},{"version_id":"842758608","version_name":"2.30.4","version_date":"2021-06-25 00:31:27.000 +0800","version_description":"Good tidings we bring again — the new app version is going to leave the previous one in the shade.<br>Check it out, we’ve:<br>• added a quick preview of charts and symbol info right in the watchlist<br>• added Menu tab for a quick access to your profile and all app settings"},{"version_id":"842822845","version_name":"2.31.0","version_date":"2021-07-12 06:07:12.000 +0800","version_description":"I'm blue<br>I'm blue<br>I'm blue, da ba dee da ba daa<br>Da ba dee da ba daa, da ba dee da ba daa<br>For this release we've revamped the fabled TradingView blue to a shade Eiffel 65 would be proud of, and also:<br>• added the option to choose from a fresh set of built-in alert sounds<br>• price changes are now also available in the native chart preview"},{"version_id":"843054049","version_name":"2.31.1","version_date":"2021-07-15 17:01:40.000 +0800","version_description":"I'm blue<br>I'm blue<br>I'm blue, da ba dee da ba daa<br>Da ba dee da ba daa, da ba dee da ba daa<br>For this release we've revamped the fabled TradingView blue to a shade Eiffel 65 would be proud of, and also:<br>• added the option to choose from a fresh set of built-in alert sounds<br>• price changes are now also available in the native chart preview"},{"version_id":"843188443","version_name":"2.31.2","version_date":"2021-07-25 22:06:49.000 +0800","version_description":"I'm blue<br>I'm blue<br>I'm blue, da ba dee da ba daa<br>Da ba dee da ba daa, da ba dee da ba daa<br>For this release we've revamped the fabled TradingView blue to a shade Eiffel 65 would be proud of, and also:<br>• added the option to choose from a fresh set of built-in alert sounds<br>• price changes are now also available in the native chart preview"},{"version_id":"843275015","version_name":"2.32.0","version_date":"2021-08-02 06:06:17.000 +0800","version_description":"Somebody once said: “News is what somebody, somewhere, wants to suppress.” \n<br>Pretty important stuff and – in our opinion – worthy of its own section of the app, which we’ve now added. We’ve also shifted Chats to the Menu tab, so you don't lose track of them."}]