[{"version_id":"822318336","version_name":"0.5.9","version_date":"","version_description":""},{"version_id":"822447755","version_name":"0.5.11","version_date":"","version_description":""},{"version_id":"822464463","version_name":"0.6.1","version_date":"","version_description":""},{"version_id":"822674970","version_name":"0.6.2","version_date":"","version_description":""},{"version_id":"823551704","version_name":"1.0.0","version_date":"","version_description":""},{"version_id":"823616980","version_name":"1.0.1","version_date":"","version_description":""},{"version_id":"823650899","version_name":"1.0.2","version_date":"","version_description":""},{"version_id":"823820746","version_name":"1.0.4","version_date":"","version_description":""},{"version_id":"823864430","version_name":"1.0.5","version_date":"","version_description":""},{"version_id":"823908257","version_name":"1.0.6","version_date":"","version_description":""},{"version_id":"824041025","version_name":"1.0.7","version_date":"","version_description":""},{"version_id":"824143260","version_name":"1.0.9","version_date":"2017-10-26 10:51:30.000 +0800","version_description":"Version 1.0.9 – Happy Halloween<br>This Halloween we prepared something really great for all of you. As a big present to all of you we’re sending you a Dark Regiment Box to your inbox during Halloween, so don’t hesitate to claim it as soon as possible.<br>May you have a scary and fun filled Halloween!<br><br>• Special Halloween Challenge, starting this Friday: Win 12 matches on the redesigned siege map to get the brand new Bouncing Bomb in the Grand Halloween Challenge.<br>• Introducing the Halloween-themed Bouncing Bomb: This nasty fruit is up for a trick or treat, by dropping burning phosphor on each bounce &amp; exploding on the 3rd touch. <br>• Limited Dark Regiment Box Special Offer: Use your chance to get your hands on the Dark Regiment Box, which has a higher probability to include the new Bouncing Bomb. You can purchase up to 1 box per day until the end of the event!<br>• Tons of bugs were fixed &amp; the balancing of many units has been improved! Please check the ingame news for a detailed list."},{"version_id":"824244317","version_name":"1.0.10","version_date":"2017-11-03 18:00:51.000 +0800","version_description":"Version 1.0.10 - Arac Attack<br>• Removed Hallowen theme &amp; Halloween Siege map.<br>• Introducing Spider Drone Army: The Spider Drone egg has burst &amp; unveils a deadly army of Spider Drones. Overwhealm your opponents by surprising them with 8 Spider Drones at once!<br>• Additional exception handling to prevent units from being spawned infinitely often.<br>• Fixed button animation in inbox popup.<br>• Several performance &amp; stability improvements.<br><br>Balancing update:<br>• Challenge rules: Increased player's default level from 8 to 9."},{"version_id":"824319451","version_name":"1.1.0","version_date":"2017-11-08 22:29:13.000 +0800","version_description":"Version 1.1 - Triple Trouble<br>Warzone is opening up to an even broader player base, by releasing the game to many more countries &amp; platforms. Be prepared for more &amp; more opponents joining the community &amp; challenging your skills on the battlefield!<br><br>• Get ready for the new Sioux Helicopter Squad: Three deadly helicopter at once ripping your melee troops apart in a heartbeat or better one salvo of their deadly machine cannons. Win in the Sioux Squad Challenge to be one of the first to own this powerful unit!<br>• Warzone is now available on Facebook Gameroom: Try out playing Warzone on any PC! If you’ve connected your game with your Facebook account, you can pick up your progress &amp; play on both platforms.<br>• Improved feedback of many UI elements &amp; fixed several bugs that prevented the UI from updating.<br>• New legendary box: Stay tuned for the legendary box offer! This box is cheaper than the heroic box, but still contains one guaranteed legendary card.<br>• Your opponent’s clan is now shown in challenge matches.<br>• Bot AI has been improved with additional behaviours.<br>• Additional exception handling to prevent synchronization issues during multiplayer matches.<br>• Fixed the flame effect of the Burner &amp; Dragon Truck not turning when attacking a moving enemy unit.<br>• Improvements to the animation system of MSV-22 Landcruiser.<br>• Fixed a bug that displayed the wrong name on a shared replay.<br>• Additional support for some GPUs (Asus ZenFone devices).<br>• When entering the clan section on main menu, the chat will now display the newest entries first, instead of the oldest.<br>• Units which are duplicated with the Amplified Replicator are now on the correct level in challenge matches.<br>• Fixed the win streak being reset when playing a challenge match.<br>• iOS: Clan farm buildings are not disappearing anymore in certain scenarios after the clan reached the next level.<br><br>Balancing adjustments:<br>• SC-74 Sioux Gunship: Decreased damage from 49 to 44.<br>• STC-2 Assault Hercules: Decreased damage from 64 to 56.<br>• Bouncing Bomb: Increased damage from 300 to 310 &amp; increased tower damage from 135 to 140."},{"version_id":"825469864","version_name":"1.1.7","version_date":"2018-01-02 15:29:01.000 +0800","version_description":"Version 1.1.7 - Hotfix"},{"version_id":"825582789","version_name":"1.1.8","version_date":"2018-01-11 15:53:19.000 +0800","version_description":"Version 1.1.8 - The Sniper's Bullet<br>• Added a deadly, new unit: The Ghost - Outfitted with a camouflage-cloak these soldiers take their time to deliver the one shot that counts<br>• Removed Christmas themed content<br>• Added 2 new maps for Siege and Domination game modes<br>• Improved UI &amp; visuals of Clan Barracks<br>• Added the new stat \"EFFECT DURATION\" to the card info popup of status changing cards, like EMP, Graviton or Phosphor<br>• Card requests appear now always on the bottom of the Clan Chat<br>• Fixed a bug in the Clan Chat that could break the function of the donation buttons on card donation request entries<br>• Fixed a bug that prevented the Lvl 4 Artillery Turret of the Clan Wall from attacking enemy units<br>• Fixed the wrong level of some units being displayed when looking at other player's decks (e.g. Spider Drone Army was displaying the level of the units spawned instead of the card level)<br>• Fixed a bug that prevented the Jetpack Marine from flying over the river in Siege<br>• Jetpack Marine is now shooting correctly<br>• Card donation counter in achievements &amp; profile popup is now working<br>• Fixed wrong Coin icon being displayed in the Barrack's card info popup (was displaying normal Coins instead of Clan Coins)<br>• Fixed a bug that prevented the Clan Wars AI from deploying its Hero unit<br>• The Replay section in Main Menu is not crashing anymore when entering after playing a Clan Wars match<br><br>Balancing adjustments:<br>• Clan Wall: Decreased health from 500k to 250k &amp; damage from 175 to 165<br>• Rapidfire Cannon: Increased damage from 40 to 42<br>• Artillery Turret: Increased damage from 160 to 180<br>• Reaper Drone: Decreased health from 85 to 80 &amp; attack speed from 0.4 to 0.5 &amp; increased damage from 11 to 12<br>• Increased Clan Ladder rewards"},{"version_id":"826021161","version_name":"1.1.12","version_date":"2018-02-16 22:47:44.000 +0800","version_description":"Version 1.1.12 – Drones are watching you!<br>• Introducing the Reaper Drone Factory: Swarm your enemies from above with the factory, periodically spawning pairs of Reaper Drones<br>• Friend's Leaderboard: See which of your friends are playing Warzone and compare your medals, decks &amp; progress with them. Gather as many friends as you can, because each of them will give you a coin income bonus of an extra 1% on all boxes won in multiplayer matches (max. 10%)<br>• Stay up-to-date with the new interactive start-up-popup: If there's something new in the game, this function will make sure that you'll know about it. Never miss something again!<br>• Changed multiplayer region from US to EU as the main connection point to prevent timeouts &amp; disconnects<br>• Newly created profiles now have a limit of 16 characters for the player's nickname<br>• Reworked ingame HUD: You can now minimize your opponent's hero unit portrait to see more area of the battlefield<br>• Added even more high-level multiplayer bots (on Monday 19th Feb. the Discord Design Challenge Bots will be unleashed)<br>• Fixed minor bugs regarding the clan wall turrets<br>• The enemy clan wall is now positioned slightly farer away from your base to make more use of the battleground<br>• Fixed waypoints of the clan war map that caused some flying units to ignore the side turrets &amp; directly attack the main turret of the wall<br>• Fixed a bug that made the Jetpack Skyforce become one single Pulse Marine if all four of the Jetpack Marines were hit by one strike at once<br>• Fixed a bug during the boot process of the Android version of Warzone that prevented the game from starting after it was installed for the 1st time<br>• Fixed a bug the caused the Tesla Tank's attack to jump over to the conquest laser cannons if they were owned by your opponent<br>• Multiplayer synchonization: Fixed certain elements that caused dead units or buildings to stay on the battlefield without perfoming any action in multiplayer matches"},{"version_id":"826154866","version_name":"1.1.14","version_date":"2018-03-02 19:07:04.000 +0800","version_description":"Version 1.1.14 - Smokey Eyes<br>• Introducing a new strike: The Smoke Grenade – Even modern targeting systems fail when the electric particles reduce their effetiveness, which reduces the range of all units down to 2<br>• Adjusted the stat text fields of the unit info popup on campaign map to prevent some digits from being cut off in certain cases if the value is a decimal number<br>• The device storage permission popup is not needed anymore &amp; will not show up on the 1st start of the game on all Android devices<br>• Stay tuned for even more very cool special rule challenges, such as 2x ENERGY, 50% HERO ENERGY GAIN and 2x DAMAGE or 2x MOVEMENT SPEED &amp; many more to come<br>• Fixed a bug in the start up popup that could cause some problems with purchasing a special offer from there in certain cases if there’re two offers available at the same time<br>• Added a new buffed/nerfed indicator that shows if and how a unit on the battleground is currently affected by a certain effect (e.g. by Commando Tank)<br><br>BALANCING ADJUSTMENTS<br>• Jetpack Marine: Increased damage from 42 to 52; decreased attack speed from 0.6 to 0.8s; decreased health from 125 to 120 (less bullets for better performance, Ghost can 1-shot him now)"},{"version_id":"826359836","version_name":"1.1.18","version_date":"2018-03-26 21:01:35.000 +0800","version_description":"Version 1.1.18 - Defying Gravity 2.0<br>• Introducing the legendary Graviton Tank: This Tank combines all the results of the latest research of gravitational manipulation. It generates a mini black hole that warps up enemy troops &amp; damages them close to its core.<br>• Huge improvements to the multiplayer system, unit's position &amp; health synching, as well as re-synching if the connection drops for a short while. Units attacking each other across the entire battlefield should be a thing of the past now!<br>• Added a new idle animation of the Vanguard's Drone Carrier<br>• Fixed a bug that displayed a texture in the wrong way in the the clan base terrain<br>• Removed unnecessary colliders from all units &amp; changed the compression type of certain textures to improve overall performance<br>• Unlocked clan level 14!<br>• Improved fluidity &amp; stability of the tutorial, so new players will have a smoother experience when starting to play Warzone<br>• Fixed a bug that could cause the hero unit to be spawned on level 1 instead of the correct one<br>• Increased the speed in which the Ballistic Missile is flying towards its target<br>• General UI improvements in 2D graphics &amp; animations<br>• You can now check out the includings of the multiplayer ladder reward boxes by tapping on them while being in the ladder popup<br><br>BALANCING ADJUSTMENTS<br>• VX-155 Drone Carrier: Increased health on stage 3 from 1040 to 1200"},{"version_id":"826462396","version_name":"1.2.0","version_date":"2018-03-29 12:17:12.000 +0800","version_description":"Version 1.2 - Clan Raid Beta<br><br>We're finishing the last refinement steps for finishing the PvP Clan Wars in which players will be able to attack enemy clans &amp; defend your own clan from being attacked by enemy players from all over the world. To build the foundation for this we're adding 16 improved Final Test Clans, which will challenge the skills of even the strongest &amp; most outstanding clans. This will also help us test the match stability for PvP combats, being unlocked soon!<br><br>• New App Icon<br>• New App Video in the App Store<br>• Fixed a bug that caused crashes in certain cases when receiving a push notification<br>• Fixed a bug in the Clan UI that caused the Clan XP display to glitch out when reaching the maximum amount of Clan XP"},{"version_id":"826748081","version_name":"1.2.3","version_date":"2018-04-20 15:00:06.000 +0800","version_description":"Bug Fix"},{"version_id":"826820144","version_name":"1.2.4","version_date":"2018-04-28 03:58:30.000 +0800","version_description":"Version 1.2.4 - Clan Wars Improvements<br><br>• Added a new defender overview popup in the clan city, which can be viewed if being attacked<br>• Added new FX in clan city when being attacked<br>• Fixed defender to have only the cards defined in the clan deck when defending<br>• Decreased amount of clan coins the attacker steals when he the wall does not get destroyed <br>• Clan wars messages will appear on the bottom of the clan chat<br>• Improved clan leader boxes in the clan store; they come with an offer for introduction on top"},{"version_id":"827076276","version_name":"1.2.5","version_date":"2018-05-09 15:23:04.000 +0800","version_description":"Version 1.2.5 - Rise from the Ashes<br>• Introducing the legendary Phoenix VTOL: This agile Hero Unit &amp; Base Building Killer is practically built around its weapon - a giant laser cannon! To be even more effective while firing at it enemies it opens up its armour plates to increase cooling.<br>• Reworked model of the Reaper Drone<br>• Fixed a bug that prevented the Commando Tank from supporting your Air Units &amp; also made him try to buff the platforms on Conquest Game Mode Maps<br>• Fixed a bug of the bot opponent that allowed them to use the Amplified Replicator without having enough energy to copy the previously played card<br><br>BALANCING ADJUSTMENTS<br>• Rail Gun Tank: Increased health and damage from 295 to 315<br>• Increased season medal reset border from 3600 to 3800<br>• Increased rotation speed of STC-3 Assault Hercules &amp; STC-4 Heavy Hercules Drop"},{"version_id":"828019910","version_name":"1.2.9","version_date":"2018-08-31 18:19:59.000 +0800","version_description":"Version 1.2.9 - Cloaked Airships Incoming<br>If you see them, it might be too late already. Get ready for the new Stealth Air Drones! They crush ground units with few shots, but are defenseless against enemy air units. Did I say defenseless? Of course, you have to remove the camouflage first. We are looking forward to your tactics and wish you a lot of fun with the new update!<br>• Unlocked the legendary Stealth Drone.<br>• New challenge type: Wanna try out the new unit without buying it? Then the new Stealth drone challenge is made for you! Here you get the new unit added to your deck during the challenge matches and you also have the chance to get the new unit for winning 12x.<br>• Added new indicators to the main manu UI, that show you if something new happened in your clan, card collection or if there's something new to discover in the store.<br>• Fixed a bug that triggered your clan's level up popup in case you watched another clans info popup and this clan's level was below your clan's level.<br>• Fixed a bug that caused the Spider Mech to be stuck in an animation state which prevented him from moving or attacking in rare cases."},{"version_id":"829699668","version_name":"1.3.7","version_date":"2018-12-20 11:20:25.000 +0800","version_description":"Version 1.3.7 - Merry Christmas Warzone Community!<br>• Watch out for the Christmas challenges to get the super rare Santa Strike skin of the Air Strike!<br>• Re-balanced the order in which the clan features unlock: Clan Raids become available much earlier now!<br>• Improved UI of the startup popup<br>• Fixed a the clan wars button in the clan base UI that caused it to show broken values in the timer<br>• Added text messages during the tutorial matches that give new players an overview of their progress<br>• Fixed several text and UI issues"},{"version_id":"829896501","version_name":"1.3.8","version_date":"2019-03-07 13:13:39.000 +0800","version_description":"Version 1.3.8<br>• Balancing adjustments regarding coin and XP rewards from boxes.<br>• Improved overall stability and performance.<br>• Fixed a rarely occurring bug in the login process that caused players to get stuck on the loading screen.<br>• Many preparations underneath the surface for soon upcoming features!"},{"version_id":"830990018","version_name":"1.3.9","version_date":"2019-04-16 19:35:25.000 +0800","version_description":"Version 1.3.9<br>Greetings General!<br><br>You can now watch an ad to decrease the unlock times of boxes.<br><br>Balancing adjustments:<br>• Autoturret: Increased health from 435 to 450<br>• Reaper Drone Factory: Increased lifetime from 45 to 55<br>• Plasma Tower: Decreased lifetime from 50 to 45 sec; Increased damage from 80 to 92 and health from 850 to 880<br>• Bunker Charger: Increased death damage from 100/200/300 to 110/220/330<br>• Phoenix VTOL: Increased health from 1050 to 1100<br><br>Share your feedback and ideas on the game's Discord channel!"}]