[{"version_id":"823260506","version_name":"1.0.0","version_date":"2017-08-23 08:45:19.000 +0800","version_description":""},{"version_id":"823461876","version_name":"1.0.4","version_date":"2017-08-29 06:24:57.000 +0800","version_description":"We fixed some of the most pressing bugs causing the game to get unresponsive\nAdditionally the base was slightly improved with some items no longer being unnecessarily difficult to find (*cough cough* plant)\nAnd a few items saw a name change, most notably \"alchemist\" was renamed to \"philosophy\"\n\nFull changelog: help.littlealchemy2.com/changelog"},{"version_id":"823665576","version_name":"1.0.7","version_date":"2017-09-15 22:16:12.000 +0800","version_description":"Another pile of bugs got fixed and combinations for a few items are now more logical.\nIf you encounter any problems make sure to send us an email: support@littlealchemy2.com\n\nFull changelog: help.littlealchemy2.com/changelog"},{"version_id":"823859073","version_name":"1.0.11","version_date":"2017-10-01 09:35:12.000 +0800","version_description":"Fixed audio issues on iOS 11.\nFixed an issue causing the iTunes login popup to appear on launch. Now it appears only when it's necessary.\nImproved logic and removed unnecessarily duplicated results for some items.\nFixed the bug causing some items to never become depleted.\nChanged basic items so that currently they can't become depleted. This will change in the next update as we plan on improving the final stages of the game.\n\nFull changelog: help.littlealchemy2.com/changelog"},{"version_id":"824304216","version_name":"1.0.19","version_date":"2017-11-09 09:12:34.000 +0800","version_description":"Final and depleted items are now removed from the workspace and from the library only after you tap them.\nNew animations added in the game.\n\nFull changelog: help.littlealchemy2.com/changelog"},{"version_id":"826313937","version_name":"1.1.1","version_date":"2018-03-15 18:13:19.000 +0800","version_description":"39 new items added to the base game!\nAdded iPhone X support so you can use all that extra screen space.\nIntroduced the \"Myths and Monsters\" content pack with 4 new basic items and over a hundred items to discover!\nImproved the logic for a number of items - on average it shouldn't influence your progress but in some rare cases you may need to find some items again.\nAdded a new tab with the store where you can support us by purchasing themed content packs that unlock extra items.\nNew categories picker in the encyclopedia.\nChanged the sizing of the items and the library - on average it shrunk the items on smaller screens to give you more space on the workspace and to show more items on the list. It should be especially visible while playing on the iPhone in the landscape orientation.\nRewrote all popups and dialogs - now they should be smoother and better positioned than ever.\nChanged how the menu is displayed on the screen, if possible leaving more space to mix the items - again, it should be especially visible while playing in the landscape orientation on an iPhone.\nImproved the library scroll - it should especially boost the performance for the older devices with a lot of items discovered.\nEncyclopedia also got an improved scroll - it should fix a lot of the performance issues and situations where the list of items wasn't displayed properly.\nImproved how the audio is handled in the game - we hope this change will fix a lot of the issues where the sounds and music were too quiet or distorted.\nFixed the issue where any touch on the item icon in the library would open its encyclopedia page.\nFixed some edge cases causing the game to lock - let us know if you still experience problems of that nature after the update!\nImproved performance of the animations of the depleted items.\nFixed the issue where switching accounts could lead to some bizarre situations allowing players to use items they didn't discover yet.\nFixed a few minor typos - they were so tiny barely anybody noticed, but to those who did: thanks notifying us!\nMade it possible to turn content packs on and off in the store.\nAnd some other minor bugfixes and improvements that would be either too technical or minor to list.\nOr we just forgot about them.\nIt was a big update.\nI'll go to bed now.\n\nFull changelog available here:\nhttps://help.littlealchemy2.com/changelog"},{"version_id":"828322969","version_name":"1.1.6","version_date":"2018-08-24 05:13:44.000 +0800","version_description":"Fixed a bug that in some cases would prevent the 'Myths and Monsters' content pack progress from being synced properly.\nFixed some bugs who used to force scrollable areas live in the past.\nIncreased the number of free hints you can use at once.\nChanged who and how delivers rewarded videos. It should make it less common to encounter a situatio where you want to get a hint but no videos are available.\nFixed some minor bugs causing inconsistencies in login behavior.\nItems displayed in the in-game store are not supposed to be dragged around. Even if you're using and iPad on iOS 11+.\nAdded a few minor UI fixes for iPhone X.\nOn iOS audio should now play when you expect it to do so.\n\nFull changelog:\nhttps://help.littlealchemy2.com/changelog"},{"version_id":"829495869","version_name":"1.2.0","version_date":"2018-12-04 22:36:04.000 +0800","version_description":"New items!\nImproved tutorials.\nStreamlined library - removed some obscure combinations and made some items easier to find.\n\nFull changelog:\nhttps://help.littlealchemy2.com/changelog\n\nWe hope you like the new content!\nIf you happen to run into any problems make sure to send us an email: contact@littlealchemy2.com"},{"version_id":"829714497","version_name":"1.2.2","version_date":"2018-12-21 22:26:09.000 +0800","version_description":"After the latest update a few bugs required extra attention.\n\nThe bug causing the content of the library to disappear should be now fixed. But if you happen to run into it again please send us the details to support@littlealchemy2.com\nPopups are now properly sized regardless of the screen size.\nMenu buttons now again display the 'x to close' when the menu is at the bottom of the screen.\nFixed the bug causing the overlay to show up without any good reason.\n\nFull changelog:\nhttps://help.littlealchemy2.com/changelog"},{"version_id":"829753729","version_name":"1.2.3","version_date":"2018-12-23 05:50:03.000 +0800","version_description":"*** Fixed the bug causing crashes when mixing items***\nSorry for the inconvenience.\n\nAfter the latest update a few bugs required extra attention.\nThe bug causing the content of the library to disappear should be now fixed. But if you happen to run into it again please send us the details to support@littlealchemy2.com\nPopups are now properly sized regardless of the screen size.\nMenu buttons now again display the 'x to close' when the menu is at the bottom of the screen.\nFixed the bug causing the overlay to show up without any good reason.\n\nFull changelog:\nhttps://help.littlealchemy2.com/changelog"},{"version_id":"830106519","version_name":"1.2.7","version_date":"2019-01-29 15:38:21.000 +0800","version_description":"Fixed more issues causing the items in the library to completely disappear. There may be a few more, rare cases of this happening but we're doing our best to track them down!\nFixed issues preventing your purchases from registering in the game under certain, rare conditions.\nFixed the 'new item' animation that didn't run smoothly on devices with newer versions of WebKit browsers installed.\nWe had a long talk with the 'iTunes login' popup - now it will only show up when it's needed, instead of greeting you every time you launched the game.\n\nFull changelog:\nhttps://help.littlealchemy2.com/changelog"},{"version_id":"836658439","version_name":"1.3.3","version_date":"2020-07-19 10:04:36.000 +0800","version_description":"Included an option to log in using an Apple ID.\nFixed a bug that in some rare cases was causing the premium content to appear as unavailable."},{"version_id":"839554254","version_name":"1.4.0","version_date":"2020-12-12 06:43:03.000 +0800","version_description":"Fixed issues preventing some users from signing in."},{"version_id":"839780405","version_name":"1.4.8","version_date":"2021-07-20 09:43:16.000 +0800","version_description":"Updates to the in-app payments system.\nMinor bug fixes."}]