[{"version_id":"821458859","version_name":"3.6.3","version_date":"2017-05-08 03:39:25.000 +0800","version_description":""},{"version_id":"822104710","version_name":"3.7.0","version_date":"2017-05-31 02:36:28.000 +0800","version_description":"# New Features<br><br>## Post Screen<br><br>- You can now edit your posted pictures<br>- You can edit nowplaying's format<br>  - Edit by going to settings -&gt; edit #nowplaying<br><br>## Edit Profile Screen<br><br>- You can now edit your profile pictures<br><br># Bug Fixes<br><br>- Fixed the bug in which photos attached to tweets become stretched out<br>- Fixed the problem where users cannot scroll up or down when there are 7 buttons on the tool bar of the posting screen<br>- Fixed the issue in which opening the posting screen from the Web would display the image without the applied theme on the completion list screen<br>- Fixed the problem where the mute function does not work for quote tweets in the tweet details screen<br>- Fixed the bug where the lower bar falls outside the screen when rotating the screen<br>- Fixed the issue where the hash tags were not being displayed in the trend tab<br>- Fixed the problem that made it difficult to use the seek bar in the media screen<br><br># Other<br><br>- You can now set the trend position<br>- When inserting #nowplaying, you can now set whether to attach an artwork by default<br>- You can now reload video that has failed to load"},{"version_id":"822651359","version_name":"3.8.0","version_date":"2017-07-07 01:47:55.000 +0800","version_description":"Many thanks for your continuous use of Feather.<br><br>This update is regarding making the heavily requested movie post possible. Please take a look. <br><br># New Features<br><br>## Post Screen<br><br>- It is now possible to post a video<br>  - If there aren't any options to attach a video on the posting screen, then please go to Settings &gt; Posting Screen Settings &gt; Customize Tool Bar, and add it as necessary. <br>  - A video filming function will be included in the next upgrade. <br><br>## Timeline<br><br>- Added a setting option to make the icons appear rounded. <br>- Added a setting option to display the number of retweets/likes on your timeline. <br>  - Possible via: Timeline Settings &gt; Tweet Layout. <br>- If you click and hold on the URL of an image or video for an extended period of time, it will open in another browser. <br><br>## Others<br><br>- Added Smooz as external browser option<br>- Now possible to clear ones internet cache<br><br># Bug Fixes<br><br>- Fixed the bug that caused videos to fail during playback<br>- Fixed the bug that occurred when tweets were still unable to be seen on ones timeline despite clearing the block<br>- Fixed the bug that caused a tab name to be reverted back to its original name despite having changed it<br>- Fixed the bug that caused the layout to go weird when turning the screen to use the DM telephone screen. <br><br>- Fixed the bug that caused videos to fail during playback.<br>- Fixed the bug that occurred when tweets were still unable to be seen on ones timeline despite clearing the block. <br>- Fixed the bug that caused a tab name to be reverted back to its original name despite having changed it. <br>- Fixed the bug that caused the layout to go weird when turning the screen to use the DM telephone screen. <br><br># Others<br><br>- Unified the capitalization for number of favorites<br>- Added the possibility of re-tweeting your own tweets, even if both accounts are run by the same user"},{"version_id":"822825000","version_name":"3.9.0","version_date":"2017-09-08 02:23:07.000 +0800","version_description":"We'd like to thank all of our users for the many reviews they have written for us.<br><br>The theme change feature which was previously only available to pro users, has been unlocked!<br><br># New Features<br><br>## Timeline<br><br>- The counters for favorites and retweets can now be refreshed.<br>   - Due to a technical limitation, it is not possible to update these numbers perfectly in real time.<br>   - They will be updated when the detailed tweet view is opened, or when you like or retweet a tweet yourself.<br><br>## Post Screen<br><br>- A rotation tool has been added to the editor for image attachments.<br><br># Bug Fixes<br><br>- Fixed the bug in which the screen would occasionally freeze when receiving notifications.<br>- Fixed the bug where URLs contained in DMs could not be opened in external browsers.<br>- Fixed the bug where the profile screen would be displayed incorrectly.<br><br># Others<br><br>- The free version can now change themes too!"},{"version_id":"823598515","version_name":"3.10.0","version_date":"2017-11-30 02:21:59.000 +0800","version_description":"Sorry to keep all of you waiting! Here's the correspondence regarding the iPhone X display!<br><br># Bug Fixes<br><br>- Fixed bug whereby muted users are deleted when you block a user<br>- Fixed bug whereby tabs cannot be rearranged properly in the page<br>- Fixed bug whereby users are unable to change the theme color<br><br># Others<br><br>- Changed RT exclusion action when searching and increased the number of search results in Japanese<br>- Able to handle logins using the Twitter official app<br>- Able to write tweets up to 280 characters<br><br>Regarding Changes in Character Limits<br><br>You can now tweet up to 280 characters in Twitter with the exception of Japanese, Chinese and Korean.<br>We have made it possible to send out your tweet even though it exceeds the character limit.<br>Postings will fail if you exceed the character limit on Twitter however, so make sure to shorten your post before submitting again.<br>Display of the correct number of character count will be provided in future updates."},{"version_id":"825085292","version_name":"3.10.1","version_date":"2017-12-27 02:05:01.000 +0800","version_description":"The next  version will no longer supports iOS 9.3 . The next version will support iOS 10.3.<br><br># Bug Fixes<br><br>- Fixed a bug where retweet exclusion in search criteria yielded no response<br>- Fixed a bug where particular URLs would crash upon accessing<br>- Fixed a bug where large images appeared abnormal on iPhone X<br>- Fixed a bug with the automatic scrolling on iPhone X<br><br># Other<br><br>- Added an English FAQThe next version will support iOS 10.3.<br><br># Bug Fixes<br><br>- Fixed a bug where retweet exclusion in search criteria yielded no response<br>- Fixed a bug where particular URLs would crash upon accessing<br>- Fixed a bug where large images appeared abnormal on iPhone X<br>- Fixed a bug with the automatic scrolling on iPhone X<br><br># Other<br><br>- Added an English FAQ<br><br>---<br><br>Sorry to keep all of you waiting! Here's the correspondence regarding the iPhone X display!<br><br># Bug Fixes<br><br>- Fixed bug whereby muted users are deleted when you block a user<br>- Fixed bug whereby tabs cannot be rearranged properly in the page<br>- Fixed bug whereby users are unable to change the theme color<br><br># Others<br><br>- Changed RT exclusion action when searching and increased the number of search results in Japanese<br>- Able to handle logins using the Twitter official app<br>- Able to write tweets up to 280 characters<br><br>Regarding Changes in Character Limits<br><br>You can now tweet up to 280 characters in Twitter with the exception of Japanese, Chinese and Korean.<br>We have made it possible to send out your tweet even though it exceeds the character limit.<br>Postings will fail if you exceed the character limit on Twitter however, so make sure to shorten your post before submitting again.<br>Display of the correct number of character count will be provided in future updates."},{"version_id":"825605955","version_name":"3.10.2","version_date":"2018-01-22 02:12:02.000 +0800","version_description":"# Fixed a crash bug.<br><br>This problem occurs at the time of communication, and at startup, timeline update,<br>It occurred in various scenes such as posting.<br>Most of the crash reported by everyone is considered to be caused by this problem.<br>If there is a case that the problem is not fixed even if you use this version, please take a moment to report it again.<br><br># Bug Fixes<br><br>- Fixed bug that became easy to crash<br><br># Others<br><br>- Supported 280 characters tweet<br><br>---<br><br>Sorry to keep all of you waiting! Here's the correspondence regarding the iPhone X display!<br><br># Bug Fixes<br><br>- Fixed bug whereby muted users are deleted when you block a user<br>- Fixed bug whereby tabs cannot be rearranged properly in the page<br>- Fixed bug whereby users are unable to change the theme color<br>- Fixed a bug where retweet exclusion in search criteria yielded no response<br>- Fixed a bug where particular URLs would crash upon accessing<br>- Fixed a bug where large images appeared abnormal on iPhone X<br>- Fixed a bug with the automatic scrolling on iPhone X<br><br># Others<br><br>- Changed RT exclusion action when searching and increased the number of search results in Japanese<br>- Able to handle logins using the Twitter official app<br>- Added an English FAQ"},{"version_id":"826626911","version_name":"3.10.3","version_date":"2018-04-13 10:22:26.000 +0800","version_description":"# Bug Fixes<br><br>- Fixed a bug where web pages failed to save to specific external apps such as Pocket.<br><br># Others<br><br>Now you can copy the User Support ID needed to send a detailed bug report to User Support through \"Settings -&gt; Help -&gt; Report an issue or submit a request\".<br><br>We may ask you to send this ID when you're contacting User Support through replies.<br>The ID is automatically attached when contacting through email."},{"version_id":"827632916","version_name":"3.10.4","version_date":"2018-06-27 09:04:26.000 +0800","version_description":"# Bug Fixes<br><br>- Fixed bug that images of Instagram were not displayed<br><br>## Others<br><br>- Corresponded to specification change of quoted tweet API"},{"version_id":"828076631","version_name":"3.11.0","version_date":"2018-08-06 02:52:27.000 +0800","version_description":"We changed the API of DM to a new one in the update this time around due to a specification change in Twitter.<br><br>The following restrictions will occur as a result of this change.<br><br>1. DMs can only be retrieved for the last 30 days<br>2. There will be a few minutes of lag time until the DM can be retrieved after it has been sent<br><br>Also, we have plans to remove the User Stream function in the next version that will be released as the API of User Stream will be terminated on August 16.<br><br>We apologize for the inconvenience caused, but these restrictions are implemented by Twitter and cannot be worked on.<br><br>We seek your kind understanding for this matter.<br><br>## Bug fixes<br><br>- Fixed double display of title in a navigation bar<br>- Fixed uncommon crashes when swiping through tweets<br><br>## Others<br><br>- Removed function to open favstar page<br>- Changed compatible iOS versions to iOS 10.3 and above"},{"version_id":"828128388","version_name":"3.11.1","version_date":"2018-08-16 15:01:00.000 +0800","version_description":"Twitter will shut down of the User Stream API on August 16th; this update is removing related features.<br><br>The following features that depended on User Stream can no longer be used.<br><br>- Real-time updating of the timeline (The home timeline can now only be updated 15 times per 15 minutes)<br>- Simple notifications<br>- Real-time notifications of likes, retweets, and DMs<br>- The feature allowing streaming without locking the screen<br>- The feature to always scroll to the latest tweet<br><br>We understand this is an inconvenience, but these changes are being made by Twitter. We have no choice.<br><br>Please understand.<br><br>## Others<br><br>- Added Black and Dream themes"},{"version_id":"828343626","version_name":"3.11.2","version_date":"2018-09-01 04:26:25.000 +0800","version_description":"# Bug fixes<br><br>- Fixed a problem that DM cannot be received if the user who sent the DM is deleted<br>- Fixed a bug that DM can get only 50 messages"},{"version_id":"828875080","version_name":"3.11.3","version_date":"2018-10-12 03:52:47.000 +0800","version_description":"# Bug fixes<br><br>- Fixed a bug that might not be able to load Direct Message<br><br># Others<br><br>- Improved visibility of Dream theme"},{"version_id":"828932381","version_name":"3.11.4","version_date":"2018-10-17 02:12:16.000 +0800","version_description":"We are sorry for the inconvenience.<br><br>Because of a bug in the draft loading in the previous (v3.11.3) version, a problem which makes drafts disappear has been happening.<br><br>We have fixed the issue in the current version, but because of Twitter overwriting the draft data when a new draft is saved or a post is uploaded, many people have irrecoverably lost their drafts.<br><br>Users who have an iTunes backup may be able to recover their drafts by restoring it and then updating feather.<br><br>Please accept our deepest apologies for the inconvenience which we have caused.<br><br># Bug fixes<br><br>- Fixed a bug that might not be able to load Direct Message<br><br># Others<br><br>- Improved visibility of Dream theme"},{"version_id":"829272024","version_name":"3.11.5","version_date":"2018-11-19 03:16:48.000 +0800","version_description":"# Bug fixes<br><br>-  Fixed bug that can not be acquired when there are many Direct Messages.<br><br># Other<br><br>- The color of the star icon of the dream theme has been made friendly to see."},{"version_id":"829626411","version_name":"3.11.6","version_date":"2019-01-24 05:03:37.000 +0800","version_description":"# Bug fixes<br><br>- Fixed a bug that the tweet body was broken in the middle of a word."},{"version_id":"830353130","version_name":"3.11.7","version_date":"2019-02-22 02:58:23.000 +0800","version_description":"Update internal library."},{"version_id":"830745444","version_name":"3.11.8","version_date":"2019-04-02 01:39:51.000 +0800","version_description":"Updated API used to translate tweets."},{"version_id":"833696136","version_name":"3.11.9","version_date":"2019-11-28 02:11:24.000 +0800","version_description":"# Bug fixes<br><br>- Fixed a bug that crashes the app when translating tweets<br>- Fixed a bug that posting screen is not displayed correctly when tweeting web page<br>- Fixed a bug that high frame rate video can not be posted<br>- Fixed a rare crash in the timeline<br>- Fixed a bug that the theme is not reflected in the search option screen.<br>- Fixed a bug that tabs are shifted when rotating the screen.<br><br># Other<br><br>To prevent the music from playing when the media screen is closed, the paused music is not played again."},{"version_id":"834038460","version_name":"3.11.10","version_date":"2019-12-19 05:02:46.000 +0800","version_description":"# Bug fixes<br><br>- Fixed crash bug on iOS 12.1.<br>- Fixed a bug that could not be updated if the location, URL, etc. are empty in profile editing.<br>- Fixed a bug that album name could not be seen on photo selection screen when dark theme.<br>- Fixed a bug that the text color of the status bar becomes white when dark theme.<br>- Fixed an issue where it was difficult to see the settings screen when dark theme."},{"version_id":"835676399","version_name":"3.11.11","version_date":"2020-04-27 03:16:23.000 +0800","version_description":"# New features<br><br>The scroll position is now retained after restarting the app.<br>This eliminates the need to re-scroll if the app crashes in the background!<br><br># Bug fixes<br><br>-Don't lose posts even if the app crashes in the background<br>-Fixed a bug that NowPlaying may not work on the posting screen<br>-Fixed a bug that WebView opens when authenticating with Twitter app<br><br>#Other<br><br>-feather is no longer available on devices older than iOS 11.4; please update iOS"},{"version_id":"835848307","version_name":"3.11.12","version_date":"2020-05-11 02:47:01.000 +0800","version_description":"Fixed a bug that retweets were included in the trend timeline!<br><br># New features<br><br>The scroll position is now retained after restarting the app.<br>This eliminates the need to re-scroll if the app crashes in the background!<br><br># Bug fixes<br><br>-Don't lose posts even if the app crashes in the background<br>-Fixed a bug that NowPlaying may not work on the posting screen<br>-Fixed a bug that WebView opens when authenticating with Twitter app<br><br>#Other<br><br>-feather is no longer available on devices older than iOS 11.4; please update iOS"},{"version_id":"836268324","version_name":"3.12.0","version_date":"2020-06-08 02:17:19.000 +0800","version_description":"# New features<br><br>The list timeline can now be updated automatically!<br>You can turn it on and off by pressing and holding the tab!<br><br># Bug fixes<br><br>- Fixed a bug that \"Read more tweets\" appears too much in the timeline<br>- Fixed an issue where the app would quit in the background<br><br>#Other<br><br>- Added new theme<br>- Made overall design adjustments<br>- Added explanation of post button to tutorial<br>- The timeline icon is now rounded by default<br>  - Can be changed from the setting screen"},{"version_id":"836330210","version_name":"3.12.1","version_date":"2020-06-09 22:50:19.000 +0800","version_description":"We apologize for the inconvenience.<br>We fixed a bug that caused a crash after posting a tweet.<br><br># New features<br><br>The list timeline can now be updated automatically!<br>You can turn it on and off by pressing and holding the tab!<br><br># Bug fixes<br><br>- Fixed a bug that \"Read more tweets\" appears too much in the timeline<br>- Fixed an issue where the app would quit in the background<br><br>#Other<br><br>- Added new theme<br>- Made overall design adjustments<br>- Added explanation of post button to tutorial<br>- The timeline icon is now rounded by default<br>  - Can be changed from the setting screen"},{"version_id":"836618659","version_name":"3.13.0","version_date":"2020-07-09 05:05:25.000 +0800","version_description":"# New features<br><br>- Added setting to hide tab names<br>- Added result type (latest/popular) to search options<br>- The trend screen can be opened from the search screen<br><br># Bug fixes<br><br>- Fixed a bug that countries could not be selected on the trend screen<br><br># Other<br><br>- Changed to show in recent searches even when changing search options<br>- Added the number of tweets on the trend list screen<br>- Made it easier to see the display that reads tweets"},{"version_id":"837247097","version_name":"3.14.0","version_date":"2020-08-07 08:10:56.000 +0800","version_description":"# Bug fixes<br><br>- Fixed a bug that the app crashes when deleting search history<br>- Fixed a bug that the position of the heart on the timeline is misaligned<br>- Fixed a bug that the profile screen display collapsed when changing the tweet layout setting<br><br># Other<br><br>- Removed \"All\" from search results options<br>- Image size increased when the quality of posted images was high"},{"version_id":"837746371","version_name":"3.15.0","version_date":"2020-09-15 07:53:25.000 +0800","version_description":"# New features<br><br>We forgot to write it in the last release notes, but now you can set the background of the timeline!<br>You can set it from \"Settings-&gt; Timeline Settings-&gt; Tweet Layout\"!<br><br># Bug fixes<br><br>- Fixed a bug that the release notes after the update may not be displayed.<br><br>#Other<br><br>- Removed the limit on the number of tabs"},{"version_id":"838530095","version_name":"3.16.0","version_date":"2020-11-09 02:02:41.000 +0800","version_description":"# Bug fixes<br><br>- Fixed a bug that Instagram images are not displayed.<br>- Fixed a bug where tweets were tweeted when the Tweet button was swiped down."},{"version_id":"839566854","version_name":"3.17.1","version_date":"2020-12-11 03:04:47.000 +0800","version_description":"# Bug fixes<br><br>- Fixed a bug that the background image of the timeline was not reflected<br>    - We are currently investigating a problem that the background image of the reply tweet does not change.<br>- Fixed an animation bug when closing the media screen quickly<br>- Fixed a bug that could cause a crash when opening a new feature pop-up<br><br># Other<br><br>- Design adjustment"},{"version_id":"840631021","version_name":"3.18.0","version_date":"2021-03-01 07:04:51.000 +0800","version_description":"# Bug fixes<br><br>- Fixed a bug that the background image of the timeline could not be set.<br>- Fixed a bug that the timeline became heavy on some iPhones<br><br># Introduction of useful features<br><br>You can close the screen by swiping down the toolbar on the post screen!<br>You no longer have to stretch your finger to the top of the screen!"}]