[{"version_id":"824407771","version_name":"5.0","version_date":"2017-11-24 11:10:05.000 +0800","version_description":""},{"version_id":"825035972","version_name":"5.0.1","version_date":"2017-11-30 09:07:46.000 +0800","version_description":"• Fixes myMindNode registration<br>• Fixes an animation glitch in tutorial<br>• Fixes a style issue when inserting a new parent node<br>• Fixes a crash when opening a document<br>• Fixes notes paring in Quick Entry<br>• Design improvements on iPhone X<br>• Fixes a rotation bug in image picker<br>• Make it easier to purchase IAP from document manager<br>• Improved legacy document mode"},{"version_id":"825263336","version_name":"6.1.2","version_date":"2019-12-04 08:52:23.000 +0800","version_description":"• Fixes a crash when importing XMind documents<br>• Ensures correct branch rendering after deleting a child node with a task<br>• Fixes a crash when exporting Markdown documents with Asian characters<br>• Fixes a bug that prevented reopening the last open document on app relaunch<br>• Ensures node titles are displayed correctly when switching between tabs in the panel<br>• Ensures the 'Transparent Background' toggle when exporting images works correctly<br>• Reduces blurriness during zooming<br>• Ensures correct restoring of scroll position when opening a document"},{"version_id":"825263336","version_name":"5.0.2","version_date":"2017-12-13 11:16:08.000 +0800","version_description":"ENHANCEMENTS<br>• Add new action to only delete the current node (normal delete will continue to also delete all subnodes)<br>• Use a docked Outline on iPhone X<br>• New share sheet action to create a URL to open the current document (makes it easier to link to documents or build workflows)<br>• Allow to export PNGs with transparent backgrounds <br>• Add \"Delete Attachment\" action to panel<br>• Long press on action icon to toggle task state when a node is selected or reset waypoint when a connection is selected<br>• Allow to select pure white, pure black color in color picker<br><br><br>FIXES<br>• Ensure Cut/Copy/Paste is always displayed in the correct language<br>• Fixes missing localisation on the settings screen<br>• Improve node dragging performance when the panel is open<br>• Ensure \"new node\" images are always updated based on the current branch direction<br>• Better communicate that the trial is ending automatically<br>• Trim certain control characters on paste to prevent a data loss issue when copying text from PDF Expert<br>• Fixes fill color of Teal theme<br>• Use better defaults for fill color when extracting a theme<br>• The \"Default\" theme section is now called \"Build-in\"<br>• Automatically set a newly created theme as the default theme<br>• Fixes a dark mode issue in font search"},{"version_id":"825957920","version_name":"5.0.5","version_date":"2018-02-15 09:19:54.000 +0800","version_description":"• Fixes a crash in the Apple Watch app"},{"version_id":"826032220","version_name":"5.0.6","version_date":"2018-02-21 10:37:29.000 +0800","version_description":"THINGS EXPORT<br>Send your tasks to Things 3.4. Your document is converted into a new project with all open and completed tasks. Hierarchies are exported as headers in Things.<br><br>ENHANCEMENTS<br>• When creating a document in a third-party sharing provider, MindNode will now default to a single file format. This enables to store documents in other storage locations like Dropbox, OneDrive and Box.<br><br>FIXES<br>• Fixes an issue related to pasting a text outline when using top-down-layout.<br>• Fixes an issue related to pasting unformatted text (including URLs) into notes."},{"version_id":"826140657","version_name":"5.0.7","version_date":"2018-03-01 16:40:42.000 +0800","version_description":"ENHANCEMENT<br>• We redesigned the free trial workflow to no longer require to purchase a free In-App-Purchase<br><br>FIXES<br>• Fixes a crash when opening a document on Apple Watch - sorry about this regression!<br>• Allow to add links to URL schemes using the Add Link action"},{"version_id":"826555766","version_name":"5.0.8","version_date":"2018-04-05 11:57:48.000 +0800","version_description":"FIXES<br><br>• Fixes an issue related to overuse of memory that sometimes caused the app to terminate while in background<br>• Prevents cut off price labels in some localizations<br>• Support tapping on links to other apps (URL schemes) in notes<br>• Fixes a crash in image picker<br>• Fixes several issues related to importing XMind documents<br>• Fixes loading of myMindNode's Terms of Service and Privacy Policy<br>• Fixes a crash when deleting a cross connection<br>• Fixes a Things exporter issue related to documents with tasks in main nodes<br><br><br>APPLE WATCH<br><br>• Use the correct tint color for the complication icon"},{"version_id":"826652392","version_name":"5.0.9","version_date":"2018-04-12 17:58:09.000 +0800","version_description":"• Fixes a crash when triggering a node action during note editing<br>• Fixes a visual glitch when entering edit mode using the outline<br>• Fixes an issue when changing selection in outline when in edit mode<br>• Fixes a crash during document loading"},{"version_id":"826790686","version_name":"5.0.10","version_date":"2018-04-25 08:02:33.000 +0800","version_description":"* Fixes a crash when opening documents that were created using an older beta version<br>* Don't create a note when using -- in a node title. You can continue to use the -- shortcut to create a note, by placing it on a separate line.<br>* Fixes an issue related to importing iToughts documents<br>* Adds logging instructions to help us debug a frequent crash. If you know of a way how to reproduce a crash, please let us know: support@mindnode.com"},{"version_id":"826877144","version_name":"5.0.11","version_date":"2018-05-01 15:23:27.000 +0800","version_description":"• Fixes a crash when creating a new node<br>• Improves myMindNode registration"},{"version_id":"827572780","version_name":"5.1","version_date":"2018-06-21 11:35:21.000 +0800","version_description":"PERFORMANCE<br>This release increases the overall performance when using MindNode. Document save and load is considerable faster; almost every direct interaction on the canvas is smoother. Especially when working with large documents, MindNode is now more responsive.<br><br> ENHANCEMENTS<br>• Imports supported document formats (FreeMind, OPML, …) directly from MindNode's document manager<br>• Allows to store documents locally on the device<br>• Adds new option to download new themes from mindnode.com/themes<br>• Adds ability to subscribe to a new email tutorial during first launch<br>• Adds ability to reset the connection waypoint<br>• Quick Entry will now use the branch color to tint task indicators<br>• When turning off \"level dependent style\", reset branch width to the default width of the current theme<br>• Shrinks the inspector on iPhone if it was fullscreen, when adding an image<br>• Improves handling of favorite colors <br><br>FIXES<br>• Fixes several issues related to text handling, including retaining empty lines at the beginning of a title<br>• Fixes several crashes related to undoing and redoing<br>• Fixes a crash during image resizing<br>• Fixes an issue related to blurry images when opening a document<br>• Uses correct preview images in sticker picker<br>• Fixes a crash when triggering undo from a Chinese handwriting keyboard<br>• Fixes pasting text into notes from Ulysses<br>• Fixes a bug where the node well was not shown after adding a photo to a node"},{"version_id":"827663039","version_name":"5.1.1","version_date":"2018-06-27 09:22:52.000 +0800","version_description":"ENHANCEMENTS<br>• Adds swipe-to-delete to outline<br><br>FIXES<br>• Only show \"Reorganize Nodes\" action, when there are subnodes to reorder<br>• When tapping on a node that contains a link, ensures that the entire node is visible<br>• Fixes a bug that caused the resize handle to be positioned on the wrong side<br>• Fixes a visual glitch when searching in outline on iPhone X<br>• Fixes a crash during on-boarding<br>• Fixes a crash when exporting large documents as an images<br>• When zooming to “Actual Size”, ensure the current selected node stays visible<br>• Fixes a hang when undoing multiple fold operations<br>• Fixes a crash when opening a document with images<br>• Fixes a crash when using Quick Look"},{"version_id":"827995297","version_name":"5.1.3","version_date":"2018-07-26 07:55:12.000 +0800","version_description":"ENHANCEMENTS<br>• Improves Quick Entry performance<br>• Improves task inheritance in Quick Entry mode <br>• Shows a more descriptive undo message when triggering undo using the two-finger gesture<br><br><br>FIXES<br>• Allows to add a link to the current selected text and not only to the entire title<br>• Removes animation when changing connection end points<br>• Improves error messages during document loading<br>• Fixes a branch thickness issue when creating nodes using the + sign<br>• Fixes a sticker display issue in outline<br>• Fixes a data loss issue when using asian characters with different attributes<br>• Improves error messages in Versions browser<br>• Don't scroll canvas when it gains Voice Over focus<br>• Fixes an issue when opening not yet downloaded documents via Files app<br>• Fixes an issue related to ending title editing when changing the insertion cursor<br>• Fixes a crash when triggering undo while in \"Apply Style\"-mode<br>• Fixes a crash when an open documents gets modified on an other device<br>• Fixes a crash during saving when a document is open on an other device<br>• No longer request two undo operations when adding an image<br>• Fixes a crash when pasting or dragging an image onto a node"},{"version_id":"828555655","version_name":"5.1.6","version_date":"2018-09-13 13:47:43.000 +0800","version_description":"ENHANCEMENTS<br>• Improves Markdown export of notes<br>• Improves spacing of iPad keyboard accessory buttons<br>• Changes sorting of export options to sort them alphabetically<br><br>FIXES<br>• Fixes an issue that caused incorrect ordering of undo operations<br>• Uses the correct stroke width when \"Level Dependent Style\" is disabled<br>• Fixes overlapping of branches when exporting as a PDF or an image<br>• Fixes an issue with XMind import<br>• Fixes a performance issue when selecting a node<br>• Ensures future compatibility of Things integration"},{"version_id":"828743370","version_name":"5.1.7","version_date":"2018-10-03 13:42:07.000 +0800","version_description":"• Fixes a crash when attaching a node to a main node<br>• Fixes a crash when a documents gets reverted to a previous version (e.g. during conflict resolution)"},{"version_id":"828950648","version_name":"5.2","version_date":"2018-10-18 07:14:30.000 +0800","version_description":"Siri Shortcuts<br>• Launch Quick Entry or open your favorite document using your personal Siri Shortcut<br>• Make MindNode part of your Siri Shortcuts workflow using new actions to import and export documents<br>• New URL-Schemes to import and export documents - Learn all the details in our User Guide<br><br><br>Custom App Icons<br>• You can now customize the look of MindNode on your home screen<br>• Change the app icon to a classic or more colourful icon in MindNode's Settings<br><br><br>ENHANCEMENTS<br><br>• Adds 5 new stickers (Apple, Cake, Clock, Pie, Tree)<br>• Adds one new themes (Slate)<br>• Highlights nodes on canvas when changing selection in outline <br>• Adds full Apple Watch Series 4 compatibility<br>• Improves the panel to show quick actions in landscape mode on iPhone Xs Max and Xr<br>• Adds a shortcut to clear the current selection (Control-Option-Command-A)<br><br><br>FIXES<br><br>• Improves error reporting when opening a document with missing images<br>• Fixes a crash during node resizing<br>• Ensures that selected nodes stay visible, when moving them using the arrow keys<br>• Outline entries with a lot of text content are sized correctly <br>• Fixes a crash during on-boarding on iPad<br>• Fixes a disappearing selection issue when checking a task<br>• Fixes a crash when opening documents<br>• Fixes an animation glitch when pasting text into Quick Entry"},{"version_id":"829032566","version_name":"5.2.1","version_date":"2018-10-25 11:36:34.000 +0800","version_description":"FIXES<br>• Fixes slowdowns when selecting nodes or connections<br>• Fixes localizations on about and settings screen<br>• Fixes text alignment in Slate theme<br>• Fixes a crash when closing a document"},{"version_id":"829117311","version_name":"5.2.2","version_date":"2018-11-09 10:22:29.000 +0800","version_description":"ENHANCEMENTS<br>• Adds full support for the new 11\" and 12.9\" iPad Pro<br>• Parses bold and italic font traits when importing iThoughts or Markdown documents<br><br>FIXES<br>• Uses the correct font size when importing notes from Markdown documents<br>• Fixes an image import issue when importing MindManager or iThoughts documents<br>• Fixes a hang when creating connections during node editing<br>• Uses the correct paste behaviour when pasting text into notes<br>• Fixes a crash when rotating an iPhone with an open outline"},{"version_id":"829593688","version_name":"5.2.3","version_date":"2018-12-13 11:55:51.000 +0800","version_description":"ENHANCEMENTS<br>• Adds actions to copy and paste style<br>• Adds actions to scroll to the start and end node of a connection<br>• Improves performance when selecting a node<br>• Improves performance during text input<br>• Makes folding indicator on nodes tap-able<br>• Opens Shortcuts app after running specific shortcuts<br>• Allows to specify document path and title, when creating a new document via URL Scheme<br><br>FIXES<br>• Prevents folded nodes to appear in Voice Over<br>• Fixes a bug where the Outline would appear empty<br>• Removes white flickering background when rotating the iPad<br>• Retains strike-through text when applying a theme <br>• Tries to recover when sticker is not part of the document<br>• Fixes a bug which lead to wrong branch layouts in manual layout<br>• Ensure that a node in text editing or resizing state isn't covered by any other node<br>• Selects a cross connection when clicking on it's title<br>• Fixes a bug which prevented the selection of cross connections after folding<br>• Fixes a drawing glitch when resizing a node<br>• Fixes a crash when dragging first level nodes<br>• Fixes a crash when changing selection after text editing<br>• Improves the dialog that appears when a document has missing images<br>• Fixes an undo related crash<br>• Improves URL scheme generation for local documents"},{"version_id":"829744409","version_name":"5.2.4","version_date":"2019-01-28 12:36:59.000 +0800","version_description":"ENHANCEMENTS<br>• Updates all existing localizations<br>• Shows selection on external screen <br><br><br>FIXES<br>• Fixes pasting text from MindNode into Keynote<br>• Improves performance when deleting or cutting a node<br>• Improves performance during text editing and node dragging<br>• Fixes cross connection waypoint positioning after copy and paste<br>• Fixes incorrect layout when pasting text list onto a node<br>• Ensures folded nodes can't be edited<br>• Fixes a crash when creating a new child node<br>• Fixes a bug showing a folding indicator on a node without children<br>• Ensures cross connection are displayed correctly after dragging of a connected node<br>• Allows image resizing without resizing the text of a node<br>• Fixes a crash when try to connect a node to it's child node<br>• Fixes a bug that lead to an incorrect layout, when pasting text onto nodes in manual layout<br>• Ensures that cross connection titles are displayed correctly after moving a node<br>• Optimizes the display of URLs with the MindNode URL Scheme in node titles<br>• Fixes importing of RTF and TaskPaper documents via the MindNode URL Scheme<br>• Fixes starting text editing with Apple Pencil<br>• Fixes a crash when using CMD+F<br>• Prevents deselecting a node when editing it's note and tapping on the canvas to dismiss the keyboard"},{"version_id":"830412295","version_name":"5.2.6","version_date":"2019-03-04 09:44:08.000 +0800","version_description":"FIXES<br>• Better retains the selection after undo operations<br>• Improves display of purchase state on About view<br>• Fixes a glitch where a node branch would still be displayed after deleting a node<br>• Fixes link detection for some links on note panel<br>• Fixes opening of recent documents from MindNode's Today Widget"},{"version_id":"831041274","version_name":"6.0","version_date":"2019-04-24 09:04:13.000 +0800","version_description":"FOCUS MODE<br>Put a spotlight on one part of your mind map and fade out all the rest. Focus Mode helps you minimize distractions and stay focused to finish your thought.<br><br>HIDE CONNECTIONS<br>Reduce distractions even further by hiding all connections on the canvas.<br><br>STICKER SEARCH<br>Quickly find the right sticker to make your document even more appealing.<br><br>MULTI-SELECT<br>Styling, editing and rearranging multiple nodes just got a whole lot easier. Select multiple objects by touching and holding anywhere on the canvas.<br><br>EXTERNAL SCREEN SUPPORT<br>Big ideas need space. With an external screen, you get a different perspective on your idea. Improvements include locking the viewport on the external screen, as well as viewing notes and using Quick Look for images.<br><br>CUSTOMIZABLE PANELS<br>Make your workspace your own. Drag and drop your favorite actions onto the panel's quick actions. On iPad drag the panels to the other side of the screen.<br><br>TRADITIONAL CHINESE<br>MindNode is now available in Traditional Chinese, increasing overall localizations to 14.<br><br><br>ENHANCEMENTS<br>• Unifies selection highlighting of nodes and connections across iOS and macOS<br>• Further unifies keyboard shortcuts across iOS and macOS, including shortcuts for folding, zooming and changing font size<br>• Supports importing of new Mind Zen documents<br>• New shortcuts including …<br>• Adds shortcut to zoom to the current selection (Command-*)<br>• Accessibility improvements such as announcing notes and connections<br>• Improves the order of actions in the action panel and edit menu<br>• Adds headers to action groups in the action panel<br>• New visualization for the connection creation mode<br>• Improves Apple Pencil usability<br><br>FIXES<br>• Ensures nodes, branches, connections and knobs are correctly animated<br>• Ensures correct animations during folding and unfolding<br>• Allows undoing node creations with Command-Z and 2-finger tap<br>• MindNode now correctly reopens the last open document if the app was closed in the background<br>• Ensures correct positions of orthogonal branches when using cloud shapes<br>• Fixes the \"mindnode://newDocument\" scheme when no filename was supplied<br>• Fixes jumping arrows when connections are animated<br>• Fixes a bug where the node well and the resizing knob wouldn't be visible, when switching to certain apps and back<br>• Allows to exit modal dialogs with ESC or the keyboard shortcut Command-.<br>• 'Delete Single Node' now also works on leaf nodes"},{"version_id":"831096934","version_name":"6.0.1","version_date":"2019-04-29 06:06:42.000 +0800","version_description":"• Fixes a visual glitch related to branch drawing<br>• Fixes a crash when opening certain documents<br>• Fixes importing of XMind documents created with Lighten<br>• Fixes an issue where branches got stuck during node folding<br>• Fixes an outline height issue for nodes with tasks<br>• Improves the selection animation<br>• Ensures that nodes aren't hidden by the panel during editing<br>• Shows a HUD when a document gets restored on launch<br>• Correctly hides the external screen popover when the screen gets disconnected<br>• Fixes VoiceOver and the button height on the What's New screen<br>• Allows to use Paste Style when Focus Mode is enabled<br>• Fixes a performance issue when saving or exporting documents"},{"version_id":"831280004","version_name":"6.0.2","version_date":"2019-05-15 07:43:14.000 +0800","version_description":"• Improves performance when adding images to a document<br>• Fixes the order of nodes after rewiring<br>• Fixes a crash when searching in outline<br>• Fixes a crash when creating nodes via node well<br>• Allows to enter Focus Mode when in Viewer Mode<br>• Improves the performance when editing a document with many images<br>• Ensures only visible nodes are selected after pasting<br>• Fixes blurry nodes during zooming<br>• Improves the display of connection titles<br>• Allows to create new main nodes in Focus Mode<br>• Improves performance when interaction with cloud-shaped nodes<br>• Resolves a hang on app launch<br>• Improves opening of the What's New screen<br>• Improves VoiceOver support when refocusing<br>• Improves Accessibility Magic Tap to focus on a focused node or the last selected node<br>• Supports dynamic type on the Help and What's New screens<br>• Fixes an issue that caused the edit menu to appear for the wrong node<br>• Fixes a crash when uploading documents to myMindNode<br>• Applies the correct style when dropping text from another apps<br>• Allows to drag and drop URLs onto the canvas<br>• Fixes a crash when change properties of multiple objects<br>• Only shows \"Apply Style to…\"-button in inspector when a single object is selected"},{"version_id":"831552642","version_name":"6.0.3","version_date":"2019-06-05 09:10:24.000 +0800","version_description":"ENHANCEMENTS<br>• Adds long-press on node width cell to enter a node width<br>• Improves zooming behaviour when ending Focus Mode<br>• Allows to change text alignment of Connection titles<br>• Adds keyboard shortcuts for \"Hide Connections\", moving nodes to one side, cycling main nodes and text alignment<br>• Improves first launch screens<br>• Adds two finger tap to undo on notes panel<br>• Mirrors panel position between internal and external screen<br>• Makes Multi-Select accessible via VoiceOver<br>• Adds hint when rubber band selection can be performed<br>• Supports Dynamic Type on style panel and improves it in the share menu and the outline<br><br>FIXES<br>• Fixes blurry text on retina screens during on-boarding<br>• Fixes a bug where the \"What's New\" screen would be shown too often<br>• Fixes panel not collapsing when creating a new node<br>• Ensures all pictures in credits have the same size<br>• Improves animation when \"Zoom to Actual Size\" is triggered<br>• Allows to dismiss link popover and about screen using the ESC key"},{"version_id":"831668832","version_name":"6.0.4","version_date":"2019-07-25 07:45:10.000 +0800","version_description":"IMPROVEMENTS<br>• Improves support for dynamic type in outline and font picker<br>• Adds support for 3-finger swipe gestures to undo and redo on iOS 12 (this replaces the previous fold swipe gesture)<br>• Removes 3-finger swipe gesture for focus mode and node creation on upcoming iOS releases (this prevents conflict with new system gestures)<br>• Fixes importing of Markdown documents from Dropbox<br>• Correctly updates style in panel after undo or paste<br>• Includes connection titles in VoiceOver announcements<br>• Fixes a bug during panel resizing<br>• Adds Fold and Unfold actions to edit menu in multi-select<br>• Correctly positions \"Exit Full Screen\" button for RTL languages <br>• Fixes a visual glitch when entering full screen on iPad with a full-height panel open<br>• Dragging formatted text from Notes app now correctly preserves formatting"},{"version_id":"832278121","version_name":"6.0.5","version_date":"2019-08-07 09:33:19.000 +0800","version_description":"• Allows using the \"Center Main Node\" during node title editing<br>• Adds a new shortcut \"Center Selection\" that can be triggered using \"Ctrl + Cmd + R\"<br>• Fixes a crash when exporting documents<br>• Fixes a crash when showing the panel with a multi-selection<br>• Fixes a crash when selecting nodes with images attached<br>• Prevents entering an invalid width, when long-pressing the node width in panel<br>• Right-to-left content of notes now stays RTL after editing"},{"version_id":"832626528","version_name":"6.0.6","version_date":"2019-09-05 08:06:07.000 +0800","version_description":"• Supports opening and saving of documents using upcoming new MindNode features<br>• Fixes a crash when uploading documents to myMindNode<br>• Fixes Apple Watch localization"},{"version_id":"832952947","version_name":"6.1","version_date":"2019-09-30 13:09:38.000 +0800","version_description":"MULTIPLE DOCUMENTS (iPadOS 13 only)<br>We've updated our iPad version to allow opening multiple documents. Open two MindNode documents side by side to work on them simultaneously. We also extended support for multiple documents to Quick Entry, which now supports multiple drafts.<br><br><br>SYSTEM DARK MODE (iOS 13 only)<br>iOS 13 adds a system-wide Dark Mode and we are now fully supporting it. We also added the ability to configure the default appearance in MindNode's settings. For example, if you preferred our previous theme-base dark mode, you can configure it there.<br><br><br>ANNOTATE IMAGES (iOS 13 only)<br>MindNode integrates with new iOS 13 Apple Pencil improvements. Add new drawings to your documents or annotate existing images. You can also take Full-Page screenshots using iOS' native Screen Capture tool (Press the Side/Top button and the Volume up button at the same time).<br><br><br>SHORTCUTS PARAMETERS (iOS 13 only)<br>Shortcuts now support parameters and our \"New Document\", \"Export\" and \"Quick Entry\" shortcuts take full advantage of them.<br><br><br>OTHER iOS 13 ENHANCEMENTS<br>• Full support for iOS 13 gestures (undo, redo, copy &amp; paste)<br>• Home Screen Quick Actions on iPadOS<br>• Support for external storage media<br>• 2-finger multi-select swipe gesture in Outline Mode<br>• iOS 13 native sheet presentation<br><br><br>ENHANCEMENTS<br>• Improves previews for themes with bordered nodes<br>• Ensures that when importing a document, the original file is not deleted<br>• Allows equal-characters in filenames"},{"version_id":"833028738","version_name":"6.1.1","version_date":"2019-10-04 13:08:03.000 +0800","version_description":"IMPROVEMENTS<br>• Only show MindNode documents on the Recents tab<br>• Fixes a crash when rotating the device<br>• Fixes a crash when loading or saving documents with asian characters<br><br><br>APPLE WATCH<br>• Fixes a crash on watchOS 4"},{"version_id":"833840707","version_name":"6.1.2","version_date":"2019-12-04 08:52:23.000 +0800","version_description":"• Fixes a crash when importing XMind documents<br>• Ensures correct branch rendering after deleting a child node with a task<br>• Fixes a crash when exporting Markdown documents with Asian characters<br>• Fixes a bug that prevented reopening the last open document on app relaunch<br>• Ensures node titles are displayed correctly when switching between tabs in the panel<br>• Ensures the 'Transparent Background' toggle when exporting images works correctly<br>• Reduces blurriness during zooming<br>• Ensures correct restoring of scroll position when opening a document"},{"version_id":"834403005","version_name":"7.0","version_date":"2020-01-22 09:57:52.000 +0800","version_description":"VISUAL TAGS<br>Categorize and add more context to your thoughts. Use tags to prioritize ideas and bring focus to a related group of ideas that are otherwise not connected. Using our tag-highlight mode you can focus on selected tags to discover new connections.<br><br>MORE STYLES<br>Personalize your mind map with a fresh batch of stickers and a new theme.<br><br>MINDNODE PLUS<br>MindNode 7 is a free update for existing customers. New customers can unlock our full feature set with our new cross-platform MindNode Plus subscription. <br><br>FREE EDITOR<br>Our free version now allows basic editing operations like adding nodes, reordering and folding.<br><br>IMPROVEMENTS<br>• Improves advanced text shortcuts to support tasks, notes and tags, and adds a new setting to toggle them<br>• Improves performance when opening and editing documents<br>• Adds Quick Look support for MindNode documents in Files app<br>• Improves document thumbnail support<br>• Allows entering fullscreen with double tap on Apple Pencil 2<br>• Adds new keyboard shortcut (Option-Shift-Command-V) to trigger “Paste &amp; Preserve Style”<br>• Fixes a bug where Focus Mode would not zoom correctly<br>• Fixes a display issue in outline when a main node is selected<br>• Fixes a hang in the on-boarding tutorial"},{"version_id":"834513223","version_name":"7.0.1","version_date":"2020-01-31 08:41:50.000 +0800","version_description":"• Adds full spotlight integration for all documents in MindNode's iCloud container<br>• Fixes a crash when deleting or renaming personal themes<br>• Fixes paragraph spacing on the upgrade screen<br>• Improves contrast of unfocused nodes in Focus Mode<br>• Ensures the tags view is correctly refreshed after a document update<br>• Fixes blurry image picker thumbnails<br>• Fixes a bug related to correctly triggering multi-select gestures<br>• Ensures the edited text stays visible when using a floating keyboard<br>• Removes 3D-touch to show notes on canvas to make it easier to drag nodes<br>• Ensures the quick-type-bar in QuickEntry is correctly updated<br>• Fixes a crash when closing a document while editing a tag name"},{"version_id":"834591769","version_name":"7.0.2","version_date":"2020-02-05 09:46:34.000 +0800","version_description":"• Ensures images added from iCloud Photo Library are crisp<br>• Improves VoiceOver support for tag management<br>• Allows to toggle between Notes/Tags in panel by tapping on the selected tab again<br>• Fixes a bug where the purchase button was accidentally shown for users who had purchased MindNode 5/6<br>• Fixes flickering of image picker when changing selection"},{"version_id":"834664507","version_name":"7.0.3","version_date":"2020-02-12 11:00:38.000 +0800","version_description":"• Fixes a crash in sticker picker on iOS 13<br>• Fixes an unintended segment change when tapping on an icon in the collapsed panel<br>• Fixes the tint color of stickers when opening the sticker picker"},{"version_id":"835040107","version_name":"7.0.4","version_date":"2020-03-11 08:42:18.000 +0800","version_description":"7.0.4 is a minor update with a few improvements and bug fixes<br><br>IMPROVEMENTS<br>• Improved the width of the tag-popover<br>• Improved error handling when a missing font fails to download<br>• Improved the layout of the welcome screen<br>• Let users decide how to deal with missing custom fonts before opening a document<br>• Fixed \"Copy URL Scheme\" when a document is stored in a subfolder<br>• Fixed a bug where customizing panel actions would sometimes not work<br>• Fixed missing print previews on iPad<br>• Fixed an issue that prevented displaying document loading errors"},{"version_id":"835495677","version_name":"7.1","version_date":"2020-04-16 12:46:32.000 +0800","version_description":"New Node Shapes<br>Use the all new hexagonal and octagonal node shapes for a fresh way to highlight your ideas.<br><br>Image Position<br>Arrange sticker and images where you want them, below or next to your idea.<br><br>New Shortcut<br>Enhance your Shortcuts to automatically export documents to Reminders, Things, &amp; OmniFocus<br><br>Improvements<br>• Added basic pointer support on iPadOS 13.4 devices with attached trackpad<br>• Fixed a bug where styles from the color or font picker would not be applied correctly<br>• Fixed a bug where \"Fold All Completed Tasks\" did not fold parent nodes with a single child node<br>• Fixed a bug which turned anchors in URL links into tags<br>• Fixed a bug which resulted in pixelated images when exporting<br>• Improved the autocapitalization of subnodes in Quick Entry<br>• Added the option to import a lower quality image if drag and drop fails from the image picker<br>• Fixed legibility of information overlays<br>• Improved the description of advanced text shortcuts<br>• Fixed a glitch when pasting nodes in vertical layout<br>• Fixed a layout issue when importing several images in manual layout <br>• Fixed an undo bug related to toggling tasks"},{"version_id":"835639112","version_name":"7.1.1","version_date":"2020-04-23 15:48:30.000 +0800","version_description":"• Fixed a bug that caused the border style section to be missing<br>• Fixed a crash when using a beta version of iPadOS/iOS<br>• Fixed a crash when displaying the outline<br>• Fixed a crash when applying a theme"},{"version_id":"835920663","version_name":"7.2","version_date":"2020-05-18 09:31:05.000 +0800","version_description":"iPad Trackpad Support<br>Enjoy full trackpad support in iPadOS. Instantly move nodes, select multiple nodes with rubber band selection, and easily interact with tasks, notes, and tags.<br><br><br>IMPROVEMENTS<br>• Improved tags to be displayed in the same order on a node as they are in the sidebar<br>• Improved importing of photos<br>• Optimized storage size of newly added photos<br>• Added the ability to move multiple nodes at once via keyboard shortcuts<br>• Added the ability to mirror multiple nodes at once via keyboard shortcuts<br>• Added the ability to start text editing of nodes by simply typing a character on an external keyboard<br>• Improved sticker &amp; image alignment for nodes with long titles<br>• Fixed a crash after ending text editing<br>• Fixed a bug when resizing title and sticker/images"},{"version_id":"836317430","version_name":"7.2.1","version_date":"2020-06-09 08:21:13.000 +0800","version_description":"This update adds support for contextual menus when using the iPad pointer as well as several bug-fixes and improvements.<br>​<br>​<br>IMPROVEMENTS<br>• Added support for secondary clicks to access a contextual menu when using the iPad pointer<br>• Added support for characters from any language in tags<br>• Ensured that the node width updates after the image position has been changed<br>• Fixed several small bugs and made improvements to the iPad pointer interaction<br>• Fixed an issue with pasting in the Free Editor<br>• Fixed a drawing glitch when exporting mind maps with underlined nodes to PDF or image<br>• Fixed the positioning of title resizing knobs after toggling the width manually<br>• Fixed a crash when using drag &amp; drop from the color picker"},{"version_id":"836730119","version_name":"7.3","version_date":"2020-07-08 07:55:43.000 +0800","version_description":"Enhanced Visual Tags<br>Show unions and intersections when highlighting tags. Highlight and remove tags directly on the node.<br><br>New Styles<br>Use embedded styles in horizontal layout and line style in vertical layout. New borderless main node style options.<br><br><br>IMPROVEMENTS<br>• Improved Smart Layout to generate more balanced layouts<br>• Added support for importing and exporting tags from Plain Text, RTF, Markdown, TextBundle, TaskPaper, CSV and OPML <br>• Added the option to use \"Paste and Preserve Style\" in notes panel<br>• Added support for including links in outline search results<br>• Changed the default paste behaviour to \"Paste and Match Style\" to be in sync with macOS <br>• Ensured that the correct branch thickness is displayed when dragging nodes<br>• Ensured that cross connections are always fully visible when exporting images or PDFs<br>• Ensured that the text cursor appears where the user taps in notes, rather than at the end of the text<br>• Fixed a bug where Quick Entry would incorrectly import pasted text outlines <br>• Fixed a bug where empty lines in Quick Entry would be imported as empty main nodes<br>• Fixed a crash when importing MindJet documents with unsupported image types<br>• Fixed a bug where interacting with the node well didn't work <br>• Fixed a tag indicator drawing glitch when adding and removing tags<br>• Adding text to a node can also be started by merely typing when a node is selected. This is now also possible when the first character has an accent mark.<br>• Fixed excessive tap visualization when using the pointer on iPadOS<br>• Improved the drag &amp; drop behavior when using the pointer on iPadOS"},{"version_id":"836758914","version_name":"7.3.1","version_date":"2020-07-08 23:06:33.000 +0800","version_description":"IMPROVEMENTS<br>• Fixed a crash in the onboarding tutorial"},{"version_id":"837235883","version_name":"7.3.2","version_date":"2020-08-10 08:11:32.000 +0800","version_description":"POINTER GESTURES<br>We brought two pointer gestures from the Mac to iPad:<br>• Hold the Option key (⌥) to turn the node well into a folding indicator to quickly fold nodes.<br>• Hold the Option key (⌥) and click on the canvas to create a new main node.<br><br><br>IMPROVED VISUAL TAGS<br>Highlighting a tag now also indicates nodes that are folded.<br><br><br>IMPROVEMENTS<br>• Fixed a bug where new nodes could not be created after cancelling dragging<br>• Fixed a crash caused by dragging and dropping text lists onto the canvas<br>• Fixed a crash when entering tag highlighting in an upcoming iOS update<br>• Fixed an issue which made branches look tangled after pasting<br>• Fixed an issue where straight branches in an embedded, top-down layout had an unnecessary curve"},{"version_id":"837822941","version_name":"7.3.3","version_date":"2020-09-21 08:29:03.000 +0800","version_description":"This update adds a new keyboard shortcut to quickly create new connections and fixes several bugs.<br><br><br>IMPROVEMENTS<br>• Added a new keyboard shortcut to create cross connections on iPadOS by pressing Shift and dragging between nodes<br>• Fixed a branch drawing issue<br>• Fixed a crash that happened when a document was reloaded from iCloud Drive<br>• Fixed a bug where XMind files could not be imported<br>• Fixed a bug which caused a branch to be displayed over a node's background when resizing an attachment using the iPadOS pointer<br>• Fixed a crash which happened while performing a secondary click with the pointer on iPadOS<br>• Fixed the direction of the folding indicator<br>• Fixed a bug where folding indicators were missing on selected nodes when presenting on external screens"},{"version_id":"837882711","version_name":"2020.5","version_date":"2020-09-30 11:58:16.000 +0800","version_description":"iOS 14 and iPadOS 14 Support<br>Edit text with an Apple Pencil and handwriting detection, use the new image picker to easily add photos, and instantly trigger actions with the new context menu.<br><br>Widget<br>Use the new MindNode widget to access your recent and pinned documents directly from your Home Screen.<br><br><br>IMPROVEMENTS<br>• Added support for opening URLs in third party browsers<br>• Fixed opening of documents on Apple Watch that are outside MindNode's iCloud container<br>• Fixed image loading on Apple Watch of single file format documents and documents outside MindNode's iCloud container<br>• Improved support for third-party fonts by adopting the system font picker<br>• Fixed an issue with opening documents that are outside MindNode's iCloud container"},{"version_id":"838295825","version_name":"2020.5.1","version_date":"2020-10-27 10:49:50.000 +0800","version_description":"IMPROVEMENTS<br>• Improved the layout of the Home Screen Widget<br>• Added the option to show the \"What's New\" screen again from the About screen<br>• Fixed haptic feedback during drag and drop<br>• Fixed a crash when starting text editing while dragging a node<br>• Updated context menu entries to be more consistent<br>• Fixed several issues that could result in MindNode crashing when switching to Home Screen or an other app<br>• Fixed holding the shift key to change the current selection<br>• Fixes hold on canvas and tap on node to expand selection<br>• Fixed several issues related to MindNode not accepting input from hardware keyboards<br>• Fixed node ordering after using alphabetic sorting<br>• Fixed a bug that caused a node title to disappear when starting rubber band selection<br><br>Apple Watch<br>• Fixed a crash when loading complications on watchOS 6"},{"version_id":"838539295","version_name":"2020.5.2","version_date":"2020-11-05 20:57:49.000 +0800","version_description":"IMPROVEMENTS<br>• Fixed an issue which caused the Candidate Window to disappear when entering Japanese text<br>• Fixed an issue where descriptions of MindNode Actions in the Shortcuts app were missing<br>• Fixed a bug where links in notes would not open when tapped<br>• Fixed a bug where links could be lost in a note after being edited<br>• Fixed the behavior of the \"Cut Title\" action so that it does not also delete a cross connection<br>• Improved the parsing of notes when using the \"--\" shortcut in the node title<br>• Improved the New Document &amp; Quick Entry actions in the Widget when using the Free Editor"},{"version_id":"838557886","version_name":"2020.6.1","version_date":"2020-12-03 09:22:16.000 +0800","version_description":"สวัสดี! MindNode has been fully localized in Thai. With this addition we now support 15 languages.<br><br>IMPROVEMENTS<br>• Added support for displaying help tags when hovering on an element with the iPadOS Pointer<br>• Improved how Tag names are exported in text-based file formats"},{"version_id":"840302081","version_name":"2021.1.1","version_date":"2021-02-03 08:27:03.000 +0800","version_description":"This update has several small improvements and fixes a few bugs.<br><br>IMPROVEMENTS<br>• Adapted several keyboard shortcuts:<br>\t- Select Previous Main Node: Shift + Alt (⌥) + P<br>\t- Select Next Main Node: Shift + Alt (⌥) + N<br>• Enabled buttons in the Action Panel's lower toolbar while editing a node title (e.g. copy, undo, ...)<br>• Improved how nodes with links are synced with Apple Reminders<br>• Improved several Action Panel titles"},{"version_id":"840644395","version_name":"2021.1.2","version_date":"2021-03-03 11:22:20.000 +0800","version_description":"• Fixed an issue where nodes would become scrambled after activating manual layout<br>• Fixed an issue where fonts would change after symbols or emojis"},{"version_id":"840870661","version_name":"2021.1.3","version_date":"2021-03-15 08:45:30.000 +0800","version_description":"• Fixed expanding the selection using the keyboard<br>• Fixed a bug that prevented editing a Notes"},{"version_id":"841246000","version_name":"2021.1.4","version_date":"2021-04-08 07:33:27.000 +0800","version_description":"This update disables automatic naming of new documents. We changed this to work around an issue related to document not appearing correctly in the document picker after closing a new document. You can reenable this feature in MindNode's settings.<br><br>IMPROVEMENTS<br>• Fixed an issue related to using QuickLook for MindNode documents in the Files app<br>• Made several improvements during document saving<br>• Added a new setting to toggle auto naming of documents and disabled it by default"},{"version_id":"841934056","version_name":"2021.1.5","version_date":"2021-04-27 08:27:27.000 +0800","version_description":"• Fixed an issue where the background color of the notes screen wouldn't update after rotating the device<br>• Fixed a crash which happened when trying to apply a style to a node with no content"},{"version_id":"842384561","version_name":"2021.2.1","version_date":"2021-05-28 06:34:28.000 +0800","version_description":"This update fixes a crash on the iPad and further improves the outline.<br><br>• Fixed a crash that occurred when opening two documents side-by-side on iPad<br>• Fixed displaying Export and Print actions when a node is selected<br>• Fixed outline filtering settings in Free Editor and Legacy mode<br>• Hid actions that require a MindNode Plus subscription for Legacy customers<br>• Improved outline Scribble interaction"},{"version_id":"843431258","version_name":"2021.2.3","version_date":"2021-08-10 11:56:53.000 +0800","version_description":"This update adds support for smart text shortcuts in the outline, improves several keyboard shortcuts, and much more.<br><br>- Added the ability to fold multiple selected nodes in the outline<br>- Added support for smart text shortcuts for tasks, notes, &amp; tags in the outline<br>- Adjusted the Option (⌥) + Delete (⌫) shortcut to perform the \"Delete Single Node\" action in the outline<br>- Disabled the double-tap gesture with the Apple Pencil to avoid switching between the canvas and the outline<br>- Ensured that the correct discoverability titles of keyboard shortcuts are displayed in the outline depending on the current state of interaction<br>- Improved legibility of text in the outline by ensuring that the color is adjusted if the theme background has changed<br>- Improved the animation of nodes when opening the onscreen keyboard<br>- Improved the appearance of the \"multiple nodes\" indicator<br>- Improved the performance of editing large documents in the outline<br>- Fixed a bug where creating links with Command (⌘) + K would sometimes not work<br>- Fixed an issue where highlighting a tag not assigned to any nodes resulted in all nodes being highlighted in the outline<br>- Fixed a bug where the title of a node would be replaced when trying to fold a child node with the Option (⌥) + . shortcut<br>- Fixed a bug where the knobs could become frozen on the canvas"},{"version_id":"844527363","version_name":"2021.3.1","version_date":"2021-10-07 15:31:11.000 +0800","version_description":"This minor update fixes a few bugs<br><br>• Ensured that edited text in the outline stays visible when the software keyboard appears<br>• Fixed a bug which prevented keyboard arrow keys from working on the canvas to change selection &amp; move nodes on iOS 14<br>• Improved the performance of selecting a node in the outline"}]