[{"version_id":"821962624","version_name":"1.0.5","version_date":"2018-01-03 08:39:27.000 +0800","version_description":""},{"version_id":"825629537","version_name":"1.1.0","version_date":"2018-01-17 10:51:42.000 +0800","version_description":"— The countdown has been added;<br>— Player rating has been added;<br>— Aim accuracy has been increased;<br>— The hangar has been optimized. Its interface has been slightly developed;<br>— Display of long nicknames has been fixed;<br>— In-game effects have been developed (explosions, explosions, explosions!);<br>— Gifting services have been added (martian titans etc.);<br>— In-game camera’s sensitivity settings have been added (horizontal and vertical);<br>— The issue with language autodetection has been fixed;<br>— The distribution of players among teams has been fixed;<br>— Other issues have been fixed."},{"version_id":"826110186","version_name":"1.2.2","version_date":"2018-03-03 22:35:18.000 +0800","version_description":"Guys, we are glad to present a change log of Update 1.2! Here are the great news for you, fellow pilots!<br>1. Play with friends (create squads and add new comrades to your friend-list).<br>2. New light Titan, Mite, is now available for purchase (real money only).<br>3. Nelly can now be bought for Energy Cells.<br>4. German, Spanish, Turkish, French, and Japanese localizations are live.<br>5. New interface of the Titans, weapons, and upgrades’ parameters.<br>6. Now bots can shoot at the enemies which are on the higher ground. <br>7. Spiders’ vertical stability and control are improved.<br>8. Rocket damage mechanics was redone. Now you can’t destroy new weapon with a single shot."},{"version_id":"826724823","version_name":"1.3.0","version_date":"2018-04-18 21:47:11.000 +0800","version_description":"- Introduction of the Hangar 2.0.<br>- Code Refactoring &amp; Performance Improvements.<br>- Settings to adjust the user interface in battle have been implemented.<br>- Display and functionality of some upgrades have been fixed.<br>- The stumbling of spiders on rough terrain has been repaired.<br>- The accuracy issues of Sarisa’s and Hammers have been fixed.<br>- Farsi language pack has been added."},{"version_id":"827742511","version_name":"1.4.0","version_date":"2018-07-04 14:42:09.000 +0800","version_description":"- New map “Desert”.<br>- Premium account allows you to progress faster.<br>- Tirpitz can bend forward slightly to allow greater Inquisitor declination. Inquisitor received stabilizer improves accuracy of firing in motion.<br>- Improved jumping from inclined and steep surfaces.<br>- AI bots no longer copy the hangars of players, but have their own, which are selected depending on the average ranking of players.<br>- Improved weapon Tormentor - the speed of the projectile is increased to 1,750 m/s, the distance is increased to 1000 m. The damage drop from 200m to 1000m by 85%, the impact pulse is increased<br>- The HP of Sarisa weapon is increased to 1500, 1600, 1700 for T1, T2, T3 respectively.<br>- Added option to disable Aim Assist.<br>- Special and Chassis Ability buttons were swapped.<br>- Minimum sprint cooldown of 1 sec.<br>- Improved status of squadmates invited to join a squad (in battle / in hangar / offline)<br>- Improved battle responsiveness of buttons and joystick.<br>- Closed vulnerabilities that allowed speed / jump cheats.<br>- Added nickname change failure reasons.<br>- Fixed those off-balance team occurrences.<br>- Squashed other bugs. (edited)"},{"version_id":"829082138","version_name":"2.0.0","version_date":"2018-10-29 13:19:47.000 +0800","version_description":"- A new store and upgrade system.<br>- A new Titan, Cormorant, has been added and will be available as prizes in community-based competition. In later updates it will be released as an IAP, and then for EC purchase.<br>- The efficiency of titans’ radars (responsible for the enemy detection) can be increased with certain upgrades. The initial range of detection for all titans except Tirpitz is 500 m. Tirpitz has 700 m.<br>- Titans now have the radar signature that correlates with the minimum range on which enemies’ markers are shown. Light titans have 0.8 pt. (80%), it means that light titans will be noticed while 80% closer. This way, Tirpitz (which detection coefficient is 700 m.) will see the enemy “lights” only at 700*0.8 = 560 m. Medium titans have 1 pt. (100%), heavies - 1.3 pt. (130%). Cormorant’s detection coefficient is 1.15 pt. (115%). It can be upgraded (decreased) with the help of special upgrades (Stealth technologies) in the core section of the upgrade system.<br>- The speed of Hammers, Inquisitors, Tormentors, Manglers’ projectiles is decreased during the flight according to their ballistics specifics.<br>- The impulse received after the hit of armor piercing rounds is decreased based on how much (depends on missile velocity) it flies.<br>- The aiming system has been developed. Now, touching the joystick slightly will not lead to problems with aiming unless you don’t move it on purpose. At the same time, the erroneously high accuracy while aiming at the maneuvering targets (which change their speed and direction of movement) has been decreased.<br>- Basic accelerators now affect only base movement speed.<br>- Sprint accelerators now affect only the sprint speed.<br>- Heavy and Light armor now affect jump ability performance.<br>- Jump Acceleration” was added to each jumping Titan’s description. This will let you see all the the impact on a Titans jump performance when upgrades are installed.<br>- Jumps are more efficient, meant to cover distance rather than stay in the air for too long.<br>- All weapons have received an additional upgrade slot.<br>- All upgrade modifications are now fixed numerical increases or decreases. (For example, if an upgrade decreases cooldown by “-1”, nothing will affect this “-1”.)<br>- Magazines for Mangler, Hammer, Tormentor and Beacon no longer affect weapon reload time.<br>- The various weapon upgrades were rebalanced due to the new algorithms and the number of upgrade slots available.<br>- A player’s guide was added to the hangar. <br>- The hangar now has background music.<br>- Titans and weapons rebalance<br>- Mass annihilation of bugs."},{"version_id":"829857918","version_name":"2.1.0","version_date":"2019-01-09 09:10:51.000 +0800","version_description":"- Performance improvement.<br>- Bugs fixed.<br>- Removing upgrades is now free.<br>- Тitans got faster.<br>- Added Italian, Greek and Korean localization."},{"version_id":"829915214","version_name":"2.1.1","version_date":"2019-01-12 21:14:24.000 +0800","version_description":"- Fixed incorrect position (underground) of allies and enemies.<br>- Fixed disconnection after death.<br>- Fixed incorrect deactivation of fire buttons.<br>- Fixed incorrect highlights on the maps.<br>- Fixed a sharp slip to the side when jumping (sliding) from a sheer cliff/surface<br>- Improved maneuverability of stock Cormorant.<br>- Cormorant's Radar Signature changed from 115% to 110%"},{"version_id":"829998686","version_name":"2.3.0","version_date":"2019-06-19 00:54:08.000 +0800","version_description":"- Engineering Service - keeping uninstalled upgrades in storage<br>- Capturable drop zones in Team Death Match mode<br>- Improved weapon aiming system<br>- Improved control of movement direction of biped titans on rough terrain<br>- Improved the animation of the fast running Little Shon and Bully<br>- Titan Bully: Sprint cooldown reduced from 10 to 8 seconds.<br>- A slight rebalance of armor for light titans<br>- Fixed graphic artefacts on iPad Pro 2018, iPad 2019, iPhone8 and newer devices<br>- Fixed bugs"},{"version_id":"829998686","version_name":"2.1.4","version_date":"2019-03-05 18:26:55.000 +0800","version_description":"- Fixed animation and IK for Martian Nelly.<br>- Fixed jumps.<br>- Fixed incorrect HP values for Sarisa and Hammer in T2 and T3 versions."},{"version_id":"829998686","version_name":"2.1.2","version_date":"2019-01-18 20:53:38.000 +0800","version_description":"- Fixed titan movement bug.<br>- Fixed incorrectly remained on the battlefield armor and other equipment of the titan, whose pilot disconnected and left match.<br>- Performance improvement."},{"version_id":"829998686","version_name":"2.1.3","version_date":"2019-03-01 19:45:59.000 +0800","version_description":"- Improved AI<br>- Improved and fixed jumps.<br>- Improved animation of titan Nelly, especially when moving at high speed. General improvement of the animation.<br>- Fixed rare wrong score calculation when player destroy enemy titan after death<br>- Fixed occasional sudden reversals of towers and guns 180 degrees<br>- Fixed some graphical artifacts.<br>- Slightly increased the speed of Sarisa missiles.<br>- Increased durability of weapons Hammer and Sarisa<br>- Weapon armor upgrades increase weapon durability by +50% more than before <br>- Reduced the impact impulse of Tormentor projectile by 20%<br>- Titan Nelly became a bit faster"},{"version_id":"830462841","version_name":"2.1.3","version_date":"2019-03-01 19:45:59.000 +0800","version_description":"- Improved AI<br>- Improved and fixed jumps.<br>- Improved animation of titan Nelly, especially when moving at high speed. General improvement of the animation.<br>- Fixed rare wrong score calculation when player destroy enemy titan after death<br>- Fixed occasional sudden reversals of towers and guns 180 degrees<br>- Fixed some graphical artifacts.<br>- Slightly increased the speed of Sarisa missiles.<br>- Increased durability of weapons Hammer and Sarisa<br>- Weapon armor upgrades increase weapon durability by +50% more than before <br>- Reduced the impact impulse of Tormentor projectile by 20%<br>- Titan Nelly became a bit faster"},{"version_id":"830495525","version_name":"2.1.4","version_date":"2019-03-05 18:26:55.000 +0800","version_description":"- Fixed animation and IK for Martian Nelly.<br>- Fixed jumps.<br>- Fixed incorrect HP values for Sarisa and Hammer in T2 and T3 versions."},{"version_id":"831432184","version_name":"2.2.0","version_date":"2019-05-25 05:49:02.000 +0800","version_description":"- Steel Convoy game mode<br>- Ability to choose drop-zones<br>- Additional drop-zones in Team Deathmatch<br>- New Titan: Bully (can be obtained in the contests)<br>- Volume settings (effects, music, and notifications)<br>- Bug fixes"},{"version_id":"831696745","version_name":"2.3.0","version_date":"2019-06-19 00:54:08.000 +0800","version_description":"- Engineering Service - keeping uninstalled upgrades in storage<br>- Capturable drop zones in Team Death Match mode<br>- Improved weapon aiming system<br>- Improved control of movement direction of biped titans on rough terrain<br>- Improved the animation of the fast running Little Shon and Bully<br>- Titan Bully: Sprint cooldown reduced from 10 to 8 seconds.<br>- A slight rebalance of armor for light titans<br>- Fixed graphic artefacts on iPad Pro 2018, iPad 2019, iPhone8 and newer devices<br>- Fixed bugs"},{"version_id":"834831096","version_name":"2.4.0","version_date":"2020-02-25 02:38:09.000 +0800","version_description":"- New UI\n<br>- Leaderboards\n<br>- New B.o.T Store\n<br>- MAO Cyclops (skin)\n<br>- Engineering premium now gives -50% discount for the upgrading to the new tier.\n<br>- The EC exchange rate has become 2 times more profitable\n<br>- Fixed and improved camera aiming\n<br>- Cormorant will not be able to transform to flight mode immediately after the spawn until lended.\n<br>- Cormorant thrusters restart time (cooldown of transformation to flight mode) increased to 5 seconds.\n<br>- Cormorant’s radar signature in ground mode is reduced to 100% (as for other medium titans), and in flight mode is increased to 120%\n<br>- Reduced accuracy of Cormorant weapons in flight and in the fall\n<br>- The angle of declination of Cormorant's weapons on the bottom hardpoints is limited (up to 60 degrees)\n<br>- Reworked stopping/knockback impulse when projectile hit.\n<br>- The range of homing missiles not depend on the flight path.\n<br>- Launching of homing missiles blocked until there is a captured target at range.\n<br>- The base damage of the Sting missile has been increased to 150. The additional damage of \"Reinforced ammunition\" upgrades has been increased to 16, 26 and 31 for T1, T2, T3, respectively.\n<br>- For homing missiles, targeting and trajectory have been improved. The probability of hitting slow maneuvering targets is increased. At the same time, dodging them has become easier.\n<br>- The Sting can shoot at one missile.\n<br>- Added reload button\n<br>- Tuning the weapon aiming and predicting system makes it a little easier to dodge for highly maneuverable titans\n<br>- Legs armor upgrades increase legs durability by +100% more than before. \n<br>- Durability of Nelly legs increased by more than 16%\n<br>- Durability of Mite legs increased by 20+%\n<br>- Some mountain trails will be fixed/eliminated, especially for Tirpitz."},{"version_id":"835447342","version_name":"2.5.0","version_date":"2020-04-08 17:54:41.000 +0800","version_description":"- Black market.<br><br>- Upgrades are no longer destroyed when removed, but stored in you storage. You can experiment with assemblies for free. However, an upgrade can only be installed on titan or a weapon with tier not lower than the upgrade tier.<br><br>- Engineering service (new name VIP service) gives a 50% discount on upgrades to the next tier, 25% discount on prices on the black market, additional positions in deliveries and higher probability of rare titans, weapons and upgrades in deliveries on the black market.<br><br>- New weapon WRM1 Vulcan - multiple rocket launcher.<br><br>- Reworked Tormentor - cannon with mechanics similar to the mechanics of the Hammer, 8 shells in a clip, rate of fire 120 rpm, reloading when emptying the clip (or manually) 5 sec. Range 520 m.<br><br>- Added speedometer to the battle UI.<br><br>- Added Polish and Portuguese localization.<br><br>- Titan Bully has additional slot for installing shield.<br><br>- Shield Ancile for titan Bully. Thick armor made of durable materials, can be partially destroyed. It is quite heavy and negatively affects the weight distribution of titan, so titan with installed shield is significantly slower. Shield can be upgraded from T1 to T3 with all types of armor (light, medium, heavy, with resistes). In full upgrade with heavy armor without resist, the Shield has 9000 hp in the central part and 4000 hp in the remaining parts. The max speed of titan in this heavy version is reduced by 18 km/h, and max sprint speed is reduced by 30 km/h. Light armor upgrades for the shield can significantly reduce the negative effect on mobility of titan with this shield.<br><br>- Titan Bully base maximal speed slightly increased up to 66 km/h and base maximal sprint speed up to 125 km/h. Radar signature increased to the standard value for light titans - 0.8.<br><br>- The durability of Bully is reduced to the same values ​​as Little Shon has.<br><br>- Titan Ravager base maximal speed increased to 40 km/h.<br><br>- Titan Nelly base maximal speed increased to 31 km/h. Nelly jump force (acceleration) also increased by more than 7%.<br><br>- The aiming system gives a little more opportunity for fast titans to dodge enemy fire<br><br>- Guided homing missiles are aimed, if possible, to tower instead of to the geometric center of titan.<br><br>- It became easier to dodge Javelin missiles.<br><br>- Weapon Beacon has increased to 25 ammo capacity. Damage increased from 90 to 100<br><br>- The initial speed of Inquisitor projectiles has been reduced to 850 m/s.<br><br>- Fixed titans movement bugs: bounce back when landing after a jump, invisible obstacles, incorrect maximal speed, etc.<br><br>- Fixed a possible bug with damage from HE missiles (Javelin in particular)"},{"version_id":"836795732","version_name":"2.6.0","version_date":"2020-07-12 19:09:45.000 +0800","version_description":"- Custom games. You can collect 2 teams, spectators, choose a map and game mode, set the max duration of the match, switch on friendly fire, configure AI bots and the team size to which AI bots fill the teams when there are not enough players, and also disallow certain types of titans and weapons (and tiers)<br> <br>- Add ability to start offline single player match with AI in a custom game.<br> <br>- The spectator mode is activated after the loss of all titans or if you are appointed as a spectator in a custom game. In the spectator mode, you can switch between players (look from their view) or switch to free flight mode<br> <br>- Quickly switchable spectator HUD presets, allow to add information on the screen or hide all unnecessary.<br><br>- In spectator mode, added (optional) the display of player names.<br><br>- Added loading screens of the art contest winners.<br> <br>- Sting - the max range and accuracy of homing (and missile maneuverability) is reduced and depends on the tier of weapons. And now range is 350m for T1, 360m for T2, 380m for T3<br> <br>- The accuracy and maneuverability of the Javelin missiles is reduced and depends on the tier of weapon.<br> <br>- Tormentors - damage increases to 160, Reinforced Ammunition upgrades improved by ~5%. The maximum range of the Tormentor is reduced to 500m. Damage drop with distance is also reduced. <br> <br>- Vulcan - slightly reduced spread, damage increased by ~6%<br> <br>- Bully - increases the speed of the tower turn, shield better covers from above, light weapons can be installed instead of shield, armor is deprived of resistance (-15% HE, -15% AP), increased tower and legs HP (and armor upgrades) by ~4%.<br> <br>- Ravager - increased HP of the tower by 6-7%, The effectiveness of armor upgrades is increased by 8-10%. Improved maneuverability.<br> <br>- Maximal value of the EMP resistance to which titan M.A.O can be improved is reduced to 60%.<br> <br>- All medium armor upgrades has been recalculated (improved) to become a viable alternative to combinations of light and heavy armor.<br> <br>- Fixed bugs"},{"version_id":"837627760","version_name":"2.7.0","version_date":"2020-09-04 11:59:55.000 +0800","version_description":"- Enemy visibility from radar on titan instead of camera.<br>- Fixed leg damage bug when missiles (Sarisa, Sting, Javelin) hit the weapon.<br>- Fixed a number of other bugs.<br>- Show upgrades locked by tier when installing upgrades from the storage.<br>- Added the ability to separately configure reload button (size, position)<br>- Titans of other players and bots move more smoothly in poor connection conditions, especially twitching was noticeable in spectator mode<br>- Added a custom game option that allows all players to use the hangar of the creator of custom game.<br>- Added a custom game option that allows all players to use the hangar provided by developer.<br>- Improved handling of the Cormorant in flight mode.<br>- The accuracy of the Cormorant's light weapons in flight mode has slightly increased.<br>- Upgrades \"Feeding Gears\" for the weapon Sting has become more effective by 20-25%"},{"version_id":"839783214","version_name":"2.8.0","version_date":"2020-12-24 09:08:14.000 +0800","version_description":"- New weapon mortar “Onager” with new plunging fire mechanics and two modes of aiming: first - azimuth-distance aiming with manual distance controlling and second - bombs will be thrown at the place indicated by the sight (reticle) (similar to that of a beacon, only that it ignores aim assist).\n<br>- Variable charge (and bomb flight time), depended on distance. Further distance means longer flight time.\n<br>- Mortar is disabled on Cormorant during flight.\n<br>\n<br>- Now there are three types of damage in the game, with the inclusion of HEF (high-explosive fragmentation) for the new warhead shells for mortars.  Armor resists for HEAT and HEF are currently the same. In the future, this may change as more damage and ammo types are introduced.\n<br>\n<br>- New system of controls and customization.\n<br>\n<br>- New message delivery protocol (including invitations) implemented in addition to unreliable channel of push notifications (invites and notifications in the hangar should come faster, and more reliable).\n<br>\n<br>- Dynamic update of online player statuses in the UI of friends/squad/ custom game\n<br>\n<br>- Improved and fixed weapon animations (mismatched reload animations timing, etc.)\n<br>\n<br>- Internal improvements and refactoring.\n<br>\n<br>- The base ground speed of the Cormorant is increased by 5 km/h\n<br>\n<br>- Cormorant received 10% resists for all types of damage in the base to all parts of titan (except weapons) including Thrusters.\n<br>\n<br>- Reduced penalties for speed and agility for Thrusters hardening.\n<br>\n<br>- Little Shon has become slightly more maneuverable, and the tower rotation speed is increased by 16%\n<br>\n<br>- Maneuverability and targeting are slightly weakened for Javelin missiles."},{"version_id":"839833343","version_name":"2.8.1","version_date":"2020-12-30 09:30:30.000 +0800","version_description":"- Fixed display of information about weapon Mangler T2<br>- Fixed sprint cooldown and sprint button.<br>- Fixed and improved camera control and multi-touch.<br>- Fixed and improved responsiveness of controls.<br>- Fixed not working automation upgrades on the Onager mortar in multiplayer.<br>- Fixed hit impulse for HEAT weapons.<br>- When Cormorant is transformed from flight mode, the aiming and orientation system of the weapons turns on before the fire is activated to increase the shooting accuracy.<br>- Fixed poor-quality display of textures (pixelation) on the Arctic map.<br>- Updated translations for Dutch, Italian, Japanese, Polish, Spanish and Portuguese."},{"version_id":"840195998","version_name":"2.8.2","version_date":"2021-01-26 04:37:46.000 +0800","version_description":"- Fixed Fulgur not working in single battles with AI bots (through custom games)\n<br>- Fixed poor-quality display of textures (pixelation) of the landscape on the Arctic map.\n<br>- Fixed sticking of the virtual joystick.\n<br>- Fixed sometimes not working camera rotation/aiming if the touch started on buttons (fire, abilities, flight control, etc.)\n<br>- Fixed non-working controls in Steel Convoy game mode, especially during capture.\n<br>- For the fire special weapon button, the sticking time is initially (by default) set to zero to prevent unwanted activation. Check the settings for this button.\n<br>- Fixed jerky movement/animation of the drop ship picking up the evacuated objective in the Steel Convoy game mode.\n<br>- Updated M.A.O Cyclops model."},{"version_id":"840439502","version_name":"2.9.0","version_date":"2021-02-13 09:58:24.000 +0800","version_description":"- Mite Predator - modification of a mass-produced titan Mite, upgraded to T3, available as an in-app purchase.<br>- New Hybrid Matchmaking based on the player's hangar strength and rating.<br>- Added option to sign in with Apple and link your profile to Apple ID.<br>- Fixed a number of bugs."}]