[{"version_id":"823733191","version_name":"0.1.19","version_date":"2017-09-21 18:37:51.000 +0800","version_description":"Bug fixes and optimization"},{"version_id":"823920834","version_name":"0.2.13","version_date":"2017-10-07 07:47:47.000 +0800","version_description":"•More Mayhem:  It’s pandemonium in the ring as new challengers have entered the arena – play as Xavier Woods, Big E, Kofi Kingston, Big Cass, Chris Jericho, Kane, Stone Cold Steve Austin and Undertaker. <br>•Daily Rewards: Start each day right with a chance to earn FREE Gold, Cash, Energy, and Level Ups.<br>•Live Events: Play events alongside RAW &amp; SmackDown Live during the week.<br><br>Join the Mayhem NOW!"},{"version_id":"824278383","version_name":"0.3.21","version_date":"2017-11-06 08:45:41.000 +0800","version_description":"•Exciting additions to our Roster - Samoa Joe, Bray Wyatt, Mankind, Shawn Michaels &amp; Macho Man Randy Savage<br>•Go face-to-face with your opponents in the new and exciting \"Versus\" mode<br>•Participate in the newly added Pay-Per-View and Special Events for more rewards<br>•Enjoy the excitement of \"No Disqualification Matches\" with chairs, tables and more<br>•Go on Quests to accomplish multiple objectives and gain loot"},{"version_id":"824329667","version_name":"0.3.34","version_date":"2017-11-13 12:02:36.000 +0800","version_description":"SURVIVOR SERIES 2017<br>Prove your mettle in the upcoming Survivor Series Event Battles.<br>-Grab exclusive Survivor Series Bundle &amp; Pack to dominate your competitors<br>-Win the one-time-only Survivor Series Lootcase in this limited time event <br>Go, Bring on the MAYHEM Now!"},{"version_id":"825158478","version_name":"0.4.87","version_date":"2017-12-06 13:09:59.000 +0800","version_description":"•      NEW Rivals Mode – Defend your team and beat your opponents in the new Rivals Mode. <br>•      NEW Tag Team Mode – Join forces with WWE legends and Superstars in the new Tag Team Mode and challenge players across the globe.<br>•      11 NEW Superstars added to the roster: Kalisto, Sting, Daniel Bryan, Shinsuke Nakamura, Baron Corbin, Braun Strowman, Sami Zayn, Sheamus, Ric Flair, Matt Hardy and Cesaro.<br>•       In Game Commentary from WWE Legend, \"Jerry the King Lawler.\""},{"version_id":"825242130","version_name":"1.27.237","version_date":"2019-12-03 07:04:51.000 +0800","version_description":"TABLES, LADDERS AND CHAIRS UPDATE\n<br>NEW SUPERSTARS\n<br>Hulkamania begins in Mayhem. Yes, get ready to welcome Hulk Hogan and Mr. T to make your legendary roster more stronger.\n<br>NO DISQUALIFICATION QUESTS\n<br>December events are loaded with No Disqualification matches. Attack your opponent with candies, gift boxes, and tables. We have made sure that you are prepared for upcoming TLC events.\n<br>MAYHEM SEASON PASS\n<br>A brilliant addition to Mayhem Pass:\n<br>A Mayhem pass holder will get a chance to Reroll the same lootcase. This means you come one step closer to your favorite superstar.\n<br>5 STAR SUPERSTARS\n<br>Your technician roster becomes more cooler with the addition of 5 Star version of Randy Orton. Rest in peace with 5 Star version of The Undertaker.\n<br>NEW CHRISTMAS ARENA\n<br>The classic WWE match bell turns into Jingle Bell with our new Christmas Arena. Feel the joy with these kicks to your opponent accompanied by the holiday classic props.\n<br>TLC\n<br>Participate in the TLC PPV to win amazing rewards. Take your Challengers to the TLC Main Card Events and set your own fate.\n<br>NEW DAILY DEALS\n<br>With the exceptional enthusiasm around all the recently introduced amazing Offers, do expect for even more exciting stuff coming your way. Wooooooo!"},{"version_id":"825242130","version_name":"1.26.216","version_date":"2019-11-15 09:51:12.000 +0800","version_description":"SURVIVOR SERIES UPDATE<br>RAW vs SDL<br>It’s time you choose sides. Either play for team RAW or join team SDL. Keep your WWE Superstars busy. All the points you score get added to the faction of your choice. Track the leaderboard. Buck up if your faction is lagging behind and continue to dominate if you are in the lead. Prove your loyalty to your favorite faction.<br>MAYHEM SEASON PASS<br>Wait! There’s more to the Mayhem Pass:<br>Recharge your energy much faster and play more<br>Reduce the Superstar Exhaustion Time in Versus Mode and get back to attack<br>Get 25% Extra Inventory Storage space for each item and stay carefree<br>Multiplying your Quest Rewards with the new Mayhem Pass for an entire season got much cooler.<br>NEW SUPERSTARS<br>It's true. Oh, it's damn true! Based on the survey results, a few of the most sought-after Superstars will join the Mayhem. Stay tuned for awesome surprises.<br>ACHIEVEMENTS<br>You can now see what you couldn't! No, it's not John Cena yet. Head to the Quest Section and tap on the Achievements Tab to view every game milestone you have successfully completed. You can also check the status of other incomplete milestones and play for specific Achievements.<br>ALLIANCE SEASONS<br>Claim your dominance on the Alliance Leaderboard with upcoming Alliance Seasons. Get point multipliers and keep coming back to participate in the Alliance Events and outscore your competition. Remember! It’s all about the collective strategy and constant communication among all your Alliance members.<br>SURVIVOR SERIES<br>Participate in the Survivor Series PPV to win amazing rewards. Take your Challengers to the Survivor Series Main Card Events and set your own fate.<br>NEW DAILY DEALS<br>With the exceptional enthusiasm around all the recently introduced amazing Offers, do expect for even more exciting stuff coming your way. Wooooooo!"},{"version_id":"825242130","version_name":"1.24.255","version_date":"2019-09-19 08:55:15.000 +0800","version_description":"Exclusive 5 Star keys: Enter the squared circle and participate in the Weekly Ultra and upcoming Rebellion Events to get your hands on precious 5 Star keys.\n<br>Exciting Offers: With the exceptional enthusiasm around the King Size Sale and the Beat the Clock Offers, do expect for even more exciting stuff coming your way. Wooooooo!\n<br>Fixed Crash Issues. Cuz Stone Cold said so!\n<br>Bug Fixes: Passive Ability that was getting triggered on tag was fixed."},{"version_id":"825242130","version_name":"1.23.233","version_date":"2019-08-04 07:07:29.000 +0800","version_description":"SummerSlam Update\n<br>Get startled as 5 Star Superstars with Unique Power Abilities join the Mayhem\n<br>Enjoy the enhanced fighting experience with new Mini-Game for 5 Star Superstars\n<br>Grab another chance to get the Authority Superstars as they make a comeback\n<br>Make the most of Daily Events to Level-Up easily and earn awesome rewards\n<br>Win lots of 5 Star Keys to claim 5 Star Superstars\n<br>#BringontheMayhem"},{"version_id":"825242130","version_name":"1.24.223","version_date":"2019-09-05 10:36:11.000 +0800","version_description":"NEW 4 STAR FEMALE SUPERSTARS<br>Welcome, Naomi, Natalya, Ember Moon, Lana, Sasha Banks, Bayley, Alexa Bliss, and Nia Jax in their most powerful version yet.<br><br>NEW MATTEL TOY SUPERSTARS<br>Get Junkyard Dog, Kevin Nash, Elias, and Matt Hardy Retro Toys and scan their codes to add them to WWE Mayhem.<br><br>REVOLUTION KEYS<br>The new 4 Star Female Superstars will mark the advent of Revolution Keys which can be collected from Events throughout the month of September. Get guaranteed 2, 3 and 4 Star versions of the Revolution Lootcase by exchanging 1000, 3000 and 10000 Revolution Keys.<br><br>MORE QUEST OPTIONS<br>We've added variety to Quests. Complete a challenge by performing the 5 Knuckle Shuffle with a 3 Star John Cena in Versus Mode or inflict 20000 Damage to your opponent with 4 Star Roman Reigns in Live Events.  So, Quests will now be particular to special moves, superstars and game modes. <br><br>The Story Mode just got more interesting with new Quest missions to complete specific Episodes in specific Seasons. Thus, with more filters and objectives, Quests will never be the same again.<br><br>ENHANCEMENT OPTIONS<br>Your opponent boasts of 100% increased Damage while you have 20% Heal ability. Or you enjoy 100% increased Damage while your opponent gets 20% Heal ability. What would you choose? Now, you get to choose an Enhancement from a set of options before entering a fight. The choice may be applicable to either your Superstar or the Opponent or both. Use this option to your advantage and select wisely!<br><br>OTHER GAME UPDATES<br>- Beginner, Normal, Superstar or Insane; female superstar difficulties will new match cards<br>- Submission Move Damage in Submission Events is now aligned to the superstar's signature move<br>- Opponent Reversals have been reconfigured to make matches easier for Early Game Players."},{"version_id":"825242130","version_name":"1.25.193","version_date":"2019-10-14 08:49:08.000 +0800","version_description":"ALLIANCE LAUNCH<br>Yes! Yes! Yes! This update will mark the advent of the much-awaited and anticipated Alliance Mode. Become the part of an Alliance and aim for the ultimate spot on the Leaderboards.<br>MAYHEM SEASON PASS<br>Quests just got now super-fun and extra-rewarding. Come back every day to complete Season Quests. Multiply your Quest Rewards with the new Mayhem Pass for an entire season. Ooooh Yeah!<br>NEW SUPERSTARS<br>It's true. Oh, it's damn true! Based on the survey results, a few of the most sought-after Superstars will join the Mayhem. Stay tuned for awesome surprises.<br>HELL IN A CELL<br>Participate in the Hell in a Cell PPV to win amazing rewards. Take your Challengers to the Hell in a Cell Main Card Events. Let'em in the Hell and set your own fate.<br>NEW DAILY DEALS<br>With the exceptional enthusiasm around the King Size Sale and the Beat the Clock Offers, do expect for even more exciting stuff coming your way. Wooooooo!"},{"version_id":"825242130","version_name":"1.22.446","version_date":"2019-07-19 13:56:14.000 +0800","version_description":"Bug fixes and optimization."},{"version_id":"825242130","version_name":"1.21.129","version_date":"2019-05-30 08:51:59.000 +0800","version_description":"LEAGUE OF CHAMPIONS UPDATE<br>Join the League of Champions and unleash the Mayhem<br>Collect the new ChampGold currency across the League of Champions campaign<br>Explore the power of SYNERGY. Participate in the first time ever Synergy Events.<br>Participate in the upcoming Super ShowDown and Stomping Grounds Main Card Events<br>#BringontheMayhem"},{"version_id":"825242130","version_name":"1.19.283","version_date":"2019-03-29 06:46:50.000 +0800","version_description":"WRESTLEMANIA UPDATE<br>- Enter WrestleMania Events with ManiaGold and earn the Authority Superstars<br>- Get in the brand new WrestleMania Arena and Live the Excitement of WWE Main Card Events<br>- Next Wave of Hero Superstars join the Mayhem along with some awesome surprises<br>- Take on opponents with new Match Abilities and have fun in unique and exciting matches<br>- Introducing Single Objective Quests. Complete missions to collect immediate Rewards."},{"version_id":"825242130","version_name":"1.20.477","version_date":"2019-05-18 04:55:34.000 +0800","version_description":"MONEY IN THE BANK UPDATE<br>Stay Alert! More Superstars to join the Mayhem.<br>MITB Lootcase is coming back. Grab the opportunity to get 4 Star Superstars.<br>Now take your female superstars to the new MITB Female Ladder Matches<br>Synergies are Rebalanced. Be careful with Superstars you take into the ring.<br>Quests are now more interesting with added conditions"},{"version_id":"825242130","version_name":"1.22.437","version_date":"2019-07-03 15:12:29.000 +0800","version_description":"RetroMadness Update\n<br>Join the Madness with the #GreatestEver WWE Legends. Stay tuned as NEW Legends make their way to the ring!\n<br>Collect Retro Tickets and unlock the Million Dollar Store for huge benefits\n<br>Boost your cash count with the new Cash Multiplier\n<br>Now put your roster up to the test in the new Insane Difficulty\n<br>Introducing new and replayable Superstar House Shows. Earn better rewards every time.\n<br>Several new animations added\n<br>#BringontheMayhem"},{"version_id":"825242130","version_name":"1.17.215","version_date":"2019-01-17 10:47:01.000 +0800","version_description":"ROYAL RUMBLE UPDATE:<br>- Get Ready to Rumble with new 4 Star Female Superstars - Wait and watch<br>- Participate in the first ever WWE Mayhem Women's Royal Rumble Event<br>- Enjoy over-the-top action with new animations - Shared Moves, No DQ Move, Super Signatures and more<br>  #BringontheMayhem"},{"version_id":"825242130","version_name":"1.7.133","version_date":"2018-05-09 10:43:51.000 +0800","version_description":"- Participate in the Backlash event.<br>- Your gameplay experience just got more exciting with 6 New crazy NO DQ MOVES.<br>- Seth Rollins gets his 3rd Signature Move."},{"version_id":"825242130","version_name":"1.0.18","version_date":"2017-12-14 08:34:58.000 +0800","version_description":"Welcome to the ultimate world of mighty WWE Superstars. Take charge of gripping arcade action gameplay with over-the-top animations. Embark on a quest for supreme dominance and enjoy:<br>- Spectacular Roster<br>- 6 Distinctive Superstars Classes<br>- Tag Team Matches and Weekly Events<br>- Never Before Seen REVERSALS<br>- Matches with your friends<br>- Rewards and Bounties<br>Become the champion of the ring and #BringOnTheMayhem"},{"version_id":"825534132","version_name":"1.1.31","version_date":"2018-01-06 07:48:28.000 +0800","version_description":"Hello Mayhemers. We've addressed issues regarding game crashes and fixed the bug causing an overflow of stash items. So keep playing and #BringOnTheMayhem."},{"version_id":"825575012","version_name":"1.1.46","version_date":"2018-01-10 09:18:40.000 +0800","version_description":"Crash issues have been fixed."},{"version_id":"825755460","version_name":"1.2.23","version_date":"2018-01-26 10:42:49.000 +0800","version_description":"皇家决战更新<br>- 体验真正的皇家决战活动的刺激将你的对手扔出圈外来取胜。<br>- 新的超级巨星 - Bobby Roode、Batista 与 Kurt Angle<br>- 18 个新的招牌技<br>- 超级巨星来了 - 用未拥有的超级巨星游玩<br>- 你现在可以出售你的物品来获得金钱，准备好 #BringOnTheMayhem"},{"version_id":"825954890","version_name":"1.2.65","version_date":"2018-02-13 08:25:46.000 +0800","version_description":"- 获得终极 4 星 Roman Reigns，使用炫酷 Shield 装备<br>- 性能优化，提升游戏体验<br>#BringOnTheMayhem"},{"version_id":"826061690","version_name":"1.3.19","version_date":"2018-02-23 09:06:14.000 +0800","version_description":"- The cage has dropped and the chamber is sealed. Play the Elimination Chamber Event with amazing new animations!<br>- Have more fun with six new special moves - Moonsault, Slingblade, Drop Kick, Head Butt, Shoulder Dash and Enziguri<br>- Earn an exclusive offer before every Title Match and purchase items you need right before your biggest challenge<br>- Now experience the exhilaration of Handicap Matches where you battle 2 superstars with 1<br>- Elias joins the Mayhem. Get him on your side.<br>#BringOnTheMayhem"},{"version_id":"826233054","version_name":"1.4.18","version_date":"2018-03-09 09:04:20.000 +0800","version_description":"THE FASTLANE UPDATE<br>Gear up to win swift rewards in the ultimate FASTLANE event<br>We did tune-up our engines of unwanted bugs for a smoother ride"},{"version_id":"826540052","version_name":"1.5.18","version_date":"2018-04-05 09:00:55.000 +0800","version_description":"DESTINATION WRESTLEMANIA<br><br>The Road to WrestleMania reaches its destination. Participate in the grand event in a brand new WrestleMania Arena.<br>Live the excitement of Andre The Giant Battle Royal event and win fabulous rewards<br>Use Overdrive items to increase your superstar's overall stats<br>Unlock Skills and empower your Overdriven superstars with crazy Smashing Capabilities<br>Earn Rewards whenever you Level Up<br>Shane-O-Mac joins the Mayhem<br><br>#BringOnTheMayhem"},{"version_id":"826735253","version_name":"1.6.102","version_date":"2018-04-20 10:54:30.000 +0800","version_description":"Kevin Nash and Razor Ramon join the Mayhem<br>XP Level now increased to 100"},{"version_id":"826892292","version_name":"1.7.133","version_date":"2018-05-09 10:43:51.000 +0800","version_description":"- Participate in the Backlash event.<br>- Your gameplay experience just got more exciting with 6 New crazy NO DQ MOVES.<br>- Seth Rollins gets his 3rd Signature Move."},{"version_id":"827281262","version_name":"1.9.167","version_date":"2018-06-04 12:45:51.000 +0800","version_description":"Bug fixes and optimizations done."},{"version_id":"827533601","version_name":"1.9.331","version_date":"2018-06-15 13:46:43.000 +0800","version_description":"MONEY IN THE BANK UPDATE<br>- Bludgeon Brothers arrive!<br>- 4 Star Dolph Ziggler joins the Mayhem<br>- Team-up against Unstoppable Giants in the first time ever Co-op Event<br>- Climb the Ladder and pull the Briefcase in the ultimate Money In The Bank event<br>- 10 New No DQ Ladder moves added<br>- 100% guaranteed 4Star Superstar in MITB Lootcase - Time your loot wisely<br>- Your partners now join you in the ring for thrilling Double Team Maneuvers<br>- Tagging in is now a Special Move. Use it to your advantage.<br>- New Story Mode Rival System: Choose a Rival, Defeat the Rival, Earn that Rival<br>- Grab a 4 Star Nakamura and go wild with Shinsuke Dirty Tricks<br>- Rob your opponent's signature with the new STEAL Skill<br>- Synergy is now independent of a superstar's rarity<br>- Information on Drop Rates included"},{"version_id":"827635119","version_name":"1.10.125","version_date":"2018-06-27 09:41:09.000 +0800","version_description":"Shelton Benjamin joins the Mayhem<br>Stand a chance to win the olympian Chad Gable in the 4th of July Event<br>Stay tuned to #BringOnTheMayhem"},{"version_id":"827796588","version_name":"1.11.174","version_date":"2018-07-14 16:11:15.000 +0800","version_description":"Extreme Gameplay Update<br>- 30+ New Abilities added to the game including Injure, Overrun and Exhaustion.<br>- Each Superstar has a preferred move for Bonus Damage<br>- Learn to Master each Superstar's method of triggering their abilities including Dodge, Parry, Pin Break and more.<br>- Increase the power level of your Abilities and Bonus Damage by ranking up your Superstar<br>- 4-Star Rusev arrives just in time to celebrate Rusev Day<br>- 3 and 4Star Finn Balor (non-demon king) join the WWE Mayhem Balor Club for High Flyer Week at end of July<br>#BringOnTheMayhem"},{"version_id":"828064695","version_name":"1.12.263","version_date":"2018-08-11 10:37:17.000 +0800","version_description":"SUMMERSLAM UPDATE<br>Eddie Guerrero and Doink the Clown join the Mayhem.<br>Introducing submission matches. Get your opponents succumb to your superstars by Tapping Out.<br>Things happen in 3! Enjoy 3vs3 Tag Team Matches and play with all of The New Day.<br>Now Events are branched into multiple paths. Have fun earning bonus exploration rewards.<br>#BringOnTheMayhem"},{"version_id":"828478316","version_name":"1.13.358","version_date":"2018-09-11 10:00:45.000 +0800","version_description":"HELL IN A CELL UPDATE<br>- Play inside the ring or on top of the cage in the Hell in a Cell Events<br>- Edge, Bam Bam Bigelow and 4Star Braun Strowman join the Mayhem<br>- Kurt Angle is now a Technician and uses the Ankle Lock as a finisher<br>- Level up skills by applying it multiple times to a Superstar<br>- Stats have been adjusted to make each Superstar stand out<br>- Level-up Cost reduced for 2 &amp; 3-star Superstars and increased for 4-star Superstars<br>#BringOnTheMayhem"},{"version_id":"828568435","version_name":"1.13.378","version_date":"2018-09-14 07:52:54.000 +0800","version_description":"HELL IN A CELL UPDATE<br>- Play inside the ring or on top of the cage in the Hell in a Cell Events<br>- Edge, Bam Bam Bigelow and 4Star Braun Strowman join the Mayhem<br>- Kurt Angle is now a Technician and uses the Ankle Lock as a finisher<br>- Level up skills by applying it multiple times to a Superstar<br>- Stats have been adjusted to make each Superstar stand out<br>- Level-up Cost reduced for 2 &amp; 3-star Superstars and increased for 4-star Superstars<br>#BringOnTheMayhem"},{"version_id":"828814401","version_name":"1.14.252","version_date":"2018-10-05 16:19:02.000 +0800","version_description":"SUPER SHOW-DOWN UPDATE<br>-Drew McIntyre joins the Mayhem with New 4Star Superstars<br>-Cesaro<br>-Jeff Hardy<br>-Matt Hardy<br>-Jimmy Uso<br>-Jey Uso<br>-Jinder Mahal<br>-Triple H<br>-Ultimate Warrior<br>-Improved Ability System<br>-All Rarities have at least 3 Abilities<br>-Every Signature has an Ability<br>-New Abilities include Vulnerable, Exposed, and Vigilant<br>-Test your skills with NO HEALTH/NO REVIVE in Gauntlet Events<br>-Synergies now readjusted to match current storylines"},{"version_id":"828836722","version_name":"1.14.270","version_date":"2018-10-08 16:17:35.000 +0800","version_description":"SUPER SHOW-DOWN UPDATE<br>-Drew McIntyre joins the Mayhem with New 4Star Superstars<br>-Cesaro<br>-Jeff Hardy<br>-Matt Hardy<br>-Jimmy Uso<br>-Jey Uso<br>-Jinder Mahal<br>-Triple H<br>-Ultimate Warrior<br>-Improved Ability System<br>-All Rarities have at least 3 Abilities<br>-Every Signature has an Ability<br>-New Abilities include Vulnerable, Exposed, and Vigilant<br>-Test your skills with NO HEALTH/NO REVIVE in Gauntlet Events<br>-Synergies now readjusted to match current storylines"},{"version_id":"829162796","version_name":"1.15.351","version_date":"2018-11-15 04:15:32.000 +0800","version_description":"SURVIVOR SERIES UPDATE<br>It's finally time. WWE Female Superstars are here to unleash the Mayhem.<br>Ronda Rousey<br>Charlotte Flair<br>Alexa Bliss<br>Sasha Banks<br>Carmella<br>Nia Jax<br>Naomi<br>Bayley<br>Nikki Bella<br>Asuka<br><br>- Now follow 'The Rising Star' Storyline in Story Mode and defend your Superstars' purpose.<br>- Join hands with Female Superstars in Mixed Matches.<br>- Charge and Grab speed increased to make it easier to connect your Special and Signature Moves."},{"version_id":"829387188","version_name":"1.15.398","version_date":"2018-11-28 05:10:09.000 +0800","version_description":"-Bug Fixes and optimization."},{"version_id":"829558355","version_name":"1.16.192","version_date":"2018-12-13 04:50:59.000 +0800","version_description":"The TLC Update<br>- More Female Superstars. More Mayhem. Welcome Natalya, Ember Moon, Ruby Riott and Lana<br>- Rey Mysterio joins the Mayhem on popular demand<br>- New Passive Abilities added to all overdriven 2, 3, and 4-star superstars<br>- Super Signatures are now even more lethal with added abilities<br>- Don't just Steal opponent Signatures, but also the abilities that come with it<br>- Do more damage with Smash Skills now replacing Shared Moves instead of Signatures<br>- New No DQ and Shared Moves added"},{"version_id":"829649473","version_name":"1.16.221","version_date":"2018-12-17 13:30:36.000 +0800","version_description":"The TLC Update<br>- More Female Superstars. More Mayhem. Welcome Natalya, Ember Moon, Ruby Riott and Lana<br>- Rey Mysterio joins the Mayhem on popular demand<br>- New Passive Abilities added to all overdriven 2, 3, and 4-star superstars<br>- Super Signatures are now even more lethal with added abilities<br>- Don't just Steal opponent Signatures, but also the abilities that come with it<br>- Do more damage with Smash Skills now replacing Shared Moves instead of Signatures<br>- New No DQ and Shared Moves added<br>- Bug Fixes and optimizations."},{"version_id":"829721305","version_name":"1.16.243","version_date":"2018-12-23 06:19:21.000 +0800","version_description":"The TLC Update<br>- More Female Superstars. More Mayhem. Welcome Natalya, Ember Moon, Ruby Riott and Lana<br>- Rey Mysterio joins the Mayhem on popular demand<br>- New Passive Abilities added to all overdriven 2, 3, and 4-star superstars<br>- Super Signatures are now even more lethal with added abilities<br>- Don't just Steal opponent Signatures, but also the abilities that come with it<br>- Do more damage with Smash Skills now replacing Shared Moves instead of Signatures<br>- New No DQ and Shared Moves added<br>- Bug Fixes and optimizations."},{"version_id":"829945824","version_name":"1.17.215","version_date":"2019-01-17 10:47:01.000 +0800","version_description":"ROYAL RUMBLE UPDATE:<br>- Get Ready to Rumble with new 4 Star Female Superstars - Wait and watch<br>- Participate in the first ever WWE Mayhem Women's Royal Rumble Event<br>- Enjoy over-the-top action with new animations - Shared Moves, No DQ Move, Super Signatures and more<br>  #BringontheMayhem"},{"version_id":"830429490","version_name":"1.18.276","version_date":"2019-03-02 04:33:25.000 +0800","version_description":"ROAD TO WRESTLEMANIA UPDATE<br>- Collect ManiaGold to get Exclusive Authority Superstars and entry to highly rewarding WrestleMania Events<br>- Head to 'The Unstoppable Force' tour in Story Mode<br>- Check-out your Player Profile<br>- Take on opponents with new Match Abilities and have fun in unique and exciting matches<br>- Play the new Versus Mode<br>- Enjoy exciting new animations<br>- Game Balancing changes"},{"version_id":"830740569","version_name":"1.19.283","version_date":"2019-03-29 06:46:50.000 +0800","version_description":"WRESTLEMANIA UPDATE<br>- Enter WrestleMania Events with ManiaGold and earn the Authority Superstars<br>- Get in the brand new WrestleMania Arena and Live the Excitement of WWE Main Card Events<br>- Next Wave of Hero Superstars join the Mayhem along with some awesome surprises<br>- Take on opponents with new Match Abilities and have fun in unique and exciting matches<br>- Introducing Single Objective Quests. Complete missions to collect immediate Rewards."},{"version_id":"831233840","version_name":"1.20.477","version_date":"2019-05-18 04:55:34.000 +0800","version_description":"MONEY IN THE BANK UPDATE<br>Stay Alert! More Superstars to join the Mayhem.<br>MITB Lootcase is coming back. Grab the opportunity to get 4 Star Superstars.<br>Now take your female superstars to the new MITB Female Ladder Matches<br>Synergies are Rebalanced. Be careful with Superstars you take into the ring.<br>Quests are now more interesting with added conditions"},{"version_id":"831456094","version_name":"1.21.129","version_date":"2019-05-30 08:51:59.000 +0800","version_description":"LEAGUE OF CHAMPIONS UPDATE<br>Join the League of Champions and unleash the Mayhem<br>Collect the new ChampGold currency across the League of Champions campaign<br>Explore the power of SYNERGY. Participate in the first time ever Synergy Events.<br>Participate in the upcoming Super ShowDown and Stomping Grounds Main Card Events<br>#BringontheMayhem"},{"version_id":"831841400","version_name":"1.22.437","version_date":"2019-07-03 15:12:29.000 +0800","version_description":"RetroMadness Update\n<br>Join the Madness with the #GreatestEver WWE Legends. Stay tuned as NEW Legends make their way to the ring!\n<br>Collect Retro Tickets and unlock the Million Dollar Store for huge benefits\n<br>Boost your cash count with the new Cash Multiplier\n<br>Now put your roster up to the test in the new Insane Difficulty\n<br>Introducing new and replayable Superstar House Shows. Earn better rewards every time.\n<br>Several new animations added\n<br>#BringontheMayhem"},{"version_id":"832058056","version_name":"1.22.446","version_date":"2019-07-19 13:56:14.000 +0800","version_description":"Bug fixes and optimization."},{"version_id":"832138193","version_name":"1.23.233","version_date":"2019-08-04 07:07:29.000 +0800","version_description":"SummerSlam Update\n<br>Get startled as 5 Star Superstars with Unique Power Abilities join the Mayhem\n<br>Enjoy the enhanced fighting experience with new Mini-Game for 5 Star Superstars\n<br>Grab another chance to get the Authority Superstars as they make a comeback\n<br>Make the most of Daily Events to Level-Up easily and earn awesome rewards\n<br>Win lots of 5 Star Keys to claim 5 Star Superstars\n<br>#BringontheMayhem"},{"version_id":"832328912","version_name":"1.23.251","version_date":"2019-08-11 08:01:33.000 +0800","version_description":"Bug in 5-Stars Superstars for different match types resolved\n<br>Zero Special Currency display in HUD corrected\n<br>Issue in Cash Multipliers on selling items resolved\n<br>Scroll list added to view all event rewards\n<br>Fixed Soft crashes"},{"version_id":"832467419","version_name":"1.24.223","version_date":"2019-09-05 10:36:11.000 +0800","version_description":"NEW 4 STAR FEMALE SUPERSTARS<br>Welcome, Naomi, Natalya, Ember Moon, Lana, Sasha Banks, Bayley, Alexa Bliss, and Nia Jax in their most powerful version yet.<br><br>NEW MATTEL TOY SUPERSTARS<br>Get Junkyard Dog, Kevin Nash, Elias, and Matt Hardy Retro Toys and scan their codes to add them to WWE Mayhem.<br><br>REVOLUTION KEYS<br>The new 4 Star Female Superstars will mark the advent of Revolution Keys which can be collected from Events throughout the month of September. Get guaranteed 2, 3 and 4 Star versions of the Revolution Lootcase by exchanging 1000, 3000 and 10000 Revolution Keys.<br><br>MORE QUEST OPTIONS<br>We've added variety to Quests. Complete a challenge by performing the 5 Knuckle Shuffle with a 3 Star John Cena in Versus Mode or inflict 20000 Damage to your opponent with 4 Star Roman Reigns in Live Events.  So, Quests will now be particular to special moves, superstars and game modes. <br><br>The Story Mode just got more interesting with new Quest missions to complete specific Episodes in specific Seasons. Thus, with more filters and objectives, Quests will never be the same again.<br><br>ENHANCEMENT OPTIONS<br>Your opponent boasts of 100% increased Damage while you have 20% Heal ability. Or you enjoy 100% increased Damage while your opponent gets 20% Heal ability. What would you choose? Now, you get to choose an Enhancement from a set of options before entering a fight. The choice may be applicable to either your Superstar or the Opponent or both. Use this option to your advantage and select wisely!<br><br>OTHER GAME UPDATES<br>- Beginner, Normal, Superstar or Insane; female superstar difficulties will new match cards<br>- Submission Move Damage in Submission Events is now aligned to the superstar's signature move<br>- Opponent Reversals have been reconfigured to make matches easier for Early Game Players."},{"version_id":"832793595","version_name":"1.24.255","version_date":"2019-09-19 08:55:15.000 +0800","version_description":"Exclusive 5 Star keys: Enter the squared circle and participate in the Weekly Ultra and upcoming Rebellion Events to get your hands on precious 5 Star keys.\n<br>Exciting Offers: With the exceptional enthusiasm around the King Size Sale and the Beat the Clock Offers, do expect for even more exciting stuff coming your way. Wooooooo!\n<br>Fixed Crash Issues. Cuz Stone Cold said so!\n<br>Bug Fixes: Passive Ability that was getting triggered on tag was fixed."},{"version_id":"833031835","version_name":"1.25.181","version_date":"","version_description":""},{"version_id":"833140236","version_name":"1.25.193","version_date":"2019-10-14 08:49:08.000 +0800","version_description":"ALLIANCE LAUNCH<br>Yes! Yes! Yes! This update will mark the advent of the much-awaited and anticipated Alliance Mode. Become the part of an Alliance and aim for the ultimate spot on the Leaderboards.<br>MAYHEM SEASON PASS<br>Quests just got now super-fun and extra-rewarding. Come back every day to complete Season Quests. Multiply your Quest Rewards with the new Mayhem Pass for an entire season. Ooooh Yeah!<br>NEW SUPERSTARS<br>It's true. Oh, it's damn true! Based on the survey results, a few of the most sought-after Superstars will join the Mayhem. Stay tuned for awesome surprises.<br>HELL IN A CELL<br>Participate in the Hell in a Cell PPV to win amazing rewards. Take your Challengers to the Hell in a Cell Main Card Events. Let'em in the Hell and set your own fate.<br>NEW DAILY DEALS<br>With the exceptional enthusiasm around the King Size Sale and the Beat the Clock Offers, do expect for even more exciting stuff coming your way. Wooooooo!"},{"version_id":"833208222","version_name":"1.26.216","version_date":"2019-11-15 09:51:12.000 +0800","version_description":"SURVIVOR SERIES UPDATE<br>RAW vs SDL<br>It’s time you choose sides. Either play for team RAW or join team SDL. Keep your WWE Superstars busy. All the points you score get added to the faction of your choice. Track the leaderboard. Buck up if your faction is lagging behind and continue to dominate if you are in the lead. Prove your loyalty to your favorite faction.<br>MAYHEM SEASON PASS<br>Wait! There’s more to the Mayhem Pass:<br>Recharge your energy much faster and play more<br>Reduce the Superstar Exhaustion Time in Versus Mode and get back to attack<br>Get 25% Extra Inventory Storage space for each item and stay carefree<br>Multiplying your Quest Rewards with the new Mayhem Pass for an entire season got much cooler.<br>NEW SUPERSTARS<br>It's true. Oh, it's damn true! Based on the survey results, a few of the most sought-after Superstars will join the Mayhem. Stay tuned for awesome surprises.<br>ACHIEVEMENTS<br>You can now see what you couldn't! No, it's not John Cena yet. Head to the Quest Section and tap on the Achievements Tab to view every game milestone you have successfully completed. You can also check the status of other incomplete milestones and play for specific Achievements.<br>ALLIANCE SEASONS<br>Claim your dominance on the Alliance Leaderboard with upcoming Alliance Seasons. Get point multipliers and keep coming back to participate in the Alliance Events and outscore your competition. Remember! It’s all about the collective strategy and constant communication among all your Alliance members.<br>SURVIVOR SERIES<br>Participate in the Survivor Series PPV to win amazing rewards. Take your Challengers to the Survivor Series Main Card Events and set your own fate.<br>NEW DAILY DEALS<br>With the exceptional enthusiasm around all the recently introduced amazing Offers, do expect for even more exciting stuff coming your way. Wooooooo!"},{"version_id":"833714317","version_name":"1.27.237","version_date":"2019-12-03 07:04:51.000 +0800","version_description":"TABLES, LADDERS AND CHAIRS UPDATE\n<br>NEW SUPERSTARS\n<br>Hulkamania begins in Mayhem. Yes, get ready to welcome Hulk Hogan and Mr. T to make your legendary roster more stronger.\n<br>NO DISQUALIFICATION QUESTS\n<br>December events are loaded with No Disqualification matches. Attack your opponent with candies, gift boxes, and tables. We have made sure that you are prepared for upcoming TLC events.\n<br>MAYHEM SEASON PASS\n<br>A brilliant addition to Mayhem Pass:\n<br>A Mayhem pass holder will get a chance to Reroll the same lootcase. This means you come one step closer to your favorite superstar.\n<br>5 STAR SUPERSTARS\n<br>Your technician roster becomes more cooler with the addition of 5 Star version of Randy Orton. Rest in peace with 5 Star version of The Undertaker.\n<br>NEW CHRISTMAS ARENA\n<br>The classic WWE match bell turns into Jingle Bell with our new Christmas Arena. Feel the joy with these kicks to your opponent accompanied by the holiday classic props.\n<br>TLC\n<br>Participate in the TLC PPV to win amazing rewards. Take your Challengers to the TLC Main Card Events and set your own fate.\n<br>NEW DAILY DEALS\n<br>With the exceptional enthusiasm around all the recently introduced amazing Offers, do expect for even more exciting stuff coming your way. Wooooooo!"},{"version_id":"833869833","version_name":"1.27.248","version_date":"2019-12-06 09:28:22.000 +0800","version_description":"Bug fixes and optimization.<br>TABLES, LADDERS AND CHAIRS UPDATE<br>NEW SUPERSTARS<br>Hulkamania begins in Mayhem. Yes, get ready to welcome Hulk Hogan and Mr. T to make your legendary roster more stronger.<br>NO DISQUALIFICATION QUESTS<br>December events are loaded with No Disqualification matches. Attack your opponent with candies, gift boxes, and tables. We have made sure that you are prepared for upcoming TLC events.<br>MAYHEM SEASON PASS<br>A brilliant addition to Mayhem Pass:<br>A Mayhem pass holder will get a chance to Reroll the same lootcase. This means you come one step closer to your favorite superstar.<br>5 STAR SUPERSTARS<br>Your technician roster becomes more cooler with the addition of 5 Star version of Randy Orton. Rest in peace with 5 Star version of The Undertaker.<br>NEW CHRISTMAS ARENA<br>The classic WWE match bell turns into Jingle Bell with our new Christmas Arena. Feel the joy with these kicks to your opponent accompanied by the holiday classic props.<br>TLC<br>Participate in the TLC PPV to win amazing rewards. Take your Challengers to the TLC Main Card Events and set your own fate.<br>NEW DAILY DEALS<br>With the exceptional enthusiasm around all the recently introduced amazing Offers, do expect for even more exciting stuff coming your way. Wooooooo!"},{"version_id":"834073775","version_name":"1.28.215","version_date":"2020-01-03 09:00:44.000 +0800","version_description":"THE NXT UPDATE\n<br>Happy New Year Mayhemers. As we enter 2020, get ready to welcome the first batch of NXT Superstars. Start collecting them and build your NXT roster. Also, do not forget to upgrade your roster for the upcoming Royal Rumble events. With new 5 Star Superstars making an entry into the world of WWE Mayhem and an NXT Mega Event, we definitely will be starting 2020 with a bang!\n<br>NXT TAKEOVER\n<br>Boom! The NXT show just got a whole lot bigger with new superstars arriving. Climb the Versus leaderboards across the month and get a chance to win NXT superstars like Adam Cole, Velveteen Dream, Shayna Baszler, Matt Riddle and many more. This update will also mark the advent of the NXT versions of a few existing superstars like Finn Balor, Sasha Banks, Bayley, Shinsuke Nakamura, and several others. Now you can only enter the NXT Show with NXT Superstars, so start collecting them all.\n<br>MAYHEM SEASON PASS\n<br>Bro! Bro! Bro! The Quests this season are NXT overloaded. Return every day to enjoy super-fun and extra-rewarding challenges. Multiply your quest rewards with the back-to-back We are NXT and NXT Takeover Mayhem Passes for the entire season respectively.\n<br>NEW 5 STAR SUPERSTARS\n<br>Get new 5 Star Superstars on Early Access and add them to your roster. Brace yourselves for the 5 Star Superstar Event and keep an eye on the 5 Star Featured Lootcase. Take your 5 Star Superstars to the squared circle and let your opponents Rest. In. Peace.\n<br>NXT EVENTS AND ALLIANCE SEASONS\n<br>Yeaoh! Enter the “Worlds Collide” Mega Event with RAW, SDL and NXT Superstars and dominate your opponents for big rewards. Participate in the NXT Themed Alliance Seasons throughout the month and rule the Alliance Leaderboards.\n<br>ROYAL RUMBLE\n<br>The only place your opponents belong is outside the ring! Participate in the Royal Rumble PPV Events to win amazing rewards. Take your Challengers to the Royal Rumble Main Card Events and set your own fate, cuz Stone Cold said so!\n<br>AMAZING OFFERS AND DAILY DEALS\n<br>Take your superstars into the ring and destroy your opponents to win great rewards. Upgrade your roster and discover New Offers as you advance in the game. Do expect for crazy deals and other exciting stuff coming your way. Wooooooo!"},{"version_id":"834534799","version_name":"1.29.261","version_date":"2020-02-03 11:32:49.000 +0800","version_description":"D-GENERATION X UPDATE<br>Nothing ever came close to D-Generation X. This update marks your opportunity to get the group of antiheroes who pushed it to the limit and got away with it. Upgrade your roster for a month full of action and excitement. With new 5 Star Superstars and Mega Events, prepare to unleash wrath on your opponents. Are you Ready?<br><br>DX SUPERSTARS<br>Triple H was a world champion. Shawn Michaels was one of the five best of all time. X-Pac could be one of the 10 greatest cruiserweights to ever wrestle. Chyna pushed past barriers and won the Intercontinental Belt, and Road Dogg was a former marine. How can you match that? Climb the Versus Leaderboards across the month and get a chance to win the members of the most rebellious group in WWE history.<br><br>MAYHEM SEASON PASS<br>The Quests this season are DX overloaded. Return every day to enjoy super-fun and extra-rewarding challenges. Multiply your quest rewards with the back-to-back Mayhem Passes for the entire season respectively.<br><br>NEW 5 STAR SUPERSTARS<br>Get new 5 Star Superstars on Early Access and add them to your roster. Brace yourselves for the 5 Star Superstar Events and keep an eye on the 5 Star Featured Lootcase. Take your 5 Star Superstars to the squared circle and dominate your opponents.<br><br>EVENTS AND ALLIANCE SEASONS<br>Along with the ‘Are You Ready?’ Mega DX Event, February boasts of several exciting events coming your way. Build your team for Valentine's Day Mixed Match Event. Win big with Mardi Gras 25 and Superbowl: Halftime Heat. Rule the Alliance Leaderboards with the DX Themed Alliance Seasons. Take your Challengers to the Fastlane and NXT Takeover: Oregon PPVs to set your own fate.<br><br>OFFERS AND DAILY DEALS<br>Head to the squared circle and destroy your opponents to win great rewards. Upgrade your roster and discover New Offers as you advance in the game. Do expect for crazy deals and other exciting stuff coming your way."},{"version_id":"834930817","version_name":"1.30.149","version_date":"2020-03-04 10:43:43.000 +0800","version_description":"THE ROAD TO WRESTLEMANIA UPDATE<br>The Road to WrestleMania 36 has begun, as the most exciting time of the year in professional wrestling has finally arrived. WWE Mayhem brings you the opportunity to live that excitement for real. Get ready to experience the thrill of an incredible journey. Get ready to #BringontheMayhem!<br><br>SUPERSTARS WITH UNIQUE POWERS<br>New WWE Superstars join the Mayhem. These Superstars are intimidating as they will come with the most unique advantages and give you authority over the others. Participate in WrestleMania Events at the end of the Campaign to get the New Superstars on your roster.<br><br>EARN MANIAGOLD<br>The Road to WrestleMania is your journey towards getting the new superstars with unique powers by your side. It offers you opportunities to collect ManiaGold. ManiaGold is your ticket to the WrestleMania Events where you get the opportunity to earn the new Superstars.<br><br>MAYHEM SEASON PASS<br>Return every day to enjoy super-fun and extra-rewarding challenges. Multiply your quest rewards with the back-to-back Mayhem Passes for the entire season respectively. Also, there’s a lot of precious ManiaGold to be collected.<br><br>NEW 5 STAR SUPERSTARS<br>Get new 5 Star Superstars on Early Access. Brace yourselves for the 5 Star Superstar Events and keep an eye on the 5 Star Featured Lootcase. Take your 5 Star Superstars to the squared circle and dominate your opponents.<br><br>EVENTS AND ALLIANCE SEASONS<br>Face the intimidating new Superstars in Special Events or participate in many other events across your Road to WrestleMania journey to earn precious ManiaGold. Rule the Alliance Leaderboards with new Alliance Seasons or take your Challengers to the Elimination Chamber PPV and set your own fate.<br><br>OFFERS AND DAILY DEALS<br>Head to the squared circle and destroy your opponents to win great rewards and more importantly, ManiaGold. Upgrade your roster and discover New Offers as you advance on the Road to WrestleMania. Do expect crazy deals and other exciting stuff coming your way."},{"version_id":"835070966","version_name":"1.30.182","version_date":"2020-03-19 08:46:49.000 +0800","version_description":"Bug fixes and optimization.<br>THE ROAD TO WRESTLEMANIA UPDATE<br>The Road to WrestleMania 36 has begun, as the most exciting time of the year in professional wrestling has finally arrived. WWE Mayhem brings you the opportunity to live that excitement for real. Get ready to experience the thrill of an incredible journey. Get ready to #BringontheMayhem!<br><br>SUPERSTARS WITH UNIQUE POWERS<br>New WWE Superstars join the Mayhem. These Superstars are intimidating as they will come with the most unique advantages and give you authority over the others. Participate in WrestleMania Events at the end of the Campaign to get the New Superstars on your roster.<br><br>EARN MANIAGOLD<br>The Road to WrestleMania is your journey towards getting the new superstars with unique powers by your side. It offers you opportunities to collect ManiaGold. ManiaGold is your ticket to the WrestleMania Events where you get the opportunity to earn the new Superstars.<br><br>MAYHEM SEASON PASS<br>Return every day to enjoy super-fun and extra-rewarding challenges. Multiply your quest rewards with the back-to-back Mayhem Passes for the entire season respectively. Also, there’s a lot of precious ManiaGold to be collected.<br><br>NEW 5 STAR SUPERSTARS<br>Get new 5 Star Superstars on Early Access. Brace yourselves for the 5 Star Superstar Events and keep an eye on the 5 Star Featured Lootcase. Take your 5 Star Superstars to the squared circle and dominate your opponents.<br><br>EVENTS AND ALLIANCE SEASONS<br>Face the intimidating new Superstars in Special Events or participate in many other events across your Road to WrestleMania journey to earn precious ManiaGold. Rule the Alliance Leaderboards with new Alliance Seasons or take your Challengers to the Elimination Chamber PPV and set your own fate.<br><br>OFFERS AND DAILY DEALS<br>Head to the squared circle and destroy your opponents to win great rewards and more importantly, ManiaGold. Upgrade your roster and discover New Offers as you advance on the Road to WrestleMania. Do expect crazy deals and other exciting stuff coming your way."},{"version_id":"835434797","version_name":"1.31.145","version_date":"2020-04-08 08:56:51.000 +0800","version_description":"THE NEW WORLD ORDER UPDATE<br>It’s time to delve into the madness of Special WrestleMania Events and get the much-awaited Exclusive Superstars on your roster. While WrestleMania 36 comes to a close, WWE Mayhem brings you the opportunity to experience the excitement of the Attitude Era for real with probably one of the best stables to have ever existed. Get ready for the New World Order. Get ready to #BringontheMayhem!<br><br>NEW WORLD ORDER<br>The nWo, one of sports-entertainment’s most controversial factions, could sum up their motives in three simple words: “We’re taking over!” Get ready to welcome the new version of Superstars like Scott Hall, Kevin Nash, Hollywood Hogan, and other nWo greats, as they take over WWE Mayhem.<br><br>COLLECT NWO BADGES<br>Become the part of one of the hottest storylines in wrestling history by collecting exclusive nWo Badges throughout April. Get enough nWo Badges to collect nWo Shared Keys. Use these keys to open respective nWo Superstar Lootcases. The nWo Badge is your ticket to create your own Exclusive WWE Mayhem nWo Club.<br><br>MAYHEM SEASON PASS<br>Return every day to enjoy super-fun and extra-rewarding challenges. Multiply your quest rewards with the back-to-back Mayhem Passes for the entire season respectively. Also, collect lots of precious nWo Badges.<br><br>NEW 5 STAR SUPERSTARS<br>Get new 5 Star Superstars on Early Access. Brace yourselves for the 5 Star Superstar Challenges and keep an eye on the 5 Star Featured Lootcase.<br><br>EVENTS AND ALLIANCE SEASONS<br>Enter the WrestleMania Moment and Grandest Stage Events with ManiaGold. Rule the Alliance Leaderboards with new Alliance Seasons, or accomplish special nWo Quests. Face the new nWo Superstars in Weekly nWo Challenge Events or participate in Special Easter, Ramadan, and other Events to collect nWo Badges.<br><br>OFFERS AND DAILY DEALS<br>Upgrade your roster and discover amazing new Offers and Deals that give you every chance to collect as many nWo badges as possible."},{"version_id":"835587547","version_name":"1.31.166","version_date":"2020-04-22 10:53:55.000 +0800","version_description":"TRIPLE H 25th ANNIVERSARY UPDATE<br>He’s The King of Kings, a nickname with no hint of exaggeration considering that Triple H is essentially WWE royalty. 25 Years of Triple H in WWE calls out for a celebration for wrestling fans around the world. While the fans will definitely keep an eye as WWE revisits The Game’s career, as Mayhemer's, there's a lot of action and entertainment coming your way.<br><br>We are ready to play the game. Are you?<br><br>5 STAR TRIPLE H JOINS THE MAYHEM<br>There could not have been a better time to release the 5 Star version of Triple H in WWE Mayhem. Keep an eye on the 5 Star Featured Lootcase and get the 5 Star version of The Game on your roster.<br><br>COLLECT TRIPLE H METAL<br>Become the part of one of the biggest celebrations in wrestling history by collecting exclusive Triple H Metal from special events and activities. Collect enough Triple H Metal currency to get the most celebrated stables in WWE History that Triple H has been a part of; DX, Evolution and The Authority.<br><br>MAYHEM SEASON PASS<br>Continue returning every day to enjoy super-fun and extra-rewarding challenges. Don’t just multiply your quest rewards with the Mayhem Pass but also collect lots of precious Triple H Metal currency.<br><br>EVENTS AND ALLIANCE SEASON<br>Participate in various events for the opportunity to get Triple H for Free and collect Triple H Metal currency. Relive the most memorable matches of the Cerebral Assassin and accomplish various challenges to conquer the special Triple H Quest. While you can rule the Alliance Leaderboard with Triple H on your roster, do dare to face The Game in his Unstoppable Giant Event.<br><br>OFFERS AND DAILY DEALS<br>Upgrade your roster and discover amazing new Offers and Deals that give you every chance to collect as much Triple H Metal currency as possible. Also, look out for Offers that give you the chance to get The 5 Star King of Kings on your roster."},{"version_id":"835819007","version_name":"1.32.209","version_date":"2020-05-08 10:22:26.000 +0800","version_description":"24/7 UPDATE<br>While WWE Mayhem brings to you the chance to claim the most memorable 24/7 Champions on your roster, all you need to do is Play 24/7. There will be new 5 Star Superstars joining the Mayhem so get ready to add them to your roster. Also stay abreast of the latest Offers and new Deals coming your way.<br><br>24/7 SUPERSTARS<br>The 24/7 Championship can be defended anytime, anywhere. So a champion defends their title 24 hours a day, 7 days a week. The best of those champions will be making their way into the world of WWE Mayhem. Make sure you give it your best to get the champions by your side.<br><br>COLLECT 24/7 WATCHES<br>While the Champions need to defend their 24/7 Title till the end, you need to constantly keep collecting 24/7 Watches from special events and activities. Collect enough 24/7 Watches to get the most celebrated 24/7 Champions on your roster. Head to the exclusive 24/7 Store where you can also purchase awesome in-game items by exchanging your 24/7 Watches.<br><br>MAYHEM SEASON PASS<br>Continue returning every day to enjoy super-fun and extra-rewarding challenges. Don’t just multiply your quest rewards with the Mayhem Pass but also collect lots of precious 24/7 Watches.<br><br>EVENTS AND ALLIANCE SEASON<br>Participate in various events for the opportunity to collect 24/7 Watches. Fight the 24/7 Title Holders or dare to face them in their Unstoppable Giant events. Accomplish various challenges to conquer the special 24/7 Quest as well as rule the Alliance Leaderboard with the 24/7 Champions on your roster. Also, participate in the MITB PPV Events and win awesome rewards.<br><br>OFFERS AND DAILY DEALS<br>Upgrade your roster and discover amazing new Offers and Deals that give you every chance to collect as many 24/7 Watches as possible. Also, look out for Offers that give you the chance to get the 5 Star Superstars and the 24/7 Champions on your roster."},{"version_id":"836015282","version_name":"1.32.249","version_date":"2020-05-21 10:35:47.000 +0800","version_description":"24/7 UPDATE\n<br>While WWE Mayhem brings to you the chance to claim the most memorable 24/7 Champions on your roster, all you need to do is Play 24/7. There will be new 5 Star Superstars joining the Mayhem so get ready to add them to your roster. Also stay abreast of the latest Offers and new Deals coming your way.\n<br>\n<br>24/7 SUPERSTARS\n<br>The 24/7 Championship can be defended anytime, anywhere. So a champion defends their title 24 hours a day, 7 days a week. The best of those champions will be making their way into the world of WWE Mayhem. Make sure you give it your best to get the champions by your side.\n<br>\n<br>COLLECT 24/7 WATCHES\n<br>While the Champions need to defend their 24/7 Title till the end, you need to constantly keep collecting 24/7 Watches from special events and activities. Collect enough 24/7 Watches to get the most celebrated 24/7 Champions on your roster. Head to the exclusive 24/7 Store where you can also purchase awesome in-game items by exchanging your 24/7 Watches.\n<br>\n<br>MAYHEM SEASON PASS\n<br>Continue returning every day to enjoy super-fun and extra-rewarding challenges. Don’t just multiply your quest rewards with the Mayhem Pass but also collect lots of precious 24/7 Watches.\n<br>\n<br>EVENTS AND ALLIANCE SEASON\n<br>Participate in various events for the opportunity to collect 24/7 Watches. Fight the 24/7 Title Holders or dare to face them in their Unstoppable Giant events. Accomplish various challenges to conquer the special 24/7 Quest as well as rule the Alliance Leaderboard with the 24/7 Champions on your roster. Also, participate in the MITB PPV Events and win awesome rewards.\n<br>\n<br>OFFERS AND DAILY DEALS\n<br>Upgrade your roster and discover amazing new Offers and Deals that give you every chance to collect as many 24/7 Watches as possible. Also, look out for Offers that give you the chance to get the 5 Star Superstars and the 24/7 Champions on your roster.<br><br>Bug fixes and optimization."},{"version_id":"836100241","version_name":"1.32.249","version_date":"2020-05-21 10:35:47.000 +0800","version_description":"24/7 UPDATE\n<br>While WWE Mayhem brings to you the chance to claim the most memorable 24/7 Champions on your roster, all you need to do is Play 24/7. There will be new 5 Star Superstars joining the Mayhem so get ready to add them to your roster. Also stay abreast of the latest Offers and new Deals coming your way.\n<br>\n<br>24/7 SUPERSTARS\n<br>The 24/7 Championship can be defended anytime, anywhere. So a champion defends their title 24 hours a day, 7 days a week. The best of those champions will be making their way into the world of WWE Mayhem. Make sure you give it your best to get the champions by your side.\n<br>\n<br>COLLECT 24/7 WATCHES\n<br>While the Champions need to defend their 24/7 Title till the end, you need to constantly keep collecting 24/7 Watches from special events and activities. Collect enough 24/7 Watches to get the most celebrated 24/7 Champions on your roster. Head to the exclusive 24/7 Store where you can also purchase awesome in-game items by exchanging your 24/7 Watches.\n<br>\n<br>MAYHEM SEASON PASS\n<br>Continue returning every day to enjoy super-fun and extra-rewarding challenges. Don’t just multiply your quest rewards with the Mayhem Pass but also collect lots of precious 24/7 Watches.\n<br>\n<br>EVENTS AND ALLIANCE SEASON\n<br>Participate in various events for the opportunity to collect 24/7 Watches. Fight the 24/7 Title Holders or dare to face them in their Unstoppable Giant events. Accomplish various challenges to conquer the special 24/7 Quest as well as rule the Alliance Leaderboard with the 24/7 Champions on your roster. Also, participate in the MITB PPV Events and win awesome rewards.\n<br>\n<br>OFFERS AND DAILY DEALS\n<br>Upgrade your roster and discover amazing new Offers and Deals that give you every chance to collect as many 24/7 Watches as possible. Also, look out for Offers that give you the chance to get the 5 Star Superstars and the 24/7 Champions on your roster.<br><br>Bug fixes and optimization."},{"version_id":"836267685","version_name":"1.33.132","version_date":"2020-06-05 11:57:10.000 +0800","version_description":"NXT TAKEOVER UPDATE<br>The future is here with new NXT Superstars. Also, stay put for some masterclass by NXT Alumni as they make a comeback to the yellow brand soon after you witness the Greatest Wrestling Match Ever at Backlash.<br><br>NXT SUPERSTARS<br>While WWE's next generation of superstars battle to make an impact on their rise to fame at NXT Takeover, some of the best of NXT Superstars will be making their way into the world of WWE Mayhem. Do not forget to embrace the company of NXT Alumni for the opportunity to get your hands on the NXT heritage superstars who made it big.<br><br>COLLECT NXT GOLD AND NXT SILVER<br>Keep collecting NXT Gold from special events and activities to get NXT Rage and NXT Arrival Lootcases for the most celebrated NXT Superstars on your roster. Conquer challenges in the latter part of this exciting NXT month to be eligible for NXT Silver Currency and get the NXT Alumni Superstars by your side.<br><br>MAYHEM SEASON PASS<br>Continue returning every day to enjoy super-fun and extra-rewarding challenges. Don’t just multiply your quest rewards with the Mayhem Pass but also collect precious NXT Gold and NXT Silver Currencies.<br><br>BACKLASH PPV<br>BackLash will be a test for all you Mayhemers with Edge and Randy Orton set to battle in a historic test of pure wrestling skills and other main card matches. Do not miss the BackLash PPV Event where you push past your limits for amazing rewards.<br><br>EVENTS AND ALLIANCE SEASON<br>Fight the NXT Superstars and the Alumni for the opportunity to collect NXT Gold and NXT Silver respectively. Accomplish various challenges to conquer the special NXT Takeover quests. Rule the Alliance Leaderboard with the NXT Superstars on your roster.<br><br>OFFERS AND DAILY DEALS<br>Upgrade your roster and discover amazing new Offers and Deals that give you every chance to collect as NXT Gold and NXT Silver Currencies."},{"version_id":"836581111","version_name":"1.34.208","version_date":"2020-07-02 09:57:39.000 +0800","version_description":"EXTREME RULES UPDATE<br>Extreme Rules will see the rules thrown out the window and rivalries taken to the next level. Participate in the Extreme Rules Events and claim ‘X Tokens’ to get your favorite WWE Superstars. <br><br>MUSCLE MONSTERS<br>As the month of July begins, the Muscle Monsters get ready to wreak havoc in WWE Mayhem and the giant incarnations of WWE’s most popular Superstars emerge from the darkness. Collect the Kettlebell currency to get supernatural monstrosities on your roster… if you dare.<br><br>FEAR THE SPEAR<br>Watching the Kings of Spear leave their feet to deliver their ground-shaking finisher definitely calls for anybody facing them to fear the Spear. Get ready to experience the Spear in all it's glory and claim the Spearguns. <br><br>GET NEW SUPERSTARS<br>Keep collecting ‘Kettlebell’ Currency across the Monster Muscles Campaign to claim giant incarnations in WWE on  your roster. Conquer challenges in the Devastating Spears campaign to be eligible for ‘Charge Tokens’ and get the Kings of Spear by your side. Also, new 5 Star Superstars join the Mayhem.<br><br>MAYHEM SEASON PASS<br>Continue returning every day to enjoy super-fun and extra-rewarding challenges. Don’t just multiply your quest rewards with the Mayhem Pass but also collect precious Kettlebells and Charge Tokens.<br><br>EVENTS AND ALLIANCE SEASON<br>Fight the Muscle Monsters and Kings of Spear one-on-one or dare to face their Ultimate Giant versions. Accomplish various challenges to conquer special campaign quests. Rule the Alliance Leaderboard with the Featured Superstars on your roster.<br><br>OFFERS AND DAILY DEALS<br>Upgrade your roster and discover amazing new Offers and Deals that give you every chance to collect respective campaign currencies and your favorite WWE Superstars."},{"version_id":"837036128","version_name":"1.35.171","version_date":"2020-07-30 09:34:56.000 +0800","version_description":"SUMMERSLAM UPDATE<br>Witness the biggest and greatest of WWE Superstars and Legends bring on the Mayhem. Claim ‘Star Tokens’ to collect all the campaign keys to have ever existed in WWE Mayhem. Open respective lootcases and get your favorite Superstars on your roster. <br><br>SUMMERSLAM 88<br>A new tradition was born as New York's Madison Square Garden hosted the inaugural SummerSlam. A capacity crowd witnessed the ultimate action with event showdowns among the greatest of WWE Superstars. Travel back in time and relive the excitement of SummerSlam 88. Collect Hall of Fame Rings and get your favorite WWE Legends on your roster.<br><br>SUMMERSLAM 2020<br>The Biggest Event of the Summer is here. There is no better way to enjoy all the excitement of SummerSlam 2020 than by participating in the WWE Mayhem SummerSlam 2020 Events. Join the biggest summer party on the planet with the biggest WWE Superstars.<br><br>GET NEW SUPERSTARS<br>Keep collecting ‘Hall of Fame Rings’ Currency from special events and activities across the SummerSlam 88 Campaign to claim the greatest WWE Legends on  your roster. New 5 Star Superstars join the Mayhem. Do not miss the opportunity!<br><br>MAYHEM SEASON PASS<br>Continue returning every day to enjoy super-fun and extra-rewarding challenges. Don’t just multiply your quest rewards with the Mayhem Pass but also collect precious Hall of Fame Rings and Star Tokens.<br><br>EVENTS AND ALLIANCE SEASON<br>Fight the WWE Legends and Superstars one-on-one or dare to face their Ultimate Giant versions. Accomplish various challenges to conquer special campaign quests. Rule the Alliance Leaderboard with the Featured Superstars on your roster.<br><br>OFFERS AND DAILY DEALS<br>Upgrade your roster and discover amazing new Offers and Deals that give you every chance to collect respective campaign currencies and your favorite WWE Superstars and Legends."},{"version_id":"837309532","version_name":"1.35.226","version_date":"2020-08-13 10:20:18.000 +0800","version_description":"MANAGERS OF MAYHEM UPDATE<br>Now get Managers on your roster and gain a huge advantage over your opponents. Also, participate in the NXT Takeover campaign and get your favorite NXT Superstars.<br><br>NEW MANAGERS<br>Introducing Miss Elizabeth and Ted DiBiase as Managers who will enhance the performance of all team members on your roster as well as add unique Power Stat as an advantage. One manager can be assigned to a team at a time, so start building your strategy.<br><br>NEW POWER STAT BUTTON<br>Your gameplay just got even more exciting! Charge the new Power Stat Button (with the appointed manager’s thumbnail) by filling-up the charge-meter. Once charged, activate the Power Stat Button and execute massive advantages attributed to the respective manager.<br><br>COLLECTIONS AND TRIUMPHS<br>Collections are a set of specific tasks whereas a Triumph is a set of Collections. Accomplish tasks and complete Triumphs to earn respective Manager Shards. Use these shards to get respective managers. Also, collect Contracts (Level-up materials) and Silver / Gold / Platinum / Diamond Cards (Rank-up materials) from Collections and Triumphs to upgrade your Managers up to their best and gain the maximum advantage out of them.<br><br>NXT TAKEOVER<br>The future is here with new NXT Superstars. While WWE's next generation of superstars battle to make an impact on their rise to fame at NXT Takeover, collect NXT Gold by participating in the campaign and claim NXT Superstars.<br><br>MAYHEM SEASON PASS<br>Continue returning every day to enjoy super-fun and extra-rewarding challenges. Don’t just multiply your quest rewards with the NXT Takeover Mayhem Pass but also collect NXT Gold.<br><br>EVENTS AND ALLIANCE SEASON<br>Fight NXT Superstars. Accomplish challenges to conquer Quests. Rule the Alliance Leaderboard and participate in the Women’s Equality Day Event for 5 Star Keys.<br><br>OFFERS AND DAILY DEALS<br>Upgrade your roster and discover amazing new Offers and Deals that give you every chance to collect NXT Gold and your favorite WWE Superstars."},{"version_id":"837406890","version_name":"1.36.145","version_date":"2020-09-04 09:16:21.000 +0800","version_description":"KING OF THE RING UPDATE<br>The King of the Ring tournament is one steeped in tradition and opportunity. Get the best superstars and take them to the conquest to determine who will emerge victoriously, and what history and tradition will they look to uphold in their pursuit of superiority?<br><br>NEW SUPERSTARS<br>While your favorite WWE Superstars will vie for the opportunity to conquer the competition within and achieve greatness in WWE, there will be new WWE Superstars making their way to the world of WWE Mayhem. Introducing Jerry “The King” Lawler and King Corbin, who will wear the crown to the ring and take the throne.<br><br>COLLECT KING OF THE RING CROWNS<br>As royal as its history, the campaign will feature illustrious events to claim the Crown - the marvelous campaign currency. Keep collecting the Crowns to get King of the Ring Lootcase and claim the most celebrated WWE Superstars on your roster for whom the crown became ingrained in their on-screen persona.<br><br>MAYHEM SEASON PASS<br>Continue returning every day to enjoy super-fun and extra-rewarding challenges. Don’t just multiply your quest rewards with the King of the Ring Mayhem Pass but also collect precious Crowns.<br><br>EVENTS AND ALLIANCE SEASON<br>The King of the Ring campaign is star-studded and is rife with spectacular Versus Events. Explode into the atmosphere breathed only by the top acts in King of the Ring Branched and Ultra events to vie for the crown and other amazing rewards. Enter the ring as featured superstars who have every tool it takes between the ropes to rule the Alliance Leaderboard. Fight the biggest superstars and accomplish various challenges to conquer special Quests. <br><br>OFFERS AND DAILY DEALS<br>Upgrade your roster and discover amazing new Offers and Deals that give you every chance to collect King of the Ring Crowns and your favorite WWE Superstars. Get 5 Star versions of The Rock and Becky Lynch on Early Access or claim 5 Star versions of Braun Stowman and Hulk Hogan from their Featured Lootcase.<br><br>Make way for the King…"},{"version_id":"837884582","version_name":"1.36.185","version_date":"2020-09-25 09:42:56.000 +0800","version_description":"CLASH OF CHAMPIONS UPDATE<br>Get ready for an intense new chapter on rivalries between WWE Champions and Superstars in ‘Clash of Champions’. Also, your wits and endurance and skill will be tested against highflying superstars with electrifying style and top-of-the-rope offense.<br><br>TOP ROPE TAKE OFF SUPERSTARS<br>Collect Top Rope Wings from high-risk, high-reward events to get the Top Rope Lootcase. Claim the likes of Jeff Hardy, Eddie Guerrero, Ali, and Ricochet on your roster, who could do things in the ring that you could miss in the blink of an eye.<br><br>EARN TITLES <br>Now show off your achievements with hard-earned Titles. Accomplish challenges in the forms of various in-game events and brag about your triumphs on your profile.<br><br>NEW TOUR IN STORY MODE<br>Brace yourselves for the third new “Takeover: Mayhem” Tour coming to the Story Mode. Build your roster of NXT Superstars and take them to the squared circle.<br><br>COLLECTION CASES<br>The 'Loot' menu now has an added provision to filter Lootcases in the 'Collection Cases' for ease of navigation.<br><br>CLASH OF CHAMPIONS PPV<br>Fuel the WWE Superstars on your roster with the allure of Champion Gold as they invade for Clash of Champions. Headlined by the biggest WWE Superstars, the war for supremacy extends to some of the biggest upcoming events, with a stacked lineup and amazing rewards.<br><br>MAYHEM SEASON PASS<br>Continue returning every day to enjoy super-fun and extra-rewarding challenges. Multiply your quest rewards with the Champions Pass and Top Rope Take Off Mayhem Pass. Also, collect precious Champion Gold and Top Rope Wings.<br><br>EVENTS AND ALLIANCE SEASON<br>This update boasts of Events that bring you the opportunity to win amazing rewards and claim the biggest Superstars on your roster. Play Clash of Champions Main card Matches and participate in the Tope Rope Take Off Branched &amp; Ultra Events. Top the Alliance Leaderboard and accomplish Quests. Get 5 Star Keys from 5 Star Challenges respectively. <br><br>OFFERS AND DAILY DEALS<br>Upgrade your roster and discover amazing new Offers and Deals to collect your favorite WWE Superstars. Get 5 Star Superstars on Early Access or from their Featured Lootcases."},{"version_id":"838221034","version_name":"1.37.786","version_date":"2020-10-16 10:30:33.000 +0800","version_description":"HALLOWEEN UPDATE<br><br>HELL IN A CELL<br>The Hell in a Cell classic steel cage with no exit ensures that there's no escape from the Champion's reign of terror, and that’s exactly the way Challengers would want it. Participate in the WWE Mayhem Hell in a Cell Events and collect ‘Hell Coins’. Take your challengers into the cage and set your own fate against the champions in the Main Card Matches.<br><br>MAYHEM ZOMBIES<br>Get ready to face the undead version of your favorite superstars. It's Mayhem Zombies! Claim ‘Deadbucks’ to get all the WWE Mayhem Zombie Superstars with exclusive abilities namely Poison, Atrophy, and Jinx.<br><br>MASKED MONSTERS<br>While Masks are super cool, they also add to the mystique of the Superstars donning them. Hail the Masked Monsters and fight them to collect cool 'Masks' and get awesome Masked Monsters on your roster, including Vader as he joins the Mayhem.<br><br>NEW SHOW TYPE<br>Introducing 'Zombies', a brand new show where you take your Zombie Superstars into the squared circle every week.<br><br>NEW SUPERSTARS<br>Keep collecting the Deadbuck, Hell Coin, and Mask currencies from events and activities across the respective campaigns to claim the newly added Mayhem Zombies and the greatest WWE Superstars on your roster. Keep an eye on the new 5 Star Superstars who join the Mayhem.<br><br>NEW MANAGER, COLLECTIONS, AND TRIUMPHS<br>Introducing Paul Heyman's Zombie version as the first Zombie Manager with Sneak Attack Power Stat to help your Superstars. Complete special Zombie Tasks in respective Zombies 1 and 2 Collections to conquer Paul Heyman’s Triumph and get Zombie Paul Heyman. Also, accomplish Zombies 3 Collection to complete the Silver Paul Heyman’s Triumph and unlock the silver version of Zombie Manager Paul Heyman.<br><br>SUPERSTAR SHAKE-UP 2020<br>With WWE completing it's latest Draft to shake up the rosters of its two main shows, it’s also time for the WWE Mayhem Superstar Shake-up. Find your favorite WWE Superstars on the RAW and SmackDown brands as per Draft 2020."},{"version_id":"838331421","version_name":"1.37.804","version_date":"2020-10-29 10:34:10.000 +0800","version_description":"HALLOWEEN UPDATE<br><br>HELL IN A CELL<br>The Hell in a Cell classic steel cage with no exit ensures that there's no escape from the Champion's reign of terror, and that’s exactly the way Challengers would want it. Participate in the WWE Mayhem Hell in a Cell Events and collect ‘Hell Coins’. Take your challengers into the cage and set your own fate against the champions in the Main Card Matches.<br><br>MAYHEM ZOMBIES<br>Get ready to face the undead version of your favorite superstars. It's Mayhem Zombies! Claim ‘Deadbucks’ to get all the WWE Mayhem Zombie Superstars with exclusive abilities namely Poison, Atrophy, and Jinx.<br><br>MASKED MONSTERS<br>While Masks are super cool, they also add to the mystique of the Superstars donning them. Hail the Masked Monsters and fight them to collect cool 'Masks' and get awesome Masked Monsters on your roster, including Vader as he joins the Mayhem.<br><br>NEW SHOW TYPE<br>Introducing 'Zombies', a brand new show where you take your Zombie Superstars into the squared circle every week.<br><br>NEW SUPERSTARS<br>Keep collecting the Deadbuck, Hell Coin, and Mask currencies from events and activities across the respective campaigns to claim the newly added Mayhem Zombies and the greatest WWE Superstars on your roster. Keep an eye on the new 5 Star Superstars who join the Mayhem.<br><br>NEW MANAGER, COLLECTIONS, AND TRIUMPHS<br>Introducing Paul Heyman's Zombie version as the first Zombie Manager with Sneak Attack Power Stat to help your Superstars. Complete special Zombie Tasks in respective Zombies 1 and 2 Collections to conquer Paul Heyman’s Triumph and get Zombie Paul Heyman. Also, accomplish Zombies 3 Collection to complete the Silver Paul Heyman’s Triumph and unlock the silver version of Zombie Manager Paul Heyman.<br><br>SUPERSTAR SHAKE-UP 2020<br>With WWE completing it's latest Draft to shake up the rosters of its two main shows, it’s also time for the WWE Mayhem Superstar Shake-up. Find your favorite WWE Superstars on the RAW and SmackDown brands as per Draft 2020."},{"version_id":"838756348","version_name":"1.38.125","version_date":"2020-11-13 11:43:37.000 +0800","version_description":"RAW VS SMACKDOWN UPDATE<br>The ultimate battle for brand supremacy is here. Choose your faction and take your superstars to the squared circle for a face-off in a series of events and standard matches. Score points for your faction and claim bragging rights along with amazing rewards.<br><br>SURVIVOR SERIES<br>WWE Survivor Series returns to provide you with unforgettable and action-filled moments. Join the Survivor Series extravaganza by participating in Branched and Ultra Events. Also, set your own fate inside the squared circle in Main Card Matches.<br><br>30 YEARS OF UNDERTAKER<br>It was the 1990 Survivor Series when The Phenom started carving a legacy in sports-entertainment that has no rival. Commemorate the 30-year anniversary of The Undertaker’s WWE debut. Play events across his campaign and face various versions of the Undertaker and his greatest rivals.<br><br>THE HART FOUNDATION<br>The Hart Foundation left an indelible mark on WWE’s tag team division by creating many lasting memories for the WWE Universe. Get ready to participate in the events across the campaign and collect HF Coins to get WWE Superstars on your roster, including Jim Neidhart and British Bulldog who’ve joined the Mayhem.<br><br>NEW SUPERSTARS<br>Keep collecting the RAW and SDL currencies and the HFC Coins from events and activities across the respective campaigns to claim the newly added WWE Superstars on your roster. Keep an eye on the new 5 Star Superstars who join the Mayhem. Celebrate the 30th anniversary of the Undertaker with his new and unclaimed versions.<br><br>EVENTS AND ALLIANCE SEASON<br>This update is star-studded and is rife with spectacular Versus Events. Explode into the atmosphere breathed only by the top acts across all campaign events to vie for respective currencies and other amazing rewards. Enter the ring as featured superstars, who have every tool it takes between the ropes to rule the Alliance Leaderboard. Fight the biggest superstars and accomplish various challenges to conquer special Quests."},{"version_id":"839556038","version_name":"1.39.144","version_date":"2020-12-10 09:35:08.000 +0800","version_description":"MAYHEM FEST UPDATE<br>WWE Mayhem Fest is back with the Third Anniversary of WWE Mayhem just around the corner. Enjoy special Anniversary Week Login Rewards. Claim the opportunity to get 3,4 &amp; 5-Star Keys from Versus. Enter the WWE Anniversary Event to win even more 3,4 &amp; 5-Star Keys.<br><br>ANNIVERSARY GIFT<br>Our appreciation for your endless support extends further where every Mayhemer will be receiving a new 3-Star version of Alexa Bliss, absolutely FREE! Come back between 14-17 December to claim her from your Inbox. <br><br>TLC PPV<br>Get ready for all-out mayhem with the upcoming TLC events where the crashes are louder, the smashes are bigger and the stakes are higher. Participate in Branched and Ultra Events. Also, set your own fate inside the squared circle in Main Card Matches.<br><br>HOLIDAY CAMPAIGN<br>While there have been plenty of Superstars to embrace the holiday spirit, five WWE Superstars who showcased their festive facet as Santa Claus, are coming to WWE Mayhem. Collect the special Snowflake currency throughout the campaign to claim the new 4-Star Santa Superstars from the Santa Lootcase.<br><br>CHRISTMAS GIFT<br>Come Christmas morning, don’t forget to login for a little something extra special! All users who login on Christmas day will get Christmas Lootcases which will contain a big bouquet of goodies. No. of lootcases given away will depend on player level.<br><br>NEW SUPERSTARS<br>Keep collecting the Holiday Campaign Snowflake currency to claim the new 4-Star Santa versions of John Cena, Stone Cold Steve Austin, Big Show, Vader and R-Truth from the Santa Lootcase. Keep an eye on the new 5-Star Superstars who join the Mayhem.<br><br>EVENTS AND ALLIANCE SEASON<br>This update is star-studded and is rife with spectacular Versus Events. Enjoy the top acts across campaign events to vie for respective currencies. Enter the ring as featured superstars, to rule the Alliance Leaderboard. Accomplish various challenges to conquer special Quests.<br><br>So, grab a slice of cake, and join us for the celebration!"},{"version_id":"840056833","version_name":"1.40.114","version_date":"2021-01-22 11:15:12.000 +0800","version_description":"ROYAL RUMBLE UPDATE<br>WWE Legends enter the Rumble for a face-off against rivals throwing them over the top rope! Also, get ready to welcome the Street Profits on your roster. Be the last person standing in WWE Royal Rumble PPV and get ready to rumble!<br><br>PLAY ROYAL RUMBLE PPV<br>The WWE Royal Rumble match is usually the most anticipated match of the year and always the most exciting to watch. Brace yourselves to enter the 2021 Royal Rumble Branched and Ultra Events and be the last man standing. Also, set your own fate inside the squared circle in Royal Rumble Main Card Matches.<br><br>FACE THE RUMBLE LEGENDS<br>WWE Mayhem brings to you the Rumble Legends who in the past have not just graced the show but also conquered it. Face the Legends of Royal Rumble to win Rumble Legends Shared Keys across events. Use the keys to avail Rumble Legends Lootcases and get The Rock, Shawn Michaels, Stone Cold Steve Austin, Ric Flair, and Bret Hart on your roster.<br><br>INTRODUCING STREET PROFITS <br>Beloved for their celebratory ways, The Sultans of Swag have amassed a legion of followers. With the WWE Universe by their side and a red cup in hand, The Street Profits are destined to be major players in the tag team division for years to come. Participate in the Street Profits Events to win Profitable Keys. Use the keys to get Profitable Lootcases and get Angelo Dawkins and Montez Ford on your roster.<br><br>EVENTS AND ALLIANCE SEASON<br>This update is star-studded and is rife with spectacular Versus Events. Enjoy the top acts across Rumble Legends and Street Profits campaign events to vie for respective currencies. Set your own fate through the Royal Rumble events and accomplish various challenges to conquer special Quests.<br><br>MAYHEM SEASON PASS<br>Continue returning every day to enjoy super-fun and extra-rewarding challenges. Don’t just multiply your quest rewards with the Rumble Legends and Street Profits Mayhem Pass but also collect precious Premium Lootcases and Gold."},{"version_id":"840629373","version_name":"1.41.159","version_date":"2021-02-26 08:15:59.000 +0800","version_description":"WRESTLEMANIA 85 UPDATE<br>WWE Mayhem takes you back into time for the opportunity to participate in the original WrestleMania and face the greatest WWE Legends ever. Also, complete your 5 Star Keys collection from the Alliance Campaign and set your own fate in the Elimination Chamber main card matches.<br><br>FACE THE WRESTLEMANIA 85 LEGENDS<br>Become a part of the glorious past and play WrestleMania 85 Events featuring larger-than-life stars, big moments, and crazy storylines to collect precious MSG Passes. Face the greatest WWE Legends from WrestleMania 85 and enjoy its legendary payoffs. Get the likes of Roddy Piper, Andre The Giant, Mr. T, Junkyard Dog, Iron Sheik, and Ricky Steamboat on your roster.<br><br>THE ALLIANCE OPPORTUNITY<br>Continue to participate in the Alliance Events with Stunning Stunners and People of Prey Alliance Seasons remaining. Enter the events with the featured superstars on your roster and come together to complete your collection of 5 Star Keys and other exclusive rewards.<br><br>NEW SUPERSTARS<br>5 Star versions of Roddy Piper and Iron Sheik will join the Mayhem. 5 Star versions of Mr. T and Junkyard Dog will be available on Early Access.<br><br>PLAY ELIMINATION CHAMBER PPV<br>Every time the cage has dropped, the vicious steel structure has always guaranteed hard-hitting action. Be well prepared when you take your superstars into Satan's Prison to participate in EC Events or set your own fate in Main Card Matches.<br><br>MAYHEM SEASON PASS<br>Continue returning every day to enjoy super-fun and extra-rewarding challenges. Don’t just multiply your quest rewards with the WrestleMania 85 Season 1 and Season 2 Mayhem Pass but also collect precious Premium Lootcases and Gold.<br><br>EVENTS AND OFFERS<br>This update is star-studded with spectacular Versus Events and rife with superb deals. Enjoy the top acts across campaign events to vie for respective superstar offers. Participate in special Chinese New Year and Valentine's Day Events and accomplish various challenges to conquer special Quests."},{"version_id":"840809088","version_name":"1.42.132","version_date":"2021-03-12 07:53:45.000 +0800","version_description":"FASTLANE UPDATE<br>The countdown to WWE WrestleMania has begun and the road to the Grandest Stage of Them All goes through Fastlane! Play events, claim new superstars, and enjoy the thrills of the ultimate WWE arcade action game.<br><br>HELL YEAH!<br>Celebrate March 16 officially as Austin 3:16 Day. Participate in events based on historical Steve Austin matches and his career highlights. Get Steve Austin on your roster and top his Quest Leaderboard for awesome rewards. So grab a Steveweiser, ready your two-finger salute, and enjoy your favorite “Stone Cold” Steve Austin moments.<br><br>PLAY FASTLANE EVENTS<br>The Road to WrestleMania goes through Fastlane and it exists to lay the groundwork for The Grandest Stage of Them All. So, be well prepared when you take your superstars for the ride of their lives to participate in Fastlane Events or set your own fate in Main Card Matches. Win Fastlane Keys and get awesome WWE Superstars from the Fastlane Lootcase.<br><br>NEW SUPERSTARS<br>Get the ultimate opportunity to claim the new version of Stone Cold Steve Austin, soon to join the Mayhem.<br><br>MAYHEM SEASON PASS<br>Continue returning every day to enjoy super-fun and extra-rewarding challenges. Don’t just multiply your quest rewards with the Fastlane Mayhem Pass but also collect precious Premium Lootcases, Gold, and Fastlane Keys.<br><br>EVENTS AND OFFERS<br>This update is star-studded with spectacular Versus Events and rife with superb deals. Enjoy the top acts across the campaigns to vie for respective superstar offers. Participate in special events and accomplish various challenges to conquer special Quests &amp; leaderboards. Do not forget to join hands and forge alliances to conquer respective Alliance seasons.<br><br>So download the update now for ultimate entertainment. And that's the bottom line cuz Stone Cold said so!"},{"version_id":"840914643","version_name":"1.43.128","version_date":"2021-03-25 09:46:45.000 +0800","version_description":"WRESTLEMANIA 37 UPDATE<br>The countdown to the official 2021 WWE WrestleMania has begun! Participate in blockbuster events and look out for exclusive currencies. This amazing new update has awesome new superstars and crazy rewards for you to collect. <br>ROAD TO WRESTLEMANIA<br>WWE Mayhem will shape up the journey towards the biggest show of the year with Road to WrestleMania. Relive the PPVs on the quest to conquer your journey on the Road to WrestleMania. Participate in a set of challenges every week. Win events across Edge’s Rumble Challenge, Drew McIntyre’s Elimination Chamber Challenge, and Roman Reigns’ WrestleMania Challenge. Collect Maniagold and enter the ultimate Wrestlemania Main Events to earn huge and exclusive rewards. <br>WRESTLEMANIA 37<br>While passionate Mayhemers are hungry for their annual entertainment gala, WrestleMania 37 will set the grandest stage for the most satisfying and rewarding moments. Play Events, win matches, and conquer quests to win WrestleMania 37 Lootcase Keys. Participate in the Free Event and win WM37 2-3 Star Lootcase. Enter the WrestleMania 37 Special and Ultra Events using Maniagold and get the opportunity to claim WrestleMania 37 Featured Superstars on your roster.<br>NEW SUPERSTARS<br>Get the ultimate opportunity to claim new 5 Star versions of WWE WrestleMania 37 Featured Superstars soon to join the Mayhem.<br>MAYHEM SEASON PASS<br>Continue returning every day to enjoy super-fun and extra-rewarding challenges. Don’t just multiply your quest rewards with the WrestleMania 37 Mayhem Pass but also collect precious Premium Lootcases, Gold, and Maniagold.<br>EVENTS AND OFFERS<br>This update is star-studded with spectacular Versus Events and rife with superb deals. Enjoy the top acts leading to WrestleMania 37 campaign events to vie for respective superstar offers. Participate in special events and accomplish various challenges to conquer special Quests. Do not forget to join hands and forge alliances to conquer respective Alliance seasons."},{"version_id":"841307607","version_name":"1.44.129","version_date":"2021-04-13 13:22:29.000 +0800","version_description":"MONEY IN THE BANK UPDATE<br>The yearly MITB extravaganza is back where you can win MITB Men's &amp; Women's Lootcases. Also, as The Hurt Business joins the Mayhem, there's no telling how much more they will accomplish if business keeps booming. While the game’s been evolving ever since an entire new Elite System is here to take it to the next level.<br>MONEY IN THE BANK<br>Your favorite MITB Lootcase is back. The winners of the chaotic encounters will earn guaranteed Lootcases that get better with age. The longer you retain them, the higher the Superstar version you obtain. Take your challengers to face the champions or rivals in 1v1 Main Card matches.<br>THE HURT BUSINESS<br>Even though The Hurt Business is portrayed as a heel faction, it's easy to root for them. They're dressed sharply, excellent at what they do, and in a lot of ways, extremely cool! Collect the Hurt Tokens from the events across the Hurt Business Campaign Events and use them to get the new Bobby Lashley and MVP on your roster.<br>ELITE EVENTS &amp; LOOTCASES<br>A new layer of Elite Events, classified into RAW, SDL, Icons, NXT, Hall Of Fame, Hero, Authority, and Evolution categories can now be unlocked at Level 12. Elite Events will give out respective Brand Elite Keys. Exchange your Elite Keys for Elite Lootcases which will contain Elite Superstars. Elite Superstars will not be available anywhere else, except their respective Brand Elite Lootcases. All the remaining Superstars will fall in Base Pool and will continue to exist across all the Lootcases where they belong. Find more in the game!<br>NEW SUPERSTARS<br>The ultimate opportunity to claim new 5 Star Superstars is here. Claim Bobby Lashley and MVP from their 3-5 Star Lootcases and brace yourselves for the Early Access surprise.<br>MAYHEM SEASON PASS<br>Continue returning every day to enjoy super-fun and extra-rewarding challenges. Don’t just multiply your quest rewards with the Hurt Business and MITB Mayhem Pass but also collect precious Premium Lootcases and loads of Gold."}]