[{"version_id":"825522696","version_name":"2.0","version_date":"2018-01-11 14:39:18.000 +0800","version_description":""},{"version_id":"825685893","version_name":"2.1.2","version_date":"","version_description":""},{"version_id":"825825073","version_name":"2.2","version_date":"2018-02-01 01:37:18.000 +0800","version_description":"- Send e-angpow to loved ones in a virtual red envelope and personalized greetings<br>- Transfer money to friends not in your contact list by scanning their QR code<br>- Enhanced signup flow <br>- Bugs fixing &amp; improvements"},{"version_id":"825881234","version_name":"2.2.1","version_date":"2018-02-05 20:47:42.000 +0800","version_description":"- Send e-angpow to loved ones in a virtual red envelope and personalized greetings<br>- Transfer money to friends not in your contact list by scanning their QR code<br>- Enhanced signup flow<br>- Fixed issue that causes the app to crash when location is disabled<br>- Bugs fixing &amp; improvements"},{"version_id":"825915648","version_name":"2.3","version_date":"2018-02-09 12:08:00.000 +0800","version_description":"- Enhanced signup flow<br>- Bugs fixing &amp; improvements"},{"version_id":"826116555","version_name":"2.4","version_date":"2018-03-01 04:10:19.000 +0800","version_description":"Gong Xi Fa Cai! We have reverted the app design back from our seasonal look, and upgraded with some new icons. Don't worry, you can still send money to friends - just without the virtual red envelope.<br><br>Travelers can now see a summary report for your spending abroad to keep track of how much you really spent during your getaway.<br><br>As always, we've been fixing bugs and upgrading the app design for a better experience for BigPay users!"},{"version_id":"826313186","version_name":"2.5","version_date":"2018-03-26 15:58:34.000 +0800","version_description":"Introducing BigPay 2.5<br><br>Finally! Everyone can enjoy having friends with benefits. BigPay users can now share their referral code with friends to get a RM5 reward once they activate their card. To spread the love even further, we'll give your friend a RM5 reward as well.<br><br>Our creative juices have been flowing quite a bit, so you will also notice some design enhancements to the app. Not a new feature, but who doesn't love nice design?"},{"version_id":"826525400","version_name":"2.6","version_date":"2018-04-04 06:43:29.000 +0800","version_description":"Introducing BigPay 2.6<br><br>Knock knock. Who's there? An improved home screen interface and some updates that will make your life a little easier.<br><br>What's better than us delivering your card in 3-5 days? You can now track your card from the moment we print it to the moment it arrives in your mailbox. Just add RM50 to your account, sit back and relax!<br><br>Who needs data and excel spreadsheets when you can view your historical spending offline or in a user-friendly graph. Just another way you can track how much you've been spending without the month-end surprises."},{"version_id":"826658408","version_name":"2.6.1","version_date":"2018-04-16 10:06:19.000 +0800","version_description":"Introducing BigPay 2.6.1<br><br>Knock knock. Who's there? An improved home screen interface and some updates that will make your life a little easier.<br><br>What's better than us delivering your card in 3-5 days? You can now track your card from the moment we print it to the moment it arrives in your mailbox. Just add RM20 to your account, sit back and relax!<br><br>Who needs data and excel spreadsheets when you can view your historical spending offline or in a user-friendly graph. Just another way you can track how much you've been spending without the month-end surprises."},{"version_id":"826772831","version_name":"2.7","version_date":"2018-04-24 11:28:07.000 +0800","version_description":"We received your emails, DMs, and carrier pigeons and guess what? We listened! You now only need to top up RM20 to your account when you sign up for BigPay. <br><br>You know who else we listened to? All of you who want to be able to export your monthly BigPay spending to Excel. Just another reason why BigPay is better than your bank and maybe even your spouse...because we listen."},{"version_id":"826954505","version_name":"2.7.1","version_date":"2018-05-09 05:36:13.000 +0800","version_description":"We received your emails, DMs, and carrier pigeons and guess what? We listened! You now only need to top up RM20 to your account when you sign up for BigPay.<br><br>You know who else we listened to? All of you who want to be able to export your monthly BigPay spending to Excel. Just another reason why BigPay is better than your bank and maybe even your spouse...because we listen."},{"version_id":"827142042","version_name":"2.8","version_date":"2018-05-17 12:24:10.000 +0800","version_description":"It's a new day, a new dawn and a new update for Malaysia. Introducing BigPay 2.8!<br><br>The future is transparent. We've given a face lift to your transaction details and you can now classify your transactions as Business or Personal.<br><br>The future is simple. Sign up faster and without any purple residue on your fingers.<br><br>The future is together. Invite friends not on BigPay via SMS to send them money for free.<br><br>The future looks pretty sweet if we do say so ourselves."},{"version_id":"827250002","version_name":"2.8.1","version_date":"2018-05-23 12:22:24.000 +0800","version_description":"It's a new day, a new dawn and a new update for Malaysia. Introducing BigPay 2.8!<br><br>The future is transparent. We've given a face lift to your transaction details and you can now classify your transactions as Business or Personal.<br><br>The future is simple. Sign up faster and without any purple residue on your fingers.<br><br>The future is together. Invite friends not on BigPay via SMS to send them money for free.<br><br>The future looks pretty sweet if we do say so ourselves."},{"version_id":"827474082","version_name":"2.9","version_date":"2018-06-11 05:08:19.000 +0800","version_description":"This Hari Raya season brings you BigPay 2.9!<br><br>You’ll notice we’ve been doing some decorating ourselves to get ready for the occasion, allowing you to send duit raya to loved ones right from the app.<br><br>Shopping a lot this month? You can now track your monthly spending right on the homepage to avoid any post-holiday surprises. <br><br>If that’s not enough, we’ve made some updates to ensure signing up for a BigPay account is easier than ever. <br><br>BigPay 2.9 - the gift that just keeps on giving."},{"version_id":"827743534","version_name":"2.10","version_date":"2018-07-03 17:50:32.000 +0800","version_description":"Imagine this… <br><br>You sign up for BigPay, top up via e-banking.<br>You need to submit expenses, search for that restaurant you paid at for a team lunch with a tap.<br>Then you go out for drinks, lose your card, report it and order a replacement right from the app.<br>And you do all this on the best interface BigPay's ever had.<br><br>Well, now you can experience just that. Introducing BigPay 2.10."},{"version_id":"827921866","version_name":"2.11","version_date":"2018-07-25 02:40:42.000 +0800","version_description":"Introducing BigPay 2.11<br><br>We’re committed to bringing fair financial services to everyone and sometimes that requires implementing limitations on some services. That’s why we’re introducing a monthly credit card top up limit of RM10,000. Don’t stress, you can still top up via online banking or debit cards without any restrictions!<br><br>But we know what you’re here for - NEW features! So now you can split the bill at dinner right from BigPay. Buh-bye awkward texts asking your friends to pay you back…and then reminding them…15 times.<br><br>Also, can we count our sleek new design as a new feature? It’s so good we’ll just call it just that."},{"version_id":"828142697","version_name":"2.11.2","version_date":"2018-08-09 04:10:52.000 +0800","version_description":"Introducing BigPay 2.11.2<br><br>We’re committed to bringing fair financial services to everyone and sometimes that requires implementing limitations on some services. That’s why we’re introducing a monthly credit card top up limit of RM10,000. Don’t stress, you can still top up via online banking or debit cards without any restrictions!<br><br>But we know what you’re here for - NEW features! So now you can split the bill at dinner right from BigPay. Buh-bye awkward texts asking your friends to pay you back…and then reminding them…15 times.<br><br>Also, can we count our sleek new design as a new feature? It’s so good we’ll just call it just that."},{"version_id":"828199638","version_name":"2.12","version_date":"2018-08-13 04:34:21.000 +0800","version_description":"Every day we're hustling... to give you the best experience when it comes to managing your money. Don't accept the status quo - upgrade to BigPay 2.12.<br>- We're now introducing a feature to request money from your contacts.<br>- View only what's important! Hide specific transactions from the home-screen.<br>- Swipe individual transactions to view what actions you can take."},{"version_id":"828501083","version_name":"2.13","version_date":"2018-09-10 05:09:55.000 +0800","version_description":"We’re on a mission to make payments easier and this is just the start! In this version, we’re introducing more &amp; simpler ways of dealing with money &amp; friends.<br>- Use the “Friends Nearby” feature to repay or ask money from people at your table!<br>- Wanna easily split the bill? Click on the transaction and select the friends who owe you.<br>- The send and request money screens are more user-friendly. Tell us what you think.<br>- For new users, we’ve integrated a more comprehensive card tracking view."},{"version_id":"828736692","version_name":"2.14","version_date":"2018-09-28 03:10:52.000 +0800","version_description":"You don’t have to travel too far to find answers, because we’ve updated our Help section to ensure you get all the support you need! Here’s what we’ve done in this update:<br>  - Search our Help section for questions and answers quickly<br>  - Browse all support issues by topic<br>  - We’ve further improved the sign-up process with support features<br>  - Transaction declined? We've improved and defined the reasons for payment failures"},{"version_id":"828809368","version_name":"2.14.1","version_date":"2018-10-04 08:24:40.000 +0800","version_description":"You don’t have to travel too far to find answers, because we’ve updated our Help section to ensure you get all the support you need! Here’s what we’ve done in this update:<br>- Search our Help section for questions and answers quickly<br>- Browse all support issues by topic<br>- We’ve further improved the sign-up process with support features<br>- Transaction declined? We've improved and defined the reasons for payment failures"},{"version_id":"828829472","version_name":"2.14.2","version_date":"2018-10-05 21:25:09.000 +0800","version_description":"You don’t have to travel too far to find answers, because we’ve updated our Help section to ensure you get all the support you need! Here’s what we’ve done in this update:<br>- Search our Help section for questions and answers quickly<br>- Browse all support issues by topic<br>- We’ve further improved the sign-up process with support features<br>- Transaction declined? We've improved and defined the reasons for payment failures"},{"version_id":"828972058","version_name":"2.15","version_date":"2018-10-22 04:24:24.000 +0800","version_description":"Small steps, everyday until we make something big. That’s our philosophy on this journey to change the way our users interact with their money! Here’s what’s new in this update:<br>- Let us know how to better support you. Up or down vote our questions in our FAQ<br>- You can now have the option to view those transactions you hid!<br>- For you travellers - we've improved the way you see FX rate when you land in a new country<br>- If you'd like to make a donation to help victims in Sulawesi, make a donation directly to the AirAsia Foundation in the Settings page<br>- And for new users we’re providing you clearer information on why your documents may not be getting approved!"},{"version_id":"829242764","version_name":"2.16","version_date":"2018-11-13 06:42:07.000 +0800","version_description":"Never lower your standards - we want to ensure that you always have the best experience when it comes to your money. In this app update we are introducing a major feature:<br>- Introducing in-app chat support! Chat directly with a support agent and get the help you need<br>- Are you a Red, Gold, Platinum or Black BIG Member? You'll now see the status in your app"},{"version_id":"829516322","version_name":"2.17","version_date":"2018-12-05 04:08:57.000 +0800","version_description":"Sikit, sikit jadi bukit is the theme for this latest version of BigPay. We've made some minor incremental changes and improvements to ensure you look forward to using your BigPay app:<br>- New font and icons<br>- A new way to access Settings in your app<br>- Improvements to our in-app live chat"},{"version_id":"829899277","version_name":"2.18","version_date":"2019-01-14 04:22:06.000 +0800","version_description":"New year, new look! Update your app to experience design improvements on the homepage and card screen.<br>- We're bringing your friends to the homepage where they belong!<br>- Easier and better access to your card settings<br>- Yay, new colors to enjoy!<br>- An improved sign up flow for our budding new BigPay users."},{"version_id":"830070252","version_name":"2.19","version_date":"2019-01-25 05:25:35.000 +0800","version_description":"Update your app to unlock an exclusive Chinese New Year feature we've designed to make sending and receiving ang pows - really, REALLY fun. Spoiler alert: finger cardio!"},{"version_id":"830287849","version_name":"2.19.3","version_date":"2019-02-18 16:56:59.000 +0800","version_description":"Mainly behind the scenes improvements in this update (specifically related to top ups) and we’ve squashed some bugs to make sure your BigPay experience is the best it can be. Keep the feedback coming and watch out for more changes coming up in 2019!"},{"version_id":"830403969","version_name":"2.19.5","version_date":"2019-02-26 11:09:29.000 +0800","version_description":"Mainly behind the scenes improvements in this update (specifically related to top ups) and we’ve squashed some bugs to make sure your BigPay experience is the best it can be. Keep the feedback coming and watch out for more changes coming up in 2019!"},{"version_id":"830956572","version_name":"2.20","version_date":"2019-04-22 04:33:37.000 +0800","version_description":"The BigPay analytics page just got a SERIOUS makeover: now equipped with 3 different sections to give you complete visibility and insights on your spending - empowering you to be financially aware! Here’s what you get with the latest update:<br>- An interactive, live graph that tracks your daily spending on a monthly basis<br>- A pie chart that gives you a clear overview of your monthly spending, sorted by category<br>- A chart that displays your yearly spend to-date"},{"version_id":"831329839","version_name":"2.21","version_date":"2019-05-21 04:02:29.000 +0800","version_description":"Let's get digital this Aidilfitri! Send some cheer to your loved ones with our Duit Raya feature no matter where they are. Update your app to unlock this feature now.<br><br>RA-RA-Raya bersama BigPay!"},{"version_id":"831466779","version_name":"2.21.1","version_date":"2019-05-29 04:53:33.000 +0800","version_description":"Let's get digital this Aidilfitri! Send some cheer to your loved ones with our Duit Raya feature no matter where they are. Update your app to unlock this feature now.<br><br>RA-RA-Raya bersama BigPay!"},{"version_id":"831985649","version_name":"2.22","version_date":"2019-07-23 04:18:39.000 +0800","version_description":"Starting today, it's going to get a hell of a lot more exciting when you send and request money!<br> <br>We've redesigned the experience for the better and you'll be glad to have bid sayonara to the old one. Think better design, animation and a cool little \"ka-ching\" sound!"},{"version_id":"832178140","version_name":"2.23","version_date":"2019-07-31 04:38:32.000 +0800","version_description":"Need your card details but don't have your wallet with you? No problem. You can now see your card details by tapping on the eye icon in the top left of your 'Card' tab."},{"version_id":"832240425","version_name":"2.23.1","version_date":"2019-08-05 09:00:53.000 +0800","version_description":"Need your card details but don't have your wallet with you? No problem. You can now see your card details by tapping on the eye icon in the top left of your 'Card' tab."},{"version_id":"832435216","version_name":"2.24","version_date":"2019-08-21 04:50:33.000 +0800","version_description":"We're back for another update! This time we added a convenient access to our Blog in your Settings tab. You'll find helpful articles on saving, budgeting, traveling and more.<br>Also, we squashed more bugs and added some final touches to the app in preparation for our next BIG release!"},{"version_id":"832607450","version_name":"2.24.1","version_date":"2019-09-04 03:51:39.000 +0800","version_description":"We're back for another update! This time we added a convenient access to our Blog in your Settings tab. You'll find helpful articles on saving, budgeting, traveling and more.<br>Also, we squashed more bugs and added some final touches to the app in preparation for our next BIG release!"},{"version_id":"832846476","version_name":"2.25","version_date":"2019-09-23 03:15:24.000 +0800","version_description":"Two BIG updates this time, you ready? <br><br>We're bringing you closer to people across ASEAN with the launch of BigPay International Bank Transfer! You can now send money to 4 countries (we'll be adding more soon) and benefit from highly competitive rates.<br><br>With that, we're also excited to release our Local Bank Transfer feature! We know many have been waiting for this.<br><br>Hit the update button now and check them out."},{"version_id":"833419782","version_name":"2.26","version_date":"2019-11-06 07:59:40.000 +0800","version_description":"You can now create your very own BigPay financial statement directly from the app! It's an upgrade from the spreadsheet you previously get. We've also redesigned the way you split bills in this update. Other than some design changes, we've added an option for you to split a bill by percentage as well."},{"version_id":"833902816","version_name":"2.27","version_date":"2019-12-11 06:25:25.000 +0800","version_description":"Time for a little Christmas magic! You can now...wait no, we’ve been told to keep our mouths shut. Just update to hear the next best thing since Mariah Carey's 'All I Want for Christmas Is You'. In other news…<br>- We now show you an expected time for your international transfer to arrive into your recipient’s bank account. Leave the guesswork to us! <br>- Some of you found the pull and release arrow confusing so we decided to sleigh (pun intended) it into early retirement."},{"version_id":"834361640","version_name":"2.28","version_date":"2020-01-17 01:00:27.000 +0800","version_description":"Guess huat we’re bringing back? e-Ang Paos!<br>Guess huat's coming soon? 3 new countries you can send money to!"},{"version_id":"834718773","version_name":"2.29","version_date":"2020-02-17 04:12:08.000 +0800","version_description":"All you filter enthusiasts out there will be delighted to know we’ve introduced spending filters to your Home screen. You can now filter your spending by Date, Category, Amount, Country and Type. The power is in your hands.<br>We’ve also improved the layout of your Home screen to make way for the filters and to show you more of your transactions."},{"version_id":"834871437","version_name":"2.30","version_date":"2020-03-27 06:23:46.000 +0800","version_description":"[<br>#StaySafeStayHOME. Featuring your all-time favorite \"Bug fixes\" and \"Performance enhancements\", we’re geared up to make sure that you have a smooth payment experience during the MCO period.<br>]"},{"version_id":"835534182","version_name":"2.31","version_date":"2020-04-16 02:59:40.000 +0800","version_description":"Chats are now live 24/7 to make sure you have all the support you need during the MCO. And speaking of support, we've launched BigPay Donations. You can now donate money to help vulnerable communities that were hit hard by the MCO. Every ringgit counts. #StayHomeStaySafe"},{"version_id":"835761536","version_name":"2.32","version_date":"2020-06-18 03:39:28.000 +0800","version_description":"We're excited to bring 2 new product updates: a bigger wallet size, and bank transfers to Australia. Expect a couple of emails when these become available to you. We're also continuing our work to become your one-stop-shop for all your financial needs and are upgrading things under the hood, mainly in the account security and top-up departments."},{"version_id":"836962420","version_name":"2.33","version_date":"2020-07-24 10:14:31.000 +0800","version_description":"Two exciting updates in this release! First, you can now transfer money from BigPay to your friends and family in China. Second, we’ll be introducing auto top-ups soon - so you never have to worry about your account balance anymore. Got a question or feedback? Chat with our team directly in your app!"},{"version_id":"837833165","version_name":"2.34.1","version_date":"2020-09-21 02:13:10.000 +0800","version_description":"To our friends in Singapore: we have some big news coming. To our users in Malaysia: you can split bills on BigPay, but what if you could... pay your bills? Expect to hear from our team soon. Got a question or feedback? Chat with our team directly in your app!"},{"version_id":"838188535","version_name":"2.34.2","version_date":"2020-10-15 02:56:36.000 +0800","version_description":"With this update, we’d like to say hello to our new friends in Singapore and remind all our users to never share their OTP with anyone. While we work hard to keep your money safe, we can only win that battle together with you.<br><br>Got a question or feedback? Chat with our team directly in your app!"},{"version_id":"838381727","version_name":"2.34.3","version_date":"2020-10-28 10:47:53.000 +0800","version_description":"With this update, we’d like to say hello to our new friends in Singapore and remind all our users to never share their OTP with anyone. While we work hard to keep your money safe, we can only win that battle together with you.<br><br>Got a question or feedback? Chat with our team directly in your app!"},{"version_id":"838938155","version_name":"2.34.4","version_date":"2020-11-19 06:13:26.000 +0800","version_description":"For our Malaysian customers, bill payments are finally here! You can now pay your favorite bills from the comfort of your BigPay app. Do note that this feature will be released progressively - firstly to a team of selected testers, secondly to a whitelisted base of customers and finally to all customers.<br><br>For Singaporean users, we’re working as fast as we can to roll out this feature to you as well"},{"version_id":"839433134","version_name":"2.34.5","version_date":"2020-12-02 03:36:19.000 +0800","version_description":"Good news -  your BigPay app now allows real time transfers from Malaysia to Singapore. <br><br>That means the money you send will be credited to the recipient account in as quick as 10 minutes!<br><br>As always, we’re working to roll out this feature across other countries that BigPay customers are sending to as well, so stay tuned!"},{"version_id":"839786241","version_name":"2.35","version_date":"2020-12-28 11:04:47.000 +0800","version_description":"We're giving you easy, one-tap access to all our awesome deals with merchants and partners. Just visit Deals on your BigPay app's Settings tab.<br>To our friends in Singapore, it'll soon be even easier to sign up for BigPay with just your SingPass.<br>We're always bringing a better BigPay to you, so keep an eye out for more updates."},{"version_id":"840211646","version_name":"2.36.1","version_date":"2021-01-27 08:42:40.000 +0800","version_description":"Hello nieces and nephews. It’s Uncle BigPay. This Chinese New Year, many of you think they will receive less Ang Pao because they cannot see their family. Haiyaa. So sad. But it’s not true! Uncle BigPay is bringing back the beloved e-Ang Pao, so you can still send and request sweet, sweet digital prosperity from your uncles and aunties. Uncle BigPay is also giving you a new way of transferring money to China. If you can’t bring your family MSG, you can still send them RMB! And don’t forget: when you’re doing your Chinese New Year shopping on international websites, your BigPay card is your best friend. Fuiyoh!<br><br>PS: Uncle Roger, if you see this… we love you &amp; get BigPay!"},{"version_id":"841003709","version_name":"2.37.0","version_date":"2021-03-23 07:12:34.000 +0800","version_description":"Have you ever tried sending money with an attitude? At BigPay, we think that text alone doesn’t carry enough sass - which is why you can now add GIFs when you P2P your friends. In other news... Topping up your BigPay account with cash is a thing: just go to your nearest 7-Eleven. We might also give some of you early access to a new feature that starts with “insu” and ends with “rance” - but we can’t say more. Oh, we are also updating our privacy policy and we have a new logo."},{"version_id":"841119042","version_name":"2.37.3","version_date":"2021-03-30 15:45:50.000 +0800","version_description":"Have you ever tried sending money with an attitude? At BigPay, we think that text alone doesn’t carry enough sass - which is why you can now add GIFs when you P2P your friends. In other news... Topping up your BigPay account with cash is a thing: just go to your nearest 7-Eleven. We might also give some of you early access to a new feature that starts with “insu” and ends with “rance” - but we can’t say more. Oh, we are also updating our privacy policy and we have a new logo."},{"version_id":"842102033","version_name":"2.39.0","version_date":"2021-05-10 08:58:27.000 +0800","version_description":"With this update, we’re handing all our users a free test of… patience. While there isn’t a lot visible to the naked eye, there's lots going on behind the scenes and great things come to those who wait. Stay safe and protect yourself - with our brand new Lifestyle Insurance, maybe?"},{"version_id":"842368051","version_name":"2.40.0","version_date":"2021-05-27 17:36:26.000 +0800","version_description":"Are you eBelia ready? Remember: if you’re a Malaysian citizen between 18 and 20 or a full-time student at Diploma level, SKM4 or above, at a registered local Higher Educational Institution… then get ready to claim your RM150 eBelia credit on June 1! Only our striking blue card gives you that much freedom to spend."},{"version_id":"842408138","version_name":"2.40.1","version_date":"2021-05-30 18:27:17.000 +0800","version_description":"Are you eBelia ready? Remember: if you’re a Malaysian citizen between 18 and 20 or a full-time student at Diploma level, SKM4 or above, at a registered local Higher Educational Institution… then get ready to claim your RM150 eBelia credit on June 1! Only our striking blue card gives you that much freedom to spend."},{"version_id":"842473791","version_name":"2.40.3","version_date":"2021-06-02 04:06:58.000 +0800","version_description":"Are you eBelia ready? Remember: if you’re a Malaysian citizen between 18 and 20 or a full-time student at Diploma level, SKM4 or above, at a registered local Higher Educational Institution… then get ready to claim your RM150 eBelia credit on June 1! Only our striking blue card gives you that much freedom to spend."},{"version_id":"842552743","version_name":"2.40.4","version_date":"2021-06-10 14:54:33.000 +0800","version_description":"Are you eBelia ready? Remember: if you’re a Malaysian citizen between 18 and 20 or a full-time student at Diploma level, SKM4 or above, at a registered local Higher Educational Institution… then get ready to claim your RM150 eBelia credit on June 1! Only our striking blue card gives you that much freedom to spend."},{"version_id":"842620972","version_name":"2.40.5","version_date":"2021-06-15 08:06:31.000 +0800","version_description":"Are you eBelia ready? Remember: if you’re a Malaysian citizen between 18 and 20 or a full-time student at Diploma level, SKM4 or above, at a registered local Higher Educational Institution… then get ready to claim your RM150 eBelia credit on June 1! Only our striking blue card gives you that much freedom to spend."},{"version_id":"843320966","version_name":"2.41.0","version_date":"2021-08-02 10:26:19.000 +0800","version_description":"In this update, we’re mainly squashing bugs and laying the foundations for exciting new features we’ve been working on. And remember: if you need someone to talk to, about BigPay or something else, there’s always our in-app chat. Stay safe."},{"version_id":"844167695","version_name":"2.42.0","version_date":"2021-09-20 08:45:23.000 +0800","version_description":"In this app release, nothing major that meets the eye… Just the usual bug squashing as we lay the groundwork for all the big things that are coming to our users. Oh, and a friendly reminder: we would never ask for your OTP, ever!"}]