[{"version_id":"822990828","version_name":"1.3.0","version_date":"2017-07-24 17:11:55.000 +0800","version_description":"Simplified login process - now the login process is changed and the default flow is to send a magic code to the user instead of login with password. This makes the login process much more easier especially for SSO users.<br>Message for the retailers without offers for mobile is now informing the users to visit the web site for the full range of offers.<br>New design on login screen which are much cleaner and friendlier for better user experience.<br>Bug fixes and stability improvements."},{"version_id":"823188423","version_name":"1.3.1","version_date":"2017-08-08 06:43:59.000 +0800","version_description":"- We’ve improved the display of instant vouchers by opening an external browser when you view them.<br>- Bug fixes and improvement."},{"version_id":"823308768","version_name":"1.3.2","version_date":"2017-08-15 22:40:02.000 +0800","version_description":"We have improved the payment process to make it more convenient and easier to navigate.<br>We have fixed a major bug where USA and Australia users were not able to complete a transaction with a new payment card."},{"version_id":"823321463","version_name":"1.3.3","version_date":"2017-08-16 17:55:04.000 +0800","version_description":"Fixed issue with the branding of the application after the last update."},{"version_id":"823356878","version_name":"1.3.4","version_date":"2017-08-19 16:20:01.000 +0800","version_description":"We have improved the login process. You can now login to the application using email addresses with special characters (for example: ', \", _, -)."},{"version_id":"823777661","version_name":"1.4.2","version_date":"2017-09-27 08:02:49.000 +0800","version_description":"We continue to add new offers and retailers to the app!<br><br>For this release we have three more offers! <br><br>You can now access and use<br><br><br>Our Discounts by Phone offer. <br>Our Discount codes offer.<br>Offers with exclusive discounts for retailer sites<br><br>This release has more than great new offers. <br><br>You can now unlock your app with your fingerprint!<br><br>We know you were tired of always entering your PIN when accessing your discounts.<br>So we have simplified the process of unlocking the application by allowing fingerprint/Touch ID unlock option."},{"version_id":"823846235","version_name":"1.4.3","version_date":"2017-10-02 07:44:57.000 +0800","version_description":"We have fixed the issue with instant vouchers not appearing on some devices."},{"version_id":"824012805","version_name":"1.5.2","version_date":"2017-10-18 08:22:56.000 +0800","version_description":"Phones at the ready, we’ve added another offer type to the app – SMS Vouchers! Now, any retailer who has a SMS Voucher offer will be searchable in the app. You order at a discounted price and the SMS Voucher will be sent to your mobile instantly!"},{"version_id":"824064757","version_name":"1.6.3","version_date":"2017-11-20 12:07:31.000 +0800","version_description":"Reloadable Cards are here!<br><br>Yes! For UK users, Reloadable Cards are now available through the SmartSpending™ app so you can:<br><br>- Browse all retailers who offer a Reloadable Card discount.<br>- Order your Reloadable Card for a discounted amount.<br>- Activate your Reloadable Card on the app – we’re still working on this for the EasySaver™ Card.<br><br>It’s not all about the UK and Reloadable Cards though, SmartSpenders, we’ve also added something for everyone:<br>- Search and purchase offers available from multiple retailers.<br>- View already opened Instant Vouchers when you’re offline. Ideal when in a shop and the signal decides to hide.<br>- Find any unique or local offers given by your employer in the app.<br>- Log directly into your employer provided benefits site to keep up with the latest company news and other benefits that your employer offers to you.<br>- Added new security measures to allow offline Instant Vouchers and continually keep your data rock solid.<br><br>Enjoy the update and keep on SmartSpending™!"},{"version_id":"825072534","version_name":"1.6.5","version_date":"2017-11-30 15:51:04.000 +0800","version_description":"Minor bug fix."},{"version_id":"825240238","version_name":"1.7.1","version_date":"2017-12-13 10:02:14.000 +0800","version_description":"Phew! Our last update was a big one, and it doesn’t mean this one is any less loveable. In this update, we’ve added:<br><br>    Improvements to the Cashback experience – you can now purchase a discounted Reloadable Card with your Cashback balance and have it posted to your chosen address.<br>    Ability to copy your Reloadable Card number from the app and paste it into the retailer’s site to check your balance.<br>    A funky ‘About’ page for the app which is now accessible from the main menu.<br>    Support for important notifications on certain screens.<br><br>Update your app today to get all of these new features!"},{"version_id":"825545657","version_name":"1.8.1","version_date":"2018-01-10 13:49:24.000 +0800","version_description":"Happy New Year, SmartSpenders! We’re starting January with multiple updates which will make your SmartSpending™ app that little bit better…<br>• Offers with multiple discounts, such as ‘Save 18% + Earn 3%’ will now be available. This means you can make a purchase with the discount code and earn Cashback at the same time.<br>• When a retailer’s offer can be used in more than one store, we’ve listed them out for you so you know exactly where you can use it.<br>• Access all available card offers by clicking ‘Reloadable Cards’ from the menu.<br>• Improved identity check message for UK SmartSpenders with the EasySaver™ offer.<br>• Minor upgrades to data security."},{"version_id":"825646550","version_name":"1.9.1","version_date":"2018-01-16 09:01:12.000 +0800","version_description":"Minor fixes and improvements."},{"version_id":"825825134","version_name":"1.10.2","version_date":"2018-01-31 09:43:00.000 +0800","version_description":"Who’s your favourite retailer from your employee discounts offering? Well, this update will:<br>     - Let you save a retailer as a favourite.<br>     - Quickly access all favourited retailers from one place. <br>     - Receive a notification as soon as one of your favourites goes on promotion!<br>     - On top of that, we’ve made a small improvement in the categories section by displaying the number of retailers per category. And a few extra minor fixes and improvements."},{"version_id":"826107788","version_name":"1.11.5","version_date":"2018-02-28 09:53:03.000 +0800","version_description":"Depending on where you are in the world, you might have a different way of referring to the discounted vouchers available on the SmartSpending™ app. When you install this update:<br>     - They’ll be called 'Instant eGift Cards' for users in Australia,<br>     - 'Instant Cards' for users in the US.<br>     - And ‘Instant Vouchers’ for users across all other locales (UK, Ireland, and New Zealand).<br>It’s a global world, we get that, and we’ve also added region specific spellings, such as Favourites / Favorites.<br>Oh, and it wouldn’t be an update if we didn’t also include some further additions to improve data security."},{"version_id":"827090242","version_name":"1.14.3","version_date":"2018-05-22 08:10:48.000 +0800","version_description":"Hello, SmartSpenders, welcome back to another edition of our release notes. This time:<br>– We’ve added the functionality to opt in and out of receiving push notifications from within the app.<br>– Depending on where you live, we’ve added a ‘My Instant Vouchers’ / ‘My Instant eGift Cards’ / ‘My Instant Cards’ button which will appear after successfully making a discount purchase of that type.<br>– We’ve made improvements to the login process.<br>– We’ve added ‘Featured Retailer’ for some of the categories<br>– And a few minor fixes and screw turns here and there."},{"version_id":"827478056","version_name":"1.14.5","version_date":"2018-06-10 14:26:14.000 +0800","version_description":"Fixes and minor improvements"},{"version_id":"827738786","version_name":"1.14.7","version_date":"2018-07-03 11:21:17.000 +0800","version_description":"We have improved the login process to make it more convenient for members who are assigned to programmes without discounts.<br>Minor fixes and improvements as well."},{"version_id":"827974954","version_name":"1.14.8","version_date":"2018-07-24 13:06:16.000 +0800","version_description":"Hello SmartSpenders! Minor improvements again to bring you the best experience."},{"version_id":"828177857","version_name":"1.14.10","version_date":"2018-08-13 09:57:55.000 +0800","version_description":"Hello SmartSpenders, good news!<br><br>You might have noticed that we have been focused on improvements in the past month. We are sorry for the frequent updates, but our goal is to delight you.<br><br>This time we are releasing a fix for those of you who were not able to view the Admin fee on the checkout before completing a transaction.<br><br>Now, enjoy the checkout experience!  We wish you many savings."},{"version_id":"828288257","version_name":"1.15.3","version_date":"2018-08-22 08:25:21.000 +0800","version_description":"Improvements to the overall experience and offers."},{"version_id":"828320079","version_name":"1.15.4","version_date":"2018-08-23 08:00:52.000 +0800","version_description":"For more convenience, we have increased the app lock timeout to 15 minutes, so now you can switch between apps without having to unlock SmartSpending so often."},{"version_id":"828334787","version_name":"1.15.5","version_date":"2018-08-24 07:57:03.000 +0800","version_description":"Minor fixes and small improvements."},{"version_id":"828418421","version_name":"1.15.6","version_date":"2018-09-03 08:04:55.000 +0800","version_description":"Minor fixes and small improvements."},{"version_id":"828849958","version_name":"1.16.1","version_date":"2018-10-10 12:48:34.000 +0800","version_description":"Minor fixes and small improvements. Keep on saving!"},{"version_id":"828936356","version_name":"1.16.2","version_date":"2018-10-17 06:27:27.000 +0800","version_description":"Minor bug fixes."},{"version_id":"829103857","version_name":"1.16.5","version_date":"2018-10-31 09:27:57.000 +0800","version_description":"Small improvements in the overall experience."},{"version_id":"829186009","version_name":"1.17.0","version_date":"2018-11-07 10:31:23.000 +0800","version_description":"Hello SmartSpenders. Here’s your latest new addition!<br><br>For the vouchers you can use partially, you’ll now be able to check the remaining balance through the app. For retailers who don’t provide this option, you’ll be able to track the balance yourself.<br><br>And as always, there are a few small improvements here and there."},{"version_id":"829507303","version_name":"1.18.1","version_date":"2018-12-05 09:57:58.000 +0800","version_description":"Technical improvements for better SmartSpending experience."},{"version_id":"829831959","version_name":"1.18.3","version_date":"2019-01-09 09:46:40.000 +0800","version_description":"Happy New Year, SmartSpenders! We’re starting January with a small update.<br><br>For vouchers which show the remaining balance on the voucher template itself, we’ve added a quick option to check that balance through the app.<br>Minor fixes as well.<br><br>We wish you many savings!"},{"version_id":"830131411","version_name":"1.18.4","version_date":"2019-01-31 10:10:53.000 +0800","version_description":"Minor improvements of the overall experience."},{"version_id":"830333224","version_name":"1.18.6","version_date":"2019-02-20 11:56:51.000 +0800","version_description":"Here is our latest addition! Now you may expect that we occasionally ask for your feedback while you are using the app. We truly appreciate hearing back from you, and this is how we improve."},{"version_id":"830531755","version_name":"1.19.2","version_date":"2019-03-11 12:34:10.000 +0800","version_description":"This time we have improved the basket experience for our UK members. When adding a reloadable card in the basket, now you’ll see only one basket item with all the details summarised for you.<br>We’ve also made minor tweaks here and there for all our members across all locales."},{"version_id":"830872622","version_name":"1.20.1","version_date":"2019-04-09 08:15:53.000 +0800","version_description":"Small improvements in the overall experience. Keep on saving!"},{"version_id":"831016600","version_name":"1.20.2","version_date":"2019-04-18 21:04:55.000 +0800","version_description":"General improvements in the overall experience."},{"version_id":"833035625","version_name":"1.20.4","version_date":"2019-10-05 06:29:42.000 +0800","version_description":"Improvements to the Help &amp; Support chat."},{"version_id":"833096555","version_name":"1.20.5","version_date":"2019-10-09 20:43:02.000 +0800","version_description":"General improvements to the Help &amp; Support chat."},{"version_id":"834284154","version_name":"1.22.3","version_date":"2020-01-09 14:30:31.000 +0800","version_description":"Improve checkout flow and fix bug related to screen locking."},{"version_id":"834348783","version_name":"1.22.5","version_date":"2020-05-27 14:51:00.000 +0800","version_description":"Fix security message overlay and missing reloadable card offers."},{"version_id":"836766149","version_name":"1.22.6","version_date":"2020-08-17 09:18:15.000 +0800","version_description":"Update security settings."},{"version_id":"837410416","version_name":"2.0.0","version_date":"2020-09-21 09:32:49.000 +0800","version_description":"- Explore discounts like never before with a brand new homepage<br>- Instantly find retailers and see your savings with the new Search functionality<br>- Bye bye bugs, hello enhancements"},{"version_id":"838225156","version_name":"2.0.1","version_date":"2020-10-16 10:19:41.000 +0800","version_description":"Improved homescreen with more offers to explore"},{"version_id":"839225777","version_name":"2.0.2","version_date":"2020-11-23 18:37:03.000 +0800","version_description":"Performance improvements and bug fixes"},{"version_id":"840871242","version_name":"2.0.3","version_date":"2021-03-23 17:49:46.000 +0800","version_description":"- Brand new navigation menu<br>- Redesigned and refreshed category screens<br>- Bug fixes and enhancements"},{"version_id":"841506800","version_name":"2.0.4","version_date":"2021-04-19 08:54:16.000 +0800","version_description":"Bugfixes and optimisations"},{"version_id":"842433507","version_name":"2.0.5","version_date":"2021-06-01 15:06:14.000 +0800","version_description":"Bug fixes and optimisations"}]