[{"version_id":"822473997","version_name":"1.0","version_date":"","version_description":""},{"version_id":"823630025","version_name":"1.0.1","version_date":"2017-09-22 06:40:39.000 +0800","version_description":"- Actualizari harta comercianti si interfata grafica<br>- Bug fixes"},{"version_id":"824229772","version_name":"1.0.2","version_date":"2017-11-03 08:19:34.000 +0800","version_description":"Multumim pentru ca utilizezi aplicatia Orange Money. Te rugam sa actualizezi versiunea astfel incat sa ai acces la ultimele imbunatatiri."},{"version_id":"825032502","version_name":"1.0.3","version_date":"2017-12-18 10:43:15.000 +0800","version_description":"Ce e nou?<br>Iti platesti asigurarea direct din aplicatie. <br>Bucura-te acum de noua versiune!"},{"version_id":"825543712","version_name":"1.0.4","version_date":"2018-01-06 10:55:41.000 +0800","version_description":"Bug fixes."},{"version_id":"828007472","version_name":"1.1.1","version_date":"2018-07-30 08:12:21.000 +0800","version_description":"Multumim pentru ca utilizezi aplicatia Orange Money!<br>Aceasta versiune include imbunatatiri."},{"version_id":"831007637","version_name":"2.2.1","version_date":"2019-04-18 17:24:16.000 +0800","version_description":"Bine ai venit la Orange Money versiunea 2.2.1. Fata de versiunea anterioara, aducem imbunatatiri atat pe design cat si pe fluxurile de plata.<br>Iti place aplicatia noastra? Atunci actualizeaza-ti versiunea. Asteptam feedback-ul tau!"},{"version_id":"832015196","version_name":"2.3.2","version_date":"2019-07-17 07:23:14.000 +0800","version_description":"Am adus imbunatatiri de design pe fluxul de alimenatare si tranferuri. Descarca acesta versiune si lasa-ne feedback-ul tau."},{"version_id":"832275148","version_name":"2.3.3","version_date":"2019-08-07 14:22:05.000 +0800","version_description":"E mai simplu acum sa transferi catre un cont Orange Money:<br>·         Iti aratam sugestii cu transferurile tale recente<br>·         lista de contacte este filtrata cu focus pe conturile Orange Money<br>Actualizeaza versiunea si spune-ne cum a fost experienta ta de plata."},{"version_id":"832436924","version_name":"2.3.4","version_date":"2019-09-02 05:53:41.000 +0800","version_description":"Aceasta versiune contine optimizari ale fluxurilor de plata. Trimite-ne feedback dupa update."},{"version_id":"832912750","version_name":"2.3.6","version_date":"2019-10-03 07:02:53.000 +0800","version_description":"Am actualizat aplicatia pentru acomodarea noului sistem de operare iOS 13. In plus, am imbunatatit performanta aplicatiei si am rezolvat bug-uri descoperite in versiunile anterioare. Fa update si trimite-ne feedback!"},{"version_id":"833532630","version_name":"2.4.0","version_date":"2019-11-13 15:18:09.000 +0800","version_description":"Noua versiune permite provizionarea cardului de debit direct din aplicatia Orange Money pentru plata prin Apple Pay."},{"version_id":"833688159","version_name":"2.4.1","version_date":"2019-11-22 07:50:59.000 +0800","version_description":"In aceasta versiune poti proviziona cardul de debit direct din aplicatia Orange Money pentru plata prin Apple Pay, cu telefonul sau ceasul. In plus, am optimizat fluxurile de plata pentru transferuri IBAN si reincarcarea cartelelor Orange PrePay si am rezolvat cateva bug-uri descoperite dupa lansarea sistemului de operare iOS 13. Asteptam feedback-ul tau!"},{"version_id":"833761150","version_name":"2.4.2","version_date":"2019-12-02 07:49:52.000 +0800","version_description":"In aceasta versiune poti proviziona cardul de debit direct din aplicatia Orange Money pentru plata prin Apple Pay, cu telefonul sau ceasul. In plus, am optimizat fluxurile de plata pentru transferuri IBAN si reincarcarea cartelelor Orange PrePay si am rezolvat cateva bug-uri descoperite dupa lansarea sistemului de operare iOS 13. Asteptam feedback-ul tau!"},{"version_id":"834588830","version_name":"2.5.0","version_date":"2020-02-10 07:43:49.000 +0800","version_description":"O noua versiune cu imbunatatiri de performanta in accesarea ecranelor aplicatiei. Actualizeaza acum."},{"version_id":"834692959","version_name":"2.6.0","version_date":"2020-02-17 07:09:40.000 +0800","version_description":"Super vesti pentru tine! Cu noua versiune a aplicatiei poti face transferuri valutare cu 0 comision,  direct din contul tau Orange Money. Ai unul dintre cele mai bune cursuri de schimb si 18 valute in care poti transfera, fie ca vrei sa iti platesti rata la banca, chiria sau sa trimiti bani in strainatate.  Faci totul din aplicatie, direct din contul tau de lei."},{"version_id":"834777166","version_name":"2.6.1","version_date":"2020-02-20 08:01:33.000 +0800","version_description":"Super vesti pentru tine! Cu noua versiune a aplicatiei poti face transferuri valutare cu 0 comision,  direct din contul tau Orange Money. Ai unul dintre cele mai bune cursuri de schimb si 18 valute in care poti transfera, fie ca vrei sa iti platesti rata la banca, chiria sau sa trimiti bani in strainatate.  Faci totul din aplicatie, direct din contul tau de lei."},{"version_id":"835281683","version_name":"2.6.2","version_date":"2020-03-30 09:02:47.000 +0800","version_description":"Cu aplicatia Orange Money<br>·         platesti facturi<br>·         transferi bani<br>·         reincarci cartele Orange SIM PrePay<br>·         platesti cu telefonul orice vrei sa achizitionezi din magazinele Orange<br> <br>Deschide-ti cont Orange Money<br>·         online, direct in aplicatie, în mai putin de 10 minute, daca esti abonat Orange sau<br>·         in orice magazin Orange<br> <br>Cand vrei sa transferi bani, cu Orange Money este simplu.<br>Transferul intre conturi Orange Money este la fel de rapid ca si cand ai trimite un SMS. Selectezi numarul de telefon din agenda, introduci suma si gata, banii sunt transferati instant, sau poti face plati catre un alt cont bancar. Transferi gratuit sume de pana la 50.000 lei catre orice alt cont bancar din Romania.<br> <br>Am adus in aplicatie optiunea de plata pentru majoritatea furnizorilor de utilitati<br>·         Ai toate facturile familiei tale intr-un singur loc<br>·         Platesti oriunde si oricand<br>·         Faci plata gratuit<br> <br>Poti salva orice card bancar in aplicatie.<br>Dupa alimentarea contului cu un card, o sa te intrebam daca vrei sa-l salvezi in aplicatie. Salvarea iti permite alimentari viitoare rapide.<br> <br>Iar ca sa stai fara griji, ai mereu acces la informatii despre soldul tau, iar banii si datele tale sunt in siguranta."},{"version_id":"835570511","version_name":"2.6.3","version_date":"2020-04-21 14:44:23.000 +0800","version_description":"Pentru ca o parte din procesele noastre aveau nevoie de prezenta ta intr-un magazin Orange iar in aceasta perioada este important sa stam cat mai mult acasa, am adus modificari fluxurilor fluxurile. De exemplu, am eliminat posibilitatea de ridicare a cardului de debit Orange Money din magazinele Orange. Iti livram cardul acasa, fara niciun cost suplimentar.<br><br>In plus, aplicatia noastra este acum disponibila pentru accesare de oriunde, nu doar din Store-ul din Romania."},{"version_id":"835664431","version_name":"2.6.4","version_date":"2020-04-26 13:46:34.000 +0800","version_description":"Pentru ca o parte din procesele noastre aveau nevoie de prezenta ta intr-un magazin Orange iar in aceasta perioada este important sa stam cat mai mult acasa, am adus modificari fluxurilor din aplicatie. De exemplu, am eliminat posibilitatea de ridicare a cardului de debit Orange Money din magazinele Orange. Iti livram cardul acasa, fara niciun cost suplimentar.<br>In plus, aplicatia noastra este acum disponibila pentru accesare de oriunde, nu doar din Store-ul din Romania.<br>Poti solicita oricand online un card de debit virtual sau fizic si sa-ti activezi platile contactless prin Orange Pay, Apple Pay, Fitbit Pay sau Garmin Pay."},{"version_id":"835937686","version_name":"2.6.5","version_date":"2020-05-17 17:31:05.000 +0800","version_description":"Aducem mici imbunatatiri la functionalitatile Orange Money ca sa ai parte de o experienta buna de utilizare. <br>Multumim! #stamacasa"},{"version_id":"836021602","version_name":"2.6.6","version_date":"2020-05-20 14:56:48.000 +0800","version_description":"Ne-am schimbat sediul social in strada Gara Herastrau nr. 4D, cladirea Green Court, corpul C, etaj 11, sectorul 2, Bucuresti si a fost necesara actualizarea Termenilor si conditiilor de utilizare a serviciilor Orange Money. Ne poti scrie folosind aceasta adresa. Multumim!<br>#stamacasa"},{"version_id":"838143383","version_name":"2.7.2","version_date":"2020-10-12 09:16:23.000 +0800","version_description":"În această versiune am schimbat modalitatea de autentificare în aplicația mobilă şi, în scurt timp, autorizarea plăƫilor online cu cardul se va efectua direct din aplicaƫie, în deplină siguranță, fără să fie necesar codul din SMS-ul cu parola 3D Secure. Tehnologia avansează şi astfel accesul în aplicaƫie şi autorizarea plățior devin şi mai comode şi la un standard şi mai înalt de siguranță."},{"version_id":"840551586","version_name":"2.8.6","version_date":"2021-02-23 05:03:44.000 +0800","version_description":"Imbunătăƫim constant aplicaƫia Orange Money, mulƫumim că eşti alături de noi!<br><br>Echipa Orange Money"},{"version_id":"841068322","version_name":"2.8.9","version_date":"2021-03-31 06:41:08.000 +0800","version_description":"Am lansat un nou canal digital de contact pentru tine: Orange Money Messenger. Il poti accesa din meniul aplicatiei, sectiunea Contact/Scrie-ne.<br>Te asteptam online cu orice solicitare despre serviciile si produsele noastre!"}]