[{"version_id":"827580402","version_name":"3.0.1","version_date":"2018-06-19 03:53:51.000 +0800","version_description":"- Fixed bug where Pro users would be prompted to subscribe<br><br>- If you are using Hashtags Pro on multiple devices or are having trouble accessing Pro features, go to Settings and tap 'Restore Purchases'"},{"version_id":"827959259","version_name":"3.1.0","version_date":"2018-07-26 02:09:55.000 +0800","version_description":"- Fixed bugs that would make the app just stop working<br><br>- Improved generation algorithm and made it so it doesn't use as many Instagram requests so you can do more per session"},{"version_id":"828403936","version_name":"3.1.1","version_date":"2018-08-30 01:22:00.000 +0800","version_description":"- Fixed bug that would tell users to endlessly contact support"},{"version_id":"828715748","version_name":"3.1.2","version_date":"2018-09-26 13:35:28.000 +0800","version_description":"- Fixed a crash at initial login"},{"version_id":"828822783","version_name":"3.1.3","version_date":"2018-10-04 20:09:21.000 +0800","version_description":"- Fixed crash on login"},{"version_id":"829352340","version_name":"3.1.4","version_date":"2018-11-20 21:00:53.000 +0800","version_description":"- Beta Testers - go to settings and tap 'Become a Beta Tester' to try the newest versions of Hashtag Expert<br><br>- Under the hood improvements that make it easier for us to debug problems"},{"version_id":"829538191","version_name":"3.2.0","version_date":"2018-12-07 14:19:55.000 +0800","version_description":"- No more rate limit! Tired of that darn limit? It's gone now.<br><br>- Remove Instagram login, no longer required<br><br>- Layed the groundwork for a super cool update coming in the next month or two (it's going to be huge)"},{"version_id":"830148599","version_name":"4.0.0","version_date":"2019-02-02 15:06:37.000 +0800","version_description":"You know when you get a haircut, look in the mirror, and think \"Dayyyyyum! I look good!”<br><br>That's how we feel right now. Hashtag Expert has gotten a facelift–or... more like 10 facelifts combined. Like a body-lift (is that a thing?). We're getting carried away. <br><br>We've completely redesigned the entire app. We've added 8 new hashtag generation algorithms. You can now customize how your hashtags are generated! This means you can add default hashtags, change how many per group, set a custom copying format, and more. There’s a lot more. Like, a lot. <br><br>We've been working really hard on this for months now. It’s time for us to send our baby out into the wild and see how she does. Keep hashtagging and someday, you may become a Hashtag Expert. (Don’t get your hopes up, legend has it that only 3 humans have ever achieved this noble status).  <br><br>Keep living life, and let us know what you think. Hit us up on Instagram @hashtagexpert."},{"version_id":"830244438","version_name":"4.0.1","version_date":"2019-02-10 18:13:51.000 +0800","version_description":"Fixed attribution problem<br><br>-<br><br>You know when you get a haircut, look in the mirror, and think \"Dayyyyyum! I look good!”<br>That's how we feel right now. Hashtag Expert has gotten a facelift–or... more like 10 facelifts combined. Like a body-lift (is that a thing?). We're getting carried away.<br><br>We've completely redesigned the entire app. We've added 8 new hashtag generation algorithms. You can now customize how your hashtags are generated! This means you can add default hashtags, change how many per group, set a custom copying format, and more. There’s a lot more. Like, a lot.<br><br>We've been working really hard on this for months now. It’s time for us to send our baby out into the wild and see how she does. Keep hashtagging and someday, you may become a Hashtag Expert. (Don’t get your hopes up, legend has it that only 3 humans have ever achieved this noble status).  <br><br>Keep living life, and let us know what you think. Hit us up on Instagram @hashtagexpert."},{"version_id":"831839000","version_name":"4.0.2","version_date":"2019-07-03 15:40:34.000 +0800","version_description":"- Simplified onboarding, it's only two steps now (fast and easy)<br><br>- More attribution stuff (boringggg)"},{"version_id":"832020425","version_name":"4.0.3","version_date":"2019-07-16 17:46:06.000 +0800","version_description":"- More attribution stuff<br><br>- Fixed some bugs with analytics"},{"version_id":"832200086","version_name":"4.0.4","version_date":"2019-08-04 20:24:45.000 +0800","version_description":"Say hello to ... CAPTIONS! You can now see 1000s of trending captions in Hashtag Expert. Also, we simplified the Profile to show your favorites, recently copied, and generated hashtags. We also added stats. You can see how many times your hashtag groups have been favorited and copied. We'll be doing more here soon...<br><br>Enjoy!"},{"version_id":"832472245","version_name":"4.1.0","version_date":"2019-08-26 15:34:00.000 +0800","version_description":"- You can now edit existing hashtag groups throughout the app. So, imagine you see a group you like but it's just missing 1 or 2 of your favorite hashtags—now you can edit it, customize it, and copy it! <br><br>- Fixed report card coloring and other bugs"},{"version_id":"833040653","version_name":"4.2.0","version_date":"2019-10-07 22:15:39.000 +0800","version_description":"- Improved core generation algorithm<br><br>- Leaderboards - see who the biggest Hashtag Experts are (users whose hashtag groups have blown up on the trending charts)<br><br>- Bug fixes, laying the groundwork for some really cool updates in the next few weeks"},{"version_id":"833069146","version_name":"4.3.0","version_date":"2019-10-21 13:41:22.000 +0800","version_description":"- Introducing our TikTok Hashtag Generator - now in the main generate tab, you can switch to the TikTok hashtag generator. This uses a special algorithm designed specifically for TikTok. Send us any feedback you have on this so we can make it better! (Is it \"Tik Tok\" or \"TikTok\", asking for a friend?)<br><br>- Redesigned Copying UI - added some cool colors and gradients and stuff that makes it looks cooler (like super cool)<br><br>- Fixed bug that stopped users who aren't logged into iCloud from generating hashtags<br><br>- Added a 'Delete Account' setting that will delete all your information from the app if you decide you want to leave us ... *starts tearing up* :'(<br><br>- Oh, almost forgot, we added 'Hand-pick Hashtags' mode which lets you ... handpick hashtags with our recommendations. So you search #halloween and instead of us creating a whole group for you, you can choose specific ones you want. It's kinda cool (low-key).<br><br>P.S. Does anyone still read these updates? If you do, email zach@shakd.io with the subject \"No, Look at Me, I am the Hashtag Expert Now\" for a special surprise"},{"version_id":"833444602","version_name":"4.3.1","version_date":"2019-11-04 17:27:07.000 +0800","version_description":"- Browse trending TikTok hashtags"},{"version_id":"833612499","version_name":"4.4.0","version_date":"2019-11-15 01:57:25.000 +0800","version_description":"Boop boop skooba da BOP BOP skeeeee ya MOOO taBA ... and all I want ....... for Christmas ..... isssssss—Oh Hey, didn't see ya there. No, I totally wasn't singing Xmas chunes before Thanksgiving—I would never do that because that's wrong. I am definitely not somebody who would do something like that. You? You look like somebody who might but not I.<br><br>And now... you come to me... on the day of my sisters' wedding ... and ask me to.... generate hashtags for you? <br><br>Alright. I'll actually give you the update now. <br><br>- Hashtag Performance - you'll notice that hashtag groups now have a performance button you can press which loads a bunch of AWESOME stats about hashtag groups like post counts, posts per hour, and average likes for tops posts. <br><br>- Caption Submission - you can now submit wacky and fun captions in the captions tab of the app. Add some trending emojitags™ to your captions so other people can find them. Add your Instagram username and maybe you'll get some followers for your awesome, trending captions? Also, you can now browse captions by emojitag (NO I don't want to autocorrect that word). It's pretty cool. Do not ask me how long I spent building that whole feature. It definitely did not take me 16 hours and 18 coffees because that would be crazy."},{"version_id":"833689266","version_name":"4.4.1","version_date":"2019-11-20 21:34:44.000 +0800","version_description":"- Removed some steps from onboarding"},{"version_id":"833860192","version_name":"4.5.0","version_date":"2019-12-04 19:24:36.000 +0800","version_description":"- Like Predictor - predict how many likes your posts will get before you post them! It's really cool and used Machine Learning (oooOOOooo)"},{"version_id":"834150852","version_name":"4.6.0","version_date":"2019-12-27 22:25:57.000 +0800","version_description":"- You can now handpick hashtags for Twitter, LinkedIn, Facebook, YouTube, and Pinterest<br><br>- Polished the design and UX a bit"},{"version_id":"835064227","version_name":"4.6.1","version_date":"2020-03-11 19:36:14.000 +0800","version_description":"- Fixed error in paywall where it'd offer you a free trial if you weren't eligible"},{"version_id":"835499113","version_name":"4.6.2","version_date":"2020-04-11 10:33:44.000 +0800","version_description":"- Fixed a nasty bug that was causing our generator to fail in various parts of the app<br><br>- Also, we're releasing a preview of a redesign. It may be a bit clunky, and we didn't have time to fully roll it out as we wanted to resolve this bug as fast as possible. But, it's been tested so we figured why not let the masses give it a try!"},{"version_id":"835596379","version_name":"4.7.0","version_date":"2020-04-23 15:37:37.000 +0800","version_description":"We're proud to announce the new and improved Performance! This is an incredibly powerful hashtag-analysis tool that you can use to predict how a specific group of hashtags will perform for your Instagram account. <br><br>We also are introducing an improved onboarding experience. You'll receive daily tips on how to use the most important parts of the app for 10 days. We hope this is helpful! <br><br>You can now review any messages we've sent you by checking out your inbox in the Generate tab. <br><br>We've introduced a few new Settings and improved some old ones. If you need help with a refund or want to report a bug, you'll find an option in Settings."},{"version_id":"835793478","version_name":"4.8.0","version_date":"2020-05-07 22:00:24.000 +0800","version_description":"We have a lot of improvements for you in this one! Let’s start with the biggest:<br><br>- New Algorithms - we added a bunch of new generator algorithms that you can use to better optimize your hashtags. The Personalize algorithm will find hashtags that match your account size and like averages. The Optimized algorithm will filter hashtags to have certain amounts of posts. And there are a few others that give even more control over post counts. We also added a helpful article to our knowledge base. Go to Settings &gt; Tips &amp; Tricks and you’ll find it.<br><br>- Performance Tweaks - you can now copy and select specific hashtags in performance, you can also sort the order of the hashtags<br><br>- New Categories - we now have over 50+ categories in the app, we added new ones based on your feedback<br><br>- Hashtag Ratings - you can now rate hashtag groups after you’ve used them on your post. This lets us know how good of a job we’re doing. We’ll be doing more with this soon.<br><br>Thanks for your feedback! We hope you enjoy this release."},{"version_id":"835875180","version_name":"4.9.0","version_date":"","version_description":""},{"version_id":"836057273","version_name":"4.9.1","version_date":"2020-05-28 17:45:41.000 +0800","version_description":"Instagram Story hashtag generator - this will generate hashtags specifically designed for IG stories. The algorithms will still apply. You can also browse trending IG Story hashtags in the Trending tab. <br><br>Banned Hashtags - we’ve heard from a lot of you that you sometimes see banned hashtags in the app. Now, we’ll filter out banned hashtags from generated hashtags and handpicked hashtags. No need to worry about that anymore.<br><br>Copying Styles and Spacers - choose from 6 different copying styles that will format your hashtags in really cool ways like ‘Mountain’ which will make your hashtags look like a mountain! Spacers are little emojis or characters that go in between each of your hashtags. Choose from over a dozen different spacers! You can set these up by tapping the configuration button in the Generate tab search bar.<br><br>Today, we say goodbye to Captions. This part of the app never fit in quite right so we’ve removed it. If you’re still interested in using it, you can go to Settings &gt; Captions and you’ll find our other app, Caption Expert, which has all the same captions.<br><br>We’ve combined the Search and Trending tabs to simplify things. This means you can now search hashtags groups by social network, category, and the various Trending/Top/Recent/New rankings.<br><br>We squashed a ton of bugs in this one as well. Have any other ideas or features you’d like to see? Open Settings &gt; ‘Send Feedback’ and send us a message, we read them all!"},{"version_id":"836295909","version_name":"4.10.0","version_date":"2020-06-17 15:23:15.000 +0800","version_description":"More Hashtag Generators! We’ve added hashtag generators for all other social networks that previously didn’t have.<br><br>Handpick Improvements - you can now view post counts and other hashtag stats when handpicking hashtags by switching to the list view.<br><br>Ratings - you can now view hashtag group ratings in Performance. This is really helpful for evaluating Trending hashtag groups and seeing how other people have rated them.<br><br>New Paywall - we’ve implemented a new paywall that is simpler and has more pricing options. We’re rolling this out to just a few people in the beginning but hopefully to everyone soon."},{"version_id":"836585900","version_name":"4.11.0","version_date":"2020-07-29 15:52:52.000 +0800","version_description":"- Fixed a bug that prevented some settings from being saved"},{"version_id":"837996310","version_name":"4.12.0","version_date":"2020-09-30 00:26:48.000 +0800","version_description":"Country and Language Filtering! - you can now filter hashtags in the Trending tab by country and language. This is really useful for making sure the hashtags are relevant to you.<br><br>We fixed an issue with the post count algorithm and also fixed a bunch of other small bugs. <br><br>We hope you are enjoying Hashtag Expert. If you are having any issues, please reach out to us at support@shakd.io"},{"version_id":"838059221","version_name":"4.12.1","version_date":"2020-10-03 16:41:29.000 +0800","version_description":"We have fixed a minor issue where emails weren't getting saved to SendGrid.<br><br>We hope you are enjoying Hashtag Expert. If you are having any issues, please reach out to us at support@shakd.io"},{"version_id":"838112216","version_name":"4.13.0","version_date":"2020-11-19 22:28:22.000 +0800","version_description":"The widget for Hashtag Expert is finally here! Quickly see which hashtags are trending and copy or save them to your favorites with three different sizes: small, medium, and large. We’ve also added some remaining translations throughout the app so you should not experience any issues there.<br><br>Oh, almost forgot - we fixed some embarrassing bugs that were found after the last release including ones related to hashtags being cut-off, handpicking hashtags, invalid characters/spaces/keywords being accepted as hashtags, duplicate hashtags appearing in auto-suggestion, and a bunch of other small fixes. We also rebuilt the logic behind the Performance feature so it should be working smoothly again—apologies for that.<br><br>We hope you’re enjoying Hashtag Expert. If you are having any issues, please reach out to us at support@shakd.io"},{"version_id":"839298458","version_name":"4.13.1","version_date":"","version_description":""},{"version_id":"839505730","version_name":"4.14.0","version_date":"","version_description":""},{"version_id":"839957480","version_name":"4.14.1","version_date":"","version_description":""},{"version_id":"839987178","version_name":"4.15.0","version_date":"2021-01-16 14:24:35.000 +0800","version_description":"NEW! We have some exciting features planned for 2021. Our new Hashtag Expert version is out and it includes some major improvements to existing features. Our goal is to help you grow your accounts organically. We're focusing on helping you use all of the powerful features of Hashtag Expert to grow your engagement. We moved our blog links, FAQ, and Knowledge Base to a more visible place in Settings. We also squashed that bug where you'd get the \"Too Specific\" error.<br>Enjoy the app and reach out to us at support@shakd.io if you have any issues!"},{"version_id":"840088684","version_name":"4.16.0","version_date":"2021-02-05 08:13:35.000 +0800","version_description":"NEW! Our latest Hashtag Expert update is out and includes amazing new features. Check out the new Editorial Hashtags section where we highlight top-performing hashtag groups for upcoming events and holidays. We also brought Performance closer to you—meaning you can now see Performance reports for handpicked hashtags. We hope it helps you build stronger hashtag groups! You can find our latest announcements at the bottom of the main tab in the Generate tab. Here you can find Editorial Hashtags, our latest Blog posts, and a link to our other app Caption Expert (100% Free).<br>Enjoy the app and reach out to us at support@shakd.io if you have any issues!"},{"version_id":"840439582","version_name":"4.17.0","version_date":"2021-02-17 23:13:17.000 +0800","version_description":"NEW! The latest Hashtag Expert update is out and includes some amazing new features. We're laying the groundwork for improved language detection (we've heard your requests!). In the future, we'll let you filter both trending hashtags and your generated hashtag groups by language. This is accomplished using some cool tech which we're really excited about (natural language processing, machine learning). <br>Enjoy the app and reach out to us at support@shakd.io if you have any issues!"},{"version_id":"840531684","version_name":"5.0.0","version_date":"2021-03-06 15:36:37.000 +0800","version_description":"NEW! Hashtag Expert 5.0.0 a major release to our app is out - and it includes amazing new features. We have updated the Trending screen with advanced filtering options and a simplified interface. You can now filter per location, date, and language next to the existing category and rating. Make sure to check out Near me under location filtering to give you hashtag groups that are popular near your location. You can use the power of some really cool tech (natural language processing, machine learning) to filter trending hashtags per language. Do not miss setting up a dominant language in the Configuration screen in which the hashtag groups should be generated (uses the same cool tech). Last but not least - we have also introduced the ability for you to sign up for PRO features over on our website, hashtag.expert.<br>Here is also a quick sneak peek on our roadmap for upcoming releases - we will focus on implementing Collections (the ability for you to organize your hashtag groups) and a complete overhaul of Performance card data.<br>Enjoy the app and reach out to us at support@shakd.io if you have any issues!"},{"version_id":"840870476","version_name":"5.0.1","version_date":"2021-03-12 20:13:11.000 +0800","version_description":"NEW! Hashtag Expert 5.0.1, a major release to our app, is out and it includes amazing new features! We squashed that annoying \"Couldn't Refresh\" issue that was appearing on the Performance screen. In our upcoming releases, we are planning to completely overhaul the Performance card and bring back some of those metrics that have been missing lately.<br><br>Our team has worked really hard to prepare these releases for you over the past few months. If you are enjoying them, make sure to leave us a review or send a kind note to our team at support@shakd.io :)"},{"version_id":"841002965","version_name":"5.1.0","version_date":"2021-03-27 07:08:53.000 +0800","version_description":"NEW! Hashtag Expert 5.1.0, a major release to our app, is out and it includes amazing new features! We squashed that annoying bug where users couldn't enter a valid IG username. In our upcoming releases, we are bringing Collections - a new way to organize generated and saved hashtag groups. Also, we are completely overhauling the Performance card and bringing back some of those metrics that have been missing lately. <br><br>Our team has worked really hard to prepare these releases for you over the past few months. If you are enjoying them, make sure to leave us a review or send a kind note to our team at support@shakd.io :)"},{"version_id":"841116996","version_name":"5.2.0","version_date":"2021-04-14 20:06:43.000 +0800","version_description":"NEW! A major enhancement to our app, Hashtag Expert 5.2.0, is out, and we can't wait for you to see it. We’re especially excited about Collections, a new way to organize your hashtag groups. Sort your favorite hashtags by brand or type of content, such as Beauty, Fashion, Food, or whatever you prefer. Simply go to your profile and start creating and organizing new Collections. If you find an interesting hashtag group that’s trending, click on the ribbon and assign it to the Collection. Or, you can create a new hashtag group and save it on the Copy Hashtag screen.<br>To make Hashtag Expert even better for you, our team is constantly working to improve it. If you enjoy using the app, please leave us a review or send a note to our team at support@shakd.io. We love hearing from you!"},{"version_id":"841378161","version_name":"5.3.0","version_date":"2021-04-22 16:36:56.000 +0800","version_description":"NEW! A major enhancement to our app, Hashtag Expert 5.3.0, is out, and we can’t wait for you to see it – because we created it as a direct response to your feedback. <br>You, our users, have been asking how to grow your accounts and make Hashtag Expert work better and smarter for you. Now, you’ll have a dedicated place to get answers to all your questions. <br><br>Introducing Learn, your very own virtual support resource. With Learn, you can receive guidance on how to grow your accounts, improve visibility, enhance engagement, and increase followers. You can also get expert advice on how to use specific Hashtag Expert features. As another part of the Hashtag Expert 5.3.0 update, we’ve tweaked the design of Curated hashtags, a collection of themed, handpicked, and curated hashtag groups by our team. <br><br>And that’s not all. Remember our promise to improve the Performance card? Well, that’s part of this release too. Check out the new changes to it, which you’ll find under Placement. We hope this will help you select even better hashtags for your posts. With future upgrades, we plan to keep tweaking Performance to help you increase engagement even more and get some additional metrics.<br><br>Our team is constantly working to make Hashtag Expert even better. If you enjoy using the app, please leave us a review or send a note to our team at support@shakd.io. We love hearing from you!"},{"version_id":"841939014","version_name":"5.4.0","version_date":"2021-05-26 19:58:06.000 +0800","version_description":"NEW! Hashtag Expert 5.4.0 is out! We can't wait for you to see it. We completely rebuilt the Hashtag Expert algorithm from the ground up. Now, our hashtag recommendations are more relevant than ever. <br><br>Performance updates are here as well! Your favorite analytics including New Posts/Hour, Likes on Top Posts, Likes on Average, and New Posts on Average are all back. <br><br>You can now connect your Instagram account which unlocks advanced, personalized hashtags and analytics!<br><br>We are also excited to announce our work on the Hashtag Expert Web App (hashtag.expert). Over the next few weeks, we’ll start inviting some of you to test it. Lookout for a notification in app!<br><br>Our team is constantly working to make Hashtag Expert even better for you. If you enjoy using the app, please leave us a review or send a note to our team at support@shakd.io. We love hearing from you!"},{"version_id":"842415571","version_name":"5.5.0","version_date":"2021-06-10 23:08:44.000 +0800","version_description":"NEW – Hashtag Expert 5.5.0 is out! *Recent Hashtags,* our latest feature on the Generate tab, shows the most recent base hashtags that you have used. So, if you happen to work with those hashtags again, tap to select a hashtag and then tap Generate or Handpick. No need to retype them!<br><br>We've also improved the Performance segment of the app to allow more editing choices, so now you can add or delete hashtags right there to work around the Placement info. This gives you the option to turn an \"Impossible\" group of hashtags into \"Possible\" or even \"Easy.\" Make sure to check out this option on the Performance tab.<br><br>We've also squashed a bug that caused more than 30 hashtags per generation for some users who were trying to create a hashtag group.<br><br>We are super excited to announce that Hashtag Expert Web App is coming soon (hashtag.expert). Over the next few weeks, we'll begin inviting some of you to test it. Keep an eye on the app notifications!<br><br>Our team is constantly working to make Hashtag Expert perform even better for you. If you enjoy using the app, please leave us a review or send a note to our team at&nbsp;support@shakd.io. We love hearing from you!"},{"version_id":"842616097","version_name":"5.6.0","version_date":"2021-06-30 17:12:01.000 +0800","version_description":"NEW – Hashtag Expert 5.6.0 is out! <br><br>The newest idea from our labs, the Hashtag Expert Keyboard, is out. Make sure to check out the tab in the main navigation and follow the instructions to set it up. With the Keyboard, you'll be able to directly browse various related hashtags, which will save you time while creating your posts!  <br><br>Also, we are beta releasing a new feature called \"Optimized,\" which you can access through Configuration on the Generate tab. \"Optimized\" enables you to automatically set hashtag post counts for the algorithm so the generated group always matches the placement you want, such as Possible, Hard, Easy, etc. You will need to log in with Instagram via Facebook (if you haven't already done so) to enable automatic retrieval of the number of followers for your account. <br><br>Our team is constantly working to make Hashtag Expert perform even better for you. If you enjoy using the app, please leave us a review or send a note to our team at&nbsp;support@shakd.io. We love hearing from you!"}]