[{"version_id":"822933963","version_name":"1.0","version_date":"2017-08-28 20:09:19.000 +0800","version_description":""},{"version_id":"823567411","version_name":"1.1.1","version_date":"2017-09-06 19:13:30.000 +0800","version_description":"Fixed a QR code scanning issue on iPhones"},{"version_id":"824191238","version_name":"1.2","version_date":"2017-10-30 22:13:34.000 +0800","version_description":"- Fixed a bug where the webcam stream would freeze upon closing and reopening the app<br>- UI updates and improvements. For the design-picky, all rounded buttons now have continuous curvature. No more sharp edges!<br>- iPhone X support"},{"version_id":"824958865","version_name":"1.2.1","version_date":"2017-12-12 00:13:24.000 +0800","version_description":"- Added a rate limit option, ideal for running OctoPrint on smaller hardware (e.g. Raspberry Pi Zero)<br>- Bug fixes<br><br>========<br>We're busy working on a major update to OctoClient, with performance improvements and many new features. If you would like to be the first to try them and help OctoClient's development, join the beta at bit.ly/octobeta"},{"version_id":"825794740","version_name":"2.1","version_date":"2018-02-02 22:48:25.000 +0800","version_description":"OctoClient has been completely re-written for greater efficiency and performance, and also has a new, significantly faster webcam stream. Numerous user interface improvements have been made, including an all-new files view that now supports folders, search and sorting by name, date and size.<br><br>This version also brings the release of OctoClient Pro, that lets you use multiple printers and also the option to view the webcam stream full-screen, as well as supporting OctoClient's future development"},{"version_id":"825880499","version_name":"2.1.1","version_date":"2018-02-07 23:08:52.000 +0800","version_description":"- Bug Fixes<br>- Small UI tweaks<br><br>This version aims to resolve a crash on startup experienced by a few users - if you still experience these after updating please email appsupport@lbell.xyz<br><br>New in version 2.1<br>=====<br>OctoClient has been completely re-written for greater efficiency and performance, and also has a new, significantly faster webcam stream. Numerous user interface improvements have been made, including an all-new files view that now supports folders, search and sorting by name, date and size.<br><br>This version also brings the release of OctoClient Pro, that lets you use multiple printers and also the option to view the webcam stream full-screen, as well as supporting OctoClient's future development"},{"version_id":"826531738","version_name":"2.1.2","version_date":"2018-04-04 18:38:53.000 +0800","version_description":"- Squashed some nasty bugs<br>- Added an option to prevent your device from sleeping while OctoClient is open<br>- Webcam settings are now stored individually per printer<br>- Added an extrude/retract by 100mm option<br>- Added pause/resume functions<br>- Updated support email address, please send future email support requests to support@octoclient.com"},{"version_id":"826698133","version_name":"2.1.3","version_date":"2018-04-21 00:38:14.000 +0800","version_description":"- HTTP Basic Auth support (used in HAProxy)<br>- Inverting axes now happens locally, in-app<br>- Added double-tap gesture to the webcam stream<br>- Fixed some edge cases that would cause the webcam stream to not function<br>- Fixed some webcam stream glitches and improved performance<br>- Lots of general bug fixes<br><br>And, as a quick development update I'm working actively on the following for version 2.2:<br>- Dual extruder support<br>- System Menu Commands<br>- Terminal<br>- Custom GCODE<br>In that order"},{"version_id":"826783198","version_name":"2.1.4","version_date":"2018-04-23 22:10:05.000 +0800","version_description":"OctoClient 2.1.4. The Update. Reimagined.<br>- Bug fixes"},{"version_id":"827281429","version_name":"2.1.5","version_date":"2018-05-25 05:31:21.000 +0800","version_description":"We're updating our privacy policy. (Just kidding :P)<br><br>This is a small maintenance release with some minor bug fixes:<br>- Fixed an image rendering bug<br>- Fixed an issue where the webcam stream would not load if protected by HTTP Basic Auth (thanks Ben!)<br>- Small miscellaneous bug fixes and general stability improvements<br>- Removed Crashlytics by Fabric, a 3rd party crash reporter, because it's no longer needed and with all the data creepiness happening recently I'd rather not have 3rd party closed-source code in the app wherever possible<br>----<br>Also, if you're experiencing a bug where the webcam stream flickers when switching between printers, I'd really appreciate it if you could send me an email to support@octoclient.com with any information on your setup."},{"version_id":"827783489","version_name":"2.1.6","version_date":"2018-07-06 22:54:20.000 +0800","version_description":"- Fixes a crash when using Basic Auth under some circumstances"},{"version_id":"827881238","version_name":"2.1.7","version_date":"2018-07-14 22:38:10.000 +0800","version_description":"- New, faster streaming engine that fixes some webcam stream bugs"},{"version_id":"828039398","version_name":"3.0","version_date":"2018-08-06 20:22:01.000 +0800","version_description":"OctoClient 3 is finally here! It brings a bunch of updates, bug fixes and a fresh design:<br><br>New:<br>- New design<br>- Support for dual extruder printers<br>- Improved streaming engine<br>- In-app help documentation<br>- Many performance improvements<br>- The usual bug fixes<br><br>New in Pro:<br>- Custom GCODE command buttons: assign your own commands to buttons in the control tab<br>- OctoPrint System Menu support: trigger both system commands and custom commands from OctoPrint plugins<br>- GCODE Terminal: Send and receive GCODE commands from your printer<br>- Pinch-to-zoom in the fullscreen webcam view<br>Thank you all for your support, especially Pro users, you help keep development of this app going!"},{"version_id":"828432037","version_name":"3.0.1","version_date":"2018-09-08 22:33:20.000 +0800","version_description":"- Bug Fixes<br>- Fixed crash from hostname misconfiguration<br>- Added option to keep controls enabled while printing<br>- Re-added privacy policy (octoclient.com/privacy)<br>-----<br>Coming (very) soon: push notifications! If you'd like to help test notifications, sign up at https://octoclient.com/beta"},{"version_id":"828602937","version_name":"3.0.2","version_date":"2018-09-17 21:45:07.000 +0800","version_description":"Happy iOS 12 day! This version brings support for iOS 12 and new iPhones."},{"version_id":"828923413","version_name":"3.0.4","version_date":"2018-11-26 19:17:18.000 +0800","version_description":"- iOS 12.1 Support<br>- Added a crash reporter, you can opt-in to crash reporting in settings"},{"version_id":"828923413","version_name":"3.0.3","version_date":"2018-10-14 22:17:00.000 +0800","version_description":"- Fixed a bug that could cause the app to abort when searching in the files tab<br>- Miscellaneous performance optimisations"},{"version_id":"829367941","version_name":"3.0.4","version_date":"2018-11-26 19:17:18.000 +0800","version_description":"- iOS 12.1 Support<br>- Added a crash reporter, you can opt-in to crash reporting in settings"},{"version_id":"829722776","version_name":"3.1","version_date":"2020-07-07 23:05:34.000 +0800","version_description":"I'm still hard at work on the next major version of OctoClient, but for now here's some fixes and&nbsp;<br>– Improved iOS 13 support<br>– Fixed an issue where when switching printers, the old printer's files would still be displayed until manually refreshed (thanks Mike)<br>– Fixed an issue where the terminal would not work in certain circumstances (thanks James)<br>– Fixed an issue where some custom system commands could not be triggered (thanks Andre and Sébastien)<br>– Fixed some issues with printing from SD cards<br>– SD card file loading now works properly<br>– Added multi-line GCODE command buttons<br>– The files sort option is now persistent across relaunches"},{"version_id":"837283071","version_name":"3.1.1","version_date":"2020-08-09 03:40:44.000 +0800","version_description":"Just a couple of fixes:<br>– Terminal input is capitalised by default to avoid issues with case-sensitive printer firmwares (thanks Reed)<br>– Fixed a bug causing multi-line GCODE commands to not be sent (thanks Fabiano)"},{"version_id":"839331493","version_name":"3.1.2","version_date":"2020-11-24 06:48:24.000 +0800","version_description":"– Fixed a bug where camera settings would not update after switching printers (thanks Garret &amp; Matt)<br>– Fixed a bug where the full-screen webcam could cause the app to become stuck in landscape mode (thanks Jasper)<br>– Added an option to disable full-screen webcam auto-rotation to landscape mode (thanks Magnus)"},{"version_id":"839686952","version_name":"3.1.3","version_date":"2020-12-17 22:03:50.000 +0800","version_description":"– Updated and simplified privacy policy<br>– Added prompt for attaching app diagnostics to support emails"},{"version_id":"840739912","version_name":"3.1.4","version_date":"2021-03-05 05:35:46.000 +0800","version_description":"– Fixed a bug where Terminal would sometimes not work with HTTP Basic Auth<br><br>——<br>OctoClient 4—bringing a new design, first-class iPad support, and much more—is now in public beta! Sign up at octoclient.com/beta"},{"version_id":"840811181","version_name":"3.1.5","version_date":"2021-03-09 18:18:39.000 +0800","version_description":"– Fixed a visual bug with the temperature control interface<br><br>——<br>OctoClient 4—bringing a new design, first-class iPad support, and much more—is now in public beta! Sign up at octoclient.com/beta"}]