[{"version_id":"825706178","version_name":"1.5.5","version_date":"2018-01-23 11:08:38.000 +0800","version_description":"Optimizations"},{"version_id":"825788741","version_name":"1.5.6","version_date":"2018-01-28 06:17:17.000 +0800","version_description":"Optimizations and bug fixes"},{"version_id":"825800672","version_name":"1.5.7","version_date":"2018-01-30 03:40:29.000 +0800","version_description":"Optimizations and bug fixes"},{"version_id":"825864446","version_name":"1.6.2","version_date":"2018-02-06 09:10:47.000 +0800","version_description":"Hello Rumblers,<br><br>We’ve updated the game! <br><br>UPDATES<br>- New monsters Daq Daq and Cupid!<br>- Overall monsters balancing, for details, please check Discord.<br>- Lunar New Year theme for main page<br>- Battle replay now shows blood bar<br>- PVP Beta Test: Random cells to give extra speed, extra energy, or inflicts damage. Also adjusted monster speed based on last PVP beta test. <br>- Other improvements and bug fixes<br><br>Tactical Monsters HQ"},{"version_id":"825914874","version_name":"1.6.3","version_date":"2018-02-09 03:50:54.000 +0800","version_description":"Hello Rumblers,<br><br>We’ve updated the game! <br><br>UPDATES<br>- New monsters Daq Daq and Cupid!<br>- Overall monsters balancing, for details, please check Discord.<br>- Lunar New Year theme for main page<br>- Battle replay now shows blood bar<br>- PVP Beta Test: Random cells to give extra speed, extra energy, or inflicts damage. Also adjusted monster speed based on last PVP beta test. <br>- Other improvements and bug fixes<br><br>Tactical Monsters HQ"},{"version_id":"825957093","version_name":"1.6.5","version_date":"2018-02-13 10:33:42.000 +0800","version_description":"Bug fixes and Optimizations"},{"version_id":"826172548","version_name":"1.7.1","version_date":"2018-03-07 08:20:41.000 +0800","version_description":"We’ve updated the game! <br><br>3/6/2018 UPDATES<br>•Get Clan Chests when combining the power of your clan!<br>•Purple card donations on Sundays!<br>•New monster Bunka has arrived!<br>•Monster Academy tutorial stages added.<br>•Cross platform PVP gameplay (iOS, Android, Steam).<br>•PVP Season now ends one day later than the previous season.<br>•Random Fun mode now is a capped level PVP which features all old and new monsters! <br>•Added localizations for Finnish, Czech, Portuguese (Portugal)<br>•Network and internet connection optimization<br>•Bug fixes and optimizations"},{"version_id":"826231921","version_name":"1.7.3","version_date":"2018-03-10 05:13:25.000 +0800","version_description":"1. Strengthen the Bunka<br>2. Bug fix: No skill sfx for Bunka's ult skill<br>3. Some UI text changes"},{"version_id":"826285048","version_name":"1.7.7","version_date":"2018-03-14 01:51:15.000 +0800","version_description":"Localization and Network optimization"},{"version_id":"826348169","version_name":"1.8.0","version_date":"2018-03-20 04:34:54.000 +0800","version_description":"Hello Rumblers,<br><br>Here’s a BIG update for Easter and spring!<br><br>3/20/2018 UPDATES<br>-Easter &amp; Spring themed main city: Discover secret prizes!<br>-NEW monster: Thumper the Easter Bunny!<br>-NEW monster: Ares the god of war!<br>-Added PVP 100 group rankings and prizes.<br>-Get monthly cards to allow all clan members to get clan points!<br>-Use clan points to upgrade orange monsters!<br>-Decreased kills needed to upgrade clan chest.<br>-Shop updated with 6 cards!<br>-Minor improvement and optimizations.<br>-Bug fixes.<br><br>Tactical Monsters HQ"},{"version_id":"826447679","version_name":"1.8.2","version_date":"2018-03-29 02:01:12.000 +0800","version_description":"bug-fix"},{"version_id":"826490847","version_name":"1.8.3","version_date":"2018-04-02 02:25:05.000 +0800","version_description":"BUG-FIX"},{"version_id":"826532453","version_name":"1.8.4","version_date":"2018-04-04 03:35:48.000 +0800","version_description":"BUG-FIX"},{"version_id":"826560044","version_name":"1.8.5","version_date":"2018-04-08 06:58:07.000 +0800","version_description":"BUG-FIX"},{"version_id":"826690370","version_name":"1.9.0","version_date":"2018-04-18 02:59:45.000 +0800","version_description":"Hello Rumblers! We have an exciting big update for you! Brand new monsters and esports mode! Let's look at what we have updated！<br>1.9.0 UPDATES：<br>New Esports Mode has been added to the game! Levels are capped!<br>Three new monsters!<br>PVP: Group rank now shows current group level.<br>PVP: You can now see your PVP rewards limit.<br>PVP: Fixed an issue where Clan PVP Arena Trophies shows 0.<br>Mine defense: Reduced the proportion of resource stealing, increased good output. <br>Mine Defense: Fixed an issue where combat results display incorrect information.<br>Mine Defense: Fixed an issue where Mine combat replay causes game to freeze.<br>Rumble Tower: The frequency of the rumble tower is halved and the rewards doubled.<br>Advanced challenges: Added for three new monsters.<br>Advanced Challenges: Fixed an issue where Elsa advanced challenge 1 cannot be passed.<br>Clan: Fixed an issue where players see other clan messages in the clan.<br>Fixed an issue where blank cards appear in the battle sequence.<br>Swedish language added.<br>Other Bug fixes.<br>Minor improvement and optimizations."},{"version_id":"826766193","version_name":"1.9.1","version_date":"2018-04-24 04:01:20.000 +0800","version_description":"BUG-FIX"},{"version_id":"827168806","version_name":"1.9.3","version_date":"2018-05-19 02:41:30.000 +0800","version_description":"1.9.3Updates<br><br>-Two new monsters: Blocky and Wushi, with basic training! <br>-Network Connection improvement.<br>-First card position in The shop is now free!<br>-The Esport mode is available 10 times in a day. Extra rewards can only be claimed only once.<br>-At the end of the PVP season, players will be reset to different arena levels.<br>-Added hint of daliy donation limits.<br>-Clan mates in clan will receive Gold and Gems after purchasing Monthly Card.<br>-Fixed an issue relating to monster cards purchasing quest."},{"version_id":"827217195","version_name":"1.9.4","version_date":"2018-05-26 03:11:13.000 +0800","version_description":"BUG-FIX"},{"version_id":"827395798","version_name":"1.9.5","version_date":"2018-06-06 10:06:27.000 +0800","version_description":"1.9.5 Updates<br><br>New Monsters: Coach Griz the super soccer player!! <br>New Monsters: Baby Wushi the Dragon Boat Festival monster!<br>The Esport mode will now unlock when a player obtains 4 monsters above LV12.<br>Clan search improvement.<br>Loading improvement."},{"version_id":"827675934","version_name":"1.9.7","version_date":"2018-07-04 02:15:00.000 +0800","version_description":"1.9.7 UPDATES<br><br>- New Monster Gobi the Gamer wishes you a happy video game day! <br>- Added \"Ultimate Skill Default Release\" option, can be edited in settings.<br>- Added \"Passive Skill Release Display\" option, can be edited in settings.<br>- Added \"Player Operation Warning\" option, can be edited in settings.<br>- Added hint when enemy will receive \"defeating blow.\"<br>- Bugs fixes.<br>- Other improvements and adjustments."},{"version_id":"827783968","version_name":"1.9.8","version_date":"2018-07-19 03:33:45.000 +0800","version_description":"BUG-FIX"},{"version_id":"827939045","version_name":"1.10.1","version_date":"2018-08-03 10:06:23.000 +0800","version_description":"1.10.1 Updates<br><br>-  New Monster FROST, COMMANDER of the ICE CREAM ARMY.<br>-  Battle in the new CAMEX GAMES ESPORTS ARENA!<br>-  Added Friendly Battles! You can now rumble fellow clan members!<br>-  Added new Adventure Mode, Guerrilla Warfare, and Rumble Tower stages.<br>- Added new clan Chief transfer system.<br>- Added a Surrender option and removed the Auto for Arena battles above 3000 trophies."},{"version_id":"828114087","version_name":"1.10.2","version_date":"2018-08-07 08:10:23.000 +0800","version_description":"- Thai language added."},{"version_id":"828191306","version_name":"1.10.3","version_date":"2018-08-13 02:53:39.000 +0800","version_description":"bug-fix"},{"version_id":"828292462","version_name":"1.10.5","version_date":"2018-08-29 03:44:46.000 +0800","version_description":"1.10.5 UPDATES<br>- New Monster Kronos, The Guardian of Time.<br>- Upgraded some in-game monster visuals! <br>- Added new maps to the PvP Arena ladder!"},{"version_id":"828509479","version_name":"1.10.8","version_date":"2018-09-12 03:28:36.000 +0800","version_description":"1.10.8 Mid Autumn Festival Update<br><br>-New Monster Missy——Breaking News: Missy was on her way back to earth when she was sucked into Dr. Walter's portal. Now, in this foreign universe, along with her trusted UARs (Unmanned Aerial Rabbits), she must use her survival skills to fend off the monsters of this land.<br>-Added a Claim All function to the in-game mail system.<br>-Added Guerilla Warfare Raids.<br>-Added new maps to Arena PvP and optimized map rotation system.<br>-Other small adjustments."},{"version_id":"828589802","version_name":"1.10.9","version_date":"2018-09-21 03:53:58.000 +0800","version_description":"1.10.9 Update<br><br>-Check out the new Tactical Monsters short film!<br>-Added eSport Leaderboard<br>-Bug Fix: Players' regions incorrectly changing when restarting the game<br>-Minor Improvements and Optimizations"},{"version_id":"828706639","version_name":"1.10.10","version_date":"2018-09-26 08:56:54.000 +0800","version_description":"bug-fix"},{"version_id":"828898991","version_name":"1.10.11","version_date":"2018-10-16 03:45:20.000 +0800","version_description":"1.10.11 Update<br><br>-New Premium and Premium PLUS Subscriptions and new store! More benefits and discounts!<br>-New Monster: Tusk — Tusk the wild boar from the Thailand forest! He is both strong and fierce just like the Thailand Wild Boars kids soccer team! Beware as you enter the forest. The rustling sound of the bushes might mean Tusk the wild boar is near. He is not fat, but muscular and super fast! The first glance of seeing him is probably when you are up in the air looking at the ground, tossed up like salad by the tusks of this wild boar!<br>-Expeditions rewards increased to balance out the increase in difficulty with higher levels<br>-Updated chests in the store!<br>-Season chests changed to Legendary Chests and Lightning Chests"},{"version_id":"828981441","version_name":"1.10.13","version_date":"2018-10-22 13:53:45.000 +0800","version_description":"bug-fix"},{"version_id":"829043052","version_name":"1.10.16","version_date":"2018-10-27 03:49:37.000 +0800","version_description":"bug-fix"},{"version_id":"829161062","version_name":"1.10.18","version_date":"2018-11-06 03:11:40.000 +0800","version_description":"1.10.18 Update<br><br>-Clan chiefs now have the ability to limit donations of clan members<br>-Premium subscribers can purchase promo packs earlier <br>-After surrendering to an opponent, you will not face the same opponent again in a short period of time<br>-Updated the visuals for monster tags"},{"version_id":"829239946","version_name":"1.10.19","version_date":"2018-11-13 02:13:33.000 +0800","version_description":"1.10.19 Thanksgiving Day Update. Happy Thanksgiving!<br><br>Turk is raiding your Thanksgiving dining table!<br>-New Monster: Turk——Turk is the only turkey to have come to this world. No one knows where he got his armor, but his weapons are most certainly stolen from the kitchen. There are even rumors that he has perfected a vegetarian turkey recipe. Looks like turkey won't be on the menu this Thanksgiving!<br>-Brand new eSport modes will be progressively added to the game! <br>-Added new Thanksgiving arena environment!<br>-Premium Plus subscribers can now switch to longer and cheaper subscription plans"},{"version_id":"829304840","version_name":"1.10.20","version_date":"2018-11-19 02:52:38.000 +0800","version_description":"bug-fix"},{"version_id":"829444647","version_name":"1.11.0","version_date":"2018-11-30 02:32:07.000 +0800","version_description":"1.11.0 Legendary Update!<br><br>-Added all new Clan Expeditions! Fierce bosses and boundless treasures await!<br>-Adjusted the turn time of real-time battles<br>-Added new player frames!"},{"version_id":"829587619","version_name":"1.11.2","version_date":"2018-12-12 03:09:26.000 +0800","version_description":"1.11.2 Merry Christmas!<br><br>Ho-Ho-Ho! Merry Christmas rumblers! It's that special time of the year, and here at Tactical Monsters we have a ton of special events and prizes for you! Join us!<br><br>-Added a special Clan Expedition event for Christmas!<br>-Christmas events ready to go!<br>-New Monster: Santa Claus——Santa burst through the portal with his huge bag of gifts, scanning the New environment around him. But where was his sled and reindeer? the other monsters could only stare. A sudden movement caught his eye, as A figure tried to slip away in the confusion. “Hold it right there, Rudolph!”<br>-Decorated the UI and login screen for a festive feel!<br>-Players are now able to see the opponent's starting zone (valid summoning cells)"},{"version_id":"829769060","version_name":"1.11.5","version_date":"2018-12-29 14:09:49.000 +0800","version_description":"bug-fix"},{"version_id":"829802029","version_name":"1.11.6","version_date":"2019-01-03 00:06:30.000 +0800","version_description":"bug-fix"},{"version_id":"829893168","version_name":"1.12.0","version_date":"2019-01-11 01:57:40.000 +0800","version_description":"Update 1.12.0 - Happy New Year!<br><br>- Added a filtering function to the Monsters page!<br>- Fixed a game crash sometimes encountered at the end of Clan Expeditions Boss battles.<br>- The number of PVP trophies gained or lost will gradually reduce when players are repeatedly matched against one another.<br>- Players who finish in the top 100 ranking of each PVP season will receive a special player logo.<br>- PVP battle history will now display the battle formation used by both players.<br>- Added a clan leaderboard for clan expeditions."},{"version_id":"829976838","version_name":"update   - New Monster: Kage——Kage","version_date":"","version_description":""},{"version_id":"829976838","version_name":"1.12.3","version_date":"2019-01-21 02:15:42.000 +0800","version_description":"1.12.3 Early Chinese New Year Celebrations!<br><br>- Added a new game mode: Mythic eSports Challenge! Show off your skills and tactics!<br>- Added a new replay feature: Highlight Rumbles! Everyone can now share their replays with all other players!<br>- New Monster Mr. P:<br>Mr. P could never beat Wukong in a fair fight and he always blamed his losses on his inferior gear. He embarked on a journey to seek advice from the great Dragon King. Instead, he received a small loan of several million gold and with it, Mr. P purchased a tank. Upon returning, he heard that Wukong was sucked into the time portal, so Mr. P followed...<br>Wukong: “Where’d you get that tank, Mr. P?”<br>Mr. P: “I bought it of course. Much better than my old shovel eh?”<br>Wukong: “Where’d you get the money? You win the lottery or something?”<br>Mr. P: “I borrowed it from the Dragon King. It was only a couple million.”<br>Wukong: “How are you going to pay him back?”<br>Mr. P: “Why would I need to pay him back? I got a tank now!”<br>- Added a new Chinese New Year map -- Hall of Virtue"},{"version_id":"830155941","version_name":"1.13.1","version_date":"2019-02-21 01:59:02.000 +0800","version_description":"1.13.1 New Year, New Outlook, Better TMRA! Version update <br>  - New Monster: Kage——Kage, Hattori Hanzo's cat, is well trained in the ancient art of Ninjutsu. During the Honnoji Incident, he learned of Oda Nobunaga's death and was on his way to deliver this urgent message to Tokugawa Ieyasu when he was sucked into a portal, missing out on his opportunity to change Japanese history.<br> - New Monster: Khan——Khan's brother Hodori was chosen as the Olympic Mascot while Khan himself became TaeKwonDo World Champion. As everyone celebrated, the brothers pondered at the night sky, looking at the time portal.<br>\"I'm leaving for a while,\" said Khan.<br>\"Into the portal?\"<br>\"Yes. I will be Champion of the Universe!\"<br> - Increased the character limit per message in clan chat! <br> - A more prominent notice will be displayed on the main page when Clan Expeditions start!"},{"version_id":"830369093","version_name":"1.14.2","version_date":"2019-05-27 04:03:50.000 +0800","version_description":"1.14.2 Re-vitalization Update!<br><br>-New Monster: Hazel the Tooth Fairy!Most tooth faeries collect only the teeth of children, but Hershel is an exception - she has a knack for collecting teeth from all sorts of strange and exotic beasts. Southend is the perfect place for a such a hobby! Thus Hershel came prepared, bringing her favorite hammer just in case...<br>-New Monster: Sergeevna the Matryoshka Doll!Sergeevna is a Matryoshka doll that was once enchanted with magic and then left behind in a long forgotten storage room. Around the time of the World Cup, she had this idea of hitching a ride with an unsuspecting tourist to do some sightseeing. Unbeknownst to her, that tourist happened to be Coach Grizz, who brought her to Southend...<br>-All rumblers will now receive a one-time reward for achieving milestone PvP trophy counts!<br>-Additional rewards are now awarded for consecutive victories for players with fewer than 4000 PvP trophies!<br>-Adjustments were made to improve the PvP experience for newer players."},{"version_id":"830369093","version_name":"1.13.3","version_date":"2019-03-02 01:52:44.000 +0800","version_description":"bug-fix"},{"version_id":"830369093","version_name":"1.13.2","version_date":"2019-02-27 02:49:46.000 +0800","version_description":"bug-fix"},{"version_id":"830471171","version_name":"1.13.3","version_date":"2019-03-02 01:52:44.000 +0800","version_description":"bug-fix"},{"version_id":"830518048","version_name":"1.13.5","version_date":"2019-03-13 01:55:53.000 +0800","version_description":"1.13.5 Happy St. Patrick's Day! Happy April Fools!<br><br>- New Monster: St. Patrick the Leprechaun      St. Patrick is an official salesperson of Lady Luck's blessing. For advertisement, he offers a free sample. However, his clients are shocked upon getting the \"sample\". \"I thought I am getting kissed by Lady Luck herself,\" his client protested. And St. Patrick replies, \"You think you can get that for free?\"<br>- New Monster: Bozo the Clown     Bozo's idea of entertainment was to poke his wacky head out of his box and to try and scare the daylight out of some unfortunate soul. Afterwards, he would try and comfort his victim with his favorite line: \"Relax, why so serious?\". Ironically, this often has the opposite effect...<br>- Minor adjustments have been made to the Mythic eSport mode.<br>- Added Clan Loyalty rewards! Leaving a clan will now result in a cool down period.<br>- Added Clan Expedition Rankings!"},{"version_id":"830614499","version_name":"1.13.6","version_date":"2019-03-18 02:34:37.000 +0800","version_description":"bug-fix"},{"version_id":"830707761","version_name":"1.13.8","version_date":"2019-04-03 01:52:26.000 +0800","version_description":"1.13.8 Happy Songkran Festival!<br><br>- New monster: Jann——Jann has grown weary of awaiting his master's return. One day, he hollered at his fellow Genies, \"Aladdin is not returning! Let's leave this desert once and for all! We can be our own masters, make new friends, and grant wishes as we please!\". With that, he flew away and never looked back...<br>- New monster: Ayara——Ayara's home of Surin had a renown Muay Thai boxer, and Ayara practiced by secretly observing him. After years of hard work, Ayara mastered the \"Mammoth Shockwave\" technique, and was ready for his next challenge. Before he left, he was given an eyepatch as a keepsake of his hometown."},{"version_id":"830900371","version_name":"1.13.9","version_date":"2019-04-13 03:28:49.000 +0800","version_description":"bug-fix"},{"version_id":"831140205","version_name":"1.14.0","version_date":"2019-05-07 01:37:15.000 +0800","version_description":"1.14.0 Game Balance Update<br><br>-In-game testing will begin for the new Auto Chess game mode!<br>-Brand new user interface and startup screen!<br>-Fixed several game issues and made several improvements."},{"version_id":"831253372","version_name":"1.14.2","version_date":"2019-05-27 04:03:50.000 +0800","version_description":"1.14.2 Re-vitalization Update!<br><br>-New Monster: Hazel the Tooth Fairy!Most tooth faeries collect only the teeth of children, but Hershel is an exception - she has a knack for collecting teeth from all sorts of strange and exotic beasts. Southend is the perfect place for a such a hobby! Thus Hershel came prepared, bringing her favorite hammer just in case...<br>-New Monster: Sergeevna the Matryoshka Doll!Sergeevna is a Matryoshka doll that was once enchanted with magic and then left behind in a long forgotten storage room. Around the time of the World Cup, she had this idea of hitching a ride with an unsuspecting tourist to do some sightseeing. Unbeknownst to her, that tourist happened to be Coach Grizz, who brought her to Southend...<br>-All rumblers will now receive a one-time reward for achieving milestone PvP trophy counts!<br>-Additional rewards are now awarded for consecutive victories for players with fewer than 4000 PvP trophies!<br>-Adjustments were made to improve the PvP experience for newer players."},{"version_id":"831597101","version_name":"1.14.4","version_date":"2019-06-26 01:48:17.000 +0800","version_description":"1.14.4 New Season- New Updates!\n<br>\n<br>-New Monster: Statue of Liberty ——On the eve of the Fourth of July celebrations, Lady Liberty suddenly disappeared! She was gone without a trace, leaving behind only an empty platform, a herd of confused tourists, and an extremely angry mayor of New York City. She has appeared in Southend, and is determined to get a taste of \"freedom\".\n<br>-New Monster: Whirlwind Swordmaster Sir Jamie ——Sir Jamie was one of the greatest swordsman in the Sunset Kingdom. His family was revered by all and had unimaginable riches. However, in the blink of an eye, his family lost everything. But, James has not lost his will to fight. To this day, he proudly wears his armor to fight for his family.\n<br>-[Bug Fix] PvP trophy count will now be reset even if the user does not claim their season PvP rewards"},{"version_id":"832106885","version_name":"1.15.0","version_date":"2019-08-02 02:09:49.000 +0800","version_description":"1.15.0 Supreme Update\n<br>-New Monster: Hawaii Crocodile - Renekton As the only saltwater croc in all of Hawai'i, Reketon starred in the game show \"Water Gun Showdown\". However, he was constantly let down by the fact that no one took his show seriously as a competitive sport. Thus he has come to Southend, to prove his worth.\n<br>-New Monster:Man of Thunder - Thor the protector of Asgard, indulged too heavily in the earthly pleasures of video games and fast food. He vowed to get back in shape after being unable to bend over. Not wanting a private trainer, he decided to find his old battleaxes and travelled to Southend to get his \"exercise\".\n<br>-Added a new high frame rate display mode, which can be enabled in the startup settings"},{"version_id":"832240082","version_name":"1.15.1","version_date":"2019-08-03 17:00:54.000 +0800","version_description":"1.15.1 Supreme Update\n<br>\n<br>-New Monster: Hawaii Crocodile - Renekton As the only saltwater croc in all of Hawai'i, Reketon starred in the game show \"Water Gun Showdown\". However, he was constantly let down by the fact that no one took his show seriously as a competitive sport. Thus he has come to Southend, to prove his worth.\n<br>-New Monster:Man of Thunder - Thor the protector of Asgard, indulged too heavily in the earthly pleasures of video games and fast food. He vowed to get back in shape after being unable to bend over. Not wanting a private trainer, he decided to find his old battleaxes and travelled to Southend to get his \"exercise\".\n<br>-Added a new high frame rate display mode, which can be enabled in the startup settings"},{"version_id":"832272654","version_name":"1.15.2","version_date":"2019-08-12 13:00:42.000 +0800","version_description":"bug-fix"},{"version_id":"832351752","version_name":"1.15.4","version_date":"2019-08-14 04:10:15.000 +0800","version_description":"bug-fix"},{"version_id":"832445497","version_name":"1.15.5","version_date":"2019-08-28 02:00:51.000 +0800","version_description":"1.15.5 Heroine's Harbinger Update\n<br>\n<br>- New Monster: MulanMulan is a heroine of outstanding class and character. She stands for love, patriotism, justice, loyalty, fearlessness… Time will not have us forget such a heroine, nor her unique disguise, nor yet her fearsome sword. – “Tribute to Mulan”\n<br>- Added a game option to disable emoticons during PvP battles.\n<br>- Added a confirmation for entering PvP matchmaking on the main page. This option can also be disabled in the game settings.\n<br>- Added new PvP battlefields!\n<br>- Added a visual effect for monsters affected by decreased mobility.\n<br>- The amount of gold obtained from Mine Defense has been greatly increased!\n<br>- The amount of gold obtained from daily PvP battles has been greatly increased!\n<br>- Other small optimizations have been made.\n<br>\n<br>-[Bug Fix] Purchasing monster cards in the Supreme Shop should now count towards that quest.\n<br>-[Bug Fix] The same PvP battlefield should no longer appear numerous times during a single season."},{"version_id":"832571328","version_name":"1.15.6","version_date":"2019-08-30 12:02:20.000 +0800","version_description":"1.15.6 Heroine's Harbinger Update<br><br>- New Monster: MulanMulan is a heroine of outstanding class and character. She stands for love, patriotism, justice, loyalty, fearlessness… Time will not have us forget such a heroine, nor her unique disguise, nor yet her fearsome sword. – “Tribute to Mulan”<br>- Added a game option to disable emoticons during PvP battles.<br>- Added a confirmation for entering PvP matchmaking on the main page. This option can also be disabled in the game settings.<br>- Added new PvP battlefields!<br>- Added a visual effect for monsters affected by decreased mobility.<br>- The amount of gold obtained from Mine Defense has been greatly increased!<br>- The amount of gold obtained from daily PvP battles has been greatly increased!<br>- Other small optimizations have been made.<br><br>-[Bug Fix] Purchasing monster cards in the Supreme Shop should now count towards that quest.<br>-[Bug Fix] The same PvP battlefield should no longer appear numerous times during a single season."},{"version_id":"832817765","version_name":"1.15.7","version_date":"2019-09-25 02:04:08.000 +0800","version_description":"1.15.7 Protector Goddess Athena\n<br>\n<br>- New Monster: AthenaAthena’s most regrettable decision was changing her combative vestments for her protective vestment right before being sucked into the time portal. She selflessly sacrifices her own lifeforce in order to protect her foolhardy friends, and thankfully, her protective garments allow her to recover while attacking. Nonetheless, she still wishes she had her combat gear…\n<br>- Added \"Return to Southend\" quests and rewards for returning players!\n<br>- Added new Magical Lucky Chests!\n<br>- Added new battlefields!\n<br>- Added new Clan Expedition bosses!\n<br>- Added new exclusive benefits and rewards for Supreme subscribers!\n<br>\n<br>-[Bug Fix] W51's self-destruct should now activate if he is defeated by Dr. Walter's burning ember ground effect.\n<br>-[Bug Fix] Rambo's Flap passive should now deal physical damage.\n<br>-[Bug Fix] Fixed some client crashes when switching between Google accounts."},{"version_id":"833189801","version_name":"1.15.8","version_date":"2019-10-25 02:06:37.000 +0800","version_description":"1.15.8.0 King of the Bayou\n<br>\n<br>-New Monster: WujingThe Monk Wujing from “Journey to the West” actually takes on the form of a catfish! After successfully obtaining the sutras from the west, he and his two brothers were named the Golden Arhat Buddha of South Babao. Wujing studied the techniques behind the trinity attack of the bubble bomb, quicksand, and crescent axe. In fact, he became so enamored with his research that decided to travel to Southend to further his practice. He hopes that, along the way, he would be able to find his two lost brothers. Thus, he left a note for Buddha and went to Southend.\n<br>-Added new Monster Academy stages!\n<br>-Added new PvP battlefields!\n<br>-[Skill Optimization] When both formations contain Jann, Mystical Sand on the battlefield will be easier to distinguish."},{"version_id":"833868536","version_name":"1.15.9","version_date":"2019-12-07 16:41:07.000 +0800","version_description":"bug-fix"},{"version_id":"834038998","version_name":"1.16.1","version_date":"2019-12-18 07:12:03.000 +0800","version_description":"1.16.1 The Night Before Christmas!<br><br>-New game mode: Gladiator Arena<br>-New Monster: SnegurkaExperts claim that the increase in global temperature may be due to the disappearance of the Snowmaiden Snegurka into the time portal. However, Southend has only gotten hotter with the heat of battle. After Snegurka's arrival, all the monsters started to engage in a massive snowball fight! Even though the Snowmaiden is no warrior, she is still valued for her team buffs!<br>-New Monster: Ginger The gingerbread men and women of Southend have suffered for long enough! Each year, while the monsters celebrate the winter holidays, the gingerbread people suffer an apocalypse. To fight back, they baked a large gingerbread warrior in Cooper's image. His mission: gingerbread shall no longer celebrate Christmas from within someone's stomach!<br><br>-[Bug Fix] Mudman should now be immediately defeated after his passive skill is triggered.<br>-[Bug Fix] Hoggy should no longer be affected by glue from Reketon's passive skill.<br>-[Bug Fix] Clan Expedition boss level should now be displayed properly.<br>-[Bug Fix] Gold bonus from consecutive PVP victories should now be displayed properly.<br>-[Bug Fix] Shared replays should now be displayed properly.<br>-[Bug Fix] The \"helpshift\" feature for iOS platform should now properly send screenshots.<br>-[Bug Fix] Harrison's ultimate skill should now properly inflict stun against Thumper in transformed mode."},{"version_id":"834262572","version_name":"1.16.3","version_date":"2020-01-14 02:03:51.000 +0800","version_description":"1.16.3 Happy Year of the Rat!\n<br>\n<br>-New Monster: Elvis\n<br>Elvis' company has successfully become listed for public offering! Overnight, he became Southend's richest entrepreneur. At the annual meeting, behind the roar of an audience in tens of thousands, Elvis rocked a handsome punk outfit and guitar. And in that moment, it didn't matter if he could sing or not, as he was going to make it rain on stage!\n<br>-Gladiator Arena: balancing adjustments have been made!\n<br>-Gladiator Arena: rewards are now based on the number of trophies.\n<br>-Gladiator Arena: rewards may now be claimed as soon as the season ends.\n<br>\n<br>-[Bug Fix] The correct ranking should now be properly displayed when switching between ranking tabs.\n<br>-[Bug Fix] Bigfoot's passive skill should now remove the debuff from Wujing's passive skill.\n<br>-[Bug Fix] Clan Expedition scoring should now be calculated correctly if the battle exceeds the maximum number of allowed turns.\n<br>-[Bug Fix] When Thumper transforms into enraged form, the debuff from Elsa's ultimate skill should now be removed."},{"version_id":"834654560","version_name":"1.16.5","version_date":"2020-02-17 02:00:55.000 +0800","version_description":"1.16.5 Approach of the Valkyrie\n<br>\n<br>-New Monster: Valkyrie\n<br>Valkyrie was drawn to Southend by the news of ferocious battles raging on in the Gladiator Arena. She strode in stealthily on her almighty Pegasus, in search of the bravest warrior. The Valkyrie rides into battle and gives her blessing of victory to the most tenacious side.\n<br>-Adjusted perks received by Supreme Subscribers in the Gladiator Arena\n<br>\n<br>-[Bug Fix] Fixed a bug where the red dot notification would appear repeatedly.\n<br>-[Bug Fix] Fixed a UI bug during battle replays where the \"Summon\" button is visible.\n<br>-[Bug Fix] Fixed a bug where the incorrect dialogue box appears when redeeming rewards."},{"version_id":"835033436","version_name":"1.16.7","version_date":"2020-03-16 02:09:28.000 +0800","version_description":"1.16.7  Seasonal Updates\n<br>\n<br>-New Monster: Kabuto\n<br>As the weather becomes hotter, the treetops of Southend become more lively. Strange shadows come to life amongst the forested canopy, peering down into the arena below. \"Can we make it? They can take down a whole tank!\" Kabuto replied disdainfully, \"A tank is nothing. I will send them flying!\"\n<br>-Clan positions have been adjusted."},{"version_id":"835620847","version_name":"1.17.1","version_date":"2020-04-28 17:02:03.000 +0800","version_description":"1.17.1 Brand New Look Update<br><br>-New Monster: Taras<br>Taras is a hideous monstrosity, even for a tarantula. A face filled with only four eyes, surrounded by only six legs, Taras' terrifyingly large mouth and razor-sharp teeth makes one wonder if it is truly a spider. There isn't a single soul on Southend who has gotten close enough to find out... unless they have already been entangled in its web!<br>-Brand new skins system!<br>-Increased rewards from Monster Academy and Basic Training<br>-Increased rewards from Expeditions<br>-Increased rewards for achiving 5 PVP victories"},{"version_id":"835737166","version_name":"1.17.2","version_date":"2020-04-29 18:03:32.000 +0800","version_description":"1.17.2 Brand New Look Update<br><br>-New Monster: Taras<br>Taras is a hideous monstrosity, even for a tarantula. A face filled with only four eyes, surrounded by only six legs, Taras' terrifyingly large mouth and razor-sharp teeth makes one wonder if it is truly a spider. There isn't a single soul on Southend who has gotten close enough to find out... unless they have already been entangled in its web!<br>-Brand new skins system!<br>-Increased rewards from Monster Academy and Basic Training<br>-Increased rewards from Expeditions<br>-Increased rewards for achiving 5 PVP victories"},{"version_id":"836069446","version_name":"1.17.4","version_date":"2020-05-27 02:07:47.000 +0800","version_description":"1.17.4 Seasonal Updates\n<br>\n<br>-New Monster: Scimitar Warrior\n<br>-Improved several elements of the game interface."},{"version_id":"836435136","version_name":"1.17.6","version_date":"2020-06-22 02:01:27.000 +0800","version_description":"1.17.6 Seasonal Updates\n<br>\n<br>-New Monster: Apollo\n<br>Southend Weather Forecast: As Apollo, God of the Sun has come to Southend in search of inspiration, an extreme temperature warning has been issued. This summer will be hotter than ever! Seek shelter when possible and avoid approaching Apollo at all costs!\n<br>-Improved several elements of the UI\n<br>Increased Rumble Tower Rewards\n<br>-Added skins for the following monsters:\n<br>Kronos, Thumper, Wushi, Colonel Baba, Karissa, Sir Phillip"},{"version_id":"836990322","version_name":"1.18.0","version_date":"2020-07-29 02:04:28.000 +0800","version_description":"1.18.0 Clan Wars are Here!\n<br>\n<br>-New Game Mode: Clan Wars. Fight for the glory of your clan!\n<br>-New Monster: Heliante\n<br>Tired of fending off zombies day in and day out, Heliante jumped on an opportunity to leave the garden. However, she did not expect to jump into the portal to Southend! Nonetheless, she wants to prove to all the plants of Southend that sunflowers are the most powerful!\n<br>-Added skins for the following monsters:\n<br>Franky, Frost, Medusa, Elsa, Captain T, Khan, Gobi, Reketon, Mr. P, Shady\n<br>\n<br>-[Bug Fix] Salih's passive skill should now deal the correct amount of damage.\n<br>-[Bug Fix] Colonel Baba's passive skill should now activate correctly.\n<br>-[Bug Fix] Frost's popsicles should no longer freeze units which are immune to freezing.\n<br>-[Bug Fix] Fixed some issues with controls and game inputs."}]