[{"version_id":"822977826","version_name":"1.0","version_date":"2017-07-29 03:22:34.000 +0800","version_description":""},{"version_id":"823073207","version_name":"1.1","version_date":"2017-08-01 01:53:17.000 +0800","version_description":"1.fix small probability bug for crash after tapping the header view\n2.add menu for long press select text to search"},{"version_id":"823204632","version_name":"1.2","version_date":"2017-08-12 00:56:03.000 +0800","version_description":"1.2 Build 5 update log:\n1. fix the iPad version of the Youku see video jump Youku client bug\n2.iPad new options that can hide the bottom navigation bar\n\n1.2 Build 3 update log:\n1. Non-video hanging window to play video support rotating full screen and web playback\n2. The return and forward cached pages no longer show progress bars\n3. Press and hold the address bar to quickly copy, paste and open\n4. Fixed Netease homepage was blocked by passive ad block\n\n1.2 Build 2 update log:\n1. Web page screenshot\n2. Passive ad block: hide instrusive ads\n3.3D Touch quick start Search and Scan QR code\n4. Optimize menu order\n5. Fix the bug that saved gif as a static image\n6. Other bug fixes and optimizations"},{"version_id":"823287799","version_name":"1.3","version_date":"2017-08-25 15:46:37.000 +0800","version_description":"1.3 Build 8:\n1. New settings - more settings - font size\n2. New settings - more settings - multi-language switch\n3. Optimize long press the pop-up menu, you can share / copy the link text\n\n1.3 Build 7:\nIOS 11 adaptation, repair iOS11 on the text can not choose the bug\n\n1.3 Build 6:\n1. Add a button to click on the background color change feedback\n2. Now you can slide back to any position on the page to return, do not have to slide to the left edge to return.\n\n1.3 Build 5:\n1. New page picture view and download / send function: you can slide from the menu - left - web page picture or long press the menu button to open\n2. Fix the bugs that are played automatically after the multi-bulb theater\n3. Fix the bug that removes the data is not clean\n4. repair jump third party App only pop up a bug\n5. Fix the bug that saves and shares the picture card owner, and can click Cancel\n\n1.3 Build 2:\n1. Optimize passive ads to reduce false blocking. Mistake is mainly reflected in the normal function of the blank, such as microblogging can not send comments before, from Baidu search open Baidu map page will be blank.\nThanks and expect students to mistakenly intercept the feedback, if you can not determine whether the current page is mistakenly intercepted, you can turn off the ad from the menu mask and then refresh once.\n2. Fix the bug that causes the screen to force rotation in full-screen video sharing\n3. Fix the iPad on the screen after the video playback box size bug\n4. Fix the bug that saved the webp format image failed\n5. Optimize the jump third-party App interception function, and now can intercept the same jump as the App Store choose to intercept (can be revoked)\n\n1.3 Build 1:\n1. Fix bugs that can not be played by Donau cinema\n2. Repair forced to jump Baidu posted it bug"},{"version_id":"823444231","version_name":"1.5","version_date":"2017-08-29 23:54:30.000 +0800","version_description":"1. Support the keyboard operation,long press the Command key on the keyboard to view all the shortcut keys\n2. Add settings - more settings - scroll rate\n3. Add settings - more settings - iPad exclusive settings, priority in the current tab to open the link.\n4. Add drop-down refresh page\n5. Optimize the privacy mode interface color display\n6. Fix iOS 9 on the iPad to rotate the screen floating frame flashing bug\n7. Optimize the button layout of the Tab selection page on the iPad\n8. Press and hold the label selection button to close all labels, close other labels, create new labels, create new privacy labels"},{"version_id":"823486940","version_name":"1.6","version_date":"2017-09-04 21:11:35.000 +0800","version_description":"fix bug on open new tab in iPad"},{"version_id":"823584159","version_name":"1.61","version_date":"2017-09-07 23:37:53.000 +0800","version_description":"fix bug"},{"version_id":"823730821","version_name":"1.62","version_date":"2017-09-22 04:14:47.000 +0800","version_description":"replace icon"},{"version_id":"823788362","version_name":"2.0","version_date":"2017-09-29 03:41:39.000 +0800","version_description":"1.Add  quick search bar on homepage.\n2.Click location bar will show search history and search view not the homepage.\n3.Optimize homepage bookmark layout.\n4.Optimize menu layout"},{"version_id":"823861643","version_name":"2.1","version_date":"2017-10-10 01:31:28.000 +0800","version_description":"1.Add night dark mode\n2.Custom User-Agent\n3.Optimize menu layout\n4.Optimize homepage.1 layout\n5.Now you can add remove 'm.' from domain to request mobile/desktop site  more easily\n6.Other optimizing and bugs fix"},{"version_id":"823958348","version_name":"2.2","version_date":"2017-10-15 00:21:59.000 +0800","version_description":"1.Add translation feature\n    Support auto translate after loading\n    Support translate in-page\n    Support 14 languages\n    Support select text to translate\n2.Setting optimize\n3.Video floating enhance\n4.Other bugs fix and improvement"},{"version_id":"824025507","version_name":"2.3","version_date":"2017-10-18 05:53:33.000 +0800","version_description":"1. Fix the third-party keyboard automatic completion bug\n2. Optimize the app boot speed, milliseconds start\n3. Optimize the night mode, to solve the problem of flashing and glare\n4. Optimize the drop-down refresh to solve the problem that the scaling may cause a refresh\n5. Optimize the first page 1 display\n6. Other optimization"},{"version_id":"824076203","version_name":"2.4","version_date":"2017-12-01 09:01:21.000 +0800","version_description":"1.Add download  and file manager\n2.Support file preview,download,zip(zip,rar,7z),unzip and so on\n3.Fit to iPhone X\n4.Other optimizations"},{"version_id":"825123090","version_name":"2.5","version_date":"2018-03-17 02:54:38.000 +0800","version_description":"1. Video playback: Added support for audio suspension playback and acceleration, support for audio/video background playback, new AirPlay reminder, new minimized playback, new pull-down window in the bottom right corner, and more websites to adapt to. Turn video settings to block automatic playback.\n2. Reading mode: Added support for web page reading mode, support for smart pages, support for bright color, parchment, retro, blue, light black and night mode themes, support for font size settings, support for reading mode, click pages.\n3. Download and file management: Supports new download from the link, new Wi-Fi transfer function, which can easily transfer files between multiple devices.\n4. Library: Added download management - library function, currently supports txt, epub, kindle, mobi, azw, azw3, azw4, prc and some pdb files. The new version of ps. will support pdf and achieve full coverage. E-book reading support Click to page, set font, theme. Page turning, line spacing, paragraph spacing, saving pictures, recording the progress of reading, minimizing, jumping chapters and pages, and other functions, the ultimate optimization.\n5. Bookmarks: support for new and synchronized bookmark folders, support for bookmark sorting and bulk deletion and movement\n6. Computer/Mobile Switching: Better UA management, and now the browser logo switch will remain valid for tabs. You can set different UAs for mobile and PC versions.\n7. Night mode optimization: All browser pages and web pages are adapted to night mode.\n8. Search: support from the link search engine, support for custom search engines from web search, support Chinese GBK encoding, solve the custom search garbled bug (if the custom engine added before has garbled, please delete and add).\n9. Translation: Added Baidu, Bing, Google Page Translation: Replacing simple translations with Google Translate. (Long press back to home button for quick access to translation options)\n10. Ads Filtering: iOS 11 adds Adblock Plus ad filtering, which is turned on by default. If false blocking occurs, you can turn off ad filtering from the menu or close Adblock Plus from Settings - Ad Filter.\n11. Toolbox: Add Screenshots, Create PDF, 1Password\n\nFunction optimization:\n1. Search interface layout optimization, new shortcut input options\n2. Home page 1 optimization, new page navigation; new one-handed operation shortcut search button at the bottom of the home page (can be set in the settings - through the set - custom within the closure)\n3. Menu layout optimization\n4. Set item optimization\n5. Performance optimization, startup speed optimization, installation package size optimization\n6. No graph mode optimization, complete provincial traffic on iOS 11\n7. Tag selection optimization\n8. Clear data optimization, support the display of the current space occupancy, support open app automatically clear data\n9. 3D Touch Optimization, Support Home, History, Search Page, Bookmarks Page 3D Touch Preview\n10. Long press the menu: long press to advance, back button to record history, long press the menu button to open a bookmark, long press the tab to select a button to quickly create/close bookmarks, long press to return to the home page for quick access to translation options\n11. Other optimization\n\nBug repair:\n1. Fix the bug of saving pictures to album flashback on iOS 11.\n2. Fixed a bug that switched to the computer version and automatically switched back\n3. Other bug fixes"},{"version_id":"826340014","version_name":"3.0","version_date":"2018-03-31 01:18:05.000 +0800","version_description":"Important updates:\n1. Optimize the page return algorithm to solve the problem of page back stalling\n2. Add new settings - Audio/Video settings - Play speed settings, both in video hovering and non-video hovering\n3. Custom search engine supports iCloud synchronization\n4. Optimize reading mode and solve false positive bugs\n5. Fix menu - send bugs that can't share WeChat\n6. iOS 11 support smart no map\n7. New Scheme:\n    Start Scheme: Alook://\n    Search or open Scheme:Alook:// followed by search or link to open\n    Download Scheme:Alook://download/ followed by download link\n\nOptimization and bug fixes:\n1. Fast input optimization, initial display https:// and m. When there is an input later / . .com\n2. New 3D Touch New Download Options\n3. Add custom search engine support from the page to specify the name\n4. iPad does not show full screen options\n5. The desktop version UA ​​toggles Chrome reminder. Safari is recommended. Switching Chrome may cause some websites to fail to play.\n6. Switch tabs, update forward button next page status\n7. Clear history and clear iOS system search content\n8. The privacy tab exits the App and is automatically destroyed and will not be stored\n9. Privacy Mode Enables Password Saving and AutoFill\n10. Fixed bug where K2 Pandora firmware could not login\n11. Reader Support Settings Remove Bottom White Space\n12. The menu will stay on the last page opened\n13. Record the history of reading mode smart pages\n14. Optimize the video sliding experience, the initial sliding progress adjustment is small, the greater the sliding distance, the faster the progress of adjustment\n15. Improve Picture Sending, Share More Apps\n16. Image loading optimization to solve the bug that the memory usage of multiple Gifs and long images may be too high\n17. Optimize the web page image display, solve the flashing bug\n18. Other bug fixes and optimizations"},{"version_id":"826519593","version_name":"3.1","version_date":"2018-04-06 02:03:31.000 +0800","version_description":"1. Support to share links and texts from the system to open or search in the Alook browser.\n2. 1Password, LastPass, Avast Passwords, and other password manager that compliant with the 1Password protocol.\n3. Keep pause state after quick slide.\n4. Fix seek time error of video dragging and fast forward.\n5. Continue to optimize App size and startup speed, from 23.2MB to 22.6MB.\n6. Reader mode loading next page can be cancel after 3s.\n7. Settings - General - Custom add option don't record search history.\n8. Fix Wi-Fi transfer bug in local network .\n9. New \"Query\" option for page selection that call system dictionary.\n10. Other optimizations and bug fixes."},{"version_id":"826624197","version_name":"3.2","version_date":"2018-04-13 04:45:36.000 +0800","version_description":"1. Web links support 3D Touch preview (6s and iOS 10 and above)\n2. Support editing site and customize search engine icons and change background color\n3. Click search recommendation does not jump directly, convenient and quick search\n4. Shorten the long press detection time of the operation bar button, more convenient and long press operation\n5. Long press the tab bar to add the option to close the current tab\n6. Desktop 3D Touch Shortcut Adds Library\n7. Interception of third-party jumps in DeepLink, currently supports Weibo, post it, Zhihu and Youku, welcome feedback\n8. Fixing Adblock Plus Blocking Bugs\n10. Open a new tab from the tab on the iPad, if the current tab is the desktop version, the new tab is also the desktop version\n11. Other optimizations and bug fixes"},{"version_id":"826669842","version_name":"3.3","version_date":"2018-04-20 08:25:05.000 +0800","version_description":"• NEW:\n1. Menu - Toolbox - Auto Refresh\n2. Settings - General - Touch ID/Face ID Settings\n3. Settings - General - Custom - long press operation settings, you can set long press shortcuts\n4. Settings - Audio/Video Settings - Pull down to prevent the video floating window from zooming down to the bottom right (iPhone only)\n5. E-book reader can also be word search and translation\n6. PDF file opens new 'preview (copyable)' option\n7. Support Chinese domain names\n8. Shield button in the upper left corner. If the current website is safe, highlight it. If it is not safe, add 50% transparency. Click to view the basic information of the website certificate.\n\n• BUG FIX & OPTIMIZATION:\n1. Recipe menu-send and menu-toolbox options, streamlining unnecessary options\n2. Fix bugs in Mobi e-books that cannot display images (files that previously failed to display images need to delete folders unzipped from Mobi)\n3. Open links via Scheme and 'Open in Alook' default open in new tab\n4. For viewing the big picture interface, if the picture is small, reduce the initial magnification and reduce distortion\n5. Fix page turning bug when e-book reader text is selected\n6. Long press still works even if forward button is not available\n7. Exit App Reset Control Center Playback Information\n8. Privacy mode also saves tags, consistent with Safari\n9. Fix page duplication bugs when eBook reader clicks and slides toggle\n10. Fix the bug that the last line of the e-book reader was intercepted\n11. Menu - Send -1Password/LastPass/AvastPasswords without clicking twice\n12. Search records and search recommendation combing:\n    a. Click on direct search\n    b. Long press to delete and fill in the input box for the search record\n    c. Long press fill input box for search recommendations\n13. Other optimizations and bug fixes"},{"version_id":"826760361","version_name":"4.0","version_date":"2018-04-27 22:52:47.000 +0800","version_description":"1. Perfectly adapt to iOS 11 Files (Note: In order to adapt, it may lead to the loss of some e-book reading records, forgive me ~)\n2. Supports iTunes file sharing from your computer\n3. New Toolbox - View Page Source Code\n4. Touch ID / Face ID is not verified before the mask home content\n5. Add ‘Duplicate’ option to file management, copy one file copy\n6. Long press shortcuts add the \"none\" and \"scroll to bottom\" options\n7. Support web page click copy\n8. File management preview file supports printing, txt and pdf click tips to select system preview and reader open\n9. Click on the top of the address bar to select the text, click again to quickly copy and manipulate\n10. Other optimizations and bug fixes"},{"version_id":"826889181","version_name":"4.1","version_date":"2018-05-13 22:20:42.000 +0800","version_description":"1. Continue to optimize App size and startup speed.Smaller! Faster!\n2. Face ID / Touch ID privacy optimization\n3. Big Bang selected text\n4. Long video full screen optimization\n5. Solve the experience bug of clicking the page link page\n6. Fix the bug of adjusting webpage font and entering the website\n7. Remove 0.3x speed, add 1.7x speed\n8. Fix the bug that refreshes the data size after the data is cleared\n9. Clear the history after the repair exits and clear the unclean bugs\n10. Long press the button to add 'Certificate button', long press to add new playback speed, new label and close current label\n11. Fixed bugs such as Twitter, starting point and other night mode icons being magnified\n12. New Settings - General - Custom Settings - Search Interface matches bookmarks and history options to remove the original matching bookmark option\n13. When the home page back button no longer switches navigation page, Home button to switch navigation page delay longer\n14. Watch the video is to open the e-book reader automatically downwards offset\n15. Resolve some website's mis-blocking bugs\n16. Fix bugs such as Twitter, starting point and other night mode icons being magnified\n17. Viewing Pictures Long Press to Quickly Copy and Save Albums\n18. More optimizations and bug fixes"},{"version_id":"827135356","version_name":"4.2","version_date":"2018-05-25 08:05:34.000 +0800","version_description":"Click on the green shield to config the website (video floating, text-only, intrusive ads, JavaScript, clipboard and ad blocking rules)\n1. New single loop for audio/video playback\n2. Optimize live video experience\n3. Fix pixiv.net and other website image download failure bug\n4. Continue to optimize the App size, reduce 100KB\n5. Fix some audio cannot be floating play bug\n6. Attempt to fix bugs in control center playing control\n7. Support search ad blocking rules\n8. Fix bugs some sites can't copy\n9. Navigation page can be removed in Settings - General Settings - Custom\n10. Optimize the loading speed of reading mode smart episodes under non-Wi-Fi networks\n11. Read mode smart page next page for notification, leave and other small chapters can still be loaded out\n12. Set the FAQ button in the upper left corner\n13. Fixed a bug where some devices could not return to the home page\n14. Fix Baidu search unlimited refresh bug\n15. The video playback is increased by sliding off: the top small window slides up and down, and the small window with the bottom corner slides right.\n16. Add a new custom “background mask interface” to protect user privacy. This option is enabled by default.\n17. Restrictions on not moving the top and bottom bars when loading\n18. Fix Baijiahao image error interception bug\n19. Fix Alook back from the background to read mode failure bug\n20. Add more built-in search engines: WeChat, Weibo, Encyclopedia, Baidu pictures, Zhihu, Douban, maps, etc.\n21. The video in the lower right corner of the window to play double-click to restore"},{"version_id":"827289916","version_name":"4.3","version_date":"2018-06-01 03:59:06.000 +0800","version_description":"1. Add Tour for main features\n2. Fix Weibo Beta image cannot save bug\n3. Video on iPhone now supports rotation into full screen\n4. Fix bugs for downloading error for some network disks\n5. Fixed a bug that some fiction websites could not enter reading mode\n6. iPad version of the video suspension can be dragged directly by holding down the upper part\n7. The toolbar is not displayed when the video hovering cache\n8. After the full screen mode enters full screen, click the bottom to display the toolbar\n9. E-book reader fixes partial Txt decoding failure bug\n10. From the copy reminder you can go directly to the website settings, prohibiting the website from accessing the clipboard\n11. Long-press the picture to add the save to album option"},{"version_id":"827386436","version_name":"5.0","version_date":"2018-06-08 01:30:59.000 +0800","version_description":"1. New app icon and iOS 10.3 above system support in settings - general - custom choose green, blue, yellow, black and watermelon red 5 solid color icons\n2. Video floating gesture update: Two-finger click to modify to switch the video zoom mode, for non-full-screen video can zoom in and fill the screen\n3. Update custom UA to the latest version, solve github version issues\n4. Fixed some bugs in the identification of GBK codes in some txt files\n5. File View Optimization, Find, Edit, and select file encoding\n6. Support for creating new blank documents and editing\n7. Library shows longer book name\n8. Fix night mode from web page Back to home page, home page background white bug\n10. Intercepting Jumps from Baidu Search to B Station and Iqiyi\n11. New Settings - General Settings - Custom - Special Settings: Night Mode White Status Bar, iPhone tab navigation bar, Back Close current tab\n13. The new collection URL can be quickly edited later, remove the collection need to confirm\n14. Other bug fixes and improvements"},{"version_id":"827466042","version_name":"5.1","version_date":"2018-06-13 04:55:04.000 +0800","version_description":"1. Optimize the tab switch page for one-handed operation experience\n2. Reading mode smart page support preload, do not have to slide to the bottom and wait for the next page to load\n3. Full-screen video playback fits iPhone X's safe area\n4. Added locking function for video playback to prevent inadvertent touch\n5. Add new settings - audio/video settings - shortcuts, you can view the video playback shortcuts\n6. Tour optimization,  you can restart the tour from the Settings - About - Show Tour\n7. New long press action to switch to the next tab\n8. Add special settings - Forward Button Prefer Forward Page\n9. Bookmark editor supports select all / deselect all\n10. Fix bugs in getting website icons\n11. Solve the problem of advertising blocking by knowing long-term punctuation\n12. Other optimizations and bug fixes"},{"version_id":"827528475","version_name":"5.2","version_date":"2018-06-22 06:53:36.000 +0800","version_description":"1. Optimize tab switch view, iPhone X tabs rounded.\n2. Bookmarks support quick move to home page.\n3. Multiple requests for opening the app under the same domain name that has been blocked only alert once.\n4. New Settings - General - Custom - Disable website access to clipboard\n5. Settings refactoring, some of the less common options move to custom settings and special settings\n6. Fix the bug that the night mode picture is too bright\n7. Long press custom action add Refresh action\n8. Support for setting up a website as a homepage\n9. Fixed part of the site closed video floating, bug still floating bug\n10. Support download audio/video playback automatically play next\n11. Privacy related settings integrated into settings - General - Privacy Settings\n12. How long it takes to enter the background after the Touch ID/Face ID authentication is turned on requires verification, such as immediate, 5 minutes, etc.\n13. Added Settings - Reader Mode - Enhanced Reading Mode, reduced reading mode detection standards, support for more sites to enter reading mode\n14. Other optimizations and bug fixes"},{"version_id":"827628171","version_name":"5.3","version_date":"2018-06-29 05:35:50.000 +0800","version_description":"We need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards.\n1. New Settings - General - Custom - Forward Rewind does not re-render, resolving back white screen feels reloading bug. ! Note: This option on iOS 11 is known to cause content that is fixed at the bottom not to be displayed. You need to scroll up to display it.\n2. Fix language shows wrong bug\n3. Add Czech Support. Thanks to Jakub Kučera~\n4. Fixed a bug that failed to send pictures to third-party app.\n5. Fix iOS 11 download file sharing to third party apps  failed bugs.\n6. New Settings - General - Home Settings - Center Search Bar, iPad is On by default\n7. The bookmark interface records the last opened folder.\n8. Fix the bug that the new tab page does not open the site home page after the site home page is set up.\n9. New Settings - General - Custom - Special Settings: Private Browsing White Theme, switch to private browsing, the top bar remains white theme.\n10. Fix the bug that the tab switch view still rotates after the screen is locked.\n11. The search interface can be quickly pulled down or pulled over a certain distance to exit the search at the top of the list\n12. Other optimizations and bug fixes"},{"version_id":"827721934","version_name":"5.4","version_date":"2018-07-07 01:35:29.000 +0800","version_description":"We need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards.\n1. Added Korean, French, Spanish, Italian, Persian, Czech support\n2. iPhone special settings - exchange home button and label button location\n3. Add special settings - 3D Touch preview opens in a new tab\n4. iPad add full screen mode support, closes full screen mode, the top address bar does not slide with the page\n5. Block Baidu cloud and B station jump client\n6. Fix the URL home page setting, there is no http:// and https:// at the beginning, load a blank bug\n7. Fix bugs that directly exit the app from the e-book reader, which may result in loss of reading progress.\n8. Add Menu - Toolbox - Developer Tools - Firebug Lite and incorporate the original view source code into the developer tools\n9. Fix the bug that the search input interface is zoomed from the top left corner.\n10. Other optimizations and bug fixes"},{"version_id":"827799332","version_name":"5.5","version_date":"2018-07-11 04:45:01.000 +0800","version_description":"We need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards.\n1. Fix the bug that the homepage of zhihu.com  blank\n2. Fixes can't click the bug at the bottom of 10.3 system after turning \"Back and Forward Not Rendering\"\n3. Fix some websites that the night mode picture is still highlighted.\n4. Support importing fonts for e-books: Click on any font from the Files, and confirm.Then you can find the corresponding font in the e-book reader settings-font after exporting.\n5. Long press the tab navigation bar item to quickly close the tab, close other tabs, close the tab on the right, move the sort and enter the website settings\n6. The label selection interface can be long pressed to close other labels, close the right label, close all labels and move sort\n7. Fix iPad open full screen mode, top blank bug"},{"version_id":"827838254","version_name":"5.6","version_date":"2018-07-23 07:37:28.000 +0800","version_description":"We need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards.\nImportant:\n1. In the new version, the action of create new tab on the iPhone is consistent with Safari. By default, the website allows the website to open the link in the new tab, and the back button can quickly close the current tab back to the parent tab.\n2. Forward Button Prefer Forward Page -> Forward Button Prefer Next Page. Now the default forward button is to open the forward page. If you want to keep the previous version, you can open \"Settings > Custom Settings > Forward Button Prefer Next Page\"\n\nOthers:\n1. Long-press option optimization, remove unnecessary options, move the big bang of the link title to \"more...\", and add \"search by image\" function\n2. Tour optimization, remove common issues and navigation options\n3. Fix the bug that recoding history in reader mode in private browsing\n4. Fixed a bug where some websites caused sliding back due to \"swipe back anywhere\",. While fixing this issue, some sites need to slide back from the left edge.\n5. Consistent with Safari: Click on the top. If the toolbar is collapsed, the toolbar will be displayed first. Click again to return to the top.\n6. Expand the tab close button click range\n7. Fix the bug that the bottom progress bar and the system operation bar are too close when playing full screen on iPhone X.\n8. Settings optimization. Move homepage settings, privacy settings and custom settings to the first level of settings\n9. When the single picture is displayed, the download bar is not displayed at the top, and you can press and hold to perform the picture operation.\n10. Improve Touch ID/Face ID verification:\n        a. Cover video suspension correctly\n        b. Fix bugs that skip verification directly after multiple verification failures\n        c. Fix bugs that can't be blocked after rotating the screen\n11. For the live broadcast or some videos that have not been obtained in length, you can't drag the progress. After dragging the progress, the length of the video that failed to obtain partial length can be displayed correctly.\n12. Add an animation to open in new tab and open in background.\n13. Try to fix the bug that the tab is closed and the video is still playing.\n14. Remove the three options: remove the priority current tab open request; back off the tab, 3D Touch opens in a new tab.\n15. Fixing New Tabs Opening Links May Be Unloaded\n16. Fix a bug that a*gle.com video can't play.\n17. The forward button first opens the previous page -> the forward button gives priority to the next page. Now the default forward button is to open the previous page. If you want to keep the previous version, you can open \"Settings > Custom Settings > Forward button to open the next page first\"\n18. * Try to fix the bug that the Control Center playlist is occupied\n19. Fixed a bug in the local video full-screen playback status bar.\n20. Fix local play video Auto play next cause card bug\n21. Fix the flashback bug that may be caused by restarting the download on iOS 12.\n22. Other bug fixes and many other optimizations"},{"version_id":"828077707","version_name":"5.7","version_date":"2018-08-06 01:22:10.000 +0800","version_description":"We need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards.\n1. Fix the bug that the local video plays the next title garbled\n2. Local video if only one video is not replayed by default\n3. Fix the iPhone horizontal screen playback video, the second failed playback bug\n4. New Settings - Custom Settings - Special Settings - Prefer Current Tab Open Link\n5. New Settings - Custom Settings - Select the location where 3D Touch opens the link in the Special Settings: Current Tab, New Tab or Background Tab\n6. When the file management interface starts editing, the top left corner will be fully selected/deselected, and the send will be moved to the bottom column and away from the delete button to reduce misoperation.\n7.eBook reader fixes bugs in the bottom text being intercepted\n8. E-book reader settings add new quick recovery default settings option\n9. When the e-book selects the font, the built-in Chinese font will be displayed in Chinese at the top of the system.\n10. Fix the long press to close all the tags and the video continues to play.\n11. Other optimizations and bug fixes"},{"version_id":"828127446","version_name":"5.8","version_date":"2018-08-11 00:01:46.000 +0800","version_description":"1. Update the icon inside the app\n2. Fix bugs in AcFun and Google Drive video playback\n3. Fix bugs in some websites such as QQ music that can't pop up the window.\n4. iPhone X local video auto hides the indicator\n5. Night mode optimization, blackening and link changes are obvious\n6. It is easier to slide the tabs left and right to close the tabs.\n7. Fix some webpage long presses without the \"More...\" option, which can't copy and big bang text bugs\n8. Other optimizations and bug fixes\n\nWe need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards."},{"version_id":"828194308","version_name":"5.9","version_date":"2018-08-17 06:34:34.000 +0800","version_description":"1. Fix bugs in the download management to view a large number of images that may cause crash\n2. Fix the bug of sort by name with number, 10 should under 02.\n3. Reduce night mode text brightness.\n4. Bookmark icon edit can view the current icon link.\n5. Modify the default value of the optional Android User-Agent to fix the bug that Youtube can't play after selecting Android User-Agent .\n6. Gallery mode optimization: photo fade to show; fix the bug that photo may not show.\n7. * During video playback, if the video link in the webpage is updated, the blue play button in the lower right corner displays the red dot to indicate that there is a new unplayed. \n8. Save the long screenshot to the secondary directory to avoid the main image directory from being stuck due to too many long screenshots.\n9. File management records the last selected sorting method.\n10. Video Floating Optimize: unplugs the headset to pause playback; call/dial auto pause\n11. Fix bugs in Mobi and EPub e-book file new line errors\n12. Fix the bug that the video playback slides fast forward and the progress is wrong.\n13. Other optimizations and bug fixes.\n\nWe need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards."},{"version_id":"828276823","version_name":"6.0","version_date":"2018-08-23 09:22:42.000 +0800","version_description":"iPad adaptation:\n1. Perfectly fits the iPad split screen mode, and can play the video correctly in full screen in any split screen mode.\n2. Supports automatic switching to iPhone User-Agent in iPad split mode:  Settings -> Custom Settings -> Use iPhone Agent in Split Screen Mode\n3. iPad adapts iOS 11 drag and drop operation:\n• Support dragging “links” from other apps to open within Alook\n• Support dragging “text” from other apps into Alook for search, translation and big bang\n• Support drag and drop “files” from other apps into Alook file management\n• Support dragging links, texts, images, files from other files into other apps\n4. iPad play video rotation screen will not reload video\n\nOther updates:\n1. Fix bug that noise  in video floating play\n2. Double-click the left side of the video hover to back 1s; double-click the middle pause; double-click the right side to advance 1s. Quickly solve the problem that the sound and picture are not synchronized or muted during the acceleration process.\n3. Fix the bug that swiping fast forward and rewind during video playback may cause a restart\n4. Other optimizations and bug fixes"},{"version_id":"828340280","version_name":"6.1","version_date":"2018-08-31 03:24:24.000 +0800","version_description":"1. Fix the bug that the iPhone can't pause the video when double-clicking in the full screen state, and zoom out the double-click forward/backward 1s range.\n2. * Fix a bug in the webpage that has an input box or a selection box that clicks once and then pops up for no reason.\n3. Pop-ups are blocked by default, and the Settings - Common Settings - Block pop-ups option is added. If you encounter a normal function of the website, you need to use pop-ups to turn off this option within the settings.\n4. Optimize the number of tabs to display\n5. Video playback restores the option of \"two-finger click\" to make the video fill the screen\n6. Drag and drop files to file management to the top of the file list\n7. Block intrusive ad optimization to reduce false blocking\n8. Night mode display optimization\n9. Other optimizations and bug fixes\n\nWe need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards."},{"version_id":"828424438","version_name":"6.2","version_date":"2018-09-04 01:40:44.000 +0800","version_description":"1. Optimize Weibo, Baidu Cloud and Youtube video playback\n2. Fix a bug that may cause a crash\n3. Press and hold the New tab to keep the current tab status. If it is currently a Desktop version, the new tab is also a Desktop version.\n4. Intercept jump to Youtube and Reddit app\n5. Other optimizations and bug fixes"},{"version_id":"828458891","version_name":"6.3","version_date":"2018-09-14 08:07:17.000 +0800","version_description":"1. Added JavaScript extension system which support active extension (manual click-to-run) and passive extension (matching domain name or URL to run).\nJS extension settings location: Settings - Custom Settings - JavaScript Extensions.\nActive Extension  Entrance: 1. Click on the green upper shield in the upper left corner - Active Extension 2. Customize a long press shortcut in Settings - General - Long press custom.\nSupported formats: a. JavaScript code b. Safari javascript: beginning  bookmark code.\n\nNote: Alook does not support Tampermonkey scripts at this time, and is not sure whether it can be supported in the future; Alook does not provide extension store; the extension runs on web pages, supports Html 5 standard interfaces, and does not support access to iOS system interfaces.\n\n2. Add Menu - Toolbox - Developer Tools - vConsole\n3. Fix link without copy without http / https top search for quick access failure bug\n4. Fix bug that may crash after Face ID / Touch ID verification is enabled\n5. Gallery mode image loading optimization, reduce memory usage\n6. Optimize reading mode performance\n7. Other optimizations and bug fixes\n\nWe need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards."},{"version_id":"828588592","version_name":"6.4","version_date":"2018-09-20 04:56:02.000 +0800","version_description":"1. Adapt to iOS 12\n2. Video playback adds AirPlay support, please ensure that it is connected to the same network as AirPlay-enabled TV or other devices.\n3. Reading mode new setting font: setting - reading mode - font\n4. Fix the bug that video full screen back to the home page and then come back and may not be able to close\n5. Fix some big webpages may have white blocks bug\n6. Fix the bug that desktop Youtube can't play.\n7. Night mode optimization, reduce the brightness of the simulated page flip button in night mode, fix some website night mode flashing white screen bug\n8. Fix bug that if video can't get size, full screen is vertical screen\n9. Other bug fixes and optimizations\n\nWe need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards."},{"version_id":"828683064","version_name":"6.5","version_date":"2018-09-29 02:58:15.000 +0800","version_description":"1. Adapt iPhone XS Max\n2. Fix bugs that may lose tab and e-book reading records\n3. Fix bugs when sharing files to other apps failed\n4. Other bug fixes and improvements\nNote: Due to changes in the programming language interface, the background color of bookmarks without icons may change in the new version.You can long press the bookmark to edit the bookmark icon."},{"version_id":"828767024","version_name":"6.6","version_date":"2018-09-30 07:55:56.000 +0800","version_description":"Emergency fix for crash before iOS 9.3"},{"version_id":"828774917","version_name":"6.7","version_date":"2018-10-05 04:58:02.000 +0800","version_description":"• Fixed Baidu cloud batch download Zip file decompression failed bug\n• Optimize page long presses to fix bugs that may cause long presses during normal sliding\n• Wi-Fi transmission page does not lock screen\n• Expand the double side of the floating window and double-click the fast forward and rewind area\n• Optimize custom app icon color values, replace the previous black icon options with pure black (#000000), and add a dark gray option with the previous black color values.\n• Add Settings - Home Settings - Bookmark Rounding Settings\n• The time is displayed in the upper right corner of the e-book reader\n• Browser User-Agent settings record last custom User-Agent\n• When creating a new download, you can set the file name before downloading. After adding the download, you can directly view the download management.\n• Fixed a bug where some websites failed to slide.\n• Fix some website floating window to close the bug of still video suspension\n• Optimize night mode picture brightness\n• Fix the bug that the App stops after the Rar file fails to be decompressed.\n• Fix font size bugs in websites with sub-frames\n• Other optimizations and bug fixes"},{"version_id":"828826589","version_name":"6.8","version_date":"2018-10-12 04:50:56.000 +0800","version_description":"• Optimized app size, 300KB less than the previous version, shortening startup time\n• Fix QR code scan some images error bug\n• Fix bug where login verification failed on some sites\n• Fixed reading mode enhancements to get blank content on some web pages\n• Other bug fixes and optimizations"},{"version_id":"828965715","version_name":"6.9","version_date":"2018-10-20 11:33:35.000 +0800","version_description":"Browser\n• Fix a bug where some websites enter the white screen for the first time and need to be refreshed to display\n• iPad new settings - custom settings - Show Top Tabs even One Tab\nFiles\n• File management and downloaded support search, support for search highlighting\n• Fix bug that the search bar in night mode still be white\n• Record the user-selected sorting method\n• Optimized file management interface layout on 5/5s/se\n• Fix bugs in Zip decompression and compression garbled\nVideo playback\n• Ignore the playback request for the same link of the video being played\n• Fix a bug in live broadcast\nLocalization\n• New Vietnamese Language\n• Russian Optimization\n\nOther optimizations and bug fixes."},{"version_id":"829001621","version_name":"7.0","version_date":"2018-10-26 02:14:28.000 +0800","version_description":"• JavaScript extensions support iCloud sync\n• JS passive extension supports local disable. Synchronize content on different devices, but you can enable different extensions on different devices.\n• Fixed a bug where setting no image mode for a single site would cause other pages to have no images\n• File Management file move selection directory can be searched\n• Menu - Toolbox - Developer Tools Firebug Lite and vConsole are fully improved, each site is automatically enabled after opening, manually click to stop\n• Select text in the browser to open the link directly if it is a link, or search if it is text\n• Modify browser open, search and translate opening in new tab instead of pop-ups\n• The green small shield in the upper left corner clicks on the menu and replaces the original “copy link” with “Open in Safari”. For copying links, you can copy them by long-pressing the title bar, clicking on the title bar thickness selection, menu-send-copy, and so on.\n• Other optimizations and bug fixes"},{"version_id":"829076027","version_name":"7.1","version_date":"2018-11-01 22:37:54.000 +0800","version_description":"· Perfect fit for iPhone XS Max and iOS 12.1\n· Optimized app size back to 23MB, increase boot speed\n· New tabs also support swiping anywhere to the right to close the current tab back to the parent tab\n· Expand the top bar height on the iPad to be consistent with Safari\n· If you have disabled all shortcut searches from Settings - Search Engine and turned off shortcut input from Settings - Custom Settings - Special Settings, remove the Quick Search / Input field when searching\n· Other optimizations and bug fixes\nNote: Due to the change of the system Api, the color of the bookmark icon. If you prefer the color of the previous version, you can long press home icon - edit - click to edit icon- select the background color or set your favorite picture. \n\nWe need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards."},{"version_id":"829172590","version_name":"7.2","version_date":"2018-11-08 07:57:44.000 +0800","version_description":"• Adapter iPhone XS Max and iOS 12, while fixing iOS 9.2 and below system crash bug\n• Video hover optimization\n• Customize volume and brightness adjust view to reduce occlusion video \n• Add and optimize animations that enter and exit full screen\n• Two-finger tap to switch the tiling of the video to fill the screen\n• Website settings optimization:\n• Add Site Settings - Allow access, if disabled, do not allow access to this domain\n• Add Website Settings - Open the click link in the new tab. Enable this option to resolve the issue of returning to the previous page to refresh or return to the top.\n• Add Settings - Site Settings to facilitate management of site settings\n• Add Settings - Privacy Settings - Let the site not track me\n• Remove ‘Prefer Opening Link in Current Tab’ option as the new version can already click back or swipe back to close tab\n• Remove ‘Back Forward Not reRender’ option by Site Settings - open the link in the new tab to achieve the back is not refreshed\n• Other optimizations and bug fixes"},{"version_id":"829217939","version_name":"7.3","version_date":"2018-11-16 03:54:44.000 +0800","version_description":"• Video Floating optimization\n     • The more action button appears in the upper right corner after the video enters full screen\n     • New video size settings: 50% - 150%\n     • New video gravity: Default, Aspect Fill, Resize Fill\n     • New background playback option\n     • New AirPlay tutorials and more shortcut tips\n     • Remove background play, shortcuts and AirPlay screencast options from settings - video settings\n• Optimize new tabs and open  in the background animations\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS, and we keep the frequency of weekly update. For more information, please check the update history and app details.\n\nWe need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards."},{"version_id":"829315406","version_name":"7.4","version_date":"2018-11-30 06:03:20.000 +0800","version_description":"• Night mode optimization\n         • Decrease night mode default brightness\n         • Added pure black night mode option, which can be turned on in Settings - Custom Settings\n         • Fix bugs in partial page keyboard and input box white in night mode\n• 3D Touch page opens in the new tab and will not be reloaded.\n• For the problem that long URL link editing is not easy (such as to modify a parameter in the link), long press address bar / click on the address bar and then click on the selected text, select \"Edit\" in the pop-up menu, you can easily edit the link.\n· Fix the bug that scanning the QR code to switch to the front camera stuck\n• Fix bug that Custom Settings - Custom App Icon - Dark Gray Icon fails on iPad\n• Optimize top button& text display and click range\n• New reminder: for passive extension， if you need to match all domain names or links, please enter '*’\n• Optimize the JavaScript extension code editing experience. Fix bug where keyboard automatically disappears during editing\n• New Schemes (not case sensitive):\n         • Alook://QRCode scans the QR code\n         • Alook://Search starts searching\n         • Alook://Books opens the library\n         • Alook://Bookmarks opens bookmarks\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS, and we keep the frequency of weekly update. For more information, please check the update history and app details.\n\nWe need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards."},{"version_id":"829471414","version_name":"7.5","version_date":"2018-12-07 00:36:59.000 +0800","version_description":"• Fix bugs where big images are slow to browse and may crash\n• Gallery mode GIF supports pause/play\n• Fix bug that some websites fail to open links in new tabs after setting\n• New settings to open url in background tab while 3D Touch preview at Settings - Custom Settings - Special Settings\n• Click/long press on the top address bar to display the edit option. If the editable content is empty and the current clipboard has content, edit the clipboard contents\n• Fixed bug that the control interface does not automatically disappear after the player has selected the speed\n• Fix bugs that may flash white background when night mode 3D Touch preview starts\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS, and we keep the frequency of weekly update. For more information, please check the update history and app details."},{"version_id":"829556836","version_name":"7.6","version_date":"2018-12-13 12:55:40.000 +0800","version_description":"• Optimize tab switching / creating experience\n     • Fix the problem of delay by clicking the tab switch button on iOS 12.\n     • Accelerate the process of creating new tab\n     • New tab page thumbnails display home page by default instead of blank\n• Fixing bug of delay after click on a web link to create a new tab\n• Reduce tab memory usage and optimize tab performance\n• Fixed  bug that not record bookmark order after resorting in the bookmark folder\n• Fixed an issue where the input text in the address bar was recognized as a link which end with  \".\"\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS, and we keep the frequency of weekly update. For more information, please check the update history and app details."},{"version_id":"829628728","version_name":"7.7","version_date":"2018-12-15 04:58:45.000 +0800","version_description":"• Fix bug that some websites failed to download PDF\n• Fix bug that swipe right back gesture and the slide up and down gesture may conflict\n\nAlook aim to be the best browser for iOS, and we keep the frequency of weekly update. For more information, please check the update history and app details."},{"version_id":"829658074","version_name":"7.8","version_date":"2018-12-20 23:38:21.000 +0800","version_description":"• Optimize forward and backward without refreshing the experience. If you encounter a website that returns to different position after return (such as Sina homepage) or back to the top (such as the South Taihu Forum), welcome feedback\n• Fix bug that YouTube click back to the homepage after switching to the PC version\n• Fix bug that video frame change after enter background\n• iPad new keyboard shortcuts (long press the keyboard Command button to view all shortcuts): Ctrl+forward key video fast forward 5s; Ctrl+back key video backward 5s; Ctrl+space key video play/pause\n• Adjust the control center audio and video forward/backward time to 15s\n• Restore Settings - Video Settings - Background Playback Options\n• Document in files full screen display on iPad\n• iPad expands the secondary interface display range\n• Fixed some bugs in http link recognition failure (such as Tencent Sports)\n• Fix some websites set up bugs that are not allowed to access but will still open\n• Improved website settings - Open Link in New Tab, fix some websites may open 2 tabs at a time\n• Fix bug that .doc files could not be downloaded\n• Correctly update the top bar height before and after the hotspot switch/telephone answer/map navigation switch\n\nAlook aim to be the best browser for iOS, and we keep the frequency of weekly update. For more information, please check the update history and app details.\n\nWe need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards."},{"version_id":"829759673","version_name":"7.9","version_date":"2019-01-03 09:36:07.000 +0800","version_description":"• Fix the bug that the forward button open the next page without \"Priority Next Page\" turned on\n• Library added search function\n• Fixed a bug that the \"Sword Art Online.epub\" e-book parsing failed\n• On the iPad, Alt+Space is used for video playback/pause for the Control+Space shortcut is occupied by the switch input method\n• Adjust the long press of the tabs button on the iPhone to make the creation of new tabs convenient\n• New “Developer Tools” in the Menu - Toolbox- Eruda\n• Settings - General Settings - New Long press shortcuts: Add bookmarks, in-page search, developer tools and website settings\n• The long press operation of returning to the home button is changed from “translation” to “toolbox”. If you need to restore, please go to Settings - Common Settings - Long press shortcut to modify\n• File management full screen display in landscape mode on iPhone\n• Fixed the bug that in system version above iOS11 file management:settings, view mode, etc that he page does not follow the system rotation\n• Provides an attempt to play options for Mp4 files that are not supported by iOS systems\n• New Settings - Video Settings - Play the next item automatically(only works within file management)\n• Fix bugs that may continually retry after Touch ID / Face ID verification fails\n• Fixed a bug in Baidu search that popped up multiple identical tabs\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS, and we keep the frequency of weekly update. For more information, please check the update history and app details."},{"version_id":"829824998","version_name":"8.0","version_date":"2019-01-13 13:27:14.000 +0800","version_description":"• Add Settings - Home Settings - Home Wallpaper Options, you can change the home page wallpaper\n• Fix download problems for OneDrive, Micro Cloud, Wanfang Data, Weifeng, etc.\n• Fix Google Drive video playback failure bug\n• Fix Toolbox - Full Page Screenshot top black box bug\n• Clear all tabs button is added in the upper right corner of the tab switching page on the iPhone. The recommended clear operation is long press the tab switching button, click the pop-up close all tabs option.\n• Fixed a bug where Baidu search clicks might jump a blank tab\n• Forward button: The default long press operation is changed from the display history to display the “forward and backward list” of the current tab. If you need to change to history you can set it in Settings - General Settings - Long Press Shortcut.\n• Add Settings - Search Engine - Search Suggestions option, optionally turn off search suggestions\n• Add Settings - Privacy Settings - Clear Private Tabs On Exit\n• iPad supports hiding the top tab bar: Settings - Custom Settings - Show Tab Navigation Bar\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS, and we keep the frequency of weekly update. For more information, please check the update history and app details."},{"version_id":"829947916","version_name":"8.1","version_date":"2019-01-29 03:11:53.000 +0800","version_description":"• Settings - Custom Settings - Site Settings to manually create new site setting\n• Settings - Custom Settings - Site Settings allow you to modify the domain name and title\n• Settings  - General - Long Press Shortcuts add option to access JS extensions\n• For settings such as general settings, video settings, etc., add the “Done” close button in the upper right corner to directly close the settings.\n• Fixed bug that the clear tab button and the top status bar overlapped at the top of the iPhone before iOS 11 system. Note: The recommended way to clear all tabs is to long press the tab selection button and click the “Close All” option that pops up.\n• iPhone horizontal screen tab view hide clear tab button\n• Long press marked ads can now  modify domain names and titles within settings\n• Fixed bug that the new download popup was misplaced under the iPhone landscape\n• Fixed bug that may not be recovered after the drop-down  to the lower right corner during audio floating playback\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS, and we keep the frequency of weekly update. For more information, please check the update history and app details."},{"version_id":"830177214","version_name":"8.2","version_date":"2019-02-05 12:28:32.000 +0800","version_description":"• Adjust the 3D Touch Alook icon menu order : Search - Scan QR Code - New Download - Library\n• Adjust the long-press tab switch button operation menu order : Close All Tabs - Close Current Tab - New Private Tab - New Tab\n• Long press tab switch button (private browsing) add new option: Close All and Exit Private\n• Optimize tab switching: last normal/private tab is automatically selected and scrolling to\n• Fixed bug that bookmarks view may be blank\n• Restore Settings - Custom Settings - Special Settings - Prefer Opening Link in Current Tab\n• For non-English users to subscribe to the English Lite adblock plus rule by default. You can unsubscribe from Settings - Ad Block - Adblock Plus\n• Fixed bug that iPhone video hovering box dragging up and down to inadvertently close\n• Fixed bug that the tab switch page repeatedly click the clear tabs button cause crash\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS, and we keep the frequency of weekly update. For more information, please check the update history and app details.\n\nWe need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards."},{"version_id":"830208576","version_name":"8.3","version_date":"2019-02-15 04:35:52.000 +0800","version_description":"• Optimize the tab swipe close animation\n• Google searched out gif disable video floating\n• Fix night mode Google search image does not show bug\n• Fixed bug that after playing video the webpage become slow scroll on Twitter\n• Long press the tab switch button restore the “Close All Except This\" option on iPad\n• Long press on the top address bar to display “Paste and Go” or “Paste and Search”\n• Click on the top bar to display “Paste and Go” or “Paste and Search”\n• Mobile User-Agent options added: Windows Phone, Symbian & BlackBerry\n• Desktop User-Agent options added: Firefox, IE 6, IE 11 options\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS, and we keep the frequency of weekly update. For more information, please check the update history and app details.\n\nWe need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards."},{"version_id":"830358816","version_name":"8.4","version_date":"2019-02-25 22:44:56.000 +0800","version_description":"• Add  Menu - Toolbox - Search in Site: Search for the specified keyword in the current website with the default search engine\n• Add Settings - Custom Settings - Webpage Green Background\n• Fixed bug that the bottom indicator is not hidden while playing video in fullscreen on New iPad Pro\n• Fixed bug that in some websites that frequently pop up long press menus\n• E-book reader adds “Dark Gray\" background option to optimize nighttime reading experience\n• Fixed bug where no search history still shows clear search history button and blank line\n• Fixed bug that the background is still black after switching from night mode to day mode and needs to be refreshed to work.\n• Untitled jump pages will not be added to the history\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS, and we keep the frequency of weekly update. For more information, please check the update history and app details.\n\nWe need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards."},{"version_id":"830498362","version_name":"8.5","version_date":"2019-03-06 10:35:03.000 +0800","version_description":"• Fixed bug that video floating plays black screen in some websites\n• Fixed bug that video floating window can not be closed by drag up after turn off the Pull Down to Shrink option\n• Show new option Wallpaper Mask Alpha after settings the homepage wallpaper\n• Settings - Home Settings - Wallpaper Status Bar for choosing light or black status bar after settings the homepage wallpaper\n• New Settings - Homepage Settings - Restore Defaults. \n• The eBook reader does not display time by default. You can enable it in settings.\n• eBook reader display time move to bottom center\n• Fixed bug where some websites flash after the green background of the webpage is opened.\n• Optimize web page reading mode algorithms to fit more websites\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details.\n\nWe need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards."},{"version_id":"830521919","version_name":"8.6","version_date":"2019-03-07 21:09:44.000 +0800","version_description":"• Fix bug in homepage wallpaper mask transparency record error.\n• You can set the home icon and text color after setting the wallpaper on the home page, and the white wallpaper can set the icon and text to black.\n• Fix bug SVG webpage icon become large in night mode.\n• File Management New/Edit file move the Cancel and Save buttons to the top to prevent loss and forget to save after compilation.\n• Optimize the menu pop-up animation experience on the iPad.\n• Fix an animation error when deleting the last tab after setting the wallpaper on the home page.\n• Other optimizations and bug fixes.\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details.\n\nWe need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards."},{"version_id":"830661101","version_name":"8.7","version_date":"2019-03-21 03:51:53.000 +0800","version_description":"• E-book reader support medium bold font\n• E-book reader support side margin on iPad\n• Fixed bug where pdf is turned incorrectly after page turning\n• Fixed bug that private browsing top color error after selecting white wallpaper \n• Fix bug where page may be white after page turning in night mode\n• Download completed page to support all selections and deselect all\n• Show links in the top address bar if the site has no title\n• Optimize website icon acquisition to fit more websites (eg shudan.red)\n• Translation optimization and improvement\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details.\n\nWe need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards."},{"version_id":"830743530","version_name":"8.8","version_date":"2019-03-29 08:53:27.000 +0800","version_description":"• iPad video floating support picture-in-picture\n• Reading mode and e-book reader support kraft background\n• Fixed bug that long pressed pop up 2 menus on iOS 12.2 \n• Fixed bug that the refresh/scan QR code button is dark after setting home wallpaper\n• Fix file management search for uppercase file name matching failures\n• Page turning percentage offers more options\n• Optimize the right margin of the eBook reader\n• Privacy optimization\n     • Bookmarks and history are not displayed at the beginning of the search\n     • Matching bookmarks and history are enabled by default when searching, you can turn off in Settings - Privacy settings\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details.\n\nWe need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards."},{"version_id":"830789383","version_name":"8.9","version_date":"2019-04-06 01:17:29.000 +0800","version_description":"• Fixed bug where the picture-in-picture playback video on the iPad could not be played after it paused.\n• Support for data: format links and base64 format image links\n• New Settings - Custom Settings - Automatically detect data options within web pages. Automatically detect links, phone numbers, flight numbers, addresses, calendar events, etc. on the web page so that they can be clicked directly.\n• Fixed bug where some websites on the iPad failed to play video.\n• Fixed bug where some videos could not be full screen in non-video suspension mode on iPad\n• Bookmarks and history are displayed when the search starts, and can be disable at Settings - Privacy Settings - Show History on Search Start\n• Match bookmarks and history when searching, can be disable at Settings - Privacy Settings - Match History When Searching\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details.\n\nWe need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards."},{"version_id":"830932646","version_name":"9.0","version_date":"2019-04-22 23:07:09.000 +0800","version_description":"• File Management supports play and import of images, videos and audios in photo library\n• Web page images and album import supports long press to select\n• Fixed bug that could not continue to play automatically after switching between other apps to play audio during playback of audio and video\n• Online video can be easily transferred from Alook to APlayer: Click on Video Floating Share - Popup Menu - Open in APlayer\n• Fixed bug where the phone unlocked and Alook might get stuck after opening the face ID\n• Optimize the initial playback position of the video on the iPad without obscuring the top tab bar\n• Automatically pin files to top uploaded via Wi-Fi transmission\n• Fixed bug where the Alook search was opened via Scheme and the operation failed if there was a newline character\n• Other optimizations and bug fixes\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details\n\nWe need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards."},{"version_id":"831135937","version_name":"9.1","version_date":"2019-05-03 08:28:53.000 +0800","version_description":"• Upgrade to the Swift 5 development language\n         • iOS 12.2 and above system App size is reduced to 16MB\n         • iOS 12.2 and above system startup time is less than 300 milliseconds (iPhone 7 Plus system iOS 12.2 test data)\n• File Management adds support for decompressing 7Z encrypted files. Full support for Zip, Rar, 7Z.\n• Record the progress of the previous online video playback, exit re-entry or re-play automatic resume\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details.\n\nWe need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards."},{"version_id":"831182750","version_name":"9.2","version_date":"2019-05-20 02:38:59.000 +0800","version_description":"• Home page supports drop-down search\n• Add Menu - Toolbox - Enter full screen, make the page cover the entire screen and hide the top status bar, which is good for maps, games, comics and more. (Long press the home button to quickly open the toolbox)\n• Night mode adds and defaults to the dark gray status bar, which can be changed to white and black from the Settings - Custom Settings - Night Mode status bar.\n• Fix bug with iOS 12.2 3D Touch failure after upgrading Swift 5\n• Fixed bug that some encrypted 7Z files failed to decompress\n• 7z supports multi-thread decompression, making full use of multi-core\n• Remove the Menu - Toolbox - More... option. This option and the Menu-Share option are duplicated. If you need to print webpage, create PDF, 1Password fill password and other functions, please click the Menu - Share options\n• Optional to retain transparency when editing the home site icon\n• Fixed bug that in batch file deletion that may be stuck in file management\n• Fixed bug that doesn't work after disabling the site's JavaScript script\n• Long press popup add new option：Copy Link Text\n• Fixed bug that could double the amount of traffic when manually adding a download\n• Search interface drop down to exit search\n• Fixed bug that switched the night/day mode centered search bar may not change\n• Provide more font size options\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details.\n\nWe need your help to translate Alook into your language. If you are glad to help please contact us at hfutld@yeah.net. Best Regards."},{"version_id":"831379724","version_name":"9.3","version_date":"2019-05-31 07:38:01.000 +0800","version_description":"• iPad full screen mode slide hidden tab bar\n• Gallery mode supports automatic loading of images in the next page\n• Add Menu - Toolbox - Screen Always On (long press the Home button to quickly open the Toolbox)\n• After manually entering full screen mode, replace the floating button with the click of the bottom toolbar.\n• Fixed bug that in some website image download failures\n• Fix some websites returning the previous page image to stop loading bugs\n• iPad excellent exchange home button and label switch button position\n• Fixed bug where 192.168.0.1:8080 failed to open.\n• Only one bottom reminder is displayed once the user declines the page to jump to the third-party App and App Store\n• Fixed bug that left the gray side on the right side after entering the full screen video in night mode\n• Fixed bug where the final size may increase slightly after the cache is cleared.\n• Optimize reading mode auto page to support more websites\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"831523092","version_name":"9.4","version_date":"2019-06-06 23:14:34.000 +0800","version_description":"• Fixed bug where clicking the top status bar after entering the full screen state may not automatically pop up the address bar\n• Optimized pull-down to exit full-screen mode experience, easier to exit full screen\n• Reduce the range of pop-up menus after entering full screen to reduce misuse\n• In full screen mode, the detected video also automatically displays the shortcut button in the lower right corner.\n• Gallery mode preload image\n• Reading mode does not automatically enter full screen mode\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"831606106","version_name":"9.5","version_date":"2019-06-13 07:23:40.000 +0800","version_description":"• Fixed a bug where the toolbar at the bottom of the reading mode overlapped after setting the wallpaper.\n• Fixed a bug where the read mode button was not hidden when it was swiped after the top address bar was hidden.\n• Support for 7z compression, 7z compression support for compression level\n• Jump to Safari for mobileprovision description files\n• Added keyboard shortcuts Command+1-8 to select the corresponding order tab; Command+9 selects the last tab.\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"831689970","version_name":"9.6","version_date":"2019-06-19 20:58:18.000 +0800","version_description":"• iOS 13 adaptation:\n         • Fixed bug where the video failed full screen;\n         • Fixed bug where clicking the top status bar can't go back to the top\n         • Fixed bug that trigger long press popups\n         • Fixed bug where e-book readers could not enter full screen\n• Fixed bug that some videos cannot be switched in webpage\n• Fixed bug that turn off video floating may not work\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"831729755","version_name":"9.7","version_date":"2019-07-04 05:24:30.000 +0800","version_description":"• Adapt to the latest iOS system:\n         • Fixed bug in tab switching animation misplacement\n         • Fixed bug where turning page fail\n         • Fixe bug where auto-pager fail\n         • Fixed bug that pop up long press menus\n         • Fixed bookmark and custom search engine failed to select images\n• Fixed bug that after clearing the history, system shortcut search records still exists\n• New tab insertion position adjustment: new tab inserted after the current label\n• iPad also supports exchange of home button and tab switching button location: Settings - Custom Settings - Exchange Home and Tab Button Locations\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"832200246","version_name":"9.8","version_date":"2019-08-01 04:25:29.000 +0800","version_description":"• Adapt to iOS 12.4\n• Added Twitter and Github search engines\n• Fix bug on the latest system, video full screen slide adjustment progress will pop up the volume interface\n• Command+T shortcuts create new tags and go directly to the input state to be consistent with Safari\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"832443570","version_name":"9.9","version_date":"2019-09-09 01:23:12.000 +0800","version_description":"• Perfect fit for iOS 12.4.1\n• Fixed bug where the speed was lost after clicking pause in the picture-in-picture mode on the iPad\n• Automatically unlock control interface when exiting full screen\n• Fixed bug that double-click pause pop-up volume interface on the latest system\n• Fixed bug that on the latest system where the video is overwritten by the top status bar\n• Fixed bug that might show bookmark folder when trying to open the history interface\n• Videos below 60s do not store playback progress, fixed bug that after playing a short preview video of the website, the next preview jumps directly to the end.\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"832699408","version_name":"10.0","version_date":"2019-09-10 23:58:51.000 +0800","version_description":"· Perfect fit for iOS 12.4.1\n· Fixed bug that returning to Alook after jumping to a third-party app, right-sliding back may crash\n· Fixed bug where the speed was lost after clicking pause in the picture-in-picture mode on the iPad\n· Automatically unlock control interface when exiting full screen\n· Fixed bug that double-click pause pop-up volume interface on the latest system\n· Fixed bug that on the latest system where the video is overwritten by the top status bar\n· Fixed bug that might show bookmark folder when trying to open the history interface\n· Videos below 60s do not store playback progress, fixed bug that after playing a short preview video of the website, the next preview jumps directly to the end.\n· Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"832872801","version_name":"10.1","version_date":"2019-10-09 09:05:07.000 +0800","version_description":"If you are willing to help us improve your translation, please feel free to contact us. We will be very grateful for this.\n\n• Adapt to iOS 13 and Dark Mode\n• New Settings - Display Settings: iOS 13 and above optional follow-up system, light and dark mode, dark and light mode available for iOS 13 and below. \n(The night mode is different from the dark mode. The night mode is soft and dark gray for nighttime lighting. The dark mode is pure black for daytime and OLED browsing.)\n• Display network, time and battery information when iPhone video is full screen\n• Fix bugs on long-clicking on iOS 13\n• Long press pop-up window to add copy image option\n• When the bottom forward button changes to stop loading the button, the long press is the same as the normal forward button.\n• Fixed a bug where the webpage full page screenshot failed\n• Other optimizations and bug fixes\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"833090217","version_name":"10.2","version_date":"2019-10-25 09:20:12.000 +0800","version_description":"If you are willing to help us improve your translation, please feel free to contact us at hfutld@yeah.net. We will be very grateful for that.\n• Dark mode and night mode display optimization\n• Improve the video levitation switch to ensure that the video floating will not float after it is turned off\n• Fixed bug that in dark mode and night mode that may flash white and then darken\n• Fixed bug that video sites such as YouTube could not be played after the iPad version was switched to the PC version.\n• Fixed bug that in some web page reading mode detection failures\n• Fixed bug that third-party apps can't copy files to Alook\n• Fixed bug that the download file preview could not be displayed full screen\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"833436677","version_name":"10.3","version_date":"2019-11-03 07:17:55.000 +0800","version_description":"If you are willing to help us improve your translation, please feel free to contact us at hfutld@yeah.net. We will be very grateful for that.\n• Improve video floating loading video speed and start playing quickly\n• The current network speed is displayed in the video floating full screen mode (iPhone X or later iOS 13 or higher)\n• Fixed bug where the video still plays when you make a call\n• Fixed bug where the webpage full page screenshot failed\n• The video button appears with the video floating off: Play speed, full screen, copy link and video floating\n• Long press options add Share URL\n• Added “Resume Playback” button when switching to 4G network pause during video playback\n• Homepage, bookmarks, history and search interface adapts iOS 13 long press preview function\n• Settings - Display Settings - Add dark mode background color, optional black and dark gray\n• Optimize background tab screenshots\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"833447182","version_name":"10.4","version_date":"2019-11-06 12:45:50.000 +0800","version_description":"If you are willing to help us improve your translation, please feel free to contact us at hfutld@yeah.net. We will be very grateful for that.\n• Improve video floating loading video speed and start playing quickly\n• The current network speed is displayed in the video floating full screen mode (iPhone X or later iOS 13 or higher)\n• Fixed bug where the video still plays when you make a call\n• Fixed bug where the webpage full page screenshot failed\n• The video button appears with the video floating off: Play speed, full screen, copy link and video floating\n• Long press options add Share URL\n• Added “Resume Playback” button when switching to 4G network pause during video playback\n• Homepage, bookmarks, history and search interface adapts iOS 13 long press preview function\n• Settings - Display Settings - Add dark mode background color, optional black and dark gray\n• Optimize background tab screenshots\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"833493359","version_name":"10.5","version_date":"2019-11-15 06:36:21.000 +0800","version_description":"If you are willing to help us improve your translation, please feel free to contact us at hfutld@yeah.net. We will be very grateful for that.\n\n• Add animation feedback for double-clicking on both sides of the video floating to fast forward 1s\n• Video floating supports screenshots, quick copy, download or save to album\n• Video floating full screen mode shows that the network speed function works on all devices\n• Fixed bug where the webpage scrolled slowly after the iPad rotated the screen\n• Increase the height of the operating bar on the full screen iPhone for easy click\n• New option in user-agent settings: Open New Tab in Desktop\n• Fixed bug where some live broadcast sites turned off video hover playback failed\n• Fix bugs in video floating progress bar blurring\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"833616258","version_name":"10.6","version_date":"2019-12-16 06:49:28.000 +0800","version_description":"• Video floating to expand double click fast forward 1s click range\n• Add Naver search engine\n• Fixed bug that the video floating back to the background to continue playing after turning off the \"Background Play\" option for some videos\n• Fixed bug where the video floating quit full screen could cause the slider on the right side of the webpage to be misplaced\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"834025255","version_name":"10.7","version_date":"2019-12-17 09:17:46.000 +0800","version_description":"• Fixed bug that clicking on the left side of the top status bar below iOS 13 could not return to the previous App / navigation / phone\n• Video floating to expand double click fast forward 1s click range\n· Add Naver search engine\n• Fixed bug that the video floating back to the background to continue playing after turning off the \"Background Play\" option for some videos\n• Fixed bug where the video floating quit full screen could cause the slider on the right side of the webpage to be misplaced\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"834151901","version_name":"10.8","version_date":"2020-01-01 07:31:48.000 +0800","version_description":"If you are willing to help us improve your translation, please feel free to contact us at hfutld@yeah.net. We will be very grateful for that.\n• Full screen display of file management view on iPad\n• Long press operation adds \"Back to Home\" option\n• Fixed bug that when the top tab bar on the iPad closes the tab, the right tab is preferred over the parent tab\n• After the user sets a custom homepage, the long-press operation of the home button is set to return to the homepage by default\n• Fixed bug that the status bar of the full-screen video playback in the file management on the iPad is disordered\n• Fixed bug that the iPhone automatically exits the file management after exiting the full screen video play in the file management\n• Fixed the issue that ad blocking may need to be refreshed after a new tag is created on some web pages to take effect\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"834186607","version_name":"10.9","version_date":"2020-02-19 05:57:21.000 +0800","version_description":"• Adapt to the latest iOS 13.3.1.\n• Fixed bug that preloading too much content in reading mode could cause fever\n• Fixed bug that the screen may go out when the video is loaded slowly.\n• Fixed bug that double speed may be lost after multiple pauses in picture-in-picture mode.\n• Fixed the inconvenience of long-term deletion of homepage bookmarks on non-full screen.\n• Fixed bug that some websites failed to save images and failed to load in image viewing mode.\n• Optimize the experience in the label selection interface with one-handed operation , and make the operation of the previous label with one hand easily.\n• The reminder of switching from WiFi to 4G when the video is playing in full screen will no longer exit the full screen. In the playback interface, you can quickly close or continue playing.\n• Click the menu button, press and hold the bookmark / history to quickly open the history, press and hold the computer / mobile version to switch quickly, and press and hold the imageless mode to switch quickly.\n• Support time setting when double-click forward / backward on 2 sides,1s, 3s, 5s, 10s, 15s, 20s, 30s are optional. Tip: The default 1s is to correct the possible audio and video out of sync with double speed playback.\n• Other improvements and optimizations.\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"834770565","version_name":"11.0","version_date":"2020-03-18 08:49:40.000 +0800","version_description":"• New video decoder:\n     Decoder 1: iOS built-in decoder\n     Advantages: power saving, stable. Disadvantages: less support format, 2x speed may be unstable at low network speeds.\n     Decoder 2: Alook independent decoder\n     Advantages: support multiple formats, speed up stability. Disadvantages: Some formats consume more power than decoder 1.\n• Video floating long press to play at 2x speed\n• Added 1.2x speed option\n• Fixed bug that some files could not be copied to Alook.\n• Fixed bug that video screenshot failed on iPad\n• Fixed bug that the full-screen back button click range is small\n• Fixed the bug that some video websites on iPad or PC version failed to play after turn off video floating.\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"835154810","version_name":"11.1","version_date":"2020-03-19 01:58:00.000 +0800","version_description":"• New video decoder:\n     Decoder 1: iOS built-in decoder\n     Advantages: power saving, stable. Disadvantages: less support format, 2x speed may be unstable at low network speeds.\n     Decoder 2: Alook independent decoder\n     Advantages: support multiple formats, speed up stability. Disadvantages: Some formats consume more power than decoder 1.\n• Video floating long press to play at 2x speed\n• Added 1.2x speed option\n• Fixed bug that some files could not be copied to Alook.\n• Fixed bug that video screenshot failed on iPad\n• Fixed bug that the full-screen back button click range is small\n• Fixed the bug that some video websites on iPad or PC version failed to play after turn off video floating.\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"835168922","version_name":"11.2","version_date":"2020-03-19 12:31:27.000 +0800","version_description":"• New video decoder:\n     Decoder 1: iOS built-in decoder\n     Advantages: power saving, stable. Disadvantages: less support format, 2x speed may be unstable at low network speeds.\n     Decoder 2: Alook independent decoder\n     Advantages: support multiple formats, speed up stability. Disadvantages: Some formats consume more power than decoder 1.\n• Video floating long press to play at 2x speed\n• Added 1.2x speed option\n• Fixed bug that some files could not be copied to Alook.\n• Fixed bug that video screenshot failed on iPad\n• Fixed bug that the full-screen back button click range is small\n• Fixed the bug that some video websites on iPad or PC version failed to play after turn off video floating.\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"835171419","version_name":"11.3","version_date":"2020-03-20 07:20:48.000 +0800","version_description":"• New video decoder:\n     Decoder 1: iOS built-in decoder\n     Advantages: power saving, stable. Disadvantages: less support format, 2x speed may be unstable at low network speeds.\n     Decoder 2: Alook independent decoder\n     Advantages: support multiple formats, speed up stability. Disadvantages: Some formats consume more power than decoder 1.\n• Fix the bug that some cloud websites fail to download\n• Support Webm and Swf online playback\n• Toolbox-Developer Tools-Added View Cookies option\n• Fix the bug that decoder 2 cannot rotate the screen automatically\n• Video floating long press to play at 2x speed\n• Added 1.2x speed option\n• Fixed bug that some files could not be copied to Alook.\n• Fixed bug that video screenshot failed on iPad\n• Fixed bug that the full-screen back button click range is small\n• Fixed the bug that some video websites on iPad or PC version failed to play after turn off video floating.\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"835195557","version_name":"11.4","version_date":"2020-03-25 03:09:20.000 +0800","version_description":"This update:\n• Fix the bug that webpage text may not be selected on the latest iOS system\n• Fix the bug of editing bookmark icon on iPad\n• Fix the bug where exiting Alook quickly from the App switching interface when FaceID was enabled caused a crash\n• Fix the bug that there are only sounds and no pictures in the video floating of some websites\n• Playback failure support fast switch decoder\n• Fix the bug where the list page of some well-known websites could not be previewed by sliding the page\n• Added the hint that decoder 2 on iPad does not support picture-in-picture\n\nRecent major updates:\n• New video decoder:\n     Decoder 1: iOS built-in decoder\n     Advantages: power saving, stable. Disadvantages: less support format, 2x speed may be unstable at low network speeds.\n     Decoder 2: Alook independent decoder\n     Advantages: support multiple formats, speed up stability. Disadvantages: Some formats consume more power than decoder 1.\n• Fix the bug that some cloud websites fail to download\n• Support Webm and Swf online playback\n• Toolbox-Developer Tools-Added View Cookies option\n• Fix the bug that decoder 2 cannot rotate the screen automatically\n• Video floating long press to play at 2x speed\n• Added 1.2x speed option\n• Fixed bug that some files could not be copied to Alook.\n• Fixed bug that video screenshot failed on iPad\n• Fixed bug that the full-screen back button click range is small\n• Fixed the bug that some video websites on iPad or PC version failed to play after turn off video floating.\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"835250650","version_name":"11.5","version_date":"2020-05-05 02:18:53.000 +0800","version_description":"This update:\n• Fix the bug that the custom menu cannot be popped up when the image is long-pressed on iOS 13.4\n• Automatically update search suggestions when deleting\n• Long press custom action add \"Clear Data\" option\n• Close the tab page to prefer neighboring tabs; if there is no brother tab, the parent tab will be preferred\n• Fixed the bug that may lock the screen automatically when playing video\n\n\nRecent major updates:\n• New video decoder:\n     Decoder 1: iOS built-in decoder\n     Advantages: power saving, stable. Disadvantages: less support format, 2x speed may be unstable at low network speeds.\n     Decoder 2: Alook independent decoder\n     Advantages: support multiple formats, speed up stability. Disadvantages: Some formats consume more power than decoder 1.\n• Fix the bug that some cloud websites fail to download\n• Support Webm and Swf online playback\n• Toolbox-Developer Tools-Added View Cookies option\n• Fix the bug that decoder 2 cannot rotate the screen automatically\n• Video floating long press to play at 2x speed\n• Added 1.2x speed option\n• Fixed bug that some files could not be copied to Alook.\n• Fixed bug that video screenshot failed on iPad\n• Fixed bug that the full-screen back button click range is small\n• Fixed the bug that some video websites on iPad or PC version failed to play after turn off video floating.\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"836619678","version_name":"11.6","version_date":"2020-06-30 02:57:19.000 +0800","version_description":"This update:\n• Adapt to the latest iOS system\n• Optimized epub format e-book analysis speed\n• Fixed bug of incorrect encoding when opening some txt ebooks\n• Fixed bug that some e-book chapter extraction errors\n• Optimize the height of the bottom hidden bar after entering the full screen\n• Auto refresh adds more optional time intervals\n• Fixed bug that some websites recognize Alook as other browsers\n• Since qiumiaojingxi and halflife rules are no longer maintained, remove them from Adblock Plus third-party rules\n\nRecent major updates:\n• New video decoder:\n     Decoder 1: iOS built-in decoder\n     Advantages: power saving, stable. Disadvantages: less support format, 2x speed may be unstable at low network speeds.\n     Decoder 2: Alook independent decoder\n     Advantages: support multiple formats, speed up stability. Disadvantages: Some formats consume more power than decoder 1.\n• Fix the bug that some cloud websites fail to download\n• Support Webm and Swf online playback\n• Toolbox-Developer Tools-Added View Cookies option\n• Fix the bug that decoder 2 cannot rotate the screen automatically\n• Video floating long press to play at 2x speed\n• Added 1.2x speed option\n• Fixed bug that some files could not be copied to Alook.\n• Fixed bug that video screenshot failed on iPad\n• Fixed bug that the full-screen back button click range is small\n• Fixed the bug that some video websites on iPad or PC version failed to play after turn off video floating.\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"837194793","version_name":"11.7","version_date":"2020-08-07 09:56:51.000 +0800","version_description":"• Adapt to the latest iOS system\n• Support bookmark backup/export\n• Add more font size options\n• Improve the picture-in-picture experience on the latest system\n• Reading mode, automatic page composition, if the current tab is the computer version, the computer version content will also be loaded\n• Fix the bug that the screen does not turn off after the floating video playback is completed\n• Fix the bug that the picture is not displayed completely after entering the gallery mode on the iPad after split screen\n• Fix the bug that the bookmark is not displayed on the history page after the bookmark is visited\n• Long press the blue video button to quickly close and open the video hover\n• New setting-custom setting-disable network switch reminder, after enabling it, switch from WiFi to 4G will no longer remind\n• New settings-custom settings-special settings-disable login/password manager\n• Click on the small green shield in the upper left corner add “get all the text options on the webpage”, you can copy/send all text in the webpage\n• New keyboard shortcut: Command + Shift + F to enter/exit the full screen by floating video\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"837267057","version_name":"11.8","version_date":"2020-08-08 08:57:19.000 +0800","version_description":"• Adapt to the latest iOS system\n• Support bookmark backup/export\n• Add more font size options\n• Improve the picture-in-picture experience on the latest system\n• Reading mode, automatic page composition, if the current tab is the computer version, the computer version content will also be loaded\n• Fix the bug that the screen does not turn off after the floating video playback is completed\n• Fix the bug that the picture is not displayed completely after entering the gallery mode on the iPad after split screen\n• Fix the bug that the bookmark is not displayed on the history page after the bookmark is visited\n• Long press the blue video button to quickly close and open the video hover\n• New setting-custom setting-disable network switch reminder, after enabling it, switch from WiFi to 4G will no longer remind\n• New settings-custom settings-special settings-disable login/password manager\n• Click on the small green shield in the upper left corner add “get all the text options on the webpage”, you can copy/send all text in the webpage\n• New keyboard shortcut: Command + Shift + F to enter/exit the full screen by floating video\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"837280549","version_name":"11.9","version_date":"2020-08-09 02:53:43.000 +0800","version_description":"• Adapt to the latest iOS system\n• Support bookmark backup/export\n• Add more font size options\n• Improve the picture-in-picture experience on the latest system\n• Reading mode, automatic page composition, if the current tab is the computer version, the computer version content will also be loaded\n• Fix the bug that the screen does not turn off after the floating video playback is completed\n• Fix the bug that the picture is not displayed completely after entering the gallery mode on the iPad after split screen\n• Fix the bug that the bookmark is not displayed on the history page after the bookmark is visited\n• Long press the blue video button to quickly close and open the video hover\n• New setting-custom setting-disable network switch reminder, after enabling it, switch from WiFi to 4G will no longer remind\n• New settings-custom settings-special settings-disable login/password manager\n• Click on the small green shield in the upper left corner add “get all the text options on the webpage”, you can copy/send all text in the webpage\n• New keyboard shortcut: Command + Shift + F to enter/exit the full screen by floating video\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"837875337","version_name":"12.0","version_date":"2020-09-27 06:32:43.000 +0800","version_description":"• Adapt to the latest iOS 14 system\n• Added forward/backward 15s option after PIP on iOS 14\n• Adapt to Bluetooth mouse long press menu\n• Fix the bug of incorrect animation of tab selection page on iOS 14\n• Added \"View in Folder\" option for download complete list file operation\n• Fix the bug that the user agent of iPhone does not work after opening split screen on iPad\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"838026272","version_name":"12.1","version_date":"2020-10-01 21:18:08.000 +0800","version_description":"• Adapt to the latest iOS 14 system\n• Added forward/backward 15s option after PIP on iOS 14\n• Adapt to Bluetooth mouse long press menu\n• Fix the bug of incorrect animation of tab selection page on iOS 14\n• Added \"View in Folder\" option for download complete list file operation\n• Fix the bug that the user agent of iPhone does not work after opening split screen on iPad\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"838502752","version_name":"12.2","version_date":"2020-11-16 00:59:36.000 +0800","version_description":"• Adapt to the latest iOS 14 system and iPhone 12 series\n• Added desktop widgets adapted to iOS 14\n• Add Menu-Translate-In-Page Translate Option\n• Picture viewing mode/webpage picture adaptation webp format\n• Fix the bug that the custom menu cannot be displayed by long pressing the picture on the iPad\n• Fix the bug that may stop at the beginning of playing video\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"839213867","version_name":"12.3","version_date":"2020-11-18 01:12:44.000 +0800","version_description":"• Adapt to the latest iOS 14 system and iPhone 12 series\n• Added desktop widgets adapted to iOS 14\n• Add Menu-Translate-In-Page Translate Option\n• Picture viewing mode/webpage picture adaptation webp format\n• Fix the bug that the custom menu cannot be displayed by long pressing the picture on the iPad\n• Fix the bug that may stop at the beginning of playing video\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details.\n\nIf you are willing to help us improve your translation, please feel free to contact us at hfutld@yeah.net. We will be very grateful for that."},{"version_id":"839271082","version_name":"12.5","version_date":"2020-11-21 03:27:12.000 +0800","version_description":"• Fix the bug that pdf cannot be viewed in split screen on iPad\n• Update Eruda and vConsole in developer tools\n• Fix the bug that epub e-book gets the wrong directory\n• Fix the bug that text selection pops up when long pressing the link/image pop-up menu on iOS 14\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details.\n\nIf you are willing to help us improve your translation, please feel free to contact us at hfutld@yeah.net. We will be very grateful for that."},{"version_id":"839654342","version_name":"12.6","version_date":"2021-01-18 01:14:34.000 +0800","version_description":"• Adapt to the latest iOS system\n• Fix the bug that the search result returns to refresh\n• Fix the bug that failed to save search screenshots\n• Fix the bug of slow loading of word translation\n• Optimize the bottom triggering experience after the mobile phone enters the full-screen state in horizontal screen\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"841308526","version_name":"12.7","version_date":"2021-04-18 23:22:02.000 +0800","version_description":"• Adapt to the latest iOS system\n• Video floating supports mirroring\n• Some websites do not enable dark/night mode\n• Long press on the picture to search for pictures add  Yandex\n• Click on the More button on the right of the file to display the specific size and last modification time of the file\n• Fixed bug that caused the shortcut search bar at the bottom not to appear on the iPad search interface floating keyboard\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"842007688","version_name":"12.8","version_date":"2021-04-30 12:35:18.000 +0800","version_description":"• Adapt to the latest iOS system\n• Video floating supports mirroring\n• Some websites do not enable dark/night mode\n• Long press on the picture to search for pictures add  Yandex\n• Click on the More button on the right of the file to display the specific size and last modification time of the file\n• Fixed bug that caused the shortcut search bar at the bottom not to appear on the iPad search interface floating keyboard\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"842588398","version_name":"12.9","version_date":"2021-06-10 22:50:11.000 +0800","version_description":"• Adapt to the latest iOS system\n• Fix the bug that the reading mode cannot be entered on the latest iOS\n• Video floating supports mirroring\n• Some websites do not enable dark/night mode\n• Long press on the picture to search for pictures add  Yandex\n• Click on the More button on the right of the file to display the specific size and last modification time of the file\n• Fixed bug that caused the shortcut search bar at the bottom not to appear on the iPad search interface floating keyboard\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"843053962","version_name":"13.0","version_date":"2021-07-18 23:24:08.000 +0800","version_description":"• Adapt to the latest iOS system\n• Added DLNA cast support\n• Fix the bug that the menu cannot be popped up by long pressing on the latest iOS system\n• Fix the bug that the video played by decoder 2 may be judged as audio\n• Fixed a bug that caused some websites to be displayed incompletely when switched to the computer version\n• Fix the bug that the new tab page flashes white after switching to night mode or dark mode\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"843699711","version_name":"13.1","version_date":"2021-08-21 01:05:22.000 +0800","version_description":"• Adapt to the latest iOS system\n• Fix the bug that may get the wrong website icon\n• Fix the bug that the new tab page of some websites may get stuck\n• Fix the bug that the animation of new tab flashes blank after switching light/dark mode\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"843832382","version_name":"13.2","version_date":"2021-08-28 21:59:32.000 +0800","version_description":"• Adapt to the latest iOS system\n• Fix the bug that may get the wrong website icon\n• Fix the bug that the new tab page of some websites may get stuck\n• Fix the bug that the animation of new tab flashes blank after switching light/dark mode\n• Other improvements and optimizations\n\nWe are very sorry, due to YouTube’s complaint, we have removed the background playback and picture-in-picture mode of the YouTube website.\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"843959662","version_name":"13.3","version_date":"2021-09-06 01:39:04.000 +0800","version_description":"• Adapt to the latest iOS system\n• Visual design update: rounder and thicker icons in the toolbar and menu bar\n• The design of search history and search suggestions has been updated to better meet the new iOS standards\n• Improve AirPlay and DLNA cast\n• Fix the bug that the top edit bar cannot automatically select all long texts\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"843977192","version_name":"13.5","version_date":"2021-09-07 06:17:31.000 +0800","version_description":"• Adapt to the latest iOS system\n• Visual design update: rounder and thicker icons in the toolbar and menu bar\n• The design of search history and search suggestions has been updated to better meet the new iOS standards\n• Improve AirPlay and DLNA cast\n• Fix the bug that the top edit bar cannot automatically select all long texts\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"844016553","version_name":"13.6","version_date":"2021-09-09 05:22:10.000 +0800","version_description":"• Adapt to the latest iOS system\n• The video floating window adopts more rounded icons\n• The picture-in-picture button is not displayed after the floating video is shrink\n• The design of search history and search suggestions has been updated to better meet the new iOS standards\n• iCloud synchronization interface added import bookmarks and export bookmarks options\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"844060856","version_name":"13.7","version_date":"2021-09-12 01:01:56.000 +0800","version_description":"• Video floating supports up to 16x speed\n• The bottom toolbar supports sliding left and right to switch adjacent tabs\n• Fix the bug that DLNA screen cast fails on iOS 14.5 and above\n• Adapt to the latest iOS system\n• Other improvements and optimizations\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"844075335","version_name":"13.8","version_date":"2021-09-19 16:51:09.000 +0800","version_description":"• Adapt to the latest iOS system\n• Fix the bug that the progress of Codec 2 may jump backwards after it freezes\n• Fix the bug that some website videos cannot be floating\n• Codec 2 can customize the long-press playback speed in the settings-video settings\n• Unchecking ad block option in website settings will invalidate Adblock Plus and blocking intrusive ads, which is equivalent to an ad filtering whitelist\n• Other optimizations and improvements\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"844682189","version_name":"13.9","version_date":"2021-10-15 14:29:28.000 +0800","version_description":"• Adapt to the latest iOS system\n• Fix the bug that some websites cannot be played by floating\n• Fix the bug that the volume of addition and subtraction is not displayed when the video is floating in full screen state on iOS 15\n• Other optimizations and improvements\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app detai"},{"version_id":"845307566","version_name":"15.0","version_date":"2021-11-14 02:29:32.000 +0800","version_description":"• Adapt to the latest iOS system\n• Fix the bug that the Codec 1 may keep buffering\n• Fix the bug that some video websites on the iPad failed to play\n• Fix the bug that some website videos still play in floating after video floating is off\n• Fix the bug that the parchment background is lost when entering reading mode in no image mode\n• Optimize the progress adjustment of the video floating left and right sliding: new process to  prevent accidental touch; sliding up and down to cancel the progress adjustment\n• Other optimizations and improvements\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"845423896","version_name":"15.1","version_date":"2021-11-19 06:55:27.000 +0800","version_description":"• Adapt to the latest iOS system\n• Fix the bug that the Codec 1 may keep buffering\n• Fix the bug that some video websites on the iPad failed to play\n• Fix the bug that some website videos still play in floating after video floating is off\n• Fix the bug that the parchment background is lost when entering reading mode in no image mode\n• Optimize the progress adjustment of the video floating left and right sliding: new process to  prevent accidental touch; sliding up and down to cancel the progress adjustment\n• Other optimizations and improvements\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"845752040","version_name":"15.2","version_date":"2021-12-05 23:52:41.000 +0800","version_description":"• Adapt to the latest iOS system\n• Fix the bug that the keyboard may retract automatically\n• Fix the bug that DLNA can't find the device and prompt error\n• Fix the bug that some TV DLNA screen cast fails\n• Added the anti-inadvertent touch of the bottom toolbar sliding left and right to switch tabs\n• Fix the bug that some websites cannot be full screen after turning off the video floating on the iPad\n• iPhone also supports a tab in the settings-custom settings to display the top tab bar\n• Other optimizations and improvements\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"845926695","version_name":"15.3","version_date":"2022-02-16 08:57:12.000 +0800","version_description":"• Adapt to the latest iOS system\n• Menu function optimization\n• Fixed the bug that DLNA screen cast failed on some devices\n• Fixed a bug where editing failed after creating a blank file\n• Fixed a bug that some webpages might freeze\n• Other optimizations and refinements\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"847213112","version_name":"15.5","version_date":"2022-02-17 05:00:14.000 +0800","version_description":"• Adapt to the latest iOS system\n• Menu function optimization\n• Fixed the bug that DLNA screen cast failed on some devices\n• Fixed a bug where editing failed after creating a blank file\n• Fixed a bug that some webpages might freeze\n• Other optimizations and refinements\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"847782381","version_name":"15.6","version_date":"2022-03-19 02:24:02.000 +0800","version_description":"• Adapt to the latest iOS system\n• Menu function optimization\n• Fixed the bug that DLNA screen cast failed on some devices\n• Fixed a bug where editing failed after creating a blank file\n• Fixed a bug that some webpages might freeze\n• Other optimizations and refinements\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."},{"version_id":"848415336","version_name":"15.7","version_date":"2022-04-19 03:48:52.000 +0800","version_description":"• Adapt to the latest iOS system\n• Bookmarks support ascending/descending order\n• Menu function optimization\n• Fixed the bug that the device could not be searched after opening the DLNA interface for the second time\n• Fixed the bug that DLNA screen cast failed on some devices\n• Fixed the bug where editing failed after creating a blank file\n• Fixed the bug that some webpages might freeze\n• Other optimizations and improvements\n\nAlook aim to be the best browser for iOS. For more information, please check the update history and app details."}]