[{"version_id":"825515722","version_name":"6.0.1","version_date":"2018-01-05 18:39:10.000 +0800","version_description":"- Added Help topic on migrating data from SkySafari 5 to SkySafari 6.<br>- Added entries in Help to take you to the Community Forums and to open a support request.<br>- Eliminated initial delay when tapping on the zoom in/out buttons.<br>- Improved responsiveness of on-screen slew buttons.<br>- Improved the timing of Jupiter moon events in the Object Info.<br>- Changed DSS download to use the first generation survey plates.  The images are smaller and faster to download and they match the view in the eyepiece better.<br>- Changed maximum DS cache size from 1 GB to 50 GB.<br>- Fixed bug where the custom observing sites were not getting searched when you searched for a location in the Location settings.<br>- Fixed bug where not all objects in a large (&gt; 400 object) observing list would be re-highlighted when the app is restarted.<br>- Fixed problem where the tick marks on the \"Show Selected Object Path\" path did not line up exactly with the correct time.<br>- Fixed bug where some observing lists would get stuck showing \"Fetching...\"<br>- Current scope RA/Dec is now initially shown in the GoTo RA/Dec panel.<br>- Fixed crash that would happen if you saved a custom observing site with a zero length name.<br>- Moved the UI for toggling backing up to the cloud servers to the Storage settings.<br>- Fixed some Night Vision problems.<br>- Various small UI changes and tweaks."},{"version_id":"825695721","version_name":"6.0.3","version_date":"2018-01-22 21:01:23.000 +0800","version_description":"- New toolbar customizations!  Added ability to show/hide specific icons on the main tool bar.  You can now show the Info &amp; Center buttons on the main toolbar if you prefer that.<br>- Fixed bug where predefined equipment would sometime show zeros for it values.<br>- Fixed bug where observing lists would sometimes not display.<br>- Fixed bug where the databases for the in-app purchase of the PGC extension and UCAC5 extension could disappear.  If you think you don't have those databases, please Restore Purchases."},{"version_id":"826012894","version_name":"6.0.4","version_date":"2018-02-16 19:50:39.000 +0800","version_description":"- Added a 3D model of the Tesla Roadster which is shown when orbiting the object.<br>- Toolbar no longer disappears in the main chart after viewing a SkyWeek chart.<br>- Made a few changes for the app to work better with LiveSky.<br>- Performance improvements when you have hundreds of observing lists or several thousand observations.<br>- Fixed bug in downloading of single DSS images where they were not being properly saved for offline viewing."},{"version_id":"826885135","version_name":"6.0.5","version_date":"2018-05-03 20:39:51.000 +0800","version_description":"- Fixed bug with not loading Spacecraft descriptions.<br>- Fixed bug when connecting to scope and you have less than 3 FOV indicators.<br>- Fixed a few layout issues on the iPhone X.<br>- Several minor tweaks and bug fixes."},{"version_id":"827361601","version_name":"6.1.2","version_date":"2018-06-04 16:23:05.000 +0800","version_description":"Thank you for using SkySafari 6 Plus! We've been hard at work under the hood of the app to tweak the code and give you the best stargazing experience possible.  In this version we've also added a couple of optional new features that are both fun and educational.<br><br>What's new:<br><br>+ Optional Interactive H-R Diagram displays where a star is in its evolutionary stage.<br>+ Optional Galaxy View visualizes the 3-D location of stars and deep sky objects in our Galaxy the Milky Way.<br>+ Toolbar buttons no longer disappear after previewing a settings file.<br>+ Onscreen highlighting of a list is now properly updated after an observation is deleted or an observing list is added or deleted to an observation.<br>+ Numerous enhancements and performance fixes"},{"version_id":"828150864","version_name":"6.2.0","version_date":"2018-08-09 19:20:25.000 +0800","version_description":"Thank you for using SkySafari Plus. We have some exciting new features and improvements in this release!<br><br>+ New Augmented Reality (AR) mode available when using the compass. AR blends the simulated sky chart with a real view of your surroundings, captured from your device's camera.  AR mode makes it even easier to find your favorite planets, stars, and constellations. Requires iOS 10.<br>+ Added support for latest iOptron firmware.<br>+ Improved accuracy of Telescope GoTos when talking to StarSense hand controller.<br>+ Various performance and stability improvements.<br><br>Some pointers on using Augmented Reality mode in SkySafari:<br><br>To use AR in SkySafari, first activate the compass by either tapping the icon in the toolbar or simply tilting your device up to the sky. A small AR icon appears above the toolbar, near the bottom of the screen. Tap the AR icon to turn on your device's camera. If this is the first time you've used AR, your device will ask for your permission to use the camera. To turn off AR mode, tap the AR icon again. When AR is active, the toolbar and on-screen buttons will be hidden.<br><br>During daylight hours, point your device's camera at an area of clear blue sky. SkySafari will fill that area with a star chart. At night, point your camera at a black sky area. SkySafari will attempt to draw the star chart only over the sky area, and not walls, buildings, trees, etc.<br><br>You can increase or decrease the amount of sky chart blending with the camera's video image by swiping up or down. At maximum blending, the star chart is drawn everywhere above the horizon, not just in clear sky areas.<br><br>You may find that the simulated objects in the sky chart don't quite line up correctly with the real objects shown by the camera. This is due to the inaccuracy inherent in your device's digital compass. To fix this problem, swipe the chart left-to-right. This way, you can align objects drawn in the chart with their images shown by the camera. The Moon is a great object to align on. The planets and brightest stars should also be visible in the camera and can be used for AR alignment."},{"version_id":"828886931","version_name":"6.2.1","version_date":"2018-10-14 15:40:10.000 +0800","version_description":"- Improved catalog search when using Planner.<br>- Added support native Sync command on NexStar and SynScan hand controllers running the appropriate firmware version. <br>- Added support for setting date/time/location on SynScan controllers.<br>- Improved accuracy of planetary position predictions.<br>- Improved memory usage.<br>- Improvements to syncing data with LiveSky server.<br>- Added Sun to HR-Diagram.<br>- Fixed bug where the AR button was shown on top of the \"Current List\" button when it was visible.<br>- Fixed bug where you could get stuck in Stereographic projection after using AR mode."},{"version_id":"829120412","version_name":"6.2.2","version_date":"2018-10-31 22:36:28.000 +0800","version_description":"- Added option to have rectangular custom fields of view.<br>- In the Scope Display screen, we now show the exit pupil (EP) of a telescope/eyepiece field of view.<br>- Miscellaneous stability improvements."},{"version_id":"829594259","version_name":"6.3.0","version_date":"2018-12-13 19:19:59.000 +0800","version_description":"• In the Observation screen you can now display the info for the object or center the object in the main chart.<br>• In the Observations screen, we no longer show sessions without any observations.  We also show the number of observations in sessions that do have observations.<br>• When associating an observing list with an observation, we now show all observing lists rather than just those that contain the object.  If the chosen list doesn't have that object in it, we give you the option to add it.<br>• There is a new option in the Object Info's more button to show all observing lists containing the object.<br>• In the Date/Time Picker dialog, there is now a \"Now\" button to set the date/time to the current time.<br>• Improved resizing of H-R Diagram.<br>• Various modifications for compatibility with soon to be released Starry Night 8.<br>• Various stability and performance improvements."},{"version_id":"831003381","version_name":"6.4.0","version_date":"2019-05-06 14:23:12.000 +0800","version_description":"• Incorporated Wolfgang Steinicke's 2019 updates to his NGC/IC database.<br>• Added better support for having multiple observations of an object in an observing list. <br>• In observing lists, you can now chose to show all objects, only observed objects, or only unobserved objects.<br>• When attaching an observation to an observing list, we now show two sections of lists. Those lists that already contain the object and those that don't.<br>• Added a Quasar type to the Planner for searches.<br>• In Pro, added the ability to toggle the extension databases between Active and Inactive states.<br>• For equatorial Celestron Wi-Fi mounts, you now are given the option of doing an All-Star Polar Alignment (ASPA) after a star alignment.<br>• Fixed a problem with StarSense alignment when using Celestron Wi-Fi.<br>• Fixed a few issues with the display or editing of times in observations and sessions.<br>• Improved performance syncing data with LiveSky.<br>• Various other performance and stability changes."},{"version_id":"831874867","version_name":"6.5.0","version_date":"2019-07-17 23:12:09.000 +0800","version_description":"Celebrate the 50th anniversary of the Apollo 11 Moon landing with a new in-app purchase that allows you to follow the Apollo 11 crew on their historic mission! Explore all Apollo Space Missions (from Apollo 8 to Apollo 17) and place yourself at the exact spot along the lunar trajectories of the Apollo spacecraft, during the most memorable and historic moments of these flights.<br><br>Features:<br><br>+ Travel along on the Apollo Space Missions, including Apollo 11 and the first lunar landing<br>+ Includes nine missions flown by the Apollo astronauts during the 1960's and 1970's<br>+ View the Earth and Moon as it appeared to the crew. Land on the Moon, then blast back into lunar orbit!<br>+ Links to key moments of the Apollo 11 Lunar Program<br>+ Moon inbound and outbound trajectories for Apollo 8, 10, 11, 12, 13, 14, 15, 16, and 17<br>+ Accurate 3-D models of the Apollo Spacecraft - including the Saturn V rocket, the Command Service Module and the Lunar Lander Module<br>+ Lunar Landing site Panorama for Apollo 11<br>+ The simulated trajectories have been made as accurate as possible, using actual data published by NASA.<br><br>Other changes:<br>• Fixed bug in the Tonight at a Glance view where the Help button wasn't positioned correctly.<br>• Tweaked the UI in a few places.<br>• New icon for Tonight button.<br>• New user interface for the Observing List repository.<br>• Fixed crash that could happen while zooming the view in and out.<br>• Performance improvement in drawing the chart.<br>• UI changes to make it easier to create multiple observations of an object in a specific observing list.<br>• Fixed bug where zoom buttons didn't work in chart views other than the main one.<br>• Added a \"Show Last Observation\" item to the Observations view.  This facilitates easily getting back to your last observation."},{"version_id":"833235700","version_name":"6.5.1","version_date":"2019-10-28 14:45:14.000 +0800","version_description":"Thank you for your continued support! This minor update addresses several user interface issues on iOS 13."},{"version_id":"833658358","version_name":"6.5.3","version_date":"2019-11-22 03:07:25.000 +0800","version_description":"Thank you for using SkySafari Plus! This minor release includes bug fixes and enhancements to better support iOS 13, including Dark Mode."},{"version_id":"834069887","version_name":"6.6.0","version_date":"2019-12-20 22:06:15.000 +0800","version_description":"Thank you for using SkySafari Plus! In this update:<br><br>+ Added PlaneWave Telescope Mount Support developed for our partners at Lowell Observatory.<br>+ Localized SkySafari for French, Spanish, German, and Italian. Additional languages will be translated soon.<br>+ Several Bug Fixes and Improvements"},{"version_id":"834108473","version_name":"6.6.1","version_date":"2019-12-26 18:38:05.000 +0800","version_description":"Minor updates to address bugs introduced with Localization."},{"version_id":"834204216","version_name":"6.6.2","version_date":"2020-01-05 19:12:47.000 +0800","version_description":"Happy New Year! In this update:<br><br>+ Fixed crash when enabling Augmented Reality (AR) mode.<br>+ Can now search for solar system objects and constellation names in localized language."},{"version_id":"834286781","version_name":"6.6.3","version_date":"2020-01-12 19:22:18.000 +0800","version_description":"In this update we address some issues due to localization and make some minor improvements. Thank you for your patience and continued support of SkySafari. You all rock like asteroids!<br><br>+ Fixed a potential crash on startup when app is localized to a language other than English.<br>+ Fixed crash with non-ascii characters in FOV equipment names.<br>+ Fixed mixup between some localized solar system object names.<br>+ Fixed several localized strings.<br>+ Measure Tool now displays angular separation info.<br>+ List reordering UI handles now visible in light mode."},{"version_id":"834504948","version_name":"6.6.4","version_date":"2020-01-29 21:18:43.000 +0800","version_description":"Performance improvements for localized search."},{"version_id":"835809407","version_name":"6.7.0","version_date":"2020-05-04 19:53:44.000 +0800","version_description":"We are sending you this latest update through hyperspace.  Thank you for your continued support.<br><br>+ Japanese Localization.<br>+ Celestron Focus Motor Control.<br>+ Several Celestron telescope bug fixes.<br>+ Several fixes in Localized Object Info.<br>+ Constellation names now localized."},{"version_id":"836344092","version_name":"6.7.2","version_date":"2020-06-11 13:50:40.000 +0800","version_description":"Comets and other solar-system bodies no longer removed from cache (disappear) after a few days.<br>Fixes for crashes on some iOS 9 devices.<br>Fixes for connection problems to some Celestron telescopes.<br>Fixed Toolbar Configuration settings icons.<br>Fixes for Japanese translations.<br>Fixes for German translations."},{"version_id":"837717191","version_name":"6.7.5","version_date":"2020-09-10 19:42:03.000 +0800","version_description":"Performance enhancements.<br>Fixes problem adding multiple Equipment to Observations."},{"version_id":"838301032","version_name":"6.7.6","version_date":"2020-10-29 12:49:33.000 +0800","version_description":"- Updated for iOS 14.<br>- Better support for connecting to telescopes through local networks.<br>- Corrections to Japanese localization."},{"version_id":"840010905","version_name":"6.8.0","version_date":"2021-01-14 16:33:17.000 +0800","version_description":"- Fixes for Astro-Physics Mount Control.<br>- Multi-language fixes.<br>- Added Russian translation."},{"version_id":"841176363","version_name":"6.8.2","version_date":"2021-04-07 09:57:56.000 +0800","version_description":"Jupiter Great Red Spot orientation updated.<br>Fixed issue with maximum location elevation.<br>Tonight's Best list sorting fixed.<br>Some light vs dark mode UI fixes.<br>Fixed crash when importing Observing Lists.<br>Corrections to Russian, Japanese and French translations."},{"version_id":"841943568","version_name":"6.8.3","version_date":"2021-04-28 13:21:22.000 +0800","version_description":"Fixes for UI in Dark/Light modes"},{"version_id":"842150843","version_name":"6.8.4","version_date":"2021-05-12 17:16:11.000 +0800","version_description":"Corrections for French, Japanese and Italian localizations.<br>Fix for SynScan telescopes."},{"version_id":"842486313","version_name":"6.8.5","version_date":"2021-06-03 16:23:15.000 +0800","version_description":"Fixes connection issues with some Celestron WiFi telescopes.<br>Fixes import of Observing Lists from SkySafari 5 using Files app &gt; Share workflow.<br>Performance Improvements."}]