[{"version_id":"823112778","version_name":"1.0","version_date":"2017-08-15 03:04:55.000 +0800","version_description":""},{"version_id":"823451505","version_name":"1.2.4","version_date":"2017-08-30 04:39:04.000 +0800","version_description":"- Touching normal & hold notes are now easier\n- Adjusted the size of drag notes\n- Fixed critical issues with note timings\n- Fixed incorrect note priority"},{"version_id":"823535662","version_name":"1.2.5","version_date":"2017-09-05 04:03:11.000 +0800","version_description":"- Remade drag notes\n- Readjusted note sizes and hitboxes\n- Shrinks upper-right pause hotspot\n- Fixed hold notes being judged early when switching fingers\n- Fixed million master being impossible in some charts"},{"version_id":"823964869","version_name":"1.3","version_date":"2017-10-11 05:28:28.000 +0800","version_description":"- Long-awaited high score system is here!\n- Individual options (note delay, inverse) for each level!\n- Screen orientation is now fixed while playing\n- Levels are now sorted properly (previously, levels start with a lowercase initial would appear at the bottom of the list)\n- Minor UI adjustments\n- There might be some bug fixes?\n- More like introduced some bugs for future me to fix"},{"version_id":"825196881","version_name":"1.3.1","version_date":"2017-12-06 02:01:46.000 +0800","version_description":"It's been a while! \\(*w *)/\n- Added hit sounds: tambourine, rim and shaker\n- You can now delete unwanted charts in Options (Finally!)\n- Now you have to tap the upper right corner TWICE to pause (You know, to prevent accidental pauses...)\n- The most recently played level would now be selected upon launch\n- Fixed inverse override being automatically reset"},{"version_id":"826051155","version_name":"1.4","version_date":"2018-03-06 08:52:04.000 +0800","version_description":"1.4 has arrived! (๑¯∀¯๑)\n\n- Introducing: Ranked Mode! Play and rank among global players!\n- Two new built-in songs from Trifect and PTB10!\n- You can now share your scores with others!\n- Much faster startup time!\n- Fixed levels being incorrectly vertically inverted: you can now turn off \"Inverse\" for your levels if you were told to turn on it previously\n- The installed level will now be automatically selected\n- New option: larger hitboxes & early/late indicator\n- Many bug fixes\n\n...and more!"},{"version_id":"827164950","version_name":"1.5","version_date":"2018-08-02 02:57:32.000 +0800","version_description":"Cytoid 1.5 \"Anniversary Update\"\n\n- New official song \"Ecstatic\" by Delos and a hidden song by PTB10. (Can you find it?)\n- Flick notes, long hold notes, and variable scanline speed: more freedom to creators, and more fun to players.\n- Mods: Invisible notes, faster approach rates, health bars... Challenge yourself in different ways!\n- Player Exp/Rating: Show off your ability, and compete with players from around the world!\n- In-game integration: You can now rate levels and view level leaderboards directly without leaving the game!\n- Audio system has been completely overhauled. Now you won't need to tune the chart offset very often! (The level absolute chart offset is now replaced with the level relative chart offset, which is relative to the main chart offset.)\n- A shiny new UI design and some subtle game animation improvements.\n- New customization options, including note size, margins, play area boundaries, detailed color customizations, and more!\n- Did I mention the game runs much smoother as well?"},{"version_id":"829122155","version_name":"1.5.1","version_date":"2018-11-01 01:34:58.000 +0800","version_description":"Happy Halloween! This update brings new, exciting storyboarding features to all charters.\n\n- Storyboard:\n    * Triggers: Conditionally spawn stage objects\n    * Stage objects can now be destroyed to boost performance\n    * UI/Scanline/Background dim/Storyboard opacity\n    * Stage objects layer & order\n    * Note colors, size & opacity\n    * Sprite/Scanline colors\n- Added background dim option\n- Clarified note descriptions in options\n- Fixed other minor bugs"},{"version_id":"829810872","version_name":"1.5.2","version_date":"2019-01-03 07:28:31.000 +0800","version_description":"Some bug fixes and general improvements. More to come in 2019!"},{"version_id":"832851791","version_name":"Compatibility\r\rIf you are using iOS 10","version_date":"","version_description":""},{"version_id":"832851791","version_name":"1.5.5","version_date":"2019-09-24 01:05:32.000 +0800","version_description":"- Fixed a file compatibility issue with iOS 13.\n- The latest Unity engine has optimized the audio play offset, which means you may have to reconfigure your level offset settings because of this change! We recommend deducting 0.05-0.1s from your current offset settings. We apologize for this inconvenience!"},{"version_id":"837779050","version_name":"2.0.0","version_date":"2020-09-18 15:13:18.000 +0800","version_description":"◾ iOS Version Compatibility\n\nIf you are using iOS 10, 11 or 12, you should either update to iOS 13, or update to the latest subversion of iOS (i.e. 10.3.4, 11.4.1 or 12.4.8) before running Cytoid. We are sorry for any inconvenience!\n\n\nTwo years in the making, the long-awaited 2.0 release is finally here!\n\nWe overhauled EVERYTHING to provide you with better gameplay & graphics, diverse gamemodes, and a much smoother community-driven experience.\n\n◆ NEW EXPERIENCE: The completely redesigned UI is more stylish than ever, and also much simpler to navigate\n◆ BUILT-IN COMMUNITY: Browse and download 4000+ user levels without leaving the game\n◆ RATING SYSTEM: A reworked rating system to test your sense of rhythm and compete against the best of the best\n◆ TRAINING: 15 levels ranged from Lv.1 to Lv.15 specifically designed to train your skills\n◆ EVENTS: Join seasonal and collaboration events and earn exclusive rewards\n◆ TIERS: Get officially certified for your Cytoid skills by passing courses of various difficulties\n◆ CHARACTERS: Introducing unlockable characters who will accompany you on your Cytoid journey\n◆ MORE CREATOR FREEDOM: New storyboarding features open up exciting possibilities for transforming Cytoid's gameplay\n◆ BETTER MUSIC/NOTE SYNC: Reduced audio latency, a calibration mode, and a one-time device setup to solve synchronization issues\n◆ LOCALIZATION: Cytoid is now in 14 languages\n...and much, much more!\n\nDevelopment of Cytoid would not be possible without a group of talented artists, our community members, and of course, our Patreon/Afdian supporters. View our special thank-you page at https://cytoid.io/credits."},{"version_id":"838423241","version_name":"2.0.2","version_date":"2020-10-30 02:34:00.000 +0800","version_description":"- Fixed crashing on launch on some iOS versions\n- Removed memory warning dialog (too many false positives!)\n- Fixed database corruption issues\n- Fixed characters not showing up in tier selection\n- Fixed drag notes glitching in some storyboards\n- Updated translations"},{"version_id":"845095834","version_name":"2.1.1","version_date":"2021-11-04 21:16:50.000 +0800","version_description":"Cytoid 2.1 is now released!\n\n\n\nAfter a long year of silence, we are excited to bring you a new Cytoid update!\n\n\n\n◆ New event: Edge of Consciousness\n\n\n\nWe collaborated with illustrator 抑制意识 to bring her original characters and their stories to Cytoid. This event presents 10 songs of various genres, including a few from last year's Cytoid Open Submission, 3 new characters and 9 event-exclusive badges.\n\n\n\n◆ New system: Character EXP\n\n\n\nWe know Cytoid is your favorite RPG game, so you can now level up your characters! The EXP you get is proportional to the difficulty of the chart as well as your performance. But you may wonder, why? Well...\n\n\n\n◆ New system: Character awakening\n\n\n\nSome characters now have an awaken form (or elite form, whatever you want to call it) which can be unlocked when they reach a certain level. In Cytoid 2.1, four characters can be awakened: Shiro, Kuro, Threose and Hancho. You can check out the specific requirements in the character selection menu!\n\n\n\n◆ New feature: Event progress tracker\n\n\n\nFinally! You can now track your progress on the events by tapping on the \"View Objectives\" button on the event selection screen. It's that simple.\n\n\n\n◆ New feature: Batch downloading/deleting levels\n\n\n\nAnother long-awaited feature. Long press on level cards to enter the multi-selection mode. Then you can easily download or delete levels at once!"}]