[{"version_id":"824466852","version_name":"0.1.3","version_date":"","version_description":""},{"version_id":"824791762","version_name":"0.1.4","version_date":"","version_description":""},{"version_id":"825022316","version_name":"0.1.5","version_date":"","version_description":""},{"version_id":"825378033","version_name":"0.1.6","version_date":"","version_description":""},{"version_id":"825794186","version_name":"1.0.1","version_date":"2018-01-29 22:46:36.000 +0800","version_description":"Hello Envisioners, <br><br>Firstly, thank you for an amazing response Envision AI 1.0! We've been working hard to improve the stability and speed of the app. This update contains a few major bug fixes that you have reported to us over the week. <br><br>Please continue to give us valuable feedback on the app either on @LetsEnvision or karthik@letsenvision.com<br><br>Thanks!"},{"version_id":"825829348","version_name":"1.1","version_date":"2018-02-02 17:20:56.000 +0800","version_description":"Hello Envisionaries,<br><br>We thank all the new subscribers and users for showing Envision 1.0 much love. We are slowly growing stronger as a community and you are the reason for all that. With this update, we are introducing a couple of more exciting features that we have been working. Can't wait for you to try them out:<br><br>1. You can now hear the scenes around you described in your own language. Just go ahead and use the \"Describe Scene\" feature and Envision will try and describe the surrounding in your native tongue. This works well with face recognition too.<br><br>2. You can now also read handwritten texts with Envision. We have made a new feature addition under the Text Recognition tab, which allows you take images of handwritten text and have it read out to you. Go ahead and try reading that birthday card you received. (This works only with English and other Latin texts at the moment, but we are looking for ways to include other scripts.)  <br><br>3. Namaste India and Sawasdee Thailand! Envision is now officially available in Hindi and in Thai. Special shoutout to Peera from Thailand for generously helping us with the translations.<br><br>4. All Text Recognition features now automatically detect lighting conditions and turn on the flash if it is too dark. <br><br>5. In addition to these, there have been several bug fixes and performance improvements that make the app noticeably smoother and faster. We have put special efforts into improving the performance of our Live Text recognition feature.<br><br>That's a quick summary of what we are pushing out now. There is plenty more brewing in our lab here and we now feel more motivated than ever to keep delivering the best service possible. Looking forward to your love and support as we grow this together. <br><br>Until next time,<br>Karthik from Envision"},{"version_id":"825874778","version_name":"1.6.7","version_date":"2019-08-20 18:30:10.000 +0800","version_description":"Hello! <br><br>Another update, another week! This time with a bunch of fixes that you all requested for this past week(and some new localizations too!). Here's a quick rundown of the changes. <br><br>1. Updated localizations for Japanese, Turkish and Hebrew! We really thank members of our community who contributed to this!<br>2. Fixes for people who use the app with bigger font sizes. <br>3. Crash fixes for users on iOS 12.4 and 13.<br><br>As always please keep the support coming for Envision coming for the rest of month! This August has been nothing short of exhilarating for us and we have some more wonderful updates planned for you the coming weeks! Also, we're really keen to hear your feedback, please send them over from within the app or write to support@letsenvision.com. We're eager to hear you!<br><br>Cheers, <br>The Entire Envision Team"},{"version_id":"828031549","version_name":"1.4.8","version_date":"2018-08-01 20:50:49.000 +0800","version_description":"Hi Envisionaries, <br><br>Here's the update for this week's release:<br><br>1) Envision can now recognise QR codes apart from barcodes. So you can scan any QR code and Envision can help you get relevant information from it. You can click on the 'More Information' button.<br><br>2) We're super excited to have Envision now available in Italian and Arabic! We're extremely thankful to Elena Brescacin, one of our Annual subscribers and Moshin, from Oman for the translations. <br><br>3) We also have some minor bug fixes and improvements to the app in general. <br><br>We spent all of July working on some really interesting features and testing them to get it just right. We can't wait to show you this in the coming month. So please stay tuned for more in the coming weeks. As always, we would love to hear your feedback about the app, you can always email us at karthik@letsenvision.com or request a call back from us from within the app!<br><br>Have a great week ahead!<br>Karthik from Envision"},{"version_id":"828176952","version_name":"1.5","version_date":"2018-08-13 00:40:03.000 +0800","version_description":"Hi,<br><br>This version introduces a new long-awaited feature in Envision called Scan &amp; Find. It's a whole new tab in addition to the Text and General tab that already existed. This tab has three functions:<br><br>1. Teach Envision: This is similar to the previous teaching flow that we had, but we have improved it for higher accuracy. The new teaching method does take a little longer to process, but ensure the recognition happens much more accurately.<br><br>2. Custom Scan: This function turns on the video feed and starts searching if any of the trained faces or objects are in the frame. As soon as it sees an object or person you have trained on the frame, it will speak it out. This could be useful in instances where you are searching for your lost keys on the table or for a friend in a cafe.<br><br>3. General Scan: This function is to use the video feed to recognise general objects that are in front of you. This could be used to get a sense of what objects are around you or to just point it out from the bus to see what are you passing by. <br><br>We have put in a lot of work into building the backend for this and will continue to work on improving its stability, speed and accuracy. This is the very first version of this whole new feature so we look forward to hearing your thoughts and feedback on it and learn how to make it better. <br><br>Best regards,<br>Karthik from Envision<br><br>P.S. Envision now is also completely available in Traditional Chinese thanks to Keny from Hong Kong!"},{"version_id":"828241740","version_name":"1.5.1","version_date":"2018-08-29 15:48:42.000 +0800","version_description":"Hi Envisionaries,<br><br>This update contains some improvements and some additions. The main improvement that you will see is with the Scan &amp; Find feature, which should now be relatively faster and more accurate. We are still working on making the training time shorter, so bear with us.<br><br>Stay tuned for more frequent updates from here on out. We have several improvements and features planned to make your Envision experience even better.<br><br>Until next time,<br>Karthik from Envision"},{"version_id":"828404666","version_name":"1.5.2","version_date":"2018-08-30 17:27:39.000 +0800","version_description":"Hi Envisionaries,<br>This update contains some improvements that will enable Envision to work better on the iPad. We've also added two new languages, Japanese and Russian! <br><br>Big shout out to our user from Japan, Tomo Kihara and Anastasia from Russia! <br><br>Stay tuned for more frequent updates from here on out. We have several improvements and features planned to make your Envision experience even better.<br><br>Until next time,<br>Karthik from Envision"},{"version_id":"828480624","version_name":"1.5.3","version_date":"2018-10-14 19:53:44.000 +0800","version_description":"Hi,<br><br>Firstly, sorry for slight delay with our iOS updates. September has been a pretty hectic month for us but we're back on track now and have some exciting stuff for you:<br><br>1) A revamped walkthrough - We've made the walkthrough shorter, crisper with this update so new users don't have to go through a lot before getting started. <br><br>2) A new subscription page - We've redone our subscription page as well so it's easier to figure out the subscription plans and know what other subscribers have to say about us!<br><br>3) Object training in the background - We've pushed the object training functionality to the background so you can continue to use the app without having to wait for the training to get over. Training usually takes 3-5 minutes and you should be able to scan and find your objects after it's done. <br><br>There are a bunch of other small bug fixes and improvements as well that have been reported over the past 3 weeks. <br><br>That's all from us, we'll see you soon with another exciting update in October. As always, please send us your feedback at karthik@letsenvision.com or reach out to us from within the app. We're always looking to hear from you and improve our services. <br><br>Have a great week ahead!<br><br>Regards, <br>Karthik from Envision"},{"version_id":"829074968","version_name":"1.5.4","version_date":"2018-11-01 23:22:50.000 +0800","version_description":"Hello, <br><br>October has been such a rewarding and intense month at Envision and we have some interesting updates to share with you in this update. <br><br>1) Dynamic Type support - With this update, we've added support for dynamic type throughout the app. This means the app will adapt to the font size of your phone which makes it a lot easier to use for our users in the low vision community. <br><br>2) Document text update - We've improved our document text mode with a couple of much requested updates. When you choose to the playback option, words are now highlighted in the text for users to easily keep a track of what's being read. You can also adjust the font size of the text directly from within the document text page. <br><br>3) Translated to Greek - Envision is now fully translated to Greek! Thanks to the efforts of Irene Nakas and her friends! Also, huge thanks to them for continuously testing the beta version of the app and for making sure we didn't miss out any translations!<br><br>4) Various bug fixes and improvements are also part of this update which improves the speed and stability of the app. <br><br>That's all for this update, folks! We're busy with some more interesting updates. As always, we want to talk to you and hear from you about your experience with the app. Please feel to reach out to us at karthik@letsenvision.com or request a call from within the app itself!<br><br>Thanks, <br>Karthik From Envision"},{"version_id":"829267999","version_name":"1.5.5","version_date":"2018-11-26 23:23:49.000 +0800","version_description":"A new festive update is here! This holiday season Envision is slashing the price off all of its subscription options by 30%! This is huge, so get all your friends and family on board as this is a limited time offer!<br><br>There are also nice little fun changes within the app that you could find. If you do find them, tweet them to us at @LetsEnvision.<br><br>This update also has some major improvements under the hood:<br><br>1. Account information is now synced real-time and will always be accurate. This should resolve some discrepancies that users were having earlier. <br>2. The Envision It extension now works across all social media apps including Twitter, Telegram, etc. <br>3. Language detection for iOS 12 users using offline text recognition has also been fixed. <br><br>Expect more fun updates going forward and have a great holiday season with your loved ones!<br><br>Cheers, <br>Karthik From Envision"},{"version_id":"829480262","version_name":"1.5.6","version_date":"2018-12-03 21:08:47.000 +0800","version_description":"Another week, another update! <br>We've been getting such an amazing response to our holiday subscription sale! Keep it coming and we promise to bring more treats this holiday season! <br><br>Here's a quick rundown of all the updates with this release: <br><br>1. Improved colour recognition! We've reworked our colour recognition algorithm to be more accurate and faster as well. Do try it out and lets us know your thoughts about this! <br><br>2. Improved Russian translations! This week we saw a lot of people from Russia becoming part of the Envision community, we took the time to fully test the app in Russian. Russian translations are brought to you, courtesy of Benjamin. Benjamin is our awesome iOS developer who's also responsible for a lot of good stuff you see in the app nowadays. <br><br>3. Full translated subscription page so all the information on it is now available in your local language. <br><br>4. Major bug fixes and improvements under the hood. <br><br>We're super excited about this release and all the upcoming improvements we've been planning for the end of the year. If you have any questions or comments about the app please do write to karthik@letsenvision.com. As always, we're very eager to hear from each one of you about your experience and the ways we can improve the app further. <br><br>Have a great month ahead!<br><br>Cheers, <br>Karthik From Envision"},{"version_id":"829550659","version_name":"1.5.7","version_date":"2018-12-19 14:47:59.000 +0800","version_description":"The holidays are nearing and it's festive season everywhere! To make it even better, we've worked on some nice updates with this release.<br><br>Here's a list of changes with this update:<br><br>1. We've made some changes to our online instant text to make it faster than before. We've also fixed some issues with the document text functionality. <br><br>2. Some users mentioned about the Envision It extension not being able to read Arabic text, we've fixed it with this update. We've also made the extension's text recognition functionality more accurate. <br><br>3. We've fixed some more bugs in the login page as well. <br><br>2018 has been such a rewarding year thanks to, you, members of the Envision community. We consider it a privilege to wake up each day and build tools for such a warm and supportive community. As always we are looking to improve the app in as many ways as possible. If you have any comments or questions about the app please feel free to shoot an email to karthik@letsenvision.com or get in touch from within the app. <br><br>Thanks and we wish you and your family Happy Holidays! <br><br>Cheers, <br>Karthik from Envision."},{"version_id":"829731581","version_name":"1.5.8","version_date":"2018-12-21 00:05:05.000 +0800","version_description":"This update contains a fix for users experiencing difficulty with logging in through Facebook."},{"version_id":"829894271","version_name":"1.5.10","version_date":"2019-01-15 18:16:32.000 +0800","version_description":"2019 has begun and how! This is our first update after the new year's and we've some great stuff planned with this release and upcoming ones real soon. <br><br>Here's what's shipping with this release:<br><br>1. We've updated our on-boarding/in-app tutorial to be a lot more easier to follow. Setting up Envision is now easier than before! Do give it a shot and let us know what you think!<br><br>2. You can now save an image with it's description even from the Envision It extension. <br><br>3. Various bug fixes and minor improvements in the Text tab.<br><br>As always we're super excited to hear your feedback, questions and comments. Do write to us at karthik@letsenvision.com or contact us through the request a call feature from within the app. We really look forward to an exciting 2019 and wish you a great 2019 as well!<br><br>Regards, <br>Karthik From Envision"},{"version_id":"829976648","version_name":"1.5.11","version_date":"2019-02-09 19:28:47.000 +0800","version_description":"Bug fixes and improvements to the document OCR module."},{"version_id":"830446305","version_name":"1.5.12","version_date":"2019-03-15 02:17:49.000 +0800","version_description":"Hello Envisionaries! <br><br>We've a new version of the Envision app ready for launch. Here's a list of improvements with this update:<br><br>1. We've fixed a bug that caused the app to crash or not be responsive when you try to import a PDF into the app. <br>2. We've also updated our Russian and Dutch translations with the app! <br>3. Some general bug fixes and improvements.<br><br>We're going to be picking up the pace with the updates and you can expect some major additions in the coming weeks. As always please keep us updated with your feedback and don't hesitate to reach out to us from within the app. <br><br>Thanks!"},{"version_id":"830657318","version_name":"1.5.13","version_date":"2019-03-20 00:48:20.000 +0800","version_description":"This is a quick update to rectify issues with translations for some languages."},{"version_id":"830710915","version_name":"1.6.0","version_date":"2019-04-07 22:51:05.000 +0800","version_description":"We are happy to introduce a major to the scan and find tab. With this update you can scan for both faces and objects through a live video feed!<br><br>When you tap on find common objects you will be able to scan for objects such as cup, chair, laptop, etc in your surroundings. When these objects come into view you will hear a beep that indicates the presence of the object. In the case of find persons it works in a similar way. You will be able to detect people and if you've trained Envision to recognise them you can hear their names spoken to you as well. <br><br>We're going to continue to improve this feature in the next few updates so if you wish to see any additions or improvements to it please write to us at karthik@letsenvision.com. We'd love to hear from you!"},{"version_id":"831143258","version_name":"1.6.1","version_date":"2019-06-01 16:31:05.000 +0800","version_description":"Hello Envisionaries! <br><br>We know this is a long due update. <br><br>May has been super hectic(and super awesome!) for us and lots of new, exciting things are happening each day! We would share them all with you in due time so in the meantime please continue supporting us and giving us feedback on where to improve. <br><br>Without further ado, here's what's new with this update:<br>1. This update brings more firepower to the Find tab. We've now expanded the objects collection to more than 60 different objects. You can also request objects that you think should be added to this list and we'll try to add them in subsequent updates. We've plans of making this tab more powerful in the near future so give us your thoughts! <br><br>2. We've fixed a bug that caused the scene description to not work from within the app for a few of y'all. We've made sure that such incidents don't happen in the future as well. Thank you for reporting this at the earliest. <br><br>3. Some minor changes under the hood to improve the performance on devices running iOS 10. <br><br>Rest assured June will be a month full of interesting, exciting updates from us! Oh, did we tell you about our new iOS developer, Abby, who worked on some of the good stuff you see with this update? You'll see more of her work in the upcoming updates as well. And finally, as always lease continue to give us valuable feedback on how to improve the app, we're always listening!<br><br>Cheers, <br>Team Envision"},{"version_id":"831529086","version_name":"1.6.2","version_date":"2019-07-06 17:46:08.000 +0800","version_description":"This version packs a lot of additions, improvements and fixes. Here's a quick rundown:<br><br>1. A new improved Edge Detection which not only gives more accurate information about edges visible but also results in a more accurate output. <br><br>2. More ways to read everything! You will see a new 'More' button on the Text Tab which will show you options to Read Multiple Pages, Import a PDF or Import an Image. <br><br>3. Face recognition for your saved photos is here. Now when you share an image from your camera roll or other apps into Envision, it will recognise the faces in it that you have taught on Envision. This provides you with a richer description of photos that have your friends or family in them.<br><br>4. Plenty of optimisations and fixes which makes the app smoother, faster and 70 MB lesser in size.<br><br>Also, some of you will notice that the handwriting recognition has gone missing! Don't panic, we have now integrated it within document recognition itself. So when you tap \"Read Document\" it recognises and reads handwriting as well.<br><br>That is all for this update, but the summer has just started. So much more exciting stuff around the corner. You really really wouldn't want to miss our next update. Until then, enjoy yourself and do reach out to us in case of any suggestions or feedback.<br><br>Yours truly,<br>The jolly folks at Envision<br><br>P.S. A quick shoutout to Abby, the latest member of the Envision team, who poured her heart into this update!"},{"version_id":"831924966","version_name":"1.6.3","version_date":"2019-07-09 21:14:20.000 +0800","version_description":"This version packs a lot of additions, improvements and fixes. Here's a quick rundown:<br><br>1. A new improved Edge Detection which not only gives more accurate information about edges visible but also results in a more accurate output.<br><br>2. More ways to read everything! You will see a new 'More' button on the Text Tab which will show you options to Read Multiple Pages, Import a PDF or Import an Image.<br><br>3. Face recognition for your saved photos is here. Now when you share an image from your camera roll or other apps into Envision, it will recognise the faces in it that you have taught on Envision. This provides you with a richer description of photos that have your friends or family in them.<br><br>4. Plenty of optimisations and fixes which makes the app smoother, faster and 70 MB lesser in size.<br><br>Also, some of you will notice that the handwriting recognition has gone missing! Don't panic, we have now integrated it within document recognition itself. So when you tap \"Read Document\" it recognises and reads handwriting as well.<br><br>That is all for this update, but the summer has just started. So much more exciting stuff around the corner. You really really wouldn't want to miss our next update. Until then, enjoy yourself and do reach out to us in case of any suggestions or feedback.<br><br>Yours truly,<br>The jolly folks at Envision<br><br>P.S. A quick shoutout to Abby, the latest member of the Envision team, who poured her heart into this update!"},{"version_id":"831960867","version_name":"1.6.4","version_date":"2019-07-19 14:16:57.000 +0800","version_description":"We hope you're summer's coming along well. This week's update comes with the following goodies: <br><br>1. We've improved the \"Envision It\" extension for reading PDFs. With this update you can share PDFs like before and it should work a lot faster and more realiably!<br><br>2. We've also slowed down the pinch to zoom feature in our magnifier. You should be experiencing the same level of pinch to zoom like you do in the Camera app. <br><br>3. We've fixed an issue where you couldn't save a person's name in a non-latin language(like Arabic, Hebrew, etc.). <br><br>4. We've made some under the hood changes that should make the app more faster and smoother to use! <br><br>As always please keep giving us your feedback! We'd love to hear from you about your experience with Envision. We've some really big stuff lined up for the summer and are super excited to show it to you! So stay tuned!"},{"version_id":"832101318","version_name":"1.6.5","version_date":"2019-07-30 20:13:41.000 +0800","version_description":"Envision's Super Summer Sale is here!<br><br>We are offering huge discounts across all our plans with Annual and Monthly subscriptions being over 50% Off whereas the Lifetime Subscription being a whopping 75% Off. If you have been waiting on the fences for an opportunity to dive into this award-winning app, now is your chance.<br><br>What else is new in this update?<br>- Updated localisations for Dutch, German, Swedish, Arabic and Ukranian. <br>- Fixing bugs with PDF recognitions.<br>- New processing sounds courtesy of the very talented Andre Louis.<br><br>And as always plenty of minor bug fixes and performance improvements to make the Envision experience smoother than ever. So what are you waiting for? Spread the word in your community as this sale will not last long. <br><br>Let us know your thoughts and feedback through karthik@letsenvision.com<br><br>Until next time,<br>The jolly folks at Envision"},{"version_id":"832209637","version_name":"1.6.6","version_date":"2019-08-07 15:42:05.000 +0800","version_description":"Hello everyone!<br><br>Firstly, thank you so much for the amazing support we've received from you guys over the past week. And also, thank you for all the feedback you've given us over the past week. We've incorporated a few things with this update and will work towards adding more of your requests in the coming weeks. Here's what's changed with this update:<br><br>1. We've fixed a crash for some users when no product was found or if an invalid barcode was detected. <br>2. We've updated strings for Arabic, Czech &amp; Chinese strings.<br>3. Some more under the hood improvements that should speed things up within the app. <br><br>As always, please keep giving us feedback on the app and we're always committed to improving it with each update. <br><br>Cheers, <br>The jolly folks at Envision"},{"version_id":"832327046","version_name":"1.6.7","version_date":"2019-08-20 18:30:10.000 +0800","version_description":"Hello! <br><br>Another update, another week! This time with a bunch of fixes that you all requested for this past week(and some new localizations too!). Here's a quick rundown of the changes. <br><br>1. Updated localizations for Japanese, Turkish and Hebrew! We really thank members of our community who contributed to this!<br>2. Fixes for people who use the app with bigger font sizes. <br>3. Crash fixes for users on iOS 12.4 and 13.<br><br>As always please keep the support coming for Envision coming for the rest of month! This August has been nothing short of exhilarating for us and we have some more wonderful updates planned for you the coming weeks! Also, we're really keen to hear your feedback, please send them over from within the app or write to support@letsenvision.com. We're eager to hear you!<br><br>Cheers, <br>The Entire Envision Team"},{"version_id":"832641513","version_name":"1.6.8","version_date":"2019-09-10 16:56:42.000 +0800","version_description":"Hi, <br><br>With this update we've made the following fixes:<br><br>1. We've fixed an issue where the app wasn't reading or describing images from Twitter or other apps. <br>2. We've fixed an issue where users weren't able to delete faces they've trained once with the envision. <br><br>We've also updated strings in Vietnamese and added a processing alert if you're trying to export text before the processing is fully complete. We've some major improvements planned for September and are excited to share it with you in the upcoming days!"},{"version_id":"832764759","version_name":"1.6.9","version_date":"2019-09-25 22:32:49.000 +0800","version_description":"This update has important bug fixes and improvements for users on iOS 13 and iOS 13.1."},{"version_id":"832996755","version_name":"1.6.10","version_date":"2019-10-02 22:07:50.000 +0800","version_description":"Hello everyone! <br><br>This update brings some more bug fixes for iOS 13, making the app more stable. We've fixed a crash which happens when you go back to the text tab after reading a document. We've also fixed the play button on the document reader page which wasn't working for a few users. <br><br>This also has a few under the hood improvements to make teaching faces and reading PDF documents faster. <br><br>As always, continue to send in your feedback and thank you for all the support!"},{"version_id":"833020567","version_name":"2.0.0","version_date":"2019-10-25 07:28:34.000 +0800","version_description":"Boom! Now, this is an update! <br><br>Introducing Envision 2.0. – A whole new look, more customisation and at a new reduced price for all. <br><br>We have been working behind the scenes for a while to build a brand for Envision that truly represents Envision's value. This is now evident in the app in terms of visual elements like logo, colour scheme and icons, but also UI changes such as dynamic font support and dark mode contrast for low vision users. Here's a list of all the changes you can find in this new update:<br><br>1. New look – new logo, new colour scheme, new icons.<br>2. Dark Mode – if you're a user who prefers a dark mode for the app as it is easier on the eyes (and better for the battery life) this is your chance.<br>3. Dynamic Type support – if you're using your phone with increased font size, the app and its buttons will automatically scale and adapt it's UI for a better experience.<br>4. The names on the buttons are also now localised into 25 languages.<br>5. An option to turn off processing sound has been introduced in Settings Tab.<br>6. The bug with importing PDF from other app has been fixed.<br>7. The bug with importing images from Twitteriffic has been fixed. <br><br>In addition to these changes, Envision now has new reduced prices. The prices vary based on geography, hence go into the app and find out the new prices in the subscription page yourself. That said, the prices have been slashed by more than 50% across all countries. <br><br>We have also built several small but delightful features in which we are excited for you to find it out as you explore the app. This is the beginning of a new ambitious road for Envision and we are very excited to continue building more feature and enhancements. Connect with us on Facebook and Twitter to express your thoughts and feedback like always. Looking forward to hearing from you.<br><br>Lots of Love,<br>Team Envision"},{"version_id":"833332802","version_name":"2.0.1","version_date":"2019-10-30 13:09:43.000 +0800","version_description":"Hi, <br><br>This quick update brings in some fixes:<br>1. Instant text now works well again. Sorry for the hiccup. <br>2. Sharing PDFs to the app is now fully functional again. <br>3. Under the hood improvements to the read documents feature to make it more accurate and faster.<br><br>Thank you for letting us know about these issues. Please continue to give us feedback about the app and what you'd like to see added or improved. <br><br>Thanks, <br>Team Envision"},{"version_id":"833405522","version_name":"2.0.2","version_date":"2019-11-08 19:25:58.000 +0800","version_description":"Fixed a bug where instant text wouldn't read out text in the voice you fixed. Other bug fixes and improvements."},{"version_id":"833578748","version_name":"2.0.3","version_date":"2019-11-16 07:53:56.000 +0800","version_description":"Hi all, <br><br>With this update we've fixed the issue with instant text. This one was really tricky for us to fix but thanks to everyone in the community for testing out the beta and getting back to us promptly. It's an understatement to say how awesome you all are! We also have improved the general performance of the app itself so things should a lot more snappy and awesome than before! <br><br>We have some interesting and much requested updates coming up over the next week. Please stay tuned for those. And as always, we're eager to hear about any feedback you might have with the app. Please write to us at support@letsenvision.com with your thoughts!<br><br>Regards,<br>Karthik from Envision"},{"version_id":"833779038","version_name":"2.1.0","version_date":"2019-12-05 14:36:32.000 +0800","version_description":"Here comes another big update ringing in the festive season! Let's run down through some new things that you will find:<br><br>1. Siri Shortcuts: You can now set up Siri Shortcuts for all the actions of the app through the Help Tab. You can then simply say \"Hey Siri, read this\" to open up instant text or \"What colour is that?\" to start detecting colours. Try it out and share your results!<br><br><br>2. 3D Touch Shortcut: We have also made it easy for you to have quick access to your most used actions by setting them as 3D Touch Shortcuts. You can then access them by pressing hard on the Envision app icon and then jump directly into the action you're looking to do.<br><br><br>3. The holiday season is back, so we have introduced introductory discounts. If you're contemplating becoming a subscriber, signing up for a subscription now will make sure you pay almost half for your first period. <br><br>4. There's also new Christmasy processing sound and app icon.<br><br><br>5. We made several improvements to the document recognition feature, where the experience is smoother than before. <br><br>As always, there are plenty more changes under the hood to improve performance. Keep a tab on our social media for a more special announcement coming up later this month.<br><br>Until then, we hope you have a nice holiday with your family and friends. <br><br>Yours truly,<br>The folks at Envision"},{"version_id":"833891941","version_name":"2.1.1","version_date":"2019-12-19 15:45:07.000 +0800","version_description":"With this update we've added improvements to instant text and document text recognition."},{"version_id":"834182352","version_name":"2.1.2","version_date":"2020-01-15 01:29:11.000 +0800","version_description":"With this update we have the following changes: <br><br>1. When you now save an image with description, Envision will save the image with both the description and the text. This is only applicable for images saved through the Envision It extension. <br><br>2. We've fixed a particular crash happening for some users when they open the app up after logging in through email. <br><br>Some more bug fixes and performance improvements. As always, please continue to share your feedback with us by writing to karthik@letsenvision.com."},{"version_id":"834387715","version_name":"2.1.3","version_date":"2020-02-11 03:15:36.000 +0800","version_description":"With this update, we've some minor improvements to instant text which should make it more accurate to use across both landscape and portrait mode. Document Scanning should crop and detect documents more accurately. Multiple Language Detection should read paragraphs, blocks and pieces of texts with its dominated language. We also have some minor improvements which should make the performance better."},{"version_id":"834687293","version_name":"2.1.4","version_date":"2020-02-14 02:49:39.000 +0800","version_description":"This update has the Instant text multi language detection improvement. It should read paragraph and text in its dominated language."},{"version_id":"834783274","version_name":"2.1.5","version_date":"2020-02-28 15:53:08.000 +0800","version_description":"Hello everyone! <br><br>With this update, we've made the following changes: <br><br>1. Improvements to instant text. A few of y'all had complained that the app wasn't reading right, we've fixed it once and for all. <br><br>2. Performance improvements so the app continues to be super smooth. <br><br>We're working on some big changes in the coming weeks so the updates are going to definitely going to get bigger and more frequent. We would love to hear your thoughts about the app - what features you'd like to see, issues you face, etc. Please write to us at support@letsenvision.com and we'll get back to you as soon as possible. <br><br>Here's until our next update, <br><br>Team Envision."},{"version_id":"834924800","version_name":"2.1.6","version_date":"2020-03-09 17:51:18.000 +0800","version_description":"Hello Everyone!<br>We are happy to update you guys with some Improvements: <br><br>1. Instant text, is now more responsive in picking up texts.<br>2. Redemption Codes, you can now redeem them via E-mail Login.<br>3. Login, along side the Redemption code fixes. We have made sure that logging in any form would be smoother.<br>4. Document Scanning, Multiple or Single. Timing wise, we manage to create a process that works for both.<br>5. Account Details, From your purchases we made sure your details and data are always up to date.<br>6. Performance,  feature buttons toggle is now more responsive.<br><br>There’s always room for improvement. We would love to hear your thoughts about the app - what features you'd like to see, issues you face, etc. Please write to us at support@letsenvision.com and we'll get back to you as soon as possible. <br><br>Here's until our next update, <br>Team Envision."},{"version_id":"835064269","version_name":"2.1.7","version_date":"2020-03-25 03:33:47.000 +0800","version_description":"This update brings some more improvements to the instant text responsiveness. This is specially for users of online instant text. <br><br>Also, there are some more bug fixes and improvements to the app that should improve the performance overall."},{"version_id":"835452788","version_name":"2.1.8","version_date":"2020-04-09 06:39:27.000 +0800","version_description":"Hello!<br><br>We hope you and your family are doing fine during these unprecedented times. We've been hard at work continuing to bring improvements to the app and making sure Envision is always in the best possible shape to support you. Here's a list of changes with this update: <br><br>1. A faster, more reliable Document Reader - you can now import PDF files of any size and the app should be able to handle it with ease. <br>2. Better export feature - You can now export a scanned document easily in .txt format and if during the export process stops midway for any reason it'll resume from the last page exported if you reload the document. <br><br>There are more improvements under the hood for the Document Reader and in other parts of the app. As always, we're eager to hear your feedback so please write to us from within the app or to support@letsenvision.com <br><br>We've some more exciting stuff planned for the rest of the month and we can't wait to share it with you!<br><br>Stay safe and stay well. <br><br>Regards,<br>Team Envision"},{"version_id":"835479742","version_name":"2.1.9","version_date":"2020-05-02 16:14:18.000 +0800","version_description":"With version 2.1.9, we have the following changes:<br><br>- Improvements to the Document Reader, especially importing PDFs.<br>- We’ve also fixed some bugs to the “Envision It” extension which should make reading text much faster than before.<br><br>There are some more improvements to the overall app itself -- just to make things a lot faster and more stable. We’d love to hear from you so please send us feedback at support@letsenvision.com.<br><br>We’ve some major improvements planned for the coming few weeks and we’re super excited to share them with you!<br><br>Until then, stay well and stay safe!"},{"version_id":"835793147","version_name":"2.2.0","version_date":"2020-05-12 20:17:38.000 +0800","version_description":"With this update we have the following improvements:<br><br>• More stable PDF importing experience - We've fixed issues that some users were reporting with importing big PDFs into the app. <br>• Faster 'Envision It' extension - We've added some major improvements to the 'Envision It' extension that will speed things up a lot and also make it more stable. <br>• Overall improvements to the app include ironing out some bugs that were reported by Arabic speaking users.<br><br>We have some great new feature updates lined up for you this month. Please continue giving us your feedbacks, requests and more by writing to support@LetsEnvision.com. <br><br>Stay well and stay safe!"},{"version_id":"835954294","version_name":"2.2.1","version_date":"2020-05-14 16:47:08.000 +0800","version_description":"This update has the Action extension Fix. Envision It would now detect Text and would give a proper Description in a photo wether it’s from your phone’s Library or with other applications such as Twitter, WhatsApp, Slack, etc,."},{"version_id":"836219696","version_name":"2.2.2","version_date":"2020-06-02 06:30:23.000 +0800","version_description":"Hello! <br><br>This update has a lot of internal improvements and bug fixes. These improvements will make the app a lot more stable for new and existing users of Envision. We do have some big feature upgrades planned in coming weeks and this update sets the stage for that. <br><br>As always, we'd love to hear your feedback about the app, so write to us directly from within the app or feel free to request a call to talk to us! <br><br>Take care and stay safe!"},{"version_id":"836241161","version_name":"2.2.3","version_date":"2020-06-16 02:46:32.000 +0800","version_description":"Update 2.2.3 is ready for you! This update has the following improvements:<br><br>• Barcode Scanning - is now even more responsive which means you can now detect almost all types of barcodes.<br>• Color Detection - Reads much slower and accurately.<br><br>Enjoy and please, if you have any feedback don't forget to update us at support@letsenvision.com"},{"version_id":"836435022","version_name":"2.2.4","version_date":"2020-07-08 22:57:34.000 +0800","version_description":"Hello everyone!<br><br>We have a big update with 2.2.4 and here's what's changed:<br><br>1. We're releasing the much requested Jump to Page feature. You can now jump to any page of an imported or scanned document within Envision. <br><br>2. We have updated translations for Dutch, Italian and more languages. Thank you to our Ambassadors for helping with this!<br><br>3. We've added a few minor UI improvements to make it more accessible for low-vision users. <br><br>Stay well, Stay safe and we'll see you with another update very soon!"},{"version_id":"836794576","version_name":"2.2.5","version_date":"2020-07-11 08:22:52.000 +0800","version_description":"Hello!<br><br>Hope you all are doing well. This update focuses on Bug fixes and improvements.<br><br>Stay well, Stay safe and we'll see you with another update very soon!"},{"version_id":"836922450","version_name":"2.2.6","version_date":"2020-07-21 01:58:45.000 +0800","version_description":"Hello there!<br><br>Another update that focuses on Bug fixes and improvements.<br><br>We are making improvements because of your feedback. If you have any concerns Please email us at support@LetsEnvision.com<br>Stay safe and stay well. <br><br>Regards,<br>Team Envision"},{"version_id":"837560840","version_name":"2.2.7","version_date":"2020-09-02 00:53:14.000 +0800","version_description":"Hello Everyone! <br><br>We hope you and your loved ones are healthy and safe. Everyone here at Envision's been doing well too! We've been hard at work putting the finishing touches on the Envision Glasses and working on some big improvements to the app. We hope to be able to share them with you very soon. <br><br>Here's what's new with this update:<br>1. The Envision Glasses tab is now live within the app. This tab is used when pairing with the Envision Glasses and controlling some key features of the device.<br>2. Some minor bug fixes in the text tab to make the document scanning more stable.<br><br>It's going to be a busy few weeks for us as we work towards rolling out some much-awaited features to delight you. In the meantime, please let us know incase you have feedback or any concerns about using the app.<br><br>Cheers, <br>Team Envision"},{"version_id":"837682039","version_name":"2.2.8","version_date":"2020-09-16 16:52:15.000 +0800","version_description":"Hello Everyone, <br><br>With this update, we've updated localizations in many of the languages that Envision supports. We've also fixed a few bugs that users reported from the last version. <br><br>As always, we'd love to hear any and all feedback from you about how to improve the app. Please feel free to write to us at support@letsenvision.com or from within the app. <br><br>Stay healthy and safe!<br><br>Regards,<br>Team Envision"},{"version_id":"837890624","version_name":"2.2.9","version_date":"2020-09-29 13:26:09.000 +0800","version_description":"Hello Everyone, <br><br>Hope you're all doing well. In this update we've some big updates so without further ado, here are the changes:<br><br>1. We've added the option to import ePub and Word documents along with images and PDFs. Now, you can click on 'More Actions' within the Text Tab and find the new 'Import Files' button. <br>2. We've also updated our translations for a number of languages. <br>3. We've made some minor speed improvements to the document scanning feature. <br><br>That's a wrap on the first of many major updates we've planned in the upcoming weeks. Please let us know any feedback you might about the app by writing to us from within the app itself or to support@letsenvision.com<br><br>Stay home and Stay safe!"},{"version_id":"838012991","version_name":"2.3.0","version_date":"2020-10-09 21:49:09.000 +0800","version_description":"Hello everyone! <br><br>We're back again with another big release this week with one of the most requested features. So without further ado, let's jump right into it:<br><br>1. Introducing the Envision Library - You can now save documents you import or scan with Envision directly inside the app. You can click on the 'More Actions' button and easily open the Envision Library. We've also moved the import files option within Library so it's easier for you to access. <br><br>2. We've made some minor UI improvements to the Document Reader to improve VoiceOver accessibility. <br><br>Apart from the above, we've some general bug fixes and stability improvements that should improve your overall Envision experience. <br><br>That's all from this for this update, we will continue to keep the momentum on new features in the upcoming updates so stay tuned! And if you have any feedback about the app please write to us from within the app or support@letsenvision.com. We'd love to hear what you think! <br><br>Until next time, stay healthy &amp; stay safe! <br><br>Cheers, <br>Team Envision"},{"version_id":"838176705","version_name":"2.3.1","version_date":"2020-10-20 17:49:09.000 +0800","version_description":"Hello everyone!<br><br>This release has some improvement regarding the following:<br><br>1. Saved information - The app should reflect your proper information and subscription purchase.<br>2. Document Reader - New layout Navigation, read and stop and paging update.<br><br>..and some general bug fixes that improves over all experience and usage.<br>Keep safe,<br>Team Envision"},{"version_id":"838351667","version_name":"2.3.2","version_date":"2020-11-02 22:39:28.000 +0800","version_description":"We this update we have some minor bug fixes for the Text Tab."},{"version_id":"838501137","version_name":"2.3.3","version_date":"2020-11-10 15:29:26.000 +0800","version_description":"Hello Everyone, <br><br>Hope you’re all staying safe and healthy! We’re super excited to bring this feature-packed version of the Envision app to you! <br><br>1. Column Detection - From this update on, Envision can recognize columns and speak out text in the correct order. So if you’re looking to read magazine articles or ebooks with column layouts then this will be a huge step forward! The column detection feature is turned on by default but you can always turn it off, if required, in the Help Tab. <br><br>2. We’ve fixed a bug that prevented Twitterific users from sharing images using ‘Envision It’.<br><br>3. We also have a new section in the Help Tab called ‘What’s New’ to help you keep up to date on the latest and greatest features, fixes and improvements within the Envision app.<br><br>That’s it for this update. Its down to the last 2 months of 2020 but we still have some big improvements planned for all of you! Please give us your feedback from within the app or write to us at support@letsenvision.com. We love hearing from you.<br><br>Until next time - stay healthy, stay safe!<br><br>Cheers, <br>Team Envision"},{"version_id":"838950990","version_name":"2.3.4","version_date":"2020-11-11 23:29:30.000 +0800","version_description":"Hello Everyone, <br><br>Hope you’re all staying safe and healthy! We’re super excited to bring this feature-packed version of the Envision app to you! <br><br>1. Column Detection - From this update on, Envision can recognize columns and speak out text in the correct order. So if you’re looking to read magazine articles or ebooks with column layouts then this will be a huge step forward! The column detection feature is turned on by default but you can always turn it off, if required, in the Help Tab. <br><br>2. We’ve fixed a bug that prevented Twitterific users from sharing images using ‘Envision It’.<br><br>3. We also have a new section in the Help Tab called ‘What’s New’ to help you keep up to date on the latest and greatest features, fixes and improvements within the Envision app.<br><br>That’s it for this update. Its down to the last 2 months of 2020 but we still have some big improvements planned for all of you! Please give us your feedback from within the app or write to us at support@letsenvision.com. We love hearing from you.<br><br>Until next time - stay healthy, stay safe!<br><br>Cheers, <br>Team Envision"},{"version_id":"839228273","version_name":"2.3.5","version_date":"2020-11-30 15:33:01.000 +0800","version_description":"Hello everyone, <br><br>We hope you're all doing well. We have some exciting news to kickoff the final stretch of 2020 - a big feature update and the Envision Winter Sale. Without further ado, here's more info:<br><br>1. Translate - With Envision you can translate documents you scan or import into the app! Envision will automatically detect the language of the page and translate these documents entirely offline in over 50 languages.<br><br>2. The Envision Winter Sale is here. Get 35% off on the Annual subscription of Envision throughout December 2020! <br><br>We've pushed some great features this year like the Envision Library, Column Detection, being able to import Word and ePub files and now Translate. We've a lot more exciting stuff in the pipeline so take advantage of the Winter Sale to keep getting all these exciting features!<br><br>3. We've also updated translations for many languages. Thanks once again to all our Ambassadors and Translators. <br> <br>That's it for this one. We still have some really cool things in the pipeline for December so please stay tuned for those. In the meantime, stay safe and healthy and as always please share your feedback with us from within the app or write to us at support@letsenvision.com<br><br>Cheers, <br>Team Envision"},{"version_id":"839450916","version_name":"2.3.6","version_date":"2020-12-08 09:07:25.000 +0800","version_description":"Hello everyone, <br><br>We hope you're all doing well and staying healthy. With this update we have the following changes:<br><br>1. We've updated the translations for all languages within the app. <br><br>2. We've made minor bug fixes within the Document Reader based on your feedback. <br><br>As always, please keep us posted about your thoughts and feedback about the app. Also, it would be really helpful if you could leave a review of the Envision app, if you had a positive experience. It really helps! <br><br>Cheers, <br>Team Envision"}]