[{"version_id":"823608435","version_name":"1.0.0","version_date":"2017-10-03 22:43:37.000 +0800","version_description":""},{"version_id":"824072764","version_name":"1.0.3","version_date":"2017-10-26 12:41:17.000 +0800","version_description":"Bug fixes, performance enhancements and fixes to reported crashes."},{"version_id":"824263096","version_name":"1.0.4","version_date":"2017-11-03 14:17:16.000 +0800","version_description":"Optimized for iOS 11 and the iPhone X"},{"version_id":"825915601","version_name":"1.0.5","version_date":"2018-02-12 14:25:12.000 +0800","version_description":"Our latest update includes minor bug fixes &amp; feature enhancements including additional iPhone X &amp; Face ID support."},{"version_id":"829107125","version_name":"1.0.6","version_date":"2018-11-01 13:22:07.000 +0800","version_description":"We are happy to share our latest app update which includes minor fixes and Face ID feature support."},{"version_id":"830173590","version_name":"1.0.7","version_date":"2019-02-04 15:21:34.000 +0800","version_description":"Based on your feedback, we’ve made some feature enhancements and changes to help improve your experience."},{"version_id":"830444947","version_name":"1.0.8","version_date":"2019-02-28 14:30:15.000 +0800","version_description":"Based on your feedback, we’ve made some feature enhancements and changes to help improve your experience."},{"version_id":"830576914","version_name":"1.0.9","version_date":"2019-03-12 12:33:14.000 +0800","version_description":"Based on your feedback, we’ve made some feature enhancements and changes to help improve your experience."},{"version_id":"831352058","version_name":"2.0.0","version_date":"2019-05-20 14:46:02.000 +0800","version_description":"The MySync app just got a makeover! Check out our new looks as well as our new offers section in the app."},{"version_id":"831517991","version_name":"2.0.1","version_date":"2019-06-11 15:05:52.000 +0800","version_description":"The MySynchrony app just got a makeover! Check out our new looks as well as our new offers section in the app."},{"version_id":"831966713","version_name":"2.1.0","version_date":"2019-07-29 18:46:54.000 +0800","version_description":"Based on your feedback, the MySynchrony app now allows you to view a summary of your special financing purchases and gives you to ability to opt in to receive push notifications for the latest special offers available."},{"version_id":"832352747","version_name":"2.2.0","version_date":"2019-08-22 15:08:57.000 +0800","version_description":"Thank you for using the MySynchrony mobile app! We've added new features to give you more convenience and control of your accounts. Cardholders with accounts in good standing can now request a credit limit increase. We've also added a message center that will keep you informed of updates and promotions. Please remember to turn on auto updates so you always have the latest version."},{"version_id":"832502065","version_name":"2.2.1","version_date":"2019-08-23 21:14:19.000 +0800","version_description":"Thank you for using the MySynchrony mobile app! We've added new features to give you more convenience and control of your accounts. Cardholders with accounts in good standing can now request a credit limit increase. We've also added a message center that will keep you informed of updates and promotions. Please remember to turn on auto updates so you always have the latest version."},{"version_id":"833167343","version_name":"2.3.0","version_date":"2019-10-21 13:12:12.000 +0800","version_description":"Thank you for using the MySynchrony mobile app! Please remember to turn on auto update so you always have the latest version. We've added new features to give you more convenience and control of your accounts and made improvements to the performance and stability of the app. You now have access to PDF versions of your statements and can get finance tips and insights to help you save more and spend wisely with Finance 101, the MySynchrony Blog."},{"version_id":"834254410","version_name":"2.3.1","version_date":"2020-01-08 15:00:47.000 +0800","version_description":"Based on your feedback, we've made some feature enhancements and changes to help improve your experience."},{"version_id":"834679754","version_name":"2.4.0","version_date":"2020-02-18 14:13:27.000 +0800","version_description":"For those who have more than one credit card account serviced at MySynchrony.com we’ve made it even easier for you to get a bird’s eye view of all your accounts on a single dashboard. We also redesigned and made improvements to the Account Summary and Payments section. Check it out and let us know what you think in the apps’s Provide Feedback section."},{"version_id":"835367464","version_name":"2.5.0","version_date":"2020-04-29 14:59:07.000 +0800","version_description":"Thank you for using the MySynchrony App! We’ve made some improvements to how you manage and view your eStatements in the app. If you’re not enrolled in eStatements and want to go paperless, visit the Account Summary Screen and tap Enroll Now to get started. This release also includes some minor bug fixes, design enhancements and performance improvements."},{"version_id":"836571664","version_name":"2.6.0","version_date":"2020-07-13 15:57:55.000 +0800","version_description":"We’ve enhanced the MySynchrony mobile app with new features that will allow our customers to do more in the app.<br>•     Synchrony Car Care™  and Synchrony HOME™ credit card holders will now have access to a Locator tool from their Account Summary view*<br>•     The Offers feature has been redesigned and enhanced! Sign in regularly, we’re adding new offers all the time.<br> <br>*Please remember that features are subject to customer eligibility."},{"version_id":"837722509","version_name":"2.7.0","version_date":"2020-09-14 19:55:15.000 +0800","version_description":"We’ve enhanced the MySynchrony mobile app with new features that will allow our customers to do more in the app:<br>* Synchrony HOME™ credit card holders get a quick and detailed view of their cash back via statement credit from qualifying purchases in their account.<br>* Synchrony HOME™ and Synchrony Car Care™ credit card holders will be able to see credit card specific offers right off the account summary screen."},{"version_id":"838047327","version_name":"2.8.0","version_date":"2020-10-14 14:56:14.000 +0800","version_description":"Thank you for using the MySynchrony mobile app! We’ve enhanced the app with the following features:<br>&nbsp;<br>* The ability to access all of our available servicing features such as enroll in Autopay, Add Authorized User and Update Personal Information via our website, MySynchrony.com without leaving the app. To access, simply go to the “Access Full Site” feature in the “More Menu” within the app.<br>* FAQs pertaining to our servicing related features via the new “Knowledge Center” which can be accessed via the “More Menu” in the app.<br>&nbsp;<br>Lastly, our Synchrony HOME™ and Synchrony Car Care™ &nbsp;apps are going away at the end of December, however account holders using those apps can still access all their great features in the MySynchrony app. Make the move today using the same login credentials!"},{"version_id":"840045234","version_name":"2.9.0","version_date":"2021-01-19 17:03:08.000 +0800","version_description":"Thank you for using the MySynchrony mobile app! Having trouble signing in? Check out “Find My Account” within the new “Get Help Signing In” feature available now on the login screen."},{"version_id":"840768922","version_name":"2.10.0","version_date":"2021-03-09 14:44:13.000 +0800","version_description":"We've added the ability for you to enroll in Autopay. Now you’ll be able to schedule payments and get them automatically deducted from your bank account each month on the payment due date. No more forgetting! Check it out and let us know what you think in the app's Provide Feedback section."},{"version_id":"840943996","version_name":"2.10.1","version_date":"2021-03-22 20:11:05.000 +0800","version_description":"Thank you for using the MySynchrony App! We’ve recently fixed some minor bugs to improve your experience.<br>Please note, going forward, newer versions of this app will only support iOS 13.0 and higher."},{"version_id":"841144475","version_name":"2.10.2","version_date":"2021-04-05 13:52:14.000 +0800","version_description":"Thank you for using the MySynchrony App! We’ve recently fixed some minor bugs to improve your experience.<br>Please note, going forward, newer versions of this app will only support iOS 13.0 and higher."},{"version_id":"841438672","version_name":"2.11.0","version_date":"2021-04-26 14:08:26.000 +0800","version_description":"Now you can get a quick look at your promotional purchases as well as see an alert 60 days before your promotional purchase expires. Check it out and let us know what you think in the Provide Feedback section.<br>&nbsp;<br>*Please update to iOS 13 or higher at your earliest convenience to receive future app version updates and improve performance. Thank you for using the MySynchrony Mobile App!"},{"version_id":"842693686","version_name":"2.11.1","version_date":"2021-06-29 17:30:43.000 +0800","version_description":"Thank you for using the MySynchrony app! This update includes some minor bug fixes to improve your experience."},{"version_id":"844342430","version_name":"2.12.1","version_date":"2021-09-28 13:17:18.000 +0800","version_description":"Thank you for using the MySynchrony app! This update includes some minor bug fixes to improve your experience."}]