[{"version_id":"826504267","version_name":"1.0.5","version_date":"2018-03-31 06:31:31.000 +0800","version_description":"- New Theme: ‘Anger’<br>- iPhone X support<br>- New About and Terms screens<br>- Minor bug fixes"},{"version_id":"826807864","version_name":"1.0.8","version_date":"2018-05-10 20:08:33.000 +0800","version_description":"- Focus - tap any Insight in your Gallery to focus.<br>- Insight Reminder notifications now open to the Focus screen.<br>- Fixed a bug which left Reminders on after you deleted an Insight from your gallery.<br>- Fixed a bug on Reminders switches, which made it look like Reminders were always OFF.<br>- Fixed a bug which cleared your Audio Insights selections whenever the app opened afresh.<br>- Even smaller app download size."},{"version_id":"830789198","version_name":"2.4","version_date":"2019-03-31 00:51:59.000 +0800","version_description":"- Seven new audio exercises<br>- Prevent education pages from showing every practice<br>- Fixed a bug which caused blank Insights for new users<br>- Prevented audio scripts from looping, but allowed backing tracks to continue<br>- Other small bug fixes"},{"version_id":"832174476","version_name":"2.7.1","version_date":"2019-08-07 10:19:13.000 +0800","version_description":"We've had an influx of Symptoms submitted through the Contribute feature in the last few weeks, so our therapists are busy writing to catch up. This update includes content written for most Symptoms contributed from late-June to mid-July, but if your Symptom doesn't appear in this update please hold tight - we will get to it soon.<br>- Minor bug fixes"},{"version_id":"832344824","version_name":"2.8","version_date":"2019-10-04 11:18:18.000 +0800","version_description":"We've had more Symptom contributions streaming in over the last couple of months. Our therapists have written for most Symptoms submitted from mid-July to late-August, and a couple that needed extra attention from earlier. If your Symptom doesn't appear in this update, please trust that we will get to it soon.<br>Other improvements in this version include:<br>- New HOME design with fresh neuroplasticity education pieces each day<br>- Another fully guided Audio Exercise, Loving-Kindness<br>- Better performance&nbsp;for older iPhone models<br>- Some iOS 13 fixes. Dark Mode and other iOS 13 goodness coming soon"},{"version_id":"833790890","version_name":"2.9","version_date":"2019-12-12 04:06:36.000 +0800","version_description":"Our therapists have written for Symptoms submitted from mid-August to mid-September. Due to high demand, we are pressing pause on receiving new contributions until we get through the current backlog and improve our writing and release cycle. We will continue to write and release content for the existing contributions in the backlog over the coming weeks and months.<br>Other changes include:<br>- Set Reminders from the INSIGHTS in the INSIGHT FINDER, and from TODAY'S INSIGHTS in HOME<br>- Clarified design and behaviour of TODAY'S INSIGHTS in HOME<br>- Improvements for iOS 13<br>- App Support/Feedback in Settings"},{"version_id":"834595537","version_name":"2.10","version_date":"2020-03-19 21:06:25.000 +0800","version_description":"Insight Reminders can help us change. Through repetition, we can replace the beliefs that are holding us back. This update brings you completely revamped location-based Reminders and the flexibility of unlimited daily and weekly Reminders.<br>Our therapists have written for Symptoms submitted in mid-September. We are still getting through Symptoms from late-September onwards.<br>This version also includes descriptions for each Theme."},{"version_id":"835187447","version_name":"2.11","version_date":"2020-03-29 23:35:22.000 +0800","version_description":"Our therapists have been hard at work to bring you a fresh Theme to cover isolation, unexpected change, information overload, social responsibility, loss of plans, and loneliness. Lots of our users around the world are also in lockdown in cities without easy access to nature. So we have taken a few native bird tracks from the Department of Conservation in NZ and added them to our audio practices. We have also been lucky enough to have some photographers contribute some of their work to enhance our Insight Finder. Thank you Kai Bauer (@weltkai), and Joel McDowell."},{"version_id":"835431797","version_name":"2.12","version_date":"2020-04-07 08:14:49.000 +0800","version_description":"You might have been scrolling a lot lately, so this update introduces Symptom Search to soothe your thumbs! Find the exact Symptom you're experiencing by searching across all our Themes at once. This update also includes a larger tab bar, and fixes a bug which caused crashes for some of our longtime customers. Be well."},{"version_id":"835579114","version_name":"2.13","version_date":"2020-05-04 21:33:16.000 +0800","version_description":"This update brings you Gratitude Practices - a great way to improve energy and overall wellbeing while reducing stress and anxiety.<br>Our therapists have also rallied the support of dozens of wellness professionals from around the world to write more content for the Social / Physical Distancing Theme."},{"version_id":"836100408","version_name":"2.13.1","version_date":"2020-05-21 20:51:33.000 +0800","version_description":"For those of you loving gratitude, this update fixes a bug that moved your completed topics to the top of the gratitude list instead of giving you seven fresh topics each day."},{"version_id":"836532450","version_name":"3.0","version_date":"2020-07-08 22:54:20.000 +0800","version_description":"In 3.0, we’ve made a few big changes to the app layout to make it more enjoyable to use. The tab bar on the bottom has been replaced by a new, one-page scrolling dashboard. Journal practices and reminders can be accessed by tapping on any of your saved Insights or Beliefs. Audio and Gratitude practices are now accessed directly from the dashboard instead of through Insights. Enjoy exploring!"},{"version_id":"836783928","version_name":"3.0.1","version_date":"2020-07-18 21:08:33.000 +0800","version_description":"We're fixed a bug which made Insight Reminders go stale and stop. This update also brings you:<br>- Share MY INSIGHTS<br>- Two new AUDIO practices<br>- Some fresh new photos in the Insight Finder"},{"version_id":"837261725","version_name":"3.0.2","version_date":"2020-08-07 20:55:38.000 +0800","version_description":"Local crisis hotlines and 'How to use Thinkladder' sections have been added to the Toolkit. We have also fixed some bugs in the dashboard."}]