[{"version_id":"827818791","version_name":"1.1.2","version_date":"2018-07-12 07:08:09.000 +0800","version_description":"In dieser neuen Version von Zak wurden kleinere Fehler in der App behoben und das Einstellungsmenü optimiert. Zudem können sich Neukunden jetzt dank des verbesserten Kontoeröffnungsprozesses noch einfacher registrieren."},{"version_id":"828481511","version_name":"1.1.4","version_date":"2018-09-06 19:44:43.000 +0800","version_description":"Dieses Update von Zak bringt folgende Verbesserungen mit sich:<br>- optimierte Darstellung des Zak Store<br>- optimierte Suchfunktion<br>- vollständiges Einsehen deiner Kartenlimite<br> <br>Und nicht vergessen: Zak weiterempfehlen und 50 CHF für dich und deine Freunde verdienen!"},{"version_id":"828913392","version_name":"1.2.0","version_date":"2018-10-17 08:50:26.000 +0800","version_description":"Mit diesem Update haben wir den gesamten Zahlungsverkehr in Zak optimiert:<br>• Es gibt einen neuen Übersichtsscreen, der dich ganz einfach an einer Stelle deine gewünschte Zahlungsverkehr-Option wählen lässt<br>• Offene Transaktionen sind in deinen Bewegungen ersichtlich<br>• Zahlungen zu Gunsten der Bank Cler werden in Echtzeit überwiesen<br><br>Zudem wurden weitere UX- und Design-Verbesserungen durchgeführt. Und nicht vergessen: Zak weiterempfehlen und 50 CHF für dich und deine Freunde verdienen!"},{"version_id":"829158271","version_name":"1.2.1","version_date":"2018-11-14 07:43:46.000 +0800","version_description":"Nutzt du bereits TouchID oder FaceID für dein Zak-Login? Du aktivierst dieses in deinen Einstellungen unter «Profil» – die Aktivierung wurde komplett überarbeitet und ist jetzt noch einfacher.<br> <br>Zudem wurde die Verständlichkeit der gemeinsamen Töpfe verbessert und weitere Optimierungen vorgenommen.<br> <br>Gefällt dir Zak? Dann empfehle es deinen Freunden weiter und kassiert beide 50 CHF."},{"version_id":"829490554","version_name":"1.3.0","version_date":"2018-12-05 10:27:01.000 +0800","version_description":"Freue dich auf zwei brandneue Features mit dieser neuen App-Version: <br>-ZAK INSTANT: In Echtzeit sofort und zu jeder Zeit Geld senden oder Geld anfordern, ohne die IBAN deines Kontaktes kennen zu müssen<br>-ZAK DEALS: Verwandle deine Konto-Gutschriften in Gutscheine, wähle aus vielen verschiedenen Partnern und mache dabei Gewinn<br>Zudem ist die App jetzt für die neuen iPhone-Modelle optimiert und es wurden weitere Optimierungen und kleinere Fehlerbehebungen umgesetzt."},{"version_id":"830292275","version_name":"1.4.0","version_date":"2019-02-20 08:56:19.000 +0800","version_description":"Mit diesem Update ist Zak nicht nur spürbar stabiler und schneller, wir haben u.a. noch folgende Dinge verbessert:<br>•         Bei Daueraufträgen siehst du jetzt immer den nächsten Ausführungstermin.<br>•         Offene Transaktionen können neu noch angepasst werden.<br>•         Für noch mehr Sicherheit ist bei einem App-Switch der Inhalt von Zak nicht mehr sichtbar.<br> <br>Gefällt dir Zak? Dann gibt uns eine gute Bewertung im Store oder empfehle es deinen Freunden weiter und kassiert beide 50 CHF."},{"version_id":"830356327","version_name":"1.4.1","version_date":"2019-02-22 21:50:30.000 +0800","version_description":"Mit diesem Update ist Zak nicht nur spürbar stabiler und schneller, wir haben u.a. noch folgende Dinge verbessert:<br>•         Bei Daueraufträgen siehst du jetzt immer den nächsten Ausführungstermin.<br>•         Offene Transaktionen können neu noch angepasst werden.<br>•         Für noch mehr Sicherheit ist bei einem App-Switch der Inhalt von Zak nicht mehr sichtbar.<br> <br>Gefällt dir Zak? Dann gibt uns eine gute Bewertung im Store oder empfehle es deinen Freunden weiter und kassiert beide 50 CHF."},{"version_id":"831032500","version_name":"1.5.0","version_date":"2019-04-24 17:15:40.000 +0800","version_description":"Jetzt ganz neu in Zak: das Vorsorgekonto 3 – dein Konto für die private Altersvorsorge. Mit der Einführung dieses neuen Features erstrahlt auch die Header-Navigation in neuem Glanz. Somit kannst du noch einfacher zwischen deiner Übersicht, den Gemeinsamen Töpfen und dem Vorsorgekonto 3 wechseln.<br><br>Zudem machen wir dir das Leben auch dadurch etwas einfacher, dass du nun deine Karten direkt in der App sperren und auch einen neuen PIN-Code direkt über die App bestellen kannst."},{"version_id":"831580870","version_name":"1.6.0","version_date":"2019-06-11 21:43:44.000 +0800","version_description":"Die Zak-Community wächst! Neu dürfen auch alle ab 15 Jahren ein Konto mit Zak eröffnen. Somit kannst du auch deinen jüngeren Freunden und Familienmitgliedern unsere Smartphone-Bank empfehlen. Ausserdem darfst du ab sofort selber entscheiden, ob du die Zak-Kreditkarte möchtest oder nicht. \n\nZusätzlich wurde die App weiter optimiert und Fehler, wie zum Beispiel bei der Face-ID-Funktion, behoben. \n\nGefällt dir Zak? Dann empfehle es deinen Freunden weiter und kassiert beide 50 CHF."},{"version_id":"831662888","version_name":"1.6.1","version_date":"2019-06-19 08:26:33.000 +0800","version_description":"Die Zak-Community wächst! Neu dürfen auch alle ab 15 Jahren ein Konto mit Zak eröffnen. Somit kannst du auch deinen jüngeren Freunden und Familienmitgliedern unsere Smartphone-Bank empfehlen. Ausserdem darfst du ab sofort selber entscheiden, ob du die Zak-Kreditkarte möchtest oder nicht. Zusätzlich wurde die App weiter optimiert und Fehler, wie zum Beispiel bei der Face-ID-Funktion, behoben. Gefällt dir Zak? Dann empfehle es deinen Freunden weiter und kassiert beide 50 CHF."},{"version_id":"831727526","version_name":"1.6.2","version_date":"2019-06-20 08:56:27.000 +0800","version_description":"Mit diesem Update haben wir die Verwendung von FaceID/TouchID optimiert. Freut euch auf die nächste App-Version! Diese bringt wieder coole Neuheiten mit sich."},{"version_id":"832098707","version_name":"2.0.1","version_date":"2019-07-24 14:00:35.000 +0800","version_description":"Endlich ist es soweit! Zak kann Apple Pay. Über die neue virtuelle Zak Visa Prepaidkarte kannst du bequem und sicher einkaufen. Einfach das Plug-In «Mobile Payment» im Zak Store aktivieren und nach wenigen Schritten kannst du Mobile Payment nutzen.\n\nGefällt dir Zak? Dann bewerte die App und empfehle Zak deinen Freunden weiter und kassiert beide 50 CHF. Denk dran, alle ab 15 können jetzt Zak nutzen."},{"version_id":"832196093","version_name":"2.0.2","version_date":"2019-08-03 08:13:06.000 +0800","version_description":"Dieser Fix bringt ein paar Optimierungen mit sich. Übrigens: hast du schon gesehen? Zak hat jetzt Mobile Payment! Das heisst, du kannst ab sofort überall mit Smartphone bezahlen."},{"version_id":"832885372","version_name":"2.1.0","version_date":"2019-10-01 07:59:19.000 +0800","version_description":"Freue dich auf eine neue Login-Experience, einfacheres Handling deiner Kreditkarten-Abrechnungen, detailliertere Umsatzdetails sowie eine Back-to-Home-Funktion per Doppelklick in der Menüleiste.<br><br>Gefällt dir Zak? Dann bewerte die App und empfehle Zak deinen Freunden weiter und kassiert beide 50 CHF. Denk dran, alle ab 15 können jetzt Zak nutzen und Mobile Payment gibt es auch."},{"version_id":"834043091","version_name":"2.3.0","version_date":"2019-12-19 16:27:25.000 +0800","version_description":"Investiere nun mit «Vorsorgen» dein Geld auch in Wertschriften und erzeuge Belastungsanzeigen als PDF direkt in der App. Empfehle deinen Freunden Zak einfacher weiter über die Teilen-Funktion deines Smartphones.<br><br>Gefällt dir Zak? Dann bewerte die App und empfehle Zak deinen Freunden weiter und kassiert beide einen Bonus. Denk dran, alle ab 15 Jahren können jetzt Zak nutzen und Mobile Payment gibt es auch."},{"version_id":"834632614","version_name":"2.4.0","version_date":"2020-02-12 06:53:03.000 +0800","version_description":"Wir haben kleine Verbesserungen und Aktualisierungen vorgenommen.<br><br>Gefällt dir Zak? Dann bewerte die App und empfehle Zak deinen Freunden weiter und kassiert beide einen Bonus. Denk dran, alle ab 15 Jahren können jetzt Zak nutzen und Mobile Payment gibt es auch."}]