[{"version_id":"825739208","version_name":"1.0.1","version_date":"2018-01-24 03:25:03.000 +0800","version_description":"We are always looking to improve your experience. You can now save your credit card details and pay your bills faster."},{"version_id":"825959864","version_name":"1.0.2","version_date":"2018-02-12 10:23:18.000 +0800","version_description":"- You can now pay multiple-bills at one go.<br>- Check the status of your feedback submitted via this mobile app.<br>- Track your Renewable Energy account and Payment Advice.<br>- General user experience improvements."},{"version_id":"826293857","version_name":"1.0.3","version_date":"2018-05-13 14:10:16.000 +0800","version_description":"- Be notified of system downtime / maintenance activities.<br>- UI/UX improvements."},{"version_id":"827871077","version_name":"1.0.4","version_date":"2018-07-15 07:45:07.000 +0800","version_description":"Minor bug fixes in payment flow for multiple selected accounts."},{"version_id":"828507456","version_name":"1.0.5","version_date":"2018-09-12 02:23:30.000 +0800","version_description":"Minor bug fixes"},{"version_id":"828679533","version_name":"1.0.6","version_date":"2018-10-08 02:07:51.000 +0800","version_description":"New feature: now customers with smart meter can view more detailed usage graph.<br>Minor UI improvements and bug fixes."},{"version_id":"828862393","version_name":"1.1.0","version_date":"2018-12-17 12:31:13.000 +0800","version_description":"Hi, welcome to our updated version which we’ve made better than ever before. Our latest version includes new features for Smart Meter and Renewable Energy customers and we have also fixed those pesky bugs! Enjoy a smoother experience with myTNB app.<br>What’s new?<br>•        We hear you! View all of your accounts in a single page<br>•        For Smart Meter user, it’s a great tool to show how much electricity you are using and how much it costs, with a daily usage graph<br>•        Monitor your monthly earnings from Renewable Energy with access to previous record"},{"version_id":"829695521","version_name":"1.1.2","version_date":"2019-01-25 03:27:48.000 +0800","version_description":"We've fixed some pesky bugs to continously enhance your myTNB experience."},{"version_id":"830227574","version_name":"1.1.3","version_date":"2019-02-11 09:27:39.000 +0800","version_description":"We've fixed some pesky bugs to continuously enhance your myTNB experience."},{"version_id":"830440113","version_name":"1.1.4","version_date":"2019-04-02 06:03:05.000 +0800","version_description":"We've fixed some pesky bugs to continuously enhance your myTNB experience."},{"version_id":"830916870","version_name":"1.1.5","version_date":"2019-04-11 06:01:23.000 +0800","version_description":"We've fixed some pesky bugs to continuously enhance your myTNB experience."},{"version_id":"831259991","version_name":"1.1.6","version_date":"2019-05-11 05:05:01.000 +0800","version_description":"UI enhancements"},{"version_id":"831518901","version_name":"1.1.7","version_date":"2019-06-01 06:02:52.000 +0800","version_description":"We are constantly working to improve your experience. This update includes stability improvements and updates to the smart meter dashboard."},{"version_id":"831609985","version_name":"1.1.8","version_date":"2019-06-20 16:33:02.000 +0800","version_description":"We are constantly working to improve your experience. This update includes stability improvements and bug fix for feedback submission."},{"version_id":"831851492","version_name":"1.1.9","version_date":"2019-09-19 03:23:28.000 +0800","version_description":"Thank you for using myTNB.<br> <br>With this update, you'll get to enjoy an even more seamless payment transaction and improved overall experience."},{"version_id":"832879688","version_name":"1.2.0","version_date":"2019-10-13 02:39:43.000 +0800","version_description":"Thank you for using myTNB. In this update, you’ll get to enjoy an even more seamless experience. Here’s what to expect:\n<br>\n<br>- View how much your bill may reach and your usage trend for the current billing period (if you’re a Smart Meter user)\n<br>- Seamlessly manage multiple notifications\n<br>- View if your electricity supply is ‘Disconnected’ on the Dashboard page\n<br>- Refresh pages if the information does not appear\n<br>\n<br>Update now to the latest version so you can enjoy the new experience!"},{"version_id":"833883030","version_name":"2.0.0","version_date":"2019-12-09 16:03:40.000 +0800","version_description":"Thanks to your feedback, we’ve got a refreshing new look, a whole new service with greater control and understanding. In this update, you’ll find:<br> <br>1. A redesigned Homepage to view all your accounts and quickly access TNB services<br>2. An enhanced Usage view to understand tariffs<br>3. A refreshed view of your Bills with a simplified breakdown of charges.<br> <br>We value your feedback! If you want us to know something, tap “Submit Feedback” via the Homepage."},{"version_id":"834716397","version_name":"2.1.0","version_date":"2020-02-17 07:53:05.000 +0800","version_description":"We’ve got some of our most exciting changes yet! Now, even more people can enjoy the myTNB app with ease thanks to these updates:<br> <br>1. Now Available in BM<br>Ya, betul! We’re now bilingual.<br> <br>2. International Phone Number? No Problem.<br>Previously, you could only register with a Malaysian phone number. Not anymore!<br> <br>Update now and enjoy all these new features! If you've got any thoughts or comments, feel free to leave/send us feedback here or via the app.<br> <br>- The myTNB Team -"},{"version_id":"834913078","version_name":"2.2.0","version_date":"2020-03-09 06:49:37.000 +0800","version_description":"We’re constantly working to improve your myTNB experience. In this update, you can enjoy:\n<br>\n<br>1) Payment Status Update via email and push notifications for your pending payments\n<br>\n<br>2) Payment Reminder Auto Delete where we’ll automatically delete your payment reminders when you’ve made your bill payments \n<br>\n<br>3) Bug fixes\n<br>\n<br>Got some thoughts regarding the myTNB app? Let us know your feedback here or via the app!\n<br>\n<br>-The myTNB Team-"},{"version_id":"836535372","version_name":"2.2.1","version_date":"2020-06-24 15:35:28.000 +0800","version_description":"Thanks for using myTNB! In this update, we’re including these new features &amp; fixtures for a more enjoyable app experience.<br><br>    • Easy Payment Plan tip to let you know about our new instalment plan that you may want to opt in<br>    • Notice at the bottom of your monthly graph for prorated bills so that you’ll understand your consumption better<br><br>Got some thoughts regarding the myTNB app? Let us know your feedback here or in the app!"},{"version_id":"837324650","version_name":"2.2.3","version_date":"2020-08-15 01:14:17.000 +0800","version_description":"In this version, we’re enhancing our current features to bring you an even better app experience. This time around, we’re including:<br> <br>1) Informational pop-ups to let you know about our latest on-goings<br>2) Visual enablement for our ‘What’s New’ section for more engaging updates<br> <br>We’re always open for suggestions! Feel free to let us know your thoughts here or in the app! <br> <br>- myTNB Team -"},{"version_id":"838023138","version_name":"2.2.4","version_date":"2020-10-02 03:11:02.000 +0800","version_description":"We’re back with another update to further enhance your myTNB App! This time around, we’re including\n<br> \n<br>1) Negative sign amendment for your bill balance to accurately show your excess payment\n<br>2) International phone number enablement for ‘Submit Feedback’\n<br>3) Other bugs and fixes\n<br> \n<br>Got opinions? We’re glad to hear it! Let us know through the App or or down below!\n<br> \n<br>- myTNB Team -"},{"version_id":"838505269","version_name":"2.2.5","version_date":"2020-11-06 01:30:52.000 +0800","version_description":"Thank you for your continuous support towards myTNB! In this version, we’ve included these updates:<br><br>1)\tEnablement of PDF attachments &amp; UI (user interface) enhancements for ‘Submit Enquiry’<br>2)\tOther bugs and fixes<br> <br>If you have any questions or suggestions, let us know down below and through the App!<br> <br>- myTNB Team -"},{"version_id":"839439047","version_name":"2.2.6","version_date":"2020-12-03 02:10:43.000 +0800","version_description":"We’re always working on making your experience with myTNB App better! In this version, we’ve included these updates:<br><br>1)\tUI (user interface) enhancements for ‘Submit Enquiry’<br>2)\tOther bugs and fixes<br> <br>If you have any questions or suggestions, let us know down below and through the App!<br> <br>- myTNB Team"},{"version_id":"840514631","version_name":"2.3.0","version_date":"2021-03-07 14:11:45.000 +0800","version_description":"Thank you for using myTNB! <br><br>In this update, we’ve included several enhancements for an even more seamless experience:<br><br>1. Monitor the status of your applications submitted via myTNB Portal and Kedai Tenaga and search and save other applications<br>2. Receive notification alerts on application status changes<br>3. Rate your meter installation experience and submit your feedback <br>4. Select your preferred text size via your App Settings<br><br>Update now to the latest version to enjoy all these new features!"},{"version_id":"843708089","version_name":"2.3.1","version_date":"2021-08-23 03:30:12.000 +0800","version_description":"Thank you for using myTNB! <br><br>Your feedback has been invaluable to us. In this version, we’ve included these updates:<br><br>1. Negative sign amendment for your bill balance to accurately show your excess payment in bill ready notification<br>2. Enhanced terms and condition for Self Meter Reading (SMR) subscription<br><br>Update to this latest version now to enjoy a smoother digital experience.<br><br>#StaySafe #GoDigital"},{"version_id":"844393758","version_name":"2.3.2","version_date":"2021-09-30 23:58:58.000 +0800","version_description":"Thank you for using myTNB! Your feedback has been invaluable to us for continuous enhancement of the features available on the app.<br><br>For customers with smart meter, you will receive a notification once your Daily Energy Usage View feature is available.<br><br>Update to the latest version now to enjoy a smarter experience."}]