[{"version_id":"824236492","version_name":"1.0.4","version_date":"2017-11-02 01:51:57.000 +0800","version_description":"Fixed some other bugs."},{"version_id":"824358195","version_name":"1.0.5","version_date":"2017-11-16 01:53:28.000 +0800","version_description":"Fixed some bugs."},{"version_id":"825235582","version_name":"1.0.6","version_date":"2017-12-11 01:21:04.000 +0800","version_description":"※New Content<br>1. God Book<br>Choose hero into learn page, learn to unlock hero’s god book attributes, make your hero more powerful!<br>2. Mythland<br>Tap challenge and choose adventure mode, you can explore different Mythlands to gather rare resources!<br>3. Added Resource Raid Chest Reward<br>Crash your enemies in Resource Raid, when you have certain amount of stars, you can open chests to get reward! Stars reset every day, don’t forget to claim your extra reward!<br>4. Added a Throw Dice Event<br>You can claim rewards in your path by throwing the dice to move, SSR hero fragments are waiting for you to claim!<br>5. Added Sound Effect<br><br>※Optimizations<br>1. Adjusted honor output in the Arena, now you can get more honor;<br>2. Adjusted the price of resources in the shop.<br><br>※Others<br>1. Fixed the problem that enemy's Dragmon info doesn’t display in League War;<br>2. Fixed the problem that Dragmon which can be trained doesn’t have red dot hint;<br>3. Fixed the problem that resources are missing after the team raid battle;<br>4. Fixed the display error in Dragmon upgrade."},{"version_id":"825387810","version_name":"1.0.9","version_date":"2017-12-22 07:04:22.000 +0800","version_description":"※New Content<br>1.Added a hint of setting Dragmon when enter Solo Campaign<br>2.Added the training guide of Dragmon skills and mercenary level<br><br>※Optimizations<br>1.Optimized the adaptation for iPhone X<br>2.Optimized the performance of the intro conversation in the newbie guide<br>3.Optimized the model size changing when put Dragmon into battle in the beginning<br>4.Optimized the backlight blur problem of victory effect in mobile device<br>5.Optimized the content of first charge pack and series pack<br>6.Optimized the display of vitality reward claim status<br>7.Optimized the fast purchase procedure when senior summon token is insufficient<br>8.Optimized the minimum guarantee introduction hint of senior summon token draw<br>9.Optimized the size of NPC’s shadow<br>10.Optimized the display of event logo, deleted the display of 7 days sign-in logo in the main page"},{"version_id":"825712862","version_name":"1.0.10","version_date":"2018-01-23 05:39:40.000 +0800","version_description":"1. We have optimized the interface of online rewards which can give you better experience;<br>2. We changed the attributes of Gem Pagoda, it can be much useful now;<br>3. Players can directly use gems to summon;"},{"version_id":"827333626","version_name":"1.0.11","version_date":"2018-06-01 01:56:33.000 +0800","version_description":"1. Optimized the Resource Raid system, increased the grade and rank rewards<br>2. Optimized the Arena system, added a highest rank reward"},{"version_id":"828594749","version_name":"1.0.13","version_date":"2018-09-18 03:45:41.000 +0800","version_description":"Fixed some bugs."}]