[{"version_id":"825858421","version_name":"1.03","version_date":"2018-02-05 15:04:38.000 +0800","version_description":"- Bug fixes<br>- UI updates"},{"version_id":"825981762","version_name":"1.04","version_date":"2018-02-15 16:16:28.000 +0800","version_description":"- UI updates<br>- App Store screenshot updates"},{"version_id":"826050323","version_name":"1.05","version_date":"2018-02-26 03:42:40.000 +0800","version_description":"- Bug Fixes"},{"version_id":"826319966","version_name":"1.06","version_date":"2018-03-17 23:03:20.000 +0800","version_description":"- New gift card options<br>- Messaging when users hit certain in-app milestones <br>- Addition of social sharing <br>- Bug fixes"},{"version_id":"826837862","version_name":"1.08","version_date":"2018-05-03 01:20:11.000 +0800","version_description":"Hello Dabblrs!<br>A new &amp; exciting update is here:<br>-Now we can notify you when there is new chance to earn with Dabbl! Just turn your notifications ON next time you are in the app!<br>-Fond of Trivia?  New Q&amp;A engagement is coming! <br>-Some annoying bugs were squashed, so your time with Dabbl is #timewellspent!"},{"version_id":"827213225","version_name":"1.09","version_date":"2018-05-25 16:53:12.000 +0800","version_description":"Hello Dabblrs!<br>While we are working on cool new features  and new opportunities to earn, <br>our team has fixed some annoying bugs and crashes, <br>so your time with Dabbl is #timewellspent!"},{"version_id":"827374007","version_name":"1.10","version_date":"2018-07-02 13:14:57.000 +0800","version_description":"Hello Dabblrs!<br>-Now you have an opportunity to invite your favorite brands to join Dabbl using social networks<br>-More bugs were exterminated, so your time with Dabbl is #timewellspent!"},{"version_id":"827848384","version_name":"1.11","version_date":"2018-07-13 18:28:44.000 +0800","version_description":"Hello Dabblrs!<br>- Learn more about your favorite brands with clickable links that open an embedded browser view<br>- Customize your Dabbl experience with new profile screen. Start by updating contact info; more profile capabilities on the way<br>- More bugs were exterminated, so your time with Dabbl is #timewellspent!"},{"version_id":"827979020","version_name":"1.12","version_date":"2018-07-26 18:37:09.000 +0800","version_description":"Hello Dabblrs!<br>- This version resolves issues with the profile screen, including images not saving and birth date not displaying correctly"},{"version_id":"828167591","version_name":"1.13","version_date":"2018-08-10 12:51:43.000 +0800","version_description":"Hello Dabblrs!<br>What's New<br>- You can start getting personalized experiences for your area by sharing your location with Dabbl!<br>- Several bugs have also been squashed so your time with Dabbl is #timewellspent"},{"version_id":"828270137","version_name":"1.14","version_date":"2018-08-28 16:10:22.000 +0800","version_description":"What's New<br>- Refer friends to Dabbl and earn up to $5! Go to your Profile to grab a link to share via Facebook, text message or your preferred social app.<br>- Several bugs have also been fixed so your time with Dabbl is #timewellspent"},{"version_id":"828388796","version_name":"1.15","version_date":"2018-08-30 18:09:47.000 +0800","version_description":"We've fixed a bug related to the new Refer a Friend feature that was affecting some users from receiving Referral earnings"},{"version_id":"828495752","version_name":"1.16","version_date":"2018-09-07 14:48:29.000 +0800","version_description":"What's New<br>- We squashed a bug related to the Referral max pop up notification crashing the app"},{"version_id":"828511040","version_name":"1.17","version_date":"2018-09-10 17:50:57.000 +0800","version_description":"What's New<br>- Get new experiences in real time by refreshing your home screen - just tap and pull down until you see the orange dots animation<br>- Enhancements to the earnings screen make it easier to manage your egift cards"},{"version_id":"828651221","version_name":"1.18","version_date":"2018-09-21 13:14:12.000 +0800","version_description":"What's New<br>- You can now rate an experience or close the app and still interact with links at the end of an experience until you tap 'Done'. <br>- Links at the end of an experience can now be tapped multiple times, if desired.<br>- We resolved an issue preventing some users from getting Refer a Friend earnings, when friends clicked on links from Facebook. <br>- Numerous other bugs were fixed to make your time with Dabbl #timewellspent"},{"version_id":"828811966","version_name":"1.19","version_date":"2018-10-05 01:51:44.000 +0800","version_description":"What’s New<br>- Did you close out the Experience but want to revisit the included link or website?  You can now tap to re-enter a Dabbl experience once its completed!<br>- Completed Experience feed tiles received a nice design makeover<br>- Forget to rate an Experience?  You may now rate it directly from the feed once you’ve completed it<br>- Flip your earned gift cards with easier to see icon<br>- A couple of bugs were eliminated to make your time with Dabbl #timewellspent"},{"version_id":"828952097","version_name":"1.20","version_date":"2018-10-18 03:17:37.000 +0800","version_description":"What’s New<br>- It's even easier to Refer friends with the addition of a Twitter referral link<br>- Experience links can now be re-viewed up for up to 30 days <br>- Several bugs were resolved to make your time with Dabbl #timewellspent"},{"version_id":"829119747","version_name":"1.21","version_date":"2018-11-06 06:21:07.000 +0800","version_description":"What's New<br>- We’ve made using your gift cards even easier. After earning and selecting a gift card, simply tap on the card from the profile screen to reveal a scannable redemption barcode<br>- Get a pop up animation when you earn money with Dabbl to hear the earnings adding up!<br>- Referring the Dabbl app with friends can now get you up to $4.00 in earnings"},{"version_id":"829296482","version_name":"1.22","version_date":"2018-11-16 00:35:48.000 +0800","version_description":"What’s New<br>- If you complete the last activity in an experience and you have to leave the app for some reason, the experience will automatically move to the ‘Completed’ section in your feed.<br>- When you refresh the feed, new experiences display at the top of your feed instead of the bottom<br>- If you choose to personalize your Dabbl experience by sharing your location, we will now validate the zip code you enter, just in case you enter an invalid one by accident<br>- We’ve stomped out several bugs to ensure your time with Dabbl is #timewellspent"},{"version_id":"829439842","version_name":"1.23","version_date":"2018-12-06 14:53:51.000 +0800","version_description":"What's New<br>- Check out our new “mystery” videos found at the bottom of your Dabbl feed. These brief videos are an easy way to add extra $$ to your Dabbl earnings!<br>- Some minor bug fixes to make your time with Dabbl #timewellspent"},{"version_id":"829585991","version_name":"1.24","version_date":"2018-12-13 02:59:15.000 +0800","version_description":"What's New<br>- Some minor bugs were fixed to make your time with Dabbl #timewellspent!"},{"version_id":"829751397","version_name":"1.25","version_date":"2018-12-28 16:20:36.000 +0800","version_description":"- We've fixed a bug preventing some users from clicking links at the end of an experience<br>Happy Holidays from Dabbl Team!"},{"version_id":"829883958","version_name":"1.26","version_date":"2019-01-11 02:59:05.000 +0800","version_description":"What's new<br>- Custom images now display on the conclusion screen to bring more variety to the app<br>- Fixed a Mystery experience bug causing some users to be shown a lower earned amount on the conclusion screen than what was added to their wallet<br>- Resolved a bug preventing some users from logging into the app after the last update<br>- Wiped out several other minor bugs to make your time with Dabbl #timewellspent"},{"version_id":"830078673","version_name":"1.27","version_date":"2019-01-25 21:33:54.000 +0800","version_description":"What's New<br>- Love one of our Dabbl experiences? You may now share it to Facebook, Twitter, or as a copied link to friends or family!<br>- New eGift Card options are available to redeem your Dabbl earnings: Spotify, Hotels.com, Overstock.com and Charity Choice<br>- Several Bugs have been fixed to make your time with Dabbl #timewellspent"},{"version_id":"830117834","version_name":"1.28","version_date":"2019-01-29 19:38:49.000 +0800","version_description":"- Hotfix to make your time with Dabbl #timewellspent"},{"version_id":"830203477","version_name":"1.29","version_date":"2019-02-07 03:06:20.000 +0800","version_description":"What's New<br>- Track Referrals and view Lifetime earnings on our newly redesigned Earnings screen<br>- We've added more Mystery Brand ad partners so there's more to see and do<br>- Bug fixes"},{"version_id":"830310241","version_name":"1.30","version_date":"2019-02-21 18:10:28.000 +0800","version_description":"What’s New<br>- You can now earn a $5 gift card just for referring up to 20 friends through the Dabbl Refer a Friend program (up from $4)<br>- Our support link has been enhanced to include your app info so we can resolve Dabbler questions/issues even quicker<br>- Bug fixes to make your time with Dabbl #timewellspent"},{"version_id":"830513572","version_name":"1.31","version_date":"2019-03-07 20:10:40.000 +0800","version_description":"What’s New<br>- Keep your eyes peeled for new research partner survey experiences coming soon! Just another way to earn with Dabbl.<br>- Several bugs were smashed to make your time with Dabbl #timewellspent"},{"version_id":"830602509","version_name":"1.32","version_date":"2019-03-21 03:04:56.000 +0800","version_description":"What's New<br>- Terms of Use updated to require all accounts be associated with a valid US Carrier mobile number<br>- Bugs fixes to make your time with Dabbl #timewellspent"},{"version_id":"830837736","version_name":"1.33","version_date":"2019-04-08 06:45:38.000 +0800","version_description":"- The Dabbl app has a fresh new look with even more ways to earn!<br>- When you complete experiences, you now earn points towards gift cards at your favorite retailers! Earn 5,000 pts and get a $5 gift card! Nothing to do on your end, we already transferred all your earnings to points for you.<br>- We've fixed several bugs to make your time with Dabbl #timewellspent"},{"version_id":"831018825","version_name":"1.34","version_date":"2019-04-18 16:32:49.000 +0800","version_description":"- Look for the new 'Extra Savings' section, where you'll find opportunities to explore and save with Dabbl partners<br>- We've fixed several bugs to make your time with Dabbl #timewellspent"},{"version_id":"831125610","version_name":"1.35","version_date":"2019-05-02 13:19:26.000 +0800","version_description":"- We've added badge icons that say 'new' to help indicate when Surveys and Videos are available<br>- Some minor messaging updates and bug fixes to ensure your time with Dabbl is #Timewellspent"},{"version_id":"831321648","version_name":"1.36","version_date":"2019-05-17 13:28:37.000 +0800","version_description":"We've heard your feedback!  Our gift card library now includes Amazon and Starbucks, plus others!<br>We've added another survey partner so there are even more surveys available to you"},{"version_id":"831488117","version_name":"1.37","version_date":"2019-05-31 15:12:08.000 +0800","version_description":"• Messaging update within our surveys section to ensure points rewarded at survey completion are always properly communicated<br>•&nbsp;UI enhancements to Dabbl experiences<br>• Bug fixes to make Dabbl #Timewellspent"},{"version_id":"831644254","version_name":"1.38","version_date":"2019-06-13 19:34:14.000 +0800","version_description":"- Added clarity into points earned from interacting with Tap Research surveys. Now, upon exiting the Tap Research screens and returning back to the Dabbl app, we'll tell you the total points you've earned in that immediate session with Tap Research, and show you that we've added them to your Dabbl balance.<br>- Other bugs to ensure your time with Dabbl is #Timewellspent"},{"version_id":"831824135","version_name":"1.39","version_date":"2019-06-28 18:17:20.000 +0800","version_description":"- Introducing a brand new Dabbl activity - the Puzzle! The Puzzle is a fun and interactive activity where Dabblrs are presented with a scrambled image and are required to slide image 'slices' back-and-forth horizontally to align and create one large image.  This option will be found in certain Dabbl experiences when selected by our advertising partners.<br>- Direct-to-app download links at the conclusion of a Dabbl experience! For advertisers that wish to feature this, you may now be directly linked to an app in the App Store from the end of a Dabbl experience. <br>- Other bugs to ensure your time with Dabbl is #Timewellspent"},{"version_id":"831868997","version_name":"1.40","version_date":"2019-07-03 14:59:22.000 +0800","version_description":"- More opportunities to earn in the 'From the Web' section of Dabbl!"},{"version_id":"831911268","version_name":"1.41","version_date":"2019-07-11 15:21:41.000 +0800","version_description":"We've beefed up the Dabbl Referral Program -  earn 1,000 points for each friend (up to 20) that signs up and earns points with Dabbl! Share the love with friends and family by giving out your personal referral link from your Dabbl profile!"},{"version_id":"832116656","version_name":"1.42","version_date":"2019-07-25 15:06:18.000 +0800","version_description":"More Surveys!  (More ways to earn points on Dabbl!)<br>+ With this update, we've added a new survey partner, Theorem Reach, offering new options for spending time with Dabbl.  <br>+ Pollfish, an existing partner, has been upgraded to be a survey 'wall', which will display multiple survey options to you so you can pick those you with to interact with. <br>+ Other features and bug fixes to make your time with Dabbl #Timewellspent"},{"version_id":"832326555","version_name":"1.43","version_date":"2019-08-12 10:23:05.000 +0800","version_description":"Added animation for earnings when you earn points<br>Added rating bar to profile section, so you can rate our app :)<br>Added auxiliary number for some gift cards"},{"version_id":"832468238","version_name":"1.44","version_date":"2019-08-22 15:53:53.000 +0800","version_description":"This release is all about GIFT CARDS!  <br>+ Look for Carter's and BuybuyBaby as available cash-out options on Dabbl!<br>+ Available GIFT CARD denominations are now shown under each option, from $5 to $20. Select the card &amp; amount you want, or wait until you have more points accumulated to get the larger amount cards!"},{"version_id":"832647837","version_name":"1.45","version_date":"2019-09-05 17:25:29.000 +0800","version_description":"This update is all about transparency into your earnings!<br>+ Redesigned earnings screen, with clear indicators of Dabbl app earnings and referral credit earnings<br>+ New view into 'Recent Earnings', which will show the last 20 transactions that have been credited to your account; by date, source, and value!<br>+ New view into your gift cards, which list in a user-friendly manner the gift cards that have been received by date; flip them over for the barcode and redemption information<br>+ Easy access to the gift card list, anytime you want to see what is in our library of available cards"},{"version_id":"832812996","version_name":"1.46","version_date":"2019-09-19 14:51:21.000 +0800","version_description":"+ More video ads in our 'From the web' section for your earning pleasure!<br>+ To simplify the experience for you, we've removed the smiley face rating from all parts of the Dabbl app. <br>+ We've exterminated a few bugs to make the Dabbl experience #Timewellspent"},{"version_id":"832998763","version_name":"1.47","version_date":"2019-10-03 16:32:01.000 +0800","version_description":"+ Referral program updates - earn 1,000 points when your referral earns 1,000 points, its that easy!<br>+ We'll add 10 points to your account when you share a Dabbl experience on Facebook or Twitter.<br>+ We've updated our privacy policy and terms of conditions with updates reflecting the latest and greatest in the Dabbl app.<br>+ Other features and bug fixes to make Dabbl #Timewellspent"},{"version_id":"833041069","version_name":"1.48","version_date":"2019-10-11 14:25:40.000 +0800","version_description":"+ Referral program updates - earn 1,000 points when your referral earns 1,000 points, its that easy!<br>+ We'll add 10 points to your account when you share a Dabbl experience on Facebook or Twitter.<br>+ We've updated our privacy policy and terms of conditions with updates reflecting the latest and greatest in the Dabbl app.<br>+ Other features and bug fixes to make Dabbl #Timewellspent"},{"version_id":"833183613","version_name":"1.49","version_date":"2019-10-17 12:08:21.000 +0800","version_description":"We've updated how Dabbl experiences appear when shared to social media channels like Facebook and Twitter.<br>We've exterminated bugs to ensure time with Dabbl is #Timewellspent"},{"version_id":"833318502","version_name":"1.50","version_date":"2019-10-28 11:13:11.000 +0800","version_description":"We've updated how Dabbl experiences appear when shared to social media channels like Facebook and Twitter.<br>We've exterminated bugs related to getting Referral share credits, to ensure time with Dabbl is #Timewellspent"},{"version_id":"833384935","version_name":"1.51","version_date":"2019-10-31 14:04:29.000 +0800","version_description":"In this version of the Dabbl app:<br>+ We've made it easier and more fun to tell your friends about the gift cards you've earned on Dabbl! Now, after you receive a gift card, you can share this exciting moment with your friends on Facebook or Twitter (or message, email, etc). Share the love and get your friends involved in earning gift cards in their downtime! <br>+ We've also cleaned up a couple of bugs - one that generated some weird 'time-outs' when trying to use the app and another related to getting credit for referring friends. #ByeBugs #Timewellspent"},{"version_id":"833580018","version_name":"1.52","version_date":"2019-11-14 12:22:16.000 +0800","version_description":"Be excited! This version of the Dabbl app introduces two exciting new features.<br>#1 is our incentives program on cash-out, where you are rewarded for cashing out towards any of your favorite gift cards over $10.  <br>#2 is a new survey partner called inBrain, bringing you fun and rewarding surveys, with partial payouts when you are screened out (for legitimate reasons, of course!).  <br>Have fun!"},{"version_id":"833609062","version_name":"1.53","version_date":"2019-11-15 17:00:31.000 +0800","version_description":"This version of the Dabbl app introduces two exciting new features.<br>+ #1 is our newly redesigned Earnings screen with  incentives program on cash-out, where you earn bonus points for cashing out at $10, $15, or $20 gift card denominations!   Bonus points will be credited after you cash out, good towards your next gift card.  <br>+ #2 is a new survey partner, inBrain!  Alongside Dabbl's existing survey partners, inBrain will provide fun and rewarding survey &amp; market research opportunities - including partial payouts when you are screened out for legitimate reasons - giving you yet another way to earn gift cards with Dabbl!  <br>+ Additional bugs were exterminated to make sure your time with Dabbl is #TimeWellSpent"},{"version_id":"833762852","version_name":"1.54","version_date":"2019-11-27 13:02:56.000 +0800","version_description":"This version of the Dabbl app introduces two exciting updates:<br>+ Save a tap, back to the main screen after viewing from the web and getting your reward popup.  <br>+ Introducing the Bark Box $35 gift card for the dog lovers."},{"version_id":"833963010","version_name":"1.56","version_date":"2019-12-13 12:04:40.000 +0800","version_description":"This version of the Dabbl app has the following updates:<br>+ Fixing bugs&nbsp;<br>+ Performance improvements"},{"version_id":"834085905","version_name":"1.57","version_date":"2019-12-21 12:59:25.000 +0800","version_description":"+ You can now copy your gift card number to clipboard for easy online redemption<br>+ 'From the web' feed tile customizable messaging to our Dabblrs <br>+ Other bug fixes to ensure your time with Dabbl is #Timewellspent"},{"version_id":"834350501","version_name":"1.59","version_date":"2020-01-15 18:03:20.000 +0800","version_description":"+ More options in the \"From the web\" section for your viewing pleasure!<br>+ A few small pesky bug fixes to ensure Dabbl is #Timewellspent"},{"version_id":"834440742","version_name":"1.60","version_date":"2020-01-23 10:52:59.000 +0800","version_description":"+ Even MORE 'from the web' video ads and high paying surveys now available for your enjoyment!<br>+ Fixed a few small bugs to ensure your time with Dabbl is #Timewellspent"},{"version_id":"834800890","version_name":"1.63","version_date":"2020-02-20 22:16:17.000 +0800","version_description":"Pesky bug fixes to our Surveys and Offers section to maximize available surveys for our loyal Dabblrs!"},{"version_id":"834895849","version_name":"1.64","version_date":"2020-03-06 12:33:00.000 +0800","version_description":"Higher reward Dabbl Experiences may now be 'unlocked' by viewing video ads...look for this as they become available!<br>Copy updates and bug fixes to ensure we maximize available surveys and ads for you, making Dabbl #Timewellspent"},{"version_id":"835075261","version_name":"1.65","version_date":"2020-03-18 16:17:09.000 +0800","version_description":"We're excited to introduce a couple of exciting features: <br>+ Dabbl Research questions that can be unlocked in the \"From Dabbl\" section<br>+ Introducing \"Offers and Tasks\", where you have options to complete various tasks to earn points. Look for it in the feed, just below \"Surveys\".<br>+ A few pesky bug fixes to ensure your time with Dabbl is #Timewellspent"},{"version_id":"835245548","version_name":"1.66","version_date":"2020-03-27 01:18:49.000 +0800","version_description":"Our new Dabbl Research questions have been moved to their very own section!"},{"version_id":"835345516","version_name":"1.67","version_date":"2020-04-02 12:44:39.000 +0800","version_description":"+ Updated the location and UI for Dabbl Research opportunities<br>+ Pesky bugs have been exterminated to make sure that time with Dabbl is #Timewellspent"},{"version_id":"835551370","version_name":"1.68","version_date":"2020-04-16 12:33:03.000 +0800","version_description":"+ Moved the 'Dabbl Research' section to be easier to find and interact with<br>+ Increased the number of available gift cards that can be selected on the Gift Card screen<br>+ Resolved a few pesky bugs to ensure time with Dabbl is #Timewellspent"},{"version_id":"835647153","version_name":"1.69","version_date":"2020-04-23 14:12:01.000 +0800","version_description":"+ Another update to the Dabbl Research section to include more ads<br>+ Enhancements to the way we present each section to you, so we can be sure time with Dabbl is #TImewellspent"},{"version_id":"836475860","version_name":"1.73","version_date":"2020-06-19 05:39:52.000 +0800","version_description":"Lots of excitement in this version of Dabbl! <br>+ MORE from the Dabbl Research section! We've added two new options for additional points from Dabbl Research.  Look for the star rating which helps indicate time required and payout opportunity. Enjoy!<br>+ Bug fixes to make time with Dabbl #Timewellspent"},{"version_id":"836491031","version_name":"1.74","version_date":"2020-07-02 12:08:38.000 +0800","version_description":"Bug fixes to the Dabbl experience CTA link to make your time with Dabbl #TimeWellSpent!"},{"version_id":"836846545","version_name":"1.75","version_date":"2020-07-23 20:49:07.000 +0800","version_description":"+ App Store marketing updates<br>+ Bug fixes to ensure your time with Dabbl is #Timewellspent"},{"version_id":"837147796","version_name":"1.76","version_date":"2020-08-07 18:30:52.000 +0800","version_description":"We're working on big things for Dabbl!  <br>+ MORE inventory in the Dabbl Research section, especially for our heaviest users<br>+ Bug and UI fixes to make Dabbl #Timewellspent"},{"version_id":"837331638","version_name":"1.77","version_date":"2020-08-21 17:24:54.000 +0800","version_description":"We've super excited to introduce Dabbl Receipts! <br>- Scan receipts for promoted products and earn extra points! <br>- Find it on your earnings screen<br>We've also exterminated a few bugs to make Dabbl #Timewellspent"},{"version_id":"837524118","version_name":"1.78","version_date":"2020-08-28 00:55:20.000 +0800","version_description":"In this version, we've exterminated a couple of important bugs related to Dabbl Research and Receipt scan.  Happy Dabbling!"},{"version_id":"838080647","version_name":"1.80","version_date":"2020-10-20 21:40:17.000 +0800","version_description":"Introducing Dabbl Cash Back! Earn points when you buy certain products you've seen on Dabbl. <br>+ Check the 'Receipts' tab located in the Earnings screen for details on eligible products<br>+ Simply upload receipts or link your Amazon account to scan; if there's a match, we'll credit you points immediately.<br>+ Visit often to for more opportunities to earn Dabbl Cash Back!"},{"version_id":"838399958","version_name":"1.81","version_date":"2020-11-04 13:09:13.000 +0800","version_description":"Introducing Dabbl Cash Back, now on your home screen! <br>+ Interact with Dabbl experiences to unlock bonus opportunities to earn by uploading a receipt that included a promoted product<br>+ Scan paper receipts or link your Amazon account<br>+ Get points each time we find a matching product <br>Also, look for quicker, easier interaction with Dabbl Research questions and surveys.  <br>Happy Dabbling!"},{"version_id":"838961325","version_name":"1.82","version_date":"2020-11-13 19:36:41.000 +0800","version_description":"In this version, we've updated our Terms of Use. Happy Dabbling!"},{"version_id":"839367516","version_name":"1.83","version_date":"2020-12-02 14:54:07.000 +0800","version_description":"In this version of Dabbl, we've cleaned up a couple of bugs and added dynamic messaging capabilities for some of the new Dabbl screens. <br>Happy Dabbling!"},{"version_id":"839838357","version_name":"1.85","version_date":"2020-12-30 21:01:59.000 +0800","version_description":"This version includes bug fixes to maximize availability of surveys to our Dabblrs"},{"version_id":"840269445","version_name":"1.86","version_date":"2021-02-10 12:12:55.000 +0800","version_description":"In this version of Dabbl, we've resolved a couple of pesky bugs to ensure your time with Dabbl is time well spent.<br>- Amazon account linkage now looks back 30 days for initial scan<br>- Referral program rewarded points <br><br>Happy Dabbling!"},{"version_id":"840764421","version_name":"1.87","version_date":"2021-03-10 20:36:32.000 +0800","version_description":"In this version:<br>+ Updated how we are presenting the screens for our FAQs, Privacy Policy, and Terms of Use<br>+ Added capacity for fun, promotional imagery in the app as we activate Dabbl payout promotions<br>+ Resolved some pesky bugs to make sure the Dabbl experience is #Timewellspent"},{"version_id":"840954438","version_name":"1.88","version_date":"2021-03-22 12:22:08.000 +0800","version_description":"In this version of Dabbl, we've resolved a couple of pesky bugs to ensure your time with Dabbl is time well spent.<br>- Slightly updated UI with updated survey and offer image tiles.<br>Happy Dabbling!"},{"version_id":"841250413","version_name":"1.90","version_date":"2021-04-16 16:13:00.000 +0800","version_description":"We're beyond excited to introduce the Dabbl Streak!  Get rewarded for consistently using Dabbl.  <br>How, you ask?<br>- Open Dabbl and check-in daily (and, of course, earn some points while you're there!)<br>- Do this for 4 days straight and get bonus points on all of your activity<br>- Bonus points grow as you continue your streak!  Earn up to 15% on ALL Activities!<br><br>We've also added the ability to opt-in (or out) of SMS messaging, now available in your profile screen.  Transparency and communication are very important parts of the Dabbl app, so we now give you the option to receive (or not) occasional texts with valuable information to help make sure your experience with Dabbl is #Timewellspent.  <br><br>Enjoy, and Happy Dabbling!"},{"version_id":"842552727","version_name":"1.95","version_date":"2021-06-15 18:45:15.000 +0800","version_description":"Dabbl Streaks UI has been updated and now there is an ability to view all your Streak progress and bonuses broken down by day.<br><br>Happy Dabbling!"}]