[{"version_id":"825235415","version_name":"1.0.1","version_date":"","version_description":""},{"version_id":"826402144","version_name":"1.0.2","version_date":"","version_description":""},{"version_id":"827147397","version_name":"1.0.3","version_date":"","version_description":""},{"version_id":"827545467","version_name":"1.1.0","version_date":"2018-06-19 12:13:38.000 +0800","version_description":"Die gute Nachricht: satellite ist und bleibt kostenlos. Noch eine gute Nachricht: Wenn du gerne mehr als 100 Minuten im Monat telefonierst, kannst du ab jetzt satellite Plus buchen. Mehr Infos und den Kauf-Button findest du nach dem Update in den “Einstellungen”. Auch eine gute Nachricht: Sobald du 90 Minuten deines kostenlosen Monatskontingents vertelefoniert hast, erscheint jetzt in der App ein Button mit den verbleibenden Restminuten. Und zum Schluss noch eine schöne Nachricht: Je mehr man ein Baby umarmt, desto klüger wird es – haben Wissenschaftler herausgefunden."},{"version_id":"827593853","version_name":"1.1.1","version_date":"2018-06-20 00:43:01.000 +0800","version_description":"Dieses Update enthält Verbesserungen der Nutzererfahrung beim In-App Kauf, sowie kleinere Fehlerbehebungen."},{"version_id":"827771033","version_name":"1.1.2","version_date":"2018-07-09 08:03:57.000 +0800","version_description":"“Wenn satellite keinmal klingelt” ist kein Film mit Jack Nicholson, sondern ein Fix in diesem Update. Was war passiert: Das Wecken der App im Hintergrund und die Annahme des Anrufes benötigt Rechenkapazitäten auf deinem iPhone. Gerade ältere Geräte haben dafür teilweise so lange gebraucht, dass der Anruf nicht erfolgreich zugestellt werden konnte. Du bekommst dann nur die Push-Nachricht über einen verpassten Anruf und wunderst dich, dass dein Handy nicht geklingelt hat. Jetzt reagiert die App schneller und alles ist gut."},{"version_id":"828086228","version_name":"1.1.3","version_date":"2018-08-03 08:07:12.000 +0800","version_description":"Wir haben überall in der App kleine und feine Verbesserungen umgesetzt, die dir das Leben erleichtern:<br><br>-    Neue Peek-Aktion in der Inbox: Wenn du beim Peek noch oben wischst, kannst du den Kontakt direkt anrufen.<br>-    Suche in den Kontakten optimiert: Namen mit Umlauten werden bei der Suche nach zugehörigem Vokal angezeigt und die Suche kennt jetzt auch Firmen-/ Spitznamen. <br>-    Leere Detailansicht verhindern: Unter bestimmten Bedingungen wurden die Detailinfos von Kontakten nicht angezeigt. War selten, aber jetzt passiert es gar nicht mehr."},{"version_id":"828224178","version_name":"1.1.4","version_date":"2018-08-15 06:45:51.000 +0800","version_description":"Während das Klima und die Politik immer unzuverlässiger sind, wird satellite durch dieses Update noch stabiler. Die meisten Änderungen (z.B. durchgängige Gespräche bei IP-Wechsel) wirst du gar nicht bewusst wahrnehmen. Doch eine Neuerung zum Ausprobieren ist auch dabei: Text der Voicemail-Abschrift kopieren. Einfach lange gedrückt halten und nach Belieben weiterverwenden."},{"version_id":"828788470","version_name":"1.2.0","version_date":"2018-10-04 11:49:42.000 +0800","version_description":"Das mit satellite klappt super und du telefonierst eigentlich nur noch über uns ... Aber was passiert jetzt mit deiner liebgewonnen Handynummer aus Kindheitstagen? Wir haben ein Herz für alte Nummern und deswegen kannst du auch mit Nummern von anderen Anbietern zu satellite wechseln. Wie das genau geht, erklären wir in der FAQ und in der App. Die Option “Rufnummer portieren” findest du in den “Einstellungen”. Neu ist außerdem ein sehenswerter Gastauftritt des satellite Bots bei Buchung von satellite Plus. Du kannst die Buchung nach der Animation übrigens auch noch abbrechen. Musst also nicht unbedingt bezahlen, um sie dir anzuschauen :)"},{"version_id":"828831148","version_name":"1.2.1","version_date":"2018-10-11 08:32:05.000 +0800","version_description":"Spontaner Bugfix: Eigentlich wollten wir erst nächste Woche wieder ein Update rausbringen. Es gab aber zwei Bugs unter iOS10, die wir direkt gefixed haben: Jetzt kannst du auch mit iOS10 deine Nummer portieren und satellite Plus buchen."},{"version_id":"829119866","version_name":"1.2.2","version_date":"2018-11-02 08:59:20.000 +0800","version_description":"iOS12 bietet spannende neue Möglichkeiten, die wir uns natürlich nicht entgehen lassen:<br>Unser Lieblingsfeature von iOS12 sind die Kurzbefehle und natürlich kann satellite die jetzt auch. Erstelle dir zum Beispiel “Schnellwahltasten” für Lieblingskontakte. Die kannst du sogar mit einem individuellen Sprachbefehl bei Siri hinzufügen. Eine Apple-Eigenheit ist übrigens, dass Kurzbefehle bei der Kurzbefehle-App vor Ausführung noch mal bestätigt werden müssen. Kurzbefehle, die in den Einstellungen “Siri&amp;Suchen” erstellt wurden, brauchen keine Bestätigung … warum? Keine Ahnung! Aber auch ohne Kurzbefehl können Anrufe von nun an mit Siri gestartet werden: “Hey Siri, ruf Mama über satellite an” – Perfekt für Freisprecheinrichtungen. Im Sperrbildschirm werden die Notifications von satellite gebündelt angezeigt und außerdem haben wir die App fit für die Screengrößen der neuen iPhone-Modelle gemacht."},{"version_id":"829263377","version_name":"1.2.3","version_date":"2018-11-15 11:17:03.000 +0800","version_description":"Hast du Freunde in Norwegen, Island, Zypern oder Japan? Vermutlich nicht, aber jetzt kannst du mit satellite auch in diese Länder telefonieren – das ist doch mal ein Grund, neue Freundschaften zu schließen!"},{"version_id":"829373251","version_name":"1.2.4","version_date":"2018-11-26 09:17:06.000 +0800","version_description":"Der satellite Bot hat einen neuen Freund: Die Apple Watch. Beide verstehen sich super und deswegen bekommst du ab jetzt bei Anrufen direkt eine Meldung auf deine Apple Watch. In den “Einstellungen” kannst du die Funktion an-/ausschalten. Und da wir schon mal in den “Einstellungen” waren, haben wir bei dieser Gelegenheit die Ansicht insgesamt etwas aufgeräumt."},{"version_id":"829631626","version_name":"1.2.5","version_date":"2018-12-14 11:26:10.000 +0800","version_description":"\"Das Update\" diesmal mit einer praktischen Neuerung für den Alltag: Wenn du von einer unbekannten Nummer angerufen wurdest, kannst du die Nummer aus der Inbox direkt als neuen Kontakt anlegen oder einem bestehenden Kontakt hinzufügen."},{"version_id":"829910366","version_name":"1.2.6","version_date":"2019-01-14 09:07:43.000 +0800","version_description":"Dieses Update fixed ein Verbindungsproblem bei ausgehenden Anrufen. In bestimmten Konstellationen von IP-Adressen hattest du beim erstem Anrufversuch keinen Sound – der zweite Versuch hat dann zwar geklappt, aber das ist ja Quatsch. Jetzt klappt alles wieder und beim nächsten Update haben wir auch wieder spannende neue Funktionen und nicht nur einen Bug-Fix."},{"version_id":"829977828","version_name":"1.2.7","version_date":"2019-03-20 16:03:58.000 +0800","version_description":"Anruft verpasst? Dann möchtest du natürlich auf einen Blick sehen, wer dich angerufen hat. satellite zeigt dir deswegen jetzt den Namen des Anrufers schon in der Push-Nachricht an. Und du kannst entscheiden, ob du den Chef, die Schwiegermutter oder den Unbekannten zurückrufen möchtest."},{"version_id":"830917577","version_name":"1.2.8","version_date":"2019-04-10 13:08:15.000 +0800","version_description":"Anruf verpasst? Dann möchtest du natürlich auf einen Blick sehen, wer dich angerufen hat … hast du gerade ein Déjà-Vu? :) Keine Sorge, nicht deine Schuld! Tatsächlich hab ich beim letzten Update genau das Gleiche geschrieben und das liegt einfach daran, dass wir die Push-Nachricht bei verpassten Anrufen noch mal angefasst haben. Jetzt steht nicht mehr nur der Vorname in der Push, sondern der komplette Name. Alle Peter und Ursulas wird das sicher freuen. Außerdem haben wir noch dafür gesorgt, dass beim Anruf eines hinterlegten Kontaktes der Name und nicht die Nummer angezeigt wird."},{"version_id":"831541642","version_name":"1.2.11","version_date":"2019-06-04 06:21:40.000 +0800","version_description":"Dieses Update enthält Verbesserungen der Nutzererfahrung und kleinere Fehlerbehebungen."},{"version_id":"831644351","version_name":"1.2.12","version_date":"2019-06-14 09:18:39.000 +0800","version_description":"Dieses Update enthält Verbesserungen der Nutzererfahrung und kleinere Fehlerbehebungen."},{"version_id":"832046515","version_name":"1.3.0","version_date":"2019-07-19 08:45:18.000 +0800","version_description":"Gute Technik löst Probleme, von denen man als Nutzer gar nichts wusste. War dir zum Beispiel klar welche Herausforderung es für satellite ist, bei laufenden Gesprächen vom Wlan in das mobile Netz zu wechseln? Vermutlich nicht, aber das klappt jetzt – auch umgekehrt – und macht dich noch mobiler. Sonst haben wir ein paar Probleme mit dem Call-Kit gefixed. Und du siehst bei Nachrichten der App jetzt immer den Namen des Kontaktes – auch auf der Apple Watch."},{"version_id":"832199325","version_name":"1.3.1","version_date":"2019-08-03 19:06:44.000 +0800","version_description":"Mit diesem Update haben wir mit kühlen Köpfen trotz tropischer Temperaturen die eingehende Erreichbarkeit stabilisiert. Denn unfreiwillig verpasste Anrufe machen nun wirklich keinen Spaß. Verabredungen zum Badesee und Eis essen steht jetzt nichts mehr im Weg."},{"version_id":"832295142","version_name":"1.3.2","version_date":"2019-08-08 05:34:26.000 +0800","version_description":"Mit diesem Update haben wir mit kühlen Köpfen trotz tropischer Temperaturen die eingehende Erreichbarkeit stabilisiert. Denn unfreiwillig verpasste Anrufe machen nun wirklich keinen Spaß. Verabredungen zum Badesee und Eis essen steht jetzt nichts mehr im Weg."},{"version_id":"832450905","version_name":"1.3.3","version_date":"2019-09-27 13:14:27.000 +0800","version_description":"Spüre die dunkle Seite der... App. Ab sofort gibt es satellite auch im Dark Mode! Wer iOS13 schon installiert hat, kann Darth Vader folgen, der zu Luke sagte: „Nur ein einziges Mal möchte ich dich mit meinen eigenen Augen sehen.” Glücklicherweise ist bei satellite die Macht mit dir und du kannst in den Einstellungen deines Geräts beliebig zwischen der hellen und dunklen Version wechseln."},{"version_id":"833108894","version_name":"1.3.4","version_date":"2019-10-10 13:47:14.000 +0800","version_description":"Nach Startschwierigkeiten mit iOS13 sind wir jetzt allerbeste Freunde! Bei Beziehungsproblemen ist ja eigentlich egal, wer angefangen hat ... aber wir waren es nicht :) Jetzt freuen wir uns gemeinsam über weniger Crashes und mehr Stabilität."},{"version_id":"833133428","version_name":"1.4.0","version_date":"2019-10-14 08:15:57.000 +0800","version_description":"Viele glauben ja, dass eine K.I. irgendwann einmal schlauer sein wird als der Mensch. Was dann passiert ist zwar nicht klar, aber wir haben schon mal einen kleinen Schritt in diese Richtung getan und präsentieren unseren neuen Chat-Bot. Er wohnt in den \"Einstellungen\" und heisst \"Schnelle Hilfe im Chat\" (an den Namen müssen wir noch mal ran). Er ist zwar noch nicht schlauer als ein Mensch, aber dafür 24 Stunden am Tag erreichbar und echt schnell. Falls er mal nicht weiter weiss, leitet er deine Frage an uns weiter – dann dauert die Antwort aber vielleicht etwas länger :)"},{"version_id":"833362861","version_name":"1.4.1","version_date":"2019-10-31 09:09:46.000 +0800","version_description":"Der Prozess zur Portierung von Bestandsnummern wurde überarbeitet und optimiert. Auch geschäftlich genutzte Mobilfunknummern können jetzt unkompliziert zu satellite übertragen werden."},{"version_id":"833685962","version_name":"1.4.2","version_date":"2019-11-22 09:07:05.000 +0800","version_description":"In Kürze startet ein Alpha-Test für neue Funktionen. Dafür wurde die App schon mal bereit gemacht – sonst gibt es nichts Neues zu verkünden."},{"version_id":"834328254","version_name":"1.4.3","version_date":"2020-01-14 15:42:56.000 +0800","version_description":"Manchmal muss man einfach mal ein bisschen aufräumen und hat nicht wirklich was Neues. Die meisten Apps nennen das dann \"Stabilitätsverbesserung\", aber das war mir heute zu banal. Trotzdem viel Spaß mit der neuen Version :)"},{"version_id":"834439920","version_name":"1.5.2","version_date":"2020-01-22 12:00:43.000 +0800","version_description":"Diese Version steht ganz im Zeichen der Voicemail! Du entscheidest ab jetzt, ob Voicemail die Anrufe automatisch nach 25 Sekunden Klingeln übernimmt. Wenn du das nicht mehr willst, kannst du Voicemail in den \"Einstellungen\" deaktivieren und es klingelt einfach weiter. Alle Abonnenten von satellite Plus können auch eigene Ansagen direkt in der App aufnehmen und verwalten. In naher Zukunft wird es noch weitere Voicemail-Funktionen geben – es bleibt also spannend :)"},{"version_id":"834466113","version_name":"1.5.3","version_date":"2020-01-23 19:13:20.000 +0800","version_description":"Diese Version steht jetzt wirklich ganz im Zeichen der Voicemail! Du entscheidest, ob Voicemail die Anrufe automatisch nach 25 Sekunden Klingeln übernimmt. Wenn du das nicht mehr willst, kannst du Voicemail in den \"Einstellungen\" deaktivieren und es klingelt einfach weiter. Alle Abonnenten von satellite Plus können auch eigene Ansagen direkt in der App aufnehmen und verwalten. In naher Zukunft wird es wieder zuverlässige Updates und noch weitere Voicemail-Funktionen geben – es bleibt also spannend :)"},{"version_id":"834616413","version_name":"1.5.4","version_date":"2020-02-10 13:52:05.000 +0800","version_description":"Sowohl unser allseits beliebte Newsletter – als auch der wirklich unterhaltsame Podcast – können jetzt in den \"Einstellungen\" verwaltet werden. So mit Anmelden/Abmelden und allem was dazu gehört."},{"version_id":"834677876","version_name":"1.5.5","version_date":"2020-02-12 14:38:06.000 +0800","version_description":"Gestern ein Update und heute direkt noch eins? Die spinnen doch bei satellite! Stimmt nicht, wir programmieren nur total schnell :) Dafür fällt das heutige Update aber auch in die Rubrik “Stabilitätsverbesserung” (s. Update 1.4.3). Du wirst also nicht viel merken. Updaten solltest du aber trotzdem."},{"version_id":"834879528","version_name":"1.6.0","version_date":"2020-02-27 11:59:40.000 +0800","version_description":"Frühjahrsputz in den “Einstellungen”. Wir haben die Settings in der App aufgeräumt, neu strukturiert und frisch angestrichen. Mit dem Update kommt dazu noch ein Evergreen: Stabilitätsverbesserung – diesmal speziell für IPv6-Telefonie. Frühling, du kannst jetzt kommen :)"},{"version_id":"834933289","version_name":"1.6.1","version_date":"2020-03-04 09:41:34.000 +0800","version_description":"Auch wenn der satellite Newsletter für sich alleine schon ein Geschenk ist, legen wir noch einen drauf: Jeder Newsletter-Abonnent bekommt ab jetzt auch einen exklusiven Klingelton gratis dazu! Ist ja fast wie auf dem Hamburger-Fischmarkt hier :-) In den “Einstellungen” kannst du den Newsletter abonnieren und den Klingelton auswählen."},{"version_id":"835900319","version_name":"1.8.1","version_date":"2020-05-13 13:41:20.000 +0800","version_description":"Fischers Fritze fischte frische Fische ... Mit den zwei neuen Voicemail-Funktionen von satellite Plus wirst du richtig professionell oder hast einfach viel Spaß! Neben der Aufnahme direkt in der App kannst du jetzt auch eigene Dateien hochladen – das Expertenlevel für professionelle Ansagen. Du bist eher ein großer Schreiber und kein großer Redner? Dann nutze einfach Text-To-Speech und lass den Bot deine Ansage sprechen. Im Gegensatz zu uns hat er auch keine Probleme mit Zungenbrechern – probier’s aus!"},{"version_id":"836417472","version_name":"1.8.3","version_date":"2020-06-16 09:27:48.000 +0800","version_description":"Ganz ehrlich? Ein neues Feature gibt’s mit diesem Update nicht. Aber der satellite Bot hat uns um ein Sommeroutfit gebeten und wir konnten einfach nicht nein sagen. ;) Die “Schnelle Hilfe im Chat” ist nach wie vor 24/7 erreichbar, sieht jetzt aber noch viel mehr nach satellite aus."},{"version_id":"836824122","version_name":"1.8.8","version_date":"2020-07-16 08:20:15.000 +0800","version_description":"Den Weg in die App zukünftig noch bequemer machen – ein Zaubermittel dafür sind sogenannte “Deep Links”. Um die nutzen zu können, mussten wir unter der Haube ein wenig schrauben. Du wirst aktuell davon nichts merken, aber vielleicht passieren ja schon bald magische Dinge ..."},{"version_id":"837104268","version_name":"1.8.10","version_date":"","version_description":""},{"version_id":"837394360","version_name":"1.8.12","version_date":"2020-08-19 08:30:30.000 +0800","version_description":"Herzlich Glückwunsch an alle Heim-Automatisierer und Tech-Optimierer! Mit satellite Plus könnt ihr jetzt eine Webhook-URL in der App eintragen. Wir schicken dann bei jedem Anruf auf eure satellite Nummer das Call-Event dorthin – und ihr könnt damit machen was ihr wollt. Wem das zu technisch war: Du kannst dein Smart Home über satellite Anrufe steuern."},{"version_id":"837814683","version_name":"1.9.0","version_date":"2020-09-19 07:44:40.000 +0800","version_description":"Das Warten auf iOS14 hat ein Ende und endlich können wir unser satellite Widget präsentieren. Es zeigt dir die persönlichen Kontakte, mit denen du zuletzt gesprochen hast und bringt dich direkt zur jeweiligen Detailansicht. Wenn du noch kein iOS14 hast, findest du das Widget auch in der “Today”-Ansicht (Homescreen ganz Links). \"Widget\" ist übrigens eine Kombination aus \"Window\" und \"Gadget\" – also sowas wie eine \"verspielte Ansicht mit praktischem Nutzen\". Und genau das ist unser Widget :)"},{"version_id":"838009545","version_name":"1.9.1","version_date":"2020-09-30 06:45:07.000 +0800","version_description":"The wait for iOS14 is over and finally we can present our satellite widget. It shows you the personal contacts you last spoke to and takes you directly to the respective detail view. If you don't have iOS14 yet, you can also find the widget in the \"Today\" view (home screen on the far left). By the way, \"Widget\" is a combination of \"Window\" and \"Gadget\" - something like a \"playful view with practical use\". And this is exactly what our widget is :)"},{"version_id":"838052712","version_name":"1.9.2","version_date":"2020-10-02 19:03:57.000 +0800","version_description":"The wait for iOS14 is over and finally we can present our satellite widget. It shows you the personal contacts you last spoke to and takes you directly to the respective detail view. If you don't have iOS14 yet, you can also find the widget in the \"Today\" view (home screen on the far left). By the way, \"Widget\" is a combination of \"Window\" and \"Gadget\" - something like a \"playful view with practical use\". And this is exactly what our widget is :)"},{"version_id":"838207256","version_name":"1.9.3","version_date":"2020-10-16 07:00:37.000 +0800","version_description":"This update prepares the app for upcoming optimizations. Soon we will be able to make the navigation within the app and the use of placeholders more user-friendly. Furthermore we were able to reduce the app by 9MB - our contribution in the fight against the home-office belly :)"},{"version_id":"838378328","version_name":"1.10.0","version_date":"2020-11-02 07:48:22.000 +0800","version_description":"With satellite Plus, you now have more options to manage your reachability yourself – quickly and easily. Create profiles that define how your voicemail, notifications and ringtone should be set. You can activate the profiles manually or automate them using Siri shortcuts."},{"version_id":"838502447","version_name":"1.10.1","version_date":"2020-11-05 21:45:00.000 +0800","version_description":"A new broom sweeps ... differently :) With the new reachability feature and the new iPhone 12, we have discovered some minor bugs and fixed them now."},{"version_id":"839087782","version_name":"1.10.2","version_date":"2020-11-18 12:18:07.000 +0800","version_description":"A new broom sweeps ... differently :) With the new reachability feature and the new iPhone 12, we have discovered some minor bugs and fixed them now."},{"version_id":"839650685","version_name":"1.11.0","version_date":"2020-12-16 17:10:12.000 +0800","version_description":"Well that's convenient! With satellite Plus, you can now set your availability based on time. Perfect for quiet lunch breaks, your well-deserved evening off and relaxed weekends. With satellite Plus, you decide how and when you want to be reachable for your contacts."},{"version_id":"839755283","version_name":"1.11.1","version_date":"2020-12-23 09:15:57.000 +0800","version_description":"Well that's convenient! With satellite Plus, you can now set your availability based on time. Perfect for quiet lunch breaks, your well-deserved evening off and relaxed weekends. With satellite Plus, you decide how and when you want to be reachable for your contacts."},{"version_id":"839837054","version_name":"1.11.2","version_date":"2021-01-05 10:22:41.000 +0800","version_description":"Well that's convenient! With satellite Plus, you can now set your availability based on time. Perfect for quiet lunch breaks, your well-deserved evening off and relaxed weekends. With satellite Plus, you decide how and when you want to be reachable for your contacts."},{"version_id":"839921841","version_name":"1.11.3","version_date":"2021-01-12 08:20:23.000 +0800","version_description":"Well that's convenient! With satellite Plus, you can now set your availability based on time. Perfect for quiet lunch breaks, your well-deserved evening off and relaxed weekends. With satellite Plus, you decide how and when you want to be reachable for your contacts."},{"version_id":"840106502","version_name":"1.11.4","version_date":"2021-01-25 13:19:52.000 +0800","version_description":"Well that's convenient! With satellite Plus, you can now set your availability based on time. Perfect for quiet lunch breaks, your well-deserved evening off and relaxed weekends. With satellite Plus, you decide how and when you want to be reachable for your contacts."},{"version_id":"840832389","version_name":"1.11.5","version_date":"2021-03-16 09:15:58.000 +0800","version_description":"Heard about the satellite podcast? In the account settings you can now not only subscribe to our \"Botcast\", but also find a short info trailer with Kevin. And don't forget: Leave a like and activate the bell ;) Apart from that, I'd like to tell you about a bizarre bug we fixed: If you logged out of the app, it could happen that your phone still rang when this satellite number was called ... but you couldn't answer the call ... *horror movie music* ... Felt really spooky! But now it will never happen again."},{"version_id":"841927411","version_name":"1.12.4","version_date":"2021-04-27 09:55:52.000 +0800","version_description":"Die \"Intelligente Erreichbarkeit\" für satellite Plus war eines unserer größeren Projekte und mit den ortsbasierten Profilen ist es jetzt fertig gestellt. Du definierst einfach einen Ort und sobald du dich dort aufhältst, aktiviert sich sich das gewünschte Profil automatisch. Voicemaileinstellungen, Klingeltöne und Benachrichtigungen – alles genau so, wie du es gerne hättest. Zusammen mit den manuellen und den zeitbasierten Profilen bringt dich jetzt buchstäblich kein Anruf mehr aus der Ruhe."},{"version_id":"842076601","version_name":"1.13.1","version_date":"2021-05-12 04:00:49.000 +0800","version_description":"\"Erreichbarkeit\" als neues kostenfreies Feature für alle. Nicht falsch verstehen, erreichbar warst du natürlich schon immer über satellite :) Aber jetzt entscheidest du, wie \"sehr\" erreichbar du sein willst: Wann soll die Voicemail angehen? Welche Ansage wird gespielt? Welcher Klingelton ist aktiv und wie willst du über verpasste Anrufe informiert werden? Das alles stellst du ab jetzt in der App unter \"Telefonie\" ein. Die Einstellungen gelten übrigens nur für die satellite Nummer. Wenn du also zwei Nummern auf dem Handy hast, kannst du sie besser voneinander trennen."},{"version_id":"842258999","version_name":"1.13.2","version_date":"2021-05-21 06:36:45.000 +0800","version_description":"Nach dem großen Release letzte Woche hatten wir jetzt Zeit für diverse Bugfixes und Stabilitätsverbesserungen. War nichts Kritisches dabei, daher wirst du vermutlich gar nichts merken."},{"version_id":"842402122","version_name":"1.13.3","version_date":"2021-05-28 12:13:22.000 +0800","version_description":"Problem erkannt, Problem gebannt! In der letzten Version gab es einen Bug, so dass Anrufe nach 1x klingeln direkt auf die Mailbox geleitet wurden. War zwar eine tolle Ausrede den Anruf vom Chef wegzudrücken, aber wir haben es trotzdem gefixt."},{"version_id":"842688023","version_name":"1.13.4","version_date":"","version_description":""}]