[{"version_id":"827765024","version_name":"1.0.1","version_date":"2018-10-06 18:17:38.000 +0800","version_description":"Initial App Store release"},{"version_id":"828839487","version_name":"1.0.2","version_date":"2018-10-07 22:26:44.000 +0800","version_description":"Fixed a couple of rare crashes"},{"version_id":"828847369","version_name":"1.0.3","version_date":"2018-10-10 21:55:44.000 +0800","version_description":"New:\n- “Downloaded” filter for local libraries: matches songs that have been downloaded to the device\n- An indicator is now displayed next to downloaded music (local library only)\n\nFixed:\n- Picking alternate app icons now works correctly on iPad\n- Fixed a crash that could occur when app returns from background state\n- Fixed a rare crash when “Loving” an artist, album or song\n\nIf you’re enjoying the app, please consider leaving a review on the App Store, it helps a lot. Use the “Rate Prism“ option available in settings. Thanks!"},{"version_id":"828924076","version_name":"1.1","version_date":"2018-11-07 01:01:29.000 +0800","version_description":"This first major update to Prism brings a native CarPlay app, a repeat button, and local caching for Plex artwork files.\nNot sure if Prism suits your needs? Try the full version for free for a week!\nDon’t forget to leave a review if you’re enjoying Prism! Thanks!\n\nNEW\n- CarPlay support\n- Swipe gesture to skip forwards and backwards\n- Repeat button on player (repeat current song OR current queue)\n- [Plex] Artwork is now cached locally\n- Free trial mode: try the full version for a week\n\nIMPROVED\n- Songs removed from a playlist in Plex / iTunes should now correctly be removed from the playlist in Prism\n- [Plex] Attempt to connect to local connections when behind a VPN while using 4G/LTE\n- [Plex] Attempt to fall back to remote connection if local connection is unsuccessful\n\nFIXED\n- Player view occasionally cutting off last song/album/artist\n- Crash when attempting to make purchase while no network connection is available\n- Rare crash when moving to album from search results"},{"version_id":"829271627","version_name":"1.1.1","version_date":"2018-11-15 01:19:51.000 +0800","version_description":"NEW:\n- Quickly switch between artists, albums and songs by 3d touching or long pressing sort button\n- [Plex] Button on player to display media info of playing song (codec, bitrate, …)\n- [Plex] Added new “Media Type” filter allowing you to filter songs by codec type\n\nIMPROVED:\n- [Plex] Allow connections to insecure custom domains\n\nNote: library refresh is required for media info to display correctly"},{"version_id":"829330931","version_name":"1.1.2","version_date":"2018-11-20 04:46:43.000 +0800","version_description":"- Fixed an issue causing the app to close prematurely when in background mode"},{"version_id":"829852981","version_name":"1.2","version_date":"2019-03-11 23:01:31.000 +0800","version_description":"NEW\n• Download music from your Plex server so you can listen later even without an internet connection\n• Customisable accent colours\n• Display duration on album detail view\n • Display disc numbers on multi-disc albums\n• Pull to refresh library\n • Long press or 3D Touch filter button to quickly add or remove filters \n• Add scroll animation to some labels rather than truncating\n\nIMPROVED\n• [CarPlay] Improved reliability\n• [iTunes] Use “Sort Artist/Album/Track” metadata where available\n • Adjustments to black theme for increased contrast\n • Improved onboarding for new users\n • Various UI adjustments\n• Send additional debug information when reporting an issue\n\nFIXED\n• [Plex] Fixed issue where FLAC playback would report incorrect timing after seeking\n• Fixed issue where automatic library refresh wasn't triggering correctly in some cases\n• Fixed various layout issues\n\nVisit prism-music.app/releases for past release notes and upcoming features.\nIf you have any issues or feedback shoot me an email at feedback@prism-music.app.\nThank you for the support!"},{"version_id":"830591222","version_name":"1.2.1","version_date":"2019-03-23 13:32:08.000 +0800","version_description":"NEW\n- Playback queue is now persisted when app is relaunched\n- [Plex] Display additional information on server detail view (server version, platform etc)\n\nIMPROVED\n- [Plex] Audio formats that are unsupported by iOS are no longer imported\n- Improved performance when importing playlists\n- Reduced CPU usage while playing music in background mode\n- Improved performance after app returns from background mode\n\nFIXED\n- Fixed libraries not auto-updating when new music is added\n- [Plex] Fixed issue where offline servers could be erroneously displayed as reachable\n- [Plex] Fixed issue where reachable servers could be displayed as “Offline” if plex.tv reports it as such\n- [CarPlay] Fixed shuffle option under downloaded music queueing all songs in library\n- [CarPlay] Don’t show cloud icon for downloaded music\n- Fixed stalled marquee animation on player view\n- Various crash fixes\n\nPrism now requires a minimum iOS version of 12.1. Sorry for any inconvenience caused."},{"version_id":"830893521","version_name":"1.2.3","version_date":"2019-04-17 12:04:31.000 +0800","version_description":"This version should fix the issues some users are having where release notes are shown on each launch, and an issue where purchase state was not being persisted after relaunch. NOTE: You may have to dismiss the release notes / restore purchase one last time - sorry about that! \n\nIt also contains a few CarPlay fixes:\n- Fixed empty recently added list\n- The speaker icon should now show correctly on the playing song\n- Fixed a crash"},{"version_id":"831262041","version_name":"1.3","version_date":"2019-06-20 17:42:56.000 +0800","version_description":"NEW\n- Rating system changed from “loves” to star ratings.\n- [Plex] Ratings are now synced back to your Plex server\n- “Loved” filter renamed to “Favourites” (matches songs rated 5 stars)\n- New “Rating” filter: match songs by their rating value\n- Update ratings of all songs in a list (tap new “…” button)\n- Double tap player view artwork to rate song 5 stars\n\nIMPROVED\n- Active filters are restored upon app relaunch\n- Selected repeat mode is restored upon app relaunch\n- Redesigned player view and animations\n- Full library refresh is performed automatically on app launch\n- Greatly improved library refresh performance\n- Improved app startup performance\n- Improved search performance\n- Moved download / delete actions under “…” to reduce confusion and minimise accidental taps\n- Removed track numbers from album art on song lists\n- Lots of other minor layout adjustments\n\nFIXED\n- Playlists deleted from iTunes and Plex should now be correctly removed\n- [Plex] Fixed an issue preventing some audio types from being imported\n- [CarPlay] Issue where playlists and tags were not sorted alphabetically\n- [Plex] Fixed stuck downloads in some situations\n- [Plex] Libraries deleted from Plex servers should now be removed correctly"},{"version_id":"831769176","version_name":"1.3.1","version_date":"2019-06-27 11:27:42.000 +0800","version_description":"- Fixed an issue where skip backwards wasn’t resetting playback to beginning of song\n- Fixed a crash due to a memory leak\n\n—————\n\nNew in v1.3:\n\nNEW\n- Rating system changed from “loves” to star ratings.\n- [Plex] Ratings are now synced back to your Plex server\n- “Loved” filter renamed to “Favourites” (matches 5 star songs)\n- New “Rating” filter: match songs by their rating value\n- Update ratings of all songs in a list (tap new “…” button)\n- Double tap player view artwork to rate song 5 stars\n\nIMPROVED\n- Active filters are restored upon app relaunch\n- Selected repeat mode is restored upon app relaunch\n- Redesigned player view and animations\n- Full library refresh is performed automatically on app launch\n- Greatly improved library refresh performance\n- Improved app startup performance\n- Improved search performance\n- Moved download / delete actions under “…” to reduce confusion and minimise accidental taps\n- Removed track numbers from album art on song lists\n- Lots of other minor layout adjustments\n\nFIXED\n- Playlists deleted from iTunes and Plex should now be correctly removed\n- [Plex] Fixed an issue preventing some audio types from being imported\n- [CarPlay] Issue where playlists and tags were not sorted alphabetically\n- [Plex] Fixed stuck downloads in some situations\n- [Plex] Libraries deleted from Plex servers should now be removed correctly"},{"version_id":"831870642","version_name":"1.3.2","version_date":"2019-08-07 11:29:39.000 +0800","version_description":"NEW\n- [Plex] Plex sign in now uses Plex OAuth\n- New card-style appearance for player view\n- Variable speed scrubbing (slide finger up/down while scrubbing, similar to old music.app)\n\nIMPROVED\n- “Swipe to skip” should now be more reliable\n- Improved player error handling:\n    - Playback error is displayed on player view\n    - When a playback error occurs, the player should no longer skip to the next track\n    - Tapping play button will attempt to restart playback\n- Increased grab size of player scrubber\n- [Plex] Reduced metadata paging size when refreshing libraries. This should reduce issues when running Plex Media Server on a device with constrained memory.\n- Don’t animate playback indicator when playback is paused\n- Various minor layout changes\n\nFIXED\n- Fixed an issue where play counts weren’t updating correctly in some situations\n- Fixed some player layout issues on iPad\n- Fixed an issue where back label wouldn’t change to reflect correct artist / album name\n- Fixed a few search issues on iOS beta versions\n- Fixed a crash on launch when running the latest iOS beta version\n- Fixed a crash when reordering chapters on the player view\n- Fixed a crash when downloading\n- Fixed an issue causing downloads to get “stuck”\n\nNOTES\nThe app now uses Crashlytics for crash reporting, and Firebase for anonymous data collection (just so I can get an idea on what features are used and how often). Both of these can be disabled under Settings -> Privacy."},{"version_id":"832525358","version_name":"2.0","version_date":"2019-10-07 08:29:41.000 +0800","version_description":"This update redesigns the app based on the past year’s worth of feedback:\n\n• New tab-based navigation: dedicated tabs for Artists, Albums, Songs, Search, Playlists & Tags\n• The order of some tabs can be rearranged: head over to the “More” tab then tap the Edit button\n• Improved playlist support: view playlists without needing to add a filter, and songs within a playlist are now sorted in correct Plex / iTunes order\n• Support for iOS 13 dark mode\n• Various iOS 13 fixes\n• Various other layout and appearance updates\n\nThank you for the continued feedback and support, it means a lot!\nIf you have the time, a review or rating makes my day.\n\n- Lachlan"},{"version_id":"833062190","version_name":"2.0.1","version_date":"2019-10-31 22:25:33.000 +0800","version_description":"NEW\n- [Plex] Support for home users. Existing users can switch home users under Libraries -> Account -> Home Users. If no user is selected, the home administrator account is used by default.\n- [Plex] Relayed (indirect) connections are now supported as a last resort\n- Additional app icon colour variations\n\nIMPROVED\n- [Plex] The app will now automatically fall back to insecure (http) connections when no secure connection can be established\n- Various dark mode improvements\n- App icon settings moved to root settings view\n\nFIXED\n- Fixed an issue where album list view could display duplicate albums\n- Fixed an issue where artist list view would sometimes display incorrect album durations\n- Fixed a search related crash\n- Fixed a download-related crash\n- Improved performance when shuffling\n- Improved performance when returning from background with large libraries\n\nIf you have the time, a review or rating makes my day!"},{"version_id":"833419252","version_name":"2.0.2","version_date":"2019-11-20 09:25:57.000 +0800","version_description":"- Crash fixes"},{"version_id":"833679120","version_name":"2.0.3","version_date":"2019-12-03 11:21:36.000 +0800","version_description":"- Fixed an issue where star rating button on the Now Playing view would not display correctly\n- Fixed an issue on iPad where the last song in a list could be clipped by the tab bar\n- Fixed a few other minor layout issues\n\nIf you have the time, a rating or review makes my day!"},{"version_id":"835922611","version_name":"2.2.0","version_date":"2020-05-13 18:22:49.000 +0800","version_description":"Note: Starting with this version you can add your Plex account to Prism for free (additional purchase no longer required).\n\nNEW\n- Added a basic equalizer (iOS 13 only)\n- Each tab now has its own search bar\n- [Plex] Artist countries are now imported as tags\n- [Plex] Similar artists are now imported and displayed under each artist\n- [Plex] Album view now displays record label when available. Tapping on the record label will show you all album released under that label.\n- [Plex] Added artist biography to artist view\n- [Plex] Added album review to album view\n- New option for sorting songs by rating\n- New option for sorting by recently played\n- New settings under Interface > General to adjust if and how library metadata is refreshed on app launch\n- New setting to reduce haptics under Interface > General\n\nIMPROVED\n- Increased size of Libraries and Downloads views on iPad\n- Additional logging to help track down recent spike in playback errors\n\nFIXED\n- [Plex] Fix for occasional m4a file playback issues\n- Fixed “Done” button not displaying on download manager view on some iPad models\n\nNOTES\n- Unfortunately, due to API limitations, the equalizer won’t work when streaming transcoded audio\n\nThank-you for the continued support. If you have the time, a review or rating makes my day!"},{"version_id":"836615307","version_name":"2.2.2","version_date":"2020-06-30 23:03:19.000 +0800","version_description":"- Reverted a change introduced in the previous version that was potentially causing excessive battery drain\n- Other minor changes to reduce background processing\n- Minor layout fixes on iPad"},{"version_id":"837186897","version_name":"2.3.0","version_date":"2020-09-10 13:40:38.000 +0800","version_description":"NEW\n- Native iOS context menu support (iOS 13 only)\n- Added German, Turkish, Czech, Chinese, Spanish and UK English localizations. Thanks to the translators! If you’d like to translate the app into your language, head over to Settings > Help Translate.\n- New option under Settings > Theme to reduce contrast when in dark mode\n- New font selection options under Settings > Theme (iOS 13 only)\n\nIMPROVED\n- Artists, albums, songs, playlists and tags are now sorted based on the system’s locale (should improve sorting of accented and Chinese characters, for example)\n- Improved dynamic text size support across the app\n- Fixed an issue where the UI would not reflect Plex authorisation errors (e.g. after password change)\n- Various download manager reliability improvements\n- Playlist performance improvements\n- Minor visual changes"},{"version_id":"837726736","version_name":"2.3.1","version_date":"2020-09-18 00:47:36.000 +0800","version_description":"Note: this will likely be the last version to support iOS 12. Apologies for any inconvenience.\n\n- Playback can now seamlessly switch between remote and local Plex connections without interruption\n- Songs in playback queue can once again be tapped to skip to that song\n- Added Norwegian, Russian and Finnish translations\n- Fixed a few crashes\n\nIn version 2.3:\n\nNEW\n- Native iOS context menu support (iOS 13 only)\n- Added German, Turkish, Czech, Chinese, Spanish and UK English localizations. Thanks to the translators! If you’d like to translate the app into your language, head over to Settings > Help Translate.\n- New option under Settings > Theme to reduce contrast when in dark mode\n- New font selection options under Settings > Theme (iOS 13 only)\n\nIMPROVED\n- Artists, albums, songs, playlists and tags are now sorted based on the system’s locale (should improve sorting of accented and Chinese characters, for example)\n- Improved dynamic text size support across the app\n- Fixed an issue where the UI would not reflect Plex authorisation errors (e.g. after password change)\n- Various download manager reliability improvements\n- Playlist performance improvements\n- Minor visual changes"},{"version_id":"840737198","version_name":"2.4.3","version_date":"2021-03-08 10:31:41.000 +0800","version_description":"- Downloads will now correctly resume from where they left off after pause / interruption\n- Swiping to skip tracks on the now playing view should now work more reliably\n- Fixed a regression causing libraries to fail to display when server contains a Plex Arcade library\n- Added Chinese (traditional) translation\n- Minor layout adjustments"},{"version_id":"843041826","version_name":"2.5.0","version_date":"2021-07-14 11:02:24.000 +0800","version_description":"Still working on 3.0 - this is a smaller stopgap release in the meantime.\n\n- The download manager has been rewritten/redesigned. Downloading should be more reliable in general, but especially when the app is backgrounded.\n- The download manager now supports concurrent downloads, adjustable under Settings > Downloads\n- Long press seek forwards/backwards buttons to display a menu with a selection of time intervals to seek by (iOS 14 only)\n- Support for selecting custom accent colors (iOS 14 only)\n- Skip forwards buttons are no longer disabled when playing the last song in queue\n- The app now uses a third-party crash reporting service (sentry.io)\n- Added French and Bulgarian translations\n- Fixed a few issues where font style wasn’t being respected\n- Fixed an issue where showing the now playing view would cause the app to freeze on iOS 15\n- Fixed a few crashes"}]