[{"version_id":"825841255","version_name":"1.0","version_date":"2018-02-09 06:13:08.000 +0800","version_description":""},{"version_id":"829724375","version_name":"1.1","version_date":"2018-12-21 20:11:25.000 +0800","version_description":"A minor upgrade that will help us improve stability and make performance improvements going forward."},{"version_id":"829940800","version_name":"1.2","version_date":"2019-01-16 15:02:05.000 +0800","version_description":"New in version 1.2:<br>- Notes about your contacts are now exported too.<br>- Your device's screen now remains active during the backup. This is particularly helpful if you have thousands of contacts to export.<br><br>Fixed in version 1.2:<br>- Fixed a bug that sometimes occurred when exporting to Excel<br>- Fixed a bug that sometimes occurred when exporting a CSV file"},{"version_id":"830073499","version_name":"1.3","version_date":"2019-01-26 00:48:22.000 +0800","version_description":"Version 1.3 fixes an issue where notes attached to a contact would sometimes not be exported properly to a .vcf file. Contacts' notes can now be exported to vCard (.vcf), CSV, and Excel without any issue.<br><br>As a side note, if you like the app and find it useful, please consider rating and reviewing it in the App Store. If you're encountering an issue or have a question, please feel free to send feedback at https://www.sixstarapps.com/export-contact/<br><br>Thank you!"},{"version_id":"831667585","version_name":"1.6","version_date":"2019-06-16 00:05:01.000 +0800","version_description":"Based on feedback received from a user, we fixed an issue where contacts containing multiple identical labels (ie. multiple numbers under the \"Mobile phone\" label) would not export properly. This is now taken care of! Thank you, Connor for reporting this bug."},{"version_id":"832014309","version_name":"1.7","version_date":"2019-07-16 16:24:15.000 +0800","version_description":"This update brings additional fields to your exports, including URL, social profiles, and more."},{"version_id":"834122897","version_name":"1.8","version_date":"2020-01-29 19:17:45.000 +0800","version_description":"This update brings support for iPad."},{"version_id":"834962288","version_name":"1.9","version_date":"2020-03-05 21:55:02.000 +0800","version_description":"This update fixes a small issue that would sometimes hide some columns when opening an exported file in Excel for Mac."},{"version_id":"842111956","version_name":"2.1","version_date":"2021-05-11 13:36:43.000 +0800","version_description":"This new version makes the app free to try. If you already purchased the app, then nothing changes for you and you will retain ability to use it forever."}]