[{"version_id":"825973350","version_name":"1.0.1","version_date":"2018-02-14 04:44:58.000 +0800","version_description":"What a week guys! It's been awesome to see so much interest in this new app. I have received so many suggestions, I can't count them anymore but everything is listed and will be considered, I can assure you that. \nThis mini-update will simply fix a few bugs to clean everything up before I start working on the feature requests I have received for the last few days! \n> Next things I'll be working on: \n- More insights that will feed your YouTube channel content strategy to grow towards monetization together\n- More personalization in the design \n- Look into the permission issues (some of you had questions about them so I added more details about that on the Login screen)\n\nIt's going to be super fun working on this knowing it can help all of us stay motivated!\n\nAlso to those who left super nice reviews & ratings on the AppStore... you're the best! You can't imagine how motivating this is! Keep 'em coming ;)\nTo the person who left a 1* review... it's ok I understand the app doesn't do much yet and I hope I can make you change your mind soon if you stick around haha.\n\nSpeak soon guys and if you want to connect, I'm on YouTube under my name Edouard Barbier, on Twitter here: barbieredouard@ and on Instagram here: @edouard_iosdev \n\nSee ya!  \nEd"},{"version_id":"826126469","version_name":"1.1.1","version_date":"2018-02-28 10:30:36.000 +0800","version_description":"[Edit] Fixing a bug for our fellow iPad users, you won't see any difference in the app. It just won't crash if you are on iPad... so update now haha. \nHi everyone! Ed here, thank you all so much for all the feedback, the love and the energy you've sent my way in the last couple weeks. We're now more than a thousand YouTubers tracking our progress towards monetization on YouTube. I have been getting ideas & suggestions from all over the world and I have now a huge to-do list but that's an amazing problem to have haha. Amazing community!  \n\nHere is another mini-update that will mainly: \n1. Pave the way for big features to be added soon \n2. Add a bit of customization to the main tracker screen, you can now see which channel is logged in as your channel photo will be displayed on the home screen. Many of you have been asking about being able to switch channels in a faster way than by signout out and back in. I'll be looking into that to see how we can bring this to the app soon.\n3. Since some of these features will take a bit longer to build, I have added a work in progress screen so you can follow my progress towards new updates. You can access it from the About screen.\n4. I've also added some cooler animations to the main tracker. You will see the numbers grow like a counter which always gives me a kick when the number goes higher than the last time I refreshed haha\n5. Additional bug fixes & performance improvements, some of it to make the app looking slightly better on iPads. \n\nA big thumbs up to folks from the YouTube Creators Facebook Group, the Reddit community and people over at YTTalks. Great energy! \n\nI read every single feedback shared via the app. I need to be more efficient at replying to everyone but I will definitely try! Keep sharing your thoughts and ideas, that's a big help towards making the app even better for everyone. \n\nIf you want to contact me, you got a few options: \n1. Email: edouard.developer@gmail.com\n2. Twitter: barbieredouard@\n3. Instagram: edouard_iosdev\n4. Via the feedback form inside the app\n\nSpeak soon people! \n\n*Ed goes back to building more features for everyone*"},{"version_id":"826891981","version_name":"1.3.3","version_date":"2018-05-03 11:04:20.000 +0800","version_description":"Hey guys, I've seen so many of you sharing screenshots from the app on social media to show how your channel is growing so I have decided to build a new feature to let you save images from the app. You can then use these images on Instagram, Facebook, Twitter... etc... anywhere you want really. The image will be saved to your iPhone/iPad's photo library. \n\nA big thank you to the folks from the \"Small Youtubers Boost\" Facebook Group who have been great in giving me feedback on this new feature. \n\nMore visuals will be added as new updates get released. To access this feature, look for the camera icon on the YT Monetization Tracker screen or swipe up and you will open a gallery. From there, swipe left/right to select the image you want and hit \"Save\". \n\nFeel free to use the #yttracker hashtag in your posts so we all spread the word about the app. \n\nNext features will be focused on bringing more analytics into the app. \n\nStay tuned! \n\nCheers, Ed."},{"version_id":"827303089","version_name":"1.3.6","version_date":"2018-05-27 05:12:04.000 +0800","version_description":"Oh well, another few bugs out of the way. \n\nI want to send my apologies to anyone based in Japan, Thailand or other countries using Buddist calendars... your Calendar system being different than the Gregorian calendar, all the data requests made by the app to YouTube's servers were failing and you couldn't see proper analytics in the app. Not super convenient, I have to agree :D That should be fixed by now. \n\nSome of you have experiences crashes when trying to refresh the data on this latest version. I've hopefully fixed that too. \n\nWith this out of the way, I can hopefully start focusing on new features. \n\nStay tuned People! \n\nPs: if you wanna become a beta tester, email me at edouard.developer@gmail.com and send me a link to your channel :)"},{"version_id":"827930890","version_name":"1.4","version_date":"2018-08-04 00:13:15.000 +0800","version_description":"Hello lovely people! I hope your channels are doing well and I hope you're ready for a big release. It has been a while but I think I came up with some good stuff. \n\nIn this version you will find: \n- A prediction feature which will tell you when you could reach monetization. How cool is that?!! \n- A profile screen which will show additional analytics and insights.\n- More sharing-cards: swipe up on the home screen and you will find a gallery full of cool visuals you can download and share. \n\nI've also recorded a demo video so you can all see how the Pro version looks like. \n\nAs always, keep sending me your feedback and suggestions and keep up the great work."},{"version_id":"828122139","version_name":"1.4.1","version_date":"2018-08-06 14:41:48.000 +0800","version_description":"Hello lovely people! I hope your channels are doing well and I hope you're ready for a big release. It has been a while but I think I came up with some good stuff.\nIn this version you will find: \n- A prediction feature which will tell you when you could reach monetization. How cool is that?!! \n- A profile screen which will show additional analytics and insights.\n- More sharing-cards: swipe up on the home screen and you will find a gallery full of cool visuals you can download and share.\n\nI've also recorded a demo video so you can all see how the Pro version looks like.\n\nAs always, keep sending me your feedback and suggestions and keep up the great work."},{"version_id":"828228918","version_name":"1.4.2","version_date":"2018-08-23 02:25:17.000 +0800","version_description":"Boom!! Dark mode is here guys! Pro users can now activate a brand new design that will spread across the entire app. \nYou can enable it from the settings screen (Profile -> Menu icon > Enable dark mode). \nIn this version, I'm also adding new sharing/milestones cards (Swipe up on the home screen to access them) that you can download and share with your friends to celebrate your YouTube progress."},{"version_id":"828625755","version_name":"1.5","version_date":"2018-09-21 18:12:39.000 +0800","version_description":"Hello folks! It's been a while since the last update as I have had difficult times in the family and that kept me away from my apps for a few weeks. \nI'm back with a new version that is here to fix all the bugs you have very nicely reported to me via email or via the feedback form inside the app. \nThank you to all of you who have been supportive in these past few months. \nIn other news, I am now fully dedicated to making YT Tracker better (understand: no more full-time job for me, full focus on the apps for the forseeable future)."},{"version_id":"828841227","version_name":"1.6","version_date":"2018-10-13 16:26:53.000 +0800","version_description":"New features coming up guys! V1.6 adds a new tab to your YT Tracker experience. \n\nSay Hello to the GROW tab. This new tab will contain a selection of features aiming to help any YouTuber grow. \nThe first addition to this suite of GROW feature is a video tags analysis tool that lets you export and copy the video tags from any video uploaded on YouTube. It's accessible for both free and pro users (Pro users have unlimited quota of exports).\n\nI also spent some time fixing a bunch of bugs that had been reported by some of you guys so thank you all for that. \n\nI hope you'll enjoy this new video tags analysis feature, if you do, please consider dropping a nice rating or even a review on the AppStore.\n\nCheers, \nEd"},{"version_id":"829085202","version_name":"1.7","version_date":"2018-11-07 04:59:24.000 +0800","version_description":"New feature: you can now create visuals ready to share on social media to promote your videos and your channel. You can customise each visual for a specific video of your choice. Go try it out now! \nPro users will now be able to become Beta testers to have a chance to try out the new features before anyone else and help me shape the direction the app takes.\nThis version also fixes a few bugs (Thanks to everyone who reported them)."},{"version_id":"829392495","version_name":"1.7.1","version_date":"2018-11-23 17:18:58.000 +0800","version_description":"Pro users can now use the new content creation feature entirely without watermarks! \nAlso minor bug fixes (thanks for the continued support of the community that helps me improve the app one version after the next)"},{"version_id":"829537345","version_name":"1.7.2","version_date":"2018-12-12 00:55:47.000 +0800","version_description":"Instagram stories are here :) \nI hope you'll enjoy these new templates to promote your channel on Instagram.\n\nThis update also fixes some bugs reported by fellow YouTubers."},{"version_id":"829751491","version_name":"1.7.3","version_date":"2018-12-28 15:53:24.000 +0800","version_description":"Let's celebrate 2018 with brand new visual templates and a 2018 summary post that will let you see how much your channel has grown this year. \nYou can now easily access all templates by simply swiping up from the home screen.\n\n2018 has been difficult for us YouTubers but I'm convinced 2019 will be full a surprise, fun discoveries and growth for all of us!\n\nSee you in the next update, at some point next year (hey, chill out, it's only a few days away ... don't worry you won't have to wait to long before seeing new features in YT Tracker)."},{"version_id":"829856993","version_name":"1.8","version_date":"2019-01-08 05:51:00.000 +0800","version_description":"Knock knock, Subscriber Live Count is here. \n\nThe profile tab of the app has been slightly modified to provide a live count displaying your subscribers in real-time.\n\nI also fixed a few bugs reported by some of you! \n\nI hope 2019 is started well for you all on YouTube. I'll be adding more and more features for you guys throughout the year. \nCheers,\nEdouard"},{"version_id":"830130735","version_name":"1.9","version_date":"2019-02-08 04:49:43.000 +0800","version_description":"After almost a month of intense work. I'm glad to finally bring to my fellow YouTubers a highly requested feature which I called 'Challenges'. \n\nIt comes to replace the milestone feature which was previously a Pro-only feature inside the app. With Challenges, you can now set your own goals: for example, gain 250 more subscribers in February 2019; or get 100,000 views on your videos in 2019, upload 25 videos in the first 3 months of 2019. You set the rules. \n\nAll you need to do is 1) pick the metric (subscriber, views, uploads or watch time), the period (which defines the length of the challenge) and the target (the goal you want to reach). \n\nFor those who will ask. Yes, this feature replaces the Milestone feature. I have had report that this milestone feature wasn't optimally built (looking in the past, limited in terms of choices etc) and I might rework it in the future but for now, I believe the Challenge feature will be a better way forward to boost our motivation for YouTube and continue to achieve our goals. \n\nFeel free to email me at edouard.developer@gmail.com if you have some feedback for me or if you found any bugs in the app (it happens, unfortunately). \n\nCheers,\nEdouard"},{"version_id":"830426391","version_name":"1.10","version_date":"2019-03-01 08:32:32.000 +0800","version_description":"The only way to grow on YouTube is really to get eyeballs on your videos right? ... But not only. Once people start watching your videos, you need to make sure they stick around and not drop after a few seconds. That's called Audience retention, the art of keeping people engaged throughout your videos. \n\nYT Tracker just got upgraded with a new feature which will help you do just that. The Audience Retention feature is now available on the \"Grow\" tab and will help you understand how much people actually watch your videos and when they stop watching. This way you can analyse your video quality better and identify where you could improve. \n\nGo discover this new feature now!! \n\nI've also spent time fixing a bunch of bugs that you have been reporting throughout the past few weeks. \n\nI hope you'll enjoy this new version. \n\nCheers, \nEdouard"},{"version_id":"830538111","version_name":"1.10.2","version_date":"2019-03-08 18:44:09.000 +0800","version_description":"Bugs fixed at different levels (Challenge feature, Audience Retention feature)\nFeel free to contact me directly via email edouard.developer@gmail.com or on Instagram @edouard_iosdev"},{"version_id":"830761577","version_name":"1.10.3","version_date":"2019-03-28 16:11:37.000 +0800","version_description":"Minor bug fixes for users with freshly created channels. Thanks again for your constant support and for all the suggestions & bug reports I keep getting. \nWe are definitely working together to make YT Tracker better."},{"version_id":"830968860","version_name":"1.12.5","version_date":"2019-08-19 21:55:22.000 +0800","version_description":"Another update to bring the app closer to a full resolution. I'm in touch with YouTube and working directly with them on this. Thanks for your patience while I work on these bugs."},{"version_id":"830968860","version_name":"1.12.1","version_date":"2019-06-27 19:24:39.000 +0800","version_description":"Woop woop, I've just added a brand new way to promote your YouTube videos. Big thumbs up to people from the Small YouTuber Boost Facebook Group. You guys rock and I hope you'll enjoy this new update. Head over to the Grow tab to discover the news. \nThe next update will take slightly longer as I'll be working on an iOS13 revamp. Lots of good stuff coming to YT Tracker soon."},{"version_id":"830968860","version_name":"1.12","version_date":"2019-05-12 08:20:25.000 +0800","version_description":"Hi guys! Here is yet another great update for all YouTubers out there! I've been working on improving the content creation module inside the app. \nGo check it out, you'll find more options to customize the post you can create with the app and also a brand new template which I'm sure you'll love. \nLet me know what you think! \nCheers, \nEd"},{"version_id":"830968860","version_name":"1.11","version_date":"2019-04-16 19:27:11.000 +0800","version_description":"The milestones are back with an improved experience!! Go discover them at the bottom of the Profile tab inside YT Tracker!\n\nAs always, feedback and suggestions are more than welcome!! Find me on Instagram (@edouard_iosdev) or email me at edouard.developer@gmail.com to have a chat."},{"version_id":"831042209","version_name":"1.11.1","version_date":"2019-04-20 16:26:27.000 +0800","version_description":"Thanks for your feedback on the latest feature guys. A few bugs made it to production and they should be fixed with this version. \nAdditionally, I've added more details on the Challenges screen. Some of you were concerned about some data not updating as often as you'd like them too. Unfortunately, this is a limitation on the YouTube side and there is always a small delay 24-48 hours with the historical analytics data. \nLet me know if you find more issues, as always, I'm here to fix them."},{"version_id":"831178963","version_name":"1.11.2","version_date":"2019-05-03 05:11:26.000 +0800","version_description":"Hi everyone, this update is just a quick one to fix a few bugs reported in the last couple weeks. \nA big thank you to those who took the time to report them. \nI'm working on new stuff which will be added to the app very soon."},{"version_id":"831268172","version_name":"1.12","version_date":"2019-05-12 08:20:25.000 +0800","version_description":"Hi guys! Here is yet another great update for all YouTubers out there! I've been working on improving the content creation module inside the app. \nGo check it out, you'll find more options to customize the post you can create with the app and also a brand new template which I'm sure you'll love. \nLet me know what you think! \nCheers, \nEd"},{"version_id":"831808273","version_name":"1.12.1","version_date":"2019-06-27 19:24:39.000 +0800","version_description":"Woop woop, I've just added a brand new way to promote your YouTube videos. Big thumbs up to people from the Small YouTuber Boost Facebook Group. You guys rock and I hope you'll enjoy this new update. Head over to the Grow tab to discover the news. \nThe next update will take slightly longer as I'll be working on an iOS13 revamp. Lots of good stuff coming to YT Tracker soon."},{"version_id":"832300573","version_name":"1.12.3","version_date":"2019-08-10 13:03:10.000 +0800","version_description":"This update will help prepare for a bigger bug fix that will bring some of the features back online. Thanks for your patience and support while I work on this to bring the app fully back online."},{"version_id":"832337389","version_name":"1.12.4","version_date":"2019-08-12 21:52:15.000 +0800","version_description":"One step closer guys... one step closer. Thank you all for your patience while I worked through this fix."},{"version_id":"832416438","version_name":"1.12.5","version_date":"2019-08-19 21:55:22.000 +0800","version_description":"Another update to bring the app closer to a full resolution. I'm in touch with YouTube and working directly with them on this. Thanks for your patience while I work on these bugs."},{"version_id":"832635036","version_name":"1.12.6","version_date":"2019-09-05 02:32:16.000 +0800","version_description":"Additional updates following feedback received by YouTube on the ongoing networking issue."},{"version_id":"832693065","version_name":"1.12.7","version_date":"2019-09-11 09:46:22.000 +0800","version_description":"Fixing the visual bug on the challenge screen. We're done with bugs fixes guys! I'm going to start looking into what's next for YT Tracker! Stay tuned!"},{"version_id":"832871317","version_name":"2.0","version_date":"2019-09-26 01:43:33.000 +0800","version_description":"YT Tracker 2.0 is here. \n\nIn this new verison, I'm bringing two new features. \n\n1. A new tracker for channels that have already achieved monetization. You'll now be able to track your progress towards bigger goals and grow as a YouTuber even further. \n2. A daily progress view with bar charts showing you how much more subscribers & views you're getting on a daily basis.\n\nThis version also fixes a couple of issues highlighted since the last update."},{"version_id":"832925294","version_name":"2.0.2","version_date":"2019-09-26 22:19:38.000 +0800","version_description":"Fix a crash that occurred for users with less than 1,000 subscribers on the Channel Tab."},{"version_id":"832967410","version_name":"2.0.3","version_date":"2019-10-17 07:05:02.000 +0800","version_description":"The subscriber challenges are back! \nThe Daily Progress charts should now work much better for all users. There was an issue with younger channels (under 1 year old).\nI also fix a few extra bugs that appeared with iOS13."},{"version_id":"833269470","version_name":"2.0.4","version_date":"2019-10-24 07:27:29.000 +0800","version_description":"One more bug we won't hear from. Thanks to those of you who reported it."},{"version_id":"833321858","version_name":"2.0.5","version_date":"2019-11-13 11:35:58.000 +0800","version_description":"This version fixes 2 more UI issues for some users who had issues loading the Milestones screen & for some others who were seeing glitches on the daily progress screen. Thanks for reporting these bugs guys. It helps a lot to make the app better and better with each update. \n\nI also added a way to swap the text on some templates from 'MY' videos to 'OUR' videos for channels that are run by more than one person."},{"version_id":"833969842","version_name":"2.1","version_date":"2019-12-12 03:14:17.000 +0800","version_description":"Fixing a critical bug with the Authentication process with Google Sign In."},{"version_id":"834026369","version_name":"2.1.1","version_date":"2019-12-17 07:30:07.000 +0800","version_description":"One more bug fixed. Some of you were seeing the progress view twice with no actual progress because the data were refreshed twice in a split second. \nThat should hopefully be fixed now. If you still experience issues, please reach out to me via the app's contact form and I'll get back to you via email."},{"version_id":"834086210","version_name":"2.1.2","version_date":"2019-12-20 23:29:51.000 +0800","version_description":"Three more bugs out of the way. \n1. If you had a very long channel name, the milestone templates were a bit cut off. That should be fixed by now. \n2. If you had high growth in your daily charts, some of the bars inside the bar charts wouldn't display properly. That's now also fixed. \n3. Double-reloading issue on launch was still occurring for some of the Pro members. That's now fixed too hopefully."},{"version_id":"834188548","version_name":"2.1.3","version_date":"2020-01-04 18:18:50.000 +0800","version_description":"Fixing New Year Crash on the Promote tab :D"},{"version_id":"834661179","version_name":"2.2","version_date":"2020-02-11 22:54:24.000 +0800","version_description":"New features: \n1. YT Tracker will now analyse your videos and give you tips to optimise your ranking in search results and recommended videos. \n2. The labels visible on the Story templates can now be edited, just tap on them to edit their text. \n3. The Profile screen has also been redesigned."},{"version_id":"834677678","version_name":"2.2.1","version_date":"2020-02-12 23:23:36.000 +0800","version_description":"One bug made it to production. Nobody panics, this version should fix it. Thanks for reporting it Emmy!!"},{"version_id":"835241774","version_name":"2.2.2","version_date":"2020-03-25 07:50:21.000 +0800","version_description":"This small update is just a quick fix to solve an issue that was occurring with the audience retention feature. \nStay safe everyone, staying home is the best way to protect yourself and your loved ones. #covid19"},{"version_id":"835479763","version_name":"2.3","version_date":"2020-04-11 02:02:16.000 +0800","version_description":"A quick update to fix a few UI issues and optimize connectivity to YouTube's servers. I hope you are all safe out there. Stay Home as much as possible and keep on creating great content for YouTube."},{"version_id":"835537352","version_name":"2.3.1","version_date":"2020-04-15 02:38:11.000 +0800","version_description":"Continued work to optimize performance and facelifting the video tags screen. Stay safe everyone!"},{"version_id":"835589356","version_name":"2.3.2","version_date":"2020-04-18 03:28:51.000 +0800","version_description":"Another few optimization to improve the fluidity and data consumption of the Year In Review 2019 templates."},{"version_id":"835770087","version_name":"2.4","version_date":"2020-05-01 08:48:42.000 +0800","version_description":"New content templates are in! It's been a while but I wanted to give you guys a few more options. You'll find 4 more templates in the Post section and 4 new overlays. \nI also fixed a long-pending bug which prevented to use Story templates overlay properly. \nYou can now let your creativity speak once again and never hesitate to reach out with templates suggestions; they're pretty easy to build so don't hesitate."},{"version_id":"835801170","version_name":"2.4.1","version_date":"2020-05-04 08:12:52.000 +0800","version_description":"Fixing a small issues with the Audience Retention Feature"},{"version_id":"835824232","version_name":"2.4.2","version_date":"2020-05-06 04:48:44.000 +0800","version_description":"Fixing additional bugs reported by some of you guys! Thanks a lot for the continuous feedback."},{"version_id":"835895200","version_name":"2.4.3","version_date":"2020-05-11 21:48:34.000 +0800","version_description":"Another quick bug fix. Thanks for the continued support & feedback."},{"version_id":"836164738","version_name":"2.4.4","version_date":"2020-06-03 08:03:25.000 +0800","version_description":"Smart video tag suggestions are here! Get ready to boost your videos' SEO with minimal efforts! "},{"version_id":"836291834","version_name":"2.4.5","version_date":"2020-06-06 02:58:04.000 +0800","version_description":"Just a quick bug fix guys! Thank you so much for the initial feedback on the new SEO Feature. I'm glad you guys like it so far."},{"version_id":"836385518","version_name":"2.4.6","version_date":"2020-06-13 19:43:59.000 +0800","version_description":"One more bug fix :) Thanks for your continuous feedback guys. "},{"version_id":"836633555","version_name":"2.5","version_date":"2020-07-01 03:54:32.000 +0800","version_description":"More social media templates added and a few more bugs fixed! \n"},{"version_id":"836730270","version_name":"2.5.1","version_date":"2020-07-07 23:57:07.000 +0800","version_description":"YouTube Coach is here. In this new feature I'll be sharing tips & tricks learnt over the past few years to help you grow the right way on YouTube. Best practices, complex topics explained and more. I hope you'll enjoy this new function. "},{"version_id":"836800152","version_name":"2.5.2","version_date":"2020-07-12 01:43:09.000 +0800","version_description":"Fixing issues with the Spy Tags feature. Thanks for the bug reports! "},{"version_id":"836949157","version_name":"2.5.3","version_date":"2020-07-22 08:57:28.000 +0800","version_description":"The year in progress summaries are back! How's your 2020 YouTube Year going so far? "},{"version_id":"836999690","version_name":"2.5.4","version_date":"2020-07-25 21:04:23.000 +0800","version_description":"Fixing another crash that occurred for some of you in the Promote section. Thanks for the feedback as always."},{"version_id":"837543937","version_name":"2.5.5","version_date":"2020-08-28 18:36:38.000 +0800","version_description":"New feature: keep all your videos ideas in one place to speed up your creation workflow. Check it out in the Grow tab. \nMore social media templates have also been added. \n"},{"version_id":"838048754","version_name":"2.6","version_date":"2020-10-02 22:36:26.000 +0800","version_description":"You can now track several channel's progress all at once in a brand new Dashboard. Open the app and swipe right to discover it. \nThe Advanced tracker can now be activated on the middle tab with the tracker switch. "},{"version_id":"838059960","version_name":"2.6.1","version_date":"2020-10-03 22:12:48.000 +0800","version_description":"A bug made it to the previous version of the app. My apologies for that. This version fixes the issue. "},{"version_id":"838097620","version_name":"2.6.2","version_date":"2020-10-07 06:16:04.000 +0800","version_description":"The Post & Story templates showing a man holding a phone are now available with a woman hand holding the phone. Tap on the hand to toggle between male and female looks. \nAdditional issues fixed following the launch of the new Dashboard feature. "},{"version_id":"838122052","version_name":"2.6.3","version_date":"2020-10-09 05:34:11.000 +0800","version_description":"One more bug fix for iPhone SE users. Thanks for the continued feedback."},{"version_id":"838313888","version_name":"2.6.4","version_date":"2020-10-22 12:06:39.000 +0800","version_description":"A few more bug fixes for older iPhones. "},{"version_id":"839446018","version_name":"2.6.5","version_date":"2020-12-02 10:50:01.000 +0800","version_description":"This new versions fixes several issues: \n- Video tags bug for some of you in the US and Canada\n- Blank dashboard issues for some of the new members \n\nThanks for the feedback. More features coming soon to YT Tracker. "},{"version_id":"839481683","version_name":"2.6.6","version_date":"2020-12-04 05:29:47.000 +0800","version_description":"Two additional bugs resolved for iPhone SE folks. Thanks for reporting these bugs."},{"version_id":"839521753","version_name":"2.8","version_date":"2020-12-07 03:05:57.000 +0800","version_description":"Thanks for reporting the recent issues on iPhone SE. These few bugs should now be fixed. "},{"version_id":"839559421","version_name":"2.8.1","version_date":"2020-12-12 11:42:44.000 +0800","version_description":"It's a wrap! New social media templates (post & story) available to celebrate your 2020 on YouTube. Enjoy! "},{"version_id":"839673955","version_name":"2.8.2","version_date":"2020-12-18 08:14:28.000 +0800","version_description":"New Insta Story / Fleet template available to begin a new year on YouTube!"},{"version_id":"839993769","version_name":"2.8.3","version_date":"2021-01-13 07:59:48.000 +0800","version_description":"Happy New Year everyone! We're starting the year slowly with a few bug fixes that were occurring on the main Dashboard where you can track several channels. I've also added a few more social media templates. \n2021 will be a big year for YT Tracker! Stay tuned for all the awesome features I'll be adding to the app soon."},{"version_id":"840179402","version_name":"2.8.4","version_date":"2021-01-25 02:34:23.000 +0800","version_description":"The content template is getting better and better. New templates, new features. You can now upload your own photos to customize your Thumbnails and you can blur the background of your posts and story at will. Stay tuned! More features are coming soon. "},{"version_id":"840508630","version_name":"2.8.6","version_date":"2021-02-17 09:08:47.000 +0800","version_description":"One hidden gem made it to the app. Will you find it? A hint: it might pop any given day when you open the app. On that day, it will be time to celebrate!! \nThis version also fixes a few UI issues for iPhone SE users. "},{"version_id":"840623256","version_name":"2.8.7","version_date":"2021-02-25 10:04:14.000 +0800","version_description":"This version fixes an issue with the latest feature released in the previous update. "},{"version_id":"841288163","version_name":"2.8.8","version_date":"2021-04-10 00:02:27.000 +0800","version_description":"A few more bugs fixed, thanks for your continued feedback guys! "},{"version_id":"842182215","version_name":"2.8.9","version_date":"2021-05-17 04:41:27.000 +0800","version_description":"Various bug have been fixed and the channel tracking feature has been enhanced! \nMore features coming soon! Stay tuned everyone!"},{"version_id":"842283899","version_name":"2.9.0","version_date":"2021-05-20 00:53:12.000 +0800","version_description":"Further improvements in the channel tracking dashboard. Thanks Denise for the bug reports :)"},{"version_id":"842608614","version_name":"2.9.1","version_date":"2021-06-11 15:21:33.000 +0800","version_description":"Various design improvements are coming to YT Tracker."},{"version_id":"842775424","version_name":"2.9.2","version_date":"2021-06-23 14:44:27.000 +0800","version_description":"This update is part of a bigger ongoing piece of work that will bring a lot more features to the app. The onboarding has been improved and the Settings screen has been given more clarity."},{"version_id":"844198267","version_name":"2021.3","version_date":"2021-09-21 06:31:17.000 +0800","version_description":"I've added a module to help you convert blocks of hashtags into video tags pre-formatted for YouTube. \nA bug that was preventing to add new competitors was also fixed. \nStay tuned for big changes ahead."}]