[{"version_id":"828849464","version_name":"2.1","version_date":"2018-10-10 08:52:54.000 +0800","version_description":"Version 2.1<br>An even more creative, artistic and intelligent Smart Swarmandal.<br>A frequency display to help with faster fine tuning."},{"version_id":"831228424","version_name":"3.1","version_date":"","version_description":""},{"version_id":"832536409","version_name":"3.2","version_date":"2019-08-28 15:19:45.000 +0800","version_description":"New Taal - Bhajani<br>New Instrument - Manjira<br>AI, Sound, UI and performance improvements, bug fixes."},{"version_id":"832599418","version_name":"3.3","version_date":"2019-09-03 03:23:40.000 +0800","version_description":"New Taal (Bhajani), New Instrument (Manjira)<br>Take a screenshot to get help or send feedback.<br>UI, AI, sound and performance improvements."},{"version_id":"832775618","version_name":"3.4","version_date":"2019-09-16 16:01:05.000 +0800","version_description":"* New Talented Taal (Roopak)<br>* New detailed note accuracy reports on the score page.<br>* New setting to hide matra (beat) number."},{"version_id":"832984415","version_name":"3.5","version_date":"2019-10-01 15:42:22.000 +0800","version_description":"- New Taal - Addha teentaal <br>- Greatly improved AI for noisy environments (stage, car, etc) on iOS 13.<br>- Smarter Swarmandal now accompanies in many new modes.<br>- Tabla has become raga aware - bols like tu and rishabh-dhin will now play kre / kre 2 / sre 1 / sre  based on raga and tuning.<br>- Improved adaptive volume on all instruments<br>- Support for iOS 13."},{"version_id":"833329939","version_name":"3.6","version_date":"2019-10-25 18:05:04.000 +0800","version_description":"- New Intelligent Taal - Jhaptaal (previously added : Roopak, Addha-Teentaal, Bhajani, Teentaal &amp; Ektaal). More taals will be added regularly.<br>- Smarter tuner display that reduces distractions, provides better biofeedback.<br>- Swarmandal smart start with Tanpura.<br>- Stability and performance fixes."},{"version_id":"833905863","version_name":"3.7","version_date":"2019-12-08 03:02:12.000 +0800","version_description":"New in version 3.7<br>- An even more realistic Smart Swarmandal with new playing modes, improved AI and tone.<br>- UI design has been upgraded to support rotation, and split-view and multi tasking on iPad.<br>- Pitch, Fine and Tuning settings have moved to perform tab and now also include the tuner level. Indian style pitch shown with frequency.<br>- 3 New pitches for instruments -  A2, A#2, B2<br>- Redesigned 3 octave keyboard<br>- Stability and Performance improvements"},{"version_id":"833919992","version_name":"3.7.1","version_date":"2019-12-08 21:09:23.000 +0800","version_description":"New in version 3.7.1<br>- An even more realistic Smart Swarmandal with new playing modes, improved AI and tone.<br>- UI design has been upgraded to support rotation, and split-view and multi tasking on iPad.<br>- Pitch, Fine and Tuning settings have moved to perform tab and now also include the tuner level. Indian style pitch shown with frequency.<br>- 3 New pitches for instruments -  A2, A#2, B2<br>- Redesigned 3 octave keyboard<br>- Stability and Performance improvements.<br>- Fix for a rare crash when updating from a very old version."},{"version_id":"834463968","version_name":"3.8","version_date":"2020-01-24 02:57:02.000 +0800","version_description":"New intelligent Taal - Dadra, and improved Tabla AI with more finesse, bravado and artistry.<br>Also, <br>- Improved performance (~20% cpu reduction)<br>- New interactive onboarding (find it in the help)<br>- Improvements in UI, under the covers."},{"version_id":"834628905","version_name":"4.0.0","version_date":"2020-02-12 03:33:08.000 +0800","version_description":"* v4.0 - INTRODUCING SMART HARMONY for all genres*<br>Pop to Jazz,  Bollywood to Indian Classical, and everything in between!<br>Automatic, creative, and mood-aware harmony played on Strings and Piano as you perform.<br><br>* STRINGS - Add soulful color with rich, soft Strings that swell up and fade gracefully.<br>* PIANO - Add flavor and flair with arpeggios and chords.<br>* AUTOMATIC HARMONIZER - A new mode in the Raga/Scales menu for playing harmony intelligently based for any song in any genre.<br>* NEW WESTERN MODES / SCALES - Ionian, Aeolian, Dorian, Phrygian, Lydian, Mixolydian, Locrian and Blues<br><br>Other changes:<br>- Tap beat gauge to toggle between a large beat gauge and a mini beat gauge (and a mini tuner gauge and large tuner gauge).<br>- Mixer panel has a master volume and settings control which has a new setting for adaptive volume for all instruments. <br>- New Raga and Taal menus, search by notes in the Raga / Scale<br>- Improved Swarmandal Tone, lowered cpu usage<br>- Faster app launch<br>- 25+% reduction in CPU usage when app is running in perform tab and screen is on. <br>- Fix a rare crash in the subscriptions page.<br>- Fix crash when app launches when a call is in progress<br>- Many other improvements under the covers"},{"version_id":"835784920","version_name":"5.0.0","version_date":"2020-05-06 03:40:00.000 +0800","version_description":"The highly requested feature - Recording, is now here!<br>In fact, NaadSadhana is now also a Full Multitrack Recording and Mixing Studio!<br>We've also gone ahead and added In-Ear Monitoring  (with 3D instrument placement, EQ and reverb) to give you a full stage/studio experience.<br>After recording, you can change track volumes levels and effects and bounce and share a file. Power users can export the entire session and all tracks for advanced editing in your favorite DAW.<br>Other notable features include full accessibility and VoiceOver support, a new tuning (12 Tone Equal Temperament), New Note naming styles (Hindi, Carnatic, English and Latin), improvements to the interface to make it fast, clean and buttery smooth, a new Raga (Latangi) and many more improvements across the board!"},{"version_id":"836384650","version_name":"5.1","version_date":"2020-06-13 02:44:30.000 +0800","version_description":"NaadSadhana is now better than ever, with new Taals, Ragas/Scales, features and more:<br>1. Hands Free controls for Rhythm &amp; Percussion - control rhythm instruments with subtle facial gestures.<br>2. Perform tab has been redesigned to make your performance more streamlined than ever.<br>3. New Taal - Keherwa<br>4. New Ragas / Scales - Gaud Sarang, Kaamod, Manjh Khamaj, Shuddha Bilawal, Shuddha Scale.<br>5. Share long recordings with ease, with mixed down tracks being 20X smaller, with no difference in audio quality.<br>6. Several fixes and speedups, stability improvements."}]