[{"version_id":"826815881","version_name":"1.0.1","version_date":"2018-04-25 22:41:17.000 +0800","version_description":"Remove build number of version in menu setting.<br>Fixed iOS 9 crash issue.<br>Fixed error banner showing please login again."},{"version_id":"826919470","version_name":"1.0.2","version_date":"2018-05-04 15:30:39.000 +0800","version_description":"- Merchant names (if available) will be displayed in Notification screen.<br>- Unintended spaces at the start and end of phone numbers and References are auto-removed for user convenience in Send Money."},{"version_id":"827700566","version_name":"1.0.3","version_date":"2018-07-10 16:23:18.000 +0800","version_description":"Fixed minor bug in notification causing empty notification screen."},{"version_id":"828561980","version_name":"2.0.0","version_date":"2018-09-14 16:00:46.000 +0800","version_description":"- bKash App is now more secure than ever, because of verification of your account before PIN input.<br>- \"Buy Airtime\" service will be known as \"Mobile Recharge\" from now on."},{"version_id":"829605960","version_name":"2.1.0","version_date":"2018-12-13 15:21:39.000 +0800","version_description":"+ Use the new Pay Bill feature in bKash App to pay for utility bills and other services, right from the comfort of your home."},{"version_id":"829989670","version_name":"2.2.0","version_date":"2019-01-22 22:22:45.000 +0800","version_description":"+ Get notification on, and see the reflection of your bank-to-bKash fund transfers (Deposit from iBanking) Statements and Limits.<br>+ Now you can select your mobile operator in Mobile Recharge, in case you have changed your operator, or plan to do so in the future."},{"version_id":"830299420","version_name":"3.0.1","version_date":"2019-09-14 15:03:39.000 +0800","version_description":"+ Improved performance and user experience<br>+ Introducing the new bKash App, with a fresh look, and exciting features<br>+ Explore bKash without an account, and register a new one in a few minutes<br>+ Scan any bKash QR from home screen for faster transaction<br>+ See the best bKash offers near you<br>+ Use shortcuts for your most frequent transactions in My bKash<br>+ Find suggestions from bKash on what other services you can try out<br>+ See all your recent transactions and promotions in Inbox"},{"version_id":"830299420","version_name":"3.0.2","version_date":"2019-09-20 17:37:35.000 +0800","version_description":"+ Fixed iOS 13 compatibility issues<br>+ You will now find a blinking cursor in PIN field for your convenience<br>+ Improved performance"},{"version_id":"830299420","version_name":"2.4.7","version_date":"2019-06-10 16:21:49.000 +0800","version_description":"+ We fixed some bugs for improving your experience of bKash App."},{"version_id":"830299420","version_name":"2.4.4","version_date":"2019-05-15 16:27:17.000 +0800","version_description":"+ You can now pay for XI Class Admission fee to the Board of Intermediate and Secondary Education, Bangladesh. You can find it in the Biller list of the Pay Bill service.<br>+ We fixed some bugs for improving your experience of bKash App."},{"version_id":"830299420","version_name":"2.4.0","version_date":"2019-03-25 18:55:44.000 +0800","version_description":"+ Now you can view the latest bKash offers, deals and other important news in your bKash App. Check out the Offers tab in the Notifications page of your bKash App to explore.<br>+ Looking for the smartest way to buy movie tickets? Look no further! Now you can buy movie tickets of Blockbuster Cinemas straight from your bKash App. Other movie theaters are coming soon!  <br>+ You can now find the Refer a Friend service inside bKash Menu."},{"version_id":"830299420","version_name":"2.3.0","version_date":"2019-02-17 02:32:32.000 +0800","version_description":"+ Worried about missing out on the latest offers and best deals of your mobile operator? Let bKash App<br>take care of it. View and purchase recharge-based Internet, Voice and Bundle offers of different mobile<br>operators in Mobile Recharge<br>+ Funding your bKash account has never been easier! Add money to your account from your debit/credit<br>card (Card to bKash), or your bank’s internet banking (iBanking) service"},{"version_id":"830654766","version_name":"2.4.0","version_date":"2019-03-25 18:55:44.000 +0800","version_description":"+ Now you can view the latest bKash offers, deals and other important news in your bKash App. Check out the Offers tab in the Notifications page of your bKash App to explore.<br>+ Looking for the smartest way to buy movie tickets? Look no further! Now you can buy movie tickets of Blockbuster Cinemas straight from your bKash App. Other movie theaters are coming soon!  <br>+ You can now find the Refer a Friend service inside bKash Menu."},{"version_id":"830721387","version_name":"2.4.0","version_date":"2019-03-25 18:55:44.000 +0800","version_description":"+ Now you can view the latest bKash offers, deals and other important news in your bKash App. Check out the Offers tab in the Notifications page of your bKash App to explore.<br>+ Looking for the smartest way to buy movie tickets? Look no further! Now you can buy movie tickets of Blockbuster Cinemas straight from your bKash App. Other movie theaters are coming soon!  <br>+ You can now find the Refer a Friend service inside bKash Menu."},{"version_id":"831289468","version_name":"2.4.4","version_date":"2019-05-15 16:27:17.000 +0800","version_description":"+ You can now pay for XI Class Admission fee to the Board of Intermediate and Secondary Education, Bangladesh. You can find it in the Biller list of the Pay Bill service.<br>+ We fixed some bugs for improving your experience of bKash App."},{"version_id":"831600850","version_name":"2.4.7","version_date":"2019-06-10 16:21:49.000 +0800","version_description":"+ We fixed some bugs for improving your experience of bKash App."},{"version_id":"832625160","version_name":"3.0.0","version_date":"2019-09-09 00:31:13.000 +0800","version_description":"+ Introducing the new bKash App, with a fresh new look, and exciting features, to make your life simpler and easier than before.\n<br>+ No bKash account? No worry! Now you can explore bKash App without an account, and then register a new one in a few minutes with your National ID.\n<br>+ You can now scan any bKash QR right from the home screen for faster Payment or Cash Out.\n<br>+ Get the best bKash offers near your location, all in one place in the home screen.\n<br>+ Use shortcuts for your most frequent transactions in My bKash.\n<br>+ Find suggestions from bKash on what other services you can try out.\n<br>+ See all your recent transactions and promotions from the Inbox button in home screen."},{"version_id":"832722281","version_name":"3.0.1","version_date":"2019-09-14 15:03:39.000 +0800","version_description":"+ Improved performance and user experience<br>+ Introducing the new bKash App, with a fresh look, and exciting features<br>+ Explore bKash without an account, and register a new one in a few minutes<br>+ Scan any bKash QR from home screen for faster transaction<br>+ See the best bKash offers near you<br>+ Use shortcuts for your most frequent transactions in My bKash<br>+ Find suggestions from bKash on what other services you can try out<br>+ See all your recent transactions and promotions in Inbox"},{"version_id":"832851907","version_name":"3.0.2","version_date":"2019-09-20 17:37:35.000 +0800","version_description":"+ Fixed iOS 13 compatibility issues<br>+ You will now find a blinking cursor in PIN field for your convenience<br>+ Improved performance"},{"version_id":"833354373","version_name":"3.0.3","version_date":"2019-10-28 03:13:08.000 +0800","version_description":"+ Skitto users, no need to feel left out anymore. You can now recharge your mobile balance from bKash App<br>+ Need help with anything? We have included a Support section for you in bKash Menu, from where you can chat with a trusted bKash representative, or send us an email<br>+ Fixed iOS 13 compatibility issues"},{"version_id":"833729361","version_name":"3.1.1","version_date":"2019-11-24 16:00:14.000 +0800","version_description":"+ Buy train tickets from the comfort of your home directly from bKash App<br>+ Pay your VISA credit card bill from Pay Bill in bKash App<br>+ Robi and Airtel users can see personalized offers in My Offer tab of Mobile Recharge<br>+ Bug fixes"},{"version_id":"834268653","version_name":"3.2.0","version_date":"2020-01-15 04:41:02.000 +0800","version_description":"+ Planning your next travel? You can now buy bus, air and launch tickets from bKash App<br>+ Several bug fixes for improved user experience"},{"version_id":"834629211","version_name":"3.3.1","version_date":"2020-02-10 18:46:23.000 +0800","version_description":"+ Forgot which bills you paid with bKash? We now have bill receipts for you<br>+ Get life and health insurance plans to protect your loved ones<br>+ Planning your next travel just got a lot easier. Book hotels all across the country from the Travel service<br>+ You can now find all bKash services on one page, by tapping on the More button on the home screen<br>+ Several bug fixes for enhanced user experience"},{"version_id":"835090141","version_name":"3.5.0","version_date":"2020-03-13 04:30:50.000 +0800","version_description":"+ Add Money to any valid bKash customer account from your VISA debit or credit card super easily.<br>+ Getting started with the app is now simpler than before. Find a welcome page waiting for you with relevant bKash offers and promotions, and get on-boarded to bKash with just your mobile number, and NID (for new users with no account) in a matter of minutes.<br>+ Shop for different products from the Shopping service of bKash App, and get them delivered to your doorstep.<br>+ We made a number of UI changes, and fixed some critical bugs for improved user experience."},{"version_id":"835604673","version_name":"3.6.0","version_date":"2020-04-19 17:51:14.000 +0800","version_description":"+ You can now pay your City Bank AMEX credit card bill from the Pay Bill service.<br>+ Who wants to remember random bill account numbers just to pay bills? We know you don't. Now save your regular bill accounts for faster bill payments.<br>+ New PIN setup, and resetting PIN can now be done through app.<br>+ During a referral campaign, you can now check your stats in Refer a Friend section inside bKash Menu.<br>+ We fixed a number of bugs to improve your bKash app experience."},{"version_id":"835771634","version_name":"3.6.2","version_date":"2020-05-01 07:44:22.000 +0800","version_description":"+ We have fixed a few bugs for a better user experience"},{"version_id":"836408825","version_name":"3.7.0","version_date":"2020-06-15 05:04:15.000 +0800","version_description":"+ Your friend doesn't have a bKash account? No worries! You can now Send Money to people without accounts. All they have to do is register a bKash account within a certain time to receive the money.<br>+ You'll see several new banks in Bank to bKash section of Add Money.<br>+ We fixed some bugs to improve your app experience."},{"version_id":"836908015","version_name":"4.0.1","version_date":"2020-07-21 21:27:07.000 +0800","version_description":"+ Bored at home? Play Bird Game in bKash App to win exciting prizes. Prizes are available only for a few days.<br>+ We've introduced your very own QR code. Others can scan it to Send Money to you quickly.<br>+ Wanna know how to pay your bills? Watch tutorial videos and sample images in Pay Bill to learn how.<br>+ There's a cool new way to know more about bKash services. Check out Discover bKash in bKash Menu.<br>+ Feeling hungry? Check out the new Food service, and pay for delicious food there."},{"version_id":"837863877","version_name":"4.1.0","version_date":"2020-09-22 23:01:05.000 +0800","version_description":"+ Thinking which mobile recharge offer to take? Enter an amount and tap on “Check Offer” button to see the best offers for you.<br>+ We have added new partners in some of our services. Follow the dots to check them out!<br>+ We have new tutorial videos in Discover bKash to help you. Follow the dot on bKash Menu."},{"version_id":"838469077","version_name":"4.3.0","version_date":"2020-11-02 04:47:20.000 +0800","version_description":"+ Pay Titas (Metered) gas bill from bKash App, in addition to the Non-metered option.<br>+ We have added a new partner in Air Tickets, so that you can book domestic and international flights with ease.<br>+ Need help with your travel plans? Book hotels all across the country from the Travel section in bKash App.<br>+ There are some new tutorial videos in Discover bKash. Follow the dot on bKash Menu to find out more."},{"version_id":"839645861","version_name":"4.4.0","version_date":"2020-12-21 05:58:07.000 +0800","version_description":"+ Find nearby bKash Agents, Merchants and Customer Care points on bKash Map<br>+ Opening a new account is now much easier, as bKash will guide you in each step seamlessly<br>+ Get your prepaid electricity Bill Tokens in bKash App<br>+ Plan quick getaways with Biman Bangladesh Airlines in Air Tickets<br>+ Make different kinds of payment to BURO Bangladesh through Pay Bill"},{"version_id":"840651584","version_name":"4.5.0","version_date":"2021-02-28 18:00:52.000 +0800","version_description":"+ Add \"Priyo Numbers\" to Send Money for free<br>+ Share joyful greetings for every occasion when you Send Money<br>+ Select \"Refer bKash App\" to view more details during referral campaigns<br>+ Scan QR on bKash posters to view exciting bKash offers<br>+ Browse websites using the new In-App Browser<br>+ Tap \"More\" to view all bKash and partner services<br>+ Buy Guardian Life Insurance policies right from bKash App"},{"version_id":"842118010","version_name":"4.6.0","version_date":"2021-05-07 18:13:59.000 +0800","version_description":"+ Cash Out from partner banks’ ATMs using bKash App<br>+ Find nearest ATMs of partner banks on bKash Map<br>+ Activate Mobile Auto-Recharge to let bKash automatically recharge your own Airtel, Banglalink or Robi prepaid number<br>+ Get easy access to Priyo numbers and saved billers from My bKash<br>+ Plan a quick bus trip with Shohoz in Tickets section"},{"version_id":"842267919","version_name":"4.6.5","version_date":"2021-05-19 03:02:45.000 +0800","version_description":"+ Cash Out from partner banks’ ATMs using bKash App<br>+ Find nearest ATMs of partner banks on bKash Map<br>+ Activate Mobile Auto-Recharge to let bKash automatically recharge your own Airtel, Banglalink or Robi prepaid number<br>+ Get easy access to saved billers from My bKash<br>+ Plan a quick bus trip with Shohoz in Tickets section"},{"version_id":"843276198","version_name":"4.7.0","version_date":"2021-07-31 10:59:43.000 +0800","version_description":"+ Use bKash services regularly to earn points and claim bKash Rewards by using your points. You can reach a higher level by earning more points and enjoy exciting rewards."},{"version_id":"844357965","version_name":"4.8.0","version_date":"2021-09-30 04:29:43.000 +0800","version_description":"+ Explore exciting offers in story mode, and find the right offers conveniently with the new search and filter features.<br>+ Browse offers and find your desired Merchants, Customer Care Centers, and ATM locations in bKash Map by using the category filters and search."}]