[{"version_id":"828749076","version_name":"2.0.1","version_date":"","version_description":""},{"version_id":"828794767","version_name":"2.1.0","version_date":"2018-10-03 07:55:14.000 +0800","version_description":"v2.0.0 - Cars. So many cars! This version includes a big update to include all current cars in Forza Horizon 4 plus a few recent spotlight cars from Forza 7.<br>What about aero? Well, for the first time in a tuning calculator you get downforce recommendat"},{"version_id":"828970286","version_name":"3.0.0","version_date":"2018-10-19 01:28:11.000 +0800","version_description":"v3.0.0 - This version tightens up Forza Horizon 4 tuning and adds the latest Car Pass vehicles. Now you can select street, dirt/snow, and off-road driving surfaces. New tune types better match the FH4 suspensions like race, drift, and rally. We even handl"},{"version_id":"829067926","version_name":"3.1.0","version_date":"2018-10-27 02:45:53.000 +0800","version_description":"The updates for Forza Horizon 4 keep coming with new Car Pass additions, improved tune results, and a few squashed bugs. For a detailed list of changes visit forzatune.com/change-log<br><br>If you don't have a copy and are a little skeptical please check "},{"version_id":"829251322","version_name":"3.1.1","version_date":"2018-11-11 06:47:17.000 +0800","version_description":"Whether you are tuning in Forza Motorsport 7 or tuning in Forza Horizon 4 you will be ready for the fun, mostly crazy Hot Wheels vehicles. This update also adds the 1973 Porsche #6 Penske Sunoco 917/30 Can-Am Spyder spotlight car.<br><br>The complete list"},{"version_id":"829456363","version_name":"3.1.2","version_date":"2018-11-30 04:34:11.000 +0800","version_description":"ForzaTune is regularly updated for Forza Horizon 4 and Forza Motorsport 7. This latest version includes the Series 3 vehicles from Horizon 4 and more.<br><br>Have a question? Send an email for direct support. Want to brag a little? Please leave a review a"},{"version_id":"829718255","version_name":"3.1.3","version_date":"2018-12-21 02:51:14.000 +0800","version_description":"If you are venturing to Fortune Island or driving the latest spotlight car in Forza 7 this update has you covered. Now you can create custom tunes for every car in Forza 7 and Horizon 4 including the latest DLC:<br><br>• 2019 Lamborghini Urus<br>• 2018 BM"},{"version_id":"829782786","version_name":"3.2.0","version_date":"2018-12-29 06:37:46.000 +0800","version_description":"Expands your Forza Horizon 4 tuning options with support for these new Car Pass vehicles:<br>• 2018 Chevrolet Camaro ZL1 1LE<br>• 2019 Chevrolet Corvette ZR1<br>• 2018 Morgan Aero GT<br>• 1970 Triumph TR6 PI<br>• 2017 Ferrari GTC4Lusso<br>• 1972 Lamborghi"},{"version_id":"830181713","version_name":"3.2.1","version_date":"2019-02-04 03:20:10.000 +0800","version_description":"This update will allow you to tune the newest vehicles in Forza Horizon 4 and Forza Motorsport 7 including:<br><br>• 2018 Audi #1 Audi Sport RS 3 LMS<br>• 1970 Chevrolet Chevelle Super Sport Barrett-Jackson Edition<br>• 1975 Ford Bronco Barrett-Jackson Ed"},{"version_id":"830495903","version_name":"3.2.2","version_date":"2019-03-06 02:16:39.000 +0800","version_description":"This update adds the remaining cars from Series 6 and other new content for Forza Horizon 4 and Motorsport 7 including:<br>• 2012 Ferrari 599XX Evolution<br>• 2012 Cadillac Escalade ESV<br>• 723 Quartz Regalia<br>• 723 Quartz Regalia Type-D<br>• 2001 TVR "},{"version_id":"830524241","version_name":"3.3.0","version_date":"2019-03-07 23:21:27.000 +0800","version_description":"This is a small update to provide better braking performance with smarter brake balance suggestions. Don't worry if the new values look odd when tuning for Forza Horizon 4. The game has a bug that reverses front and rear (weird, right?). As always send an"},{"version_id":"830673325","version_name":"3.3.1","version_date":"2019-03-21 00:18:42.000 +0800","version_description":"Tune the new RTR Mustangs in Forza Motorsport 7 along with all the Series 7 reward cars in Forza Horizon 4."},{"version_id":"831423416","version_name":"3.3.2","version_date":"2019-05-24 23:01:13.000 +0800","version_description":"Cars, cars and more cars. This update brings new Forza 7 cars including Indy, the latest Forza Horizon series rewards vehicles, and a few others to round out the lineup. <br><br>And when you post a top 10 or top 50 leaderboard time be sure to email a scre"},{"version_id":"831834965","version_name":"3.3.3","version_date":"2019-06-29 19:51:16.000 +0800","version_description":"This update adds tuning support for a new season reward car, the 2019 Rimac C_Two. You can also create tunes for the Lego Speed Champion cars including the Mini, F40 and Senna. You'll be surprised how well these cars can handle – even if they are made out"},{"version_id":"832297010","version_name":"3.3.4","version_date":"2019-08-08 12:13:20.000 +0800","version_description":"Now supports vehicles through Series 12 in Forza Horizon 4 including the Ranger Raptor, Wrangler DD, E350 D, Impala SS, CCX, 12C, Lego 911, DBS Superleggera, Vanquish Zagato plus beta support for the Top Gear Trucks. Also improves tunes for several previo"},{"version_id":"832337371","version_name":"3.3.5","version_date":"2019-08-11 23:30:42.000 +0800","version_description":"Adds 2019 Porsche 718 Cayman GT4 Clubsport for Forza Motorsport 7. Earlier this week the 3.3.4 update also added support through Series 12 in Forza Horizon 4 including the Ranger Raptor, Wrangler DD, E350 D, Impala SS, CCX, 12C, Lego 911, DBS Superleggera"},{"version_id":"832576352","version_name":"3.3.6","version_date":"2019-08-31 01:41:03.000 +0800","version_description":"Your favorite Forza Horizon 4 tuning guide and calculator gets the new Porsche vehicles in Series 13. They include the 356 SL Gmünd Coupe, 917 LH, Cayman GTS, and more. Also adds support for the Italdesign Zerouno.<br><br>Have you checked out our Keys to "},{"version_id":"833438749","version_name":"3.3.7","version_date":"2019-11-02 04:34:38.000 +0800","version_description":"Now supports Forza Horizon 4 Series 14 and 15 vehicles including the Bugatti Divo, McLaren 720S Spider, Rossion Q1 and more. If you are also interested in becoming a better driver be sure to check out our Keys to Speed™ training course. Click the \"Driver "},{"version_id":"833724447","version_name":"3.3.8","version_date":"2019-11-23 09:09:08.000 +0800","version_description":"Excited about the Ferrari 488 Pista and other Series 16 vehicles? This update has you covered - we'll also be gearing up for Toyota's return to Forza in December! <br><br>Pssst...if you are interested in becoming a better driver be sure to check out our K"},{"version_id":"833973828","version_name":"3.3.9","version_date":"2019-12-12 21:19:33.000 +0800","version_description":"Adds tuning support for the Supra, new Renaults and other Series 17 cars in Forza Horizon 4.<br><br>Pssst...if you are interested in becoming a better driver be sure to check out our Keys to Speed™ training course. You can learn more by clicking the \"Driv"},{"version_id":"834413761","version_name":"3.3.10","version_date":"2020-01-19 09:24:07.000 +0800","version_description":"Adds tuning support for Series 18 vehicles in Forza Horizon 4.<br><br>Pssst...looking to improve your driving skills too? You may be interested in my Keys to Speed™ online racing school. Click the \"Driver Training\" button on the ForzaTune 7 home screen to"},{"version_id":"834767044","version_name":"3.3.11","version_date":"2020-02-20 07:38:59.000 +0800","version_description":"Adds tuning support for new Series 19 vehicles in Forza Horizon 4 including the Lexus LFA and more. Also includes small update to menu items."},{"version_id":"835110968","version_name":"3.3.12","version_date":"2020-03-16 20:58:18.000 +0800","version_description":"Adds tuning support for Series 20 vehicles in Forza Horizon 4 along with a few user interface updates. Interested in improving your driving skills too? I have a free mini-course covering 3 foundations of faster lap times. Click 'Driver Training' on the ho"},{"version_id":"835404519","version_name":"3.4.0","version_date":"2020-04-10 09:02:13.000 +0800","version_description":"Enjoy several highly-requested features plus tuning for Series 21 cars. You can now backup your tunes, and even share tunes with friends.<br><br>This update also includes: renaming your tunes, two decimals for tire pressures in Bar, separate weight and sp"},{"version_id":"836101784","version_name":"3.4.1","version_date":"2020-05-18 05:28:07.000 +0800","version_description":"Create tunes for the latest Series 22 vehicles, send feedback on specific tunes, and get more consistent ride height results. This update also adds example values to make it easier for new users, fixes the link to the online racing school in the main menu"},{"version_id":"836608279","version_name":"4.0.1","version_date":"2020-07-04 09:37:45.000 +0800","version_description":"ForzaTune 7 is now ForzaTune Pro. This update also includes Series 23 vehicles for Forza Horizon 4 tuning. Other improvements include better track settings for Nürburgring and the Grand Prix circuit, minor adjustment to alignment settings, and improved ri"},{"version_id":"836801474","version_name":"4.0.2","version_date":"2020-07-12 04:36:22.000 +0800","version_description":"Adds Series 24 cars for Forza Horizon 4 tuning. If you missed the last release note, ForzaTune Pro is the new name for the original ForzaTune 7. Enjoy!"},{"version_id":"837701869","version_name":"4.0.3","version_date":"2020-09-09 23:44:33.000 +0800","version_description":"Forza Horizon 4 tuning update to include the latest Series 26 vehicles. If you missed the summer release note, ForzaTune 7 is now ForzaTune Pro. Enjoy!"},{"version_id":"838218690","version_name":"4.0.4","version_date":"2020-10-16 00:46:18.000 +0800","version_description":"This marks the 37th content update for ForzaTune Pro (wow!) and includes new Series 27 and 28 vehicles for Forza Horizon 4.<br><br>Notice: if you have a large number of saved tunes in ForzaTune, be sure to back up your data from time to time. Tune data is"},{"version_id":"839378325","version_name":"4.0.5","version_date":"2020-11-27 08:33:51.000 +0800","version_description":"Adds tuning support for the remaining Series 29 cars including the AMG Hammer and Porsche 911 Reimagined by Singer. You'll also see an improved experience when making tune customizations.<br><br>Friendly Reminder: if you keep a large number of tunes in th"}]