[{"version_id":"829820549","version_name":"1.1","version_date":"2019-01-03 19:06:07.000 +0800","version_description":"- kleinere Fehler behoben<br>- einige Videos für den Video In-App-Kauf wurden verbessert<br>- neueste Bestandszahlen der Brutvögel und Zugvögel Deutschlands hinzugefügt"},{"version_id":"829847644","version_name":"1.2","version_date":"2019-01-06 16:41:00.000 +0800","version_description":"Wir haben Einige Kleinigkeiten verbessert und das Videopaket läuft jetzt noch besser!"},{"version_id":"829884371","version_name":"1.3","version_date":"2019-01-10 15:44:48.000 +0800","version_description":"- Das Popup, welches auf die Vogelzählaktion aufmerksam macht, erscheint jetzt nur noch einmal am Anfang.<br>- Kleinigkeiten am Export wurden verbessert<br>- Einige Videos vom In-App-Videopaket wurden verbessert"},{"version_id":"829978725","version_name":"1.4","version_date":"2019-01-17 12:59:05.000 +0800","version_description":"Wir haben einige Vogelstimmen ausgetauscht und verbessert. Um die neuen Sounds zu genießen, stellen Sie bitte Ihren Vogelstimmenkauf wieder her."},{"version_id":"830175031","version_name":"1.5","version_date":"2019-02-02 20:10:21.000 +0800","version_description":"Danke für die überwältigende Resonanz auf die App, wir wollen die App weiter auf dem neuesten Stand halten und verbessern und weiter zur besten Vogel App Deutschlands ausbauen. Viele weitere Updates sind geplant!<br><br>Mit diesem Update haben wir ein Problem der Vogelstimmen gelöst, welches jetzt alle Vogelstimmen nach dem letzten Update wieder abspielen lässt. 69 Vogelstimmen u.a. die Waldohreule, ließen sich nicht abspielen aufgrund eines Konfigurationsfehlers. Bitte hierfür auch das In-App Soundpaket wiederherstellen. Vergesst nicht uns eine gute Bewertung zu geben falls Euch die App gefällt, Danke!"},{"version_id":"830949753","version_name":"1.6","version_date":"2019-04-20 13:53:04.000 +0800","version_description":"Wir haben viele kleine Fehler verbessert:<br>- Endlich ist das Videopaket 2 erhältlich - Weitere 100 Vogelarten wurden mit Videos versehen (In-App-Kauf)<br>- Einige Texte wurden überarbeitet<br>- Alpenbirkenzeisig und Birkenzeisig wurden zusammengefasst<br>- die Saatgans wurde in Waldsaatgans und Tundrasaatgans in 2 Arten gesplittet<br>- Einige bestehende Videos wurden verbessert und mit neuem Matirial ergänzt"},{"version_id":"831229106","version_name":"1.7","version_date":"2019-05-09 16:02:10.000 +0800","version_description":"Das Video-In-App-Paket 3 ist online. Damit haben alle Vögel Videos!"},{"version_id":"831267993","version_name":"1.8","version_date":"2019-05-11 14:42:16.000 +0800","version_description":"Das Video-In-App-Paket 3 ist online. Damit haben alle Vögel Videos!"},{"version_id":"834221909","version_name":"1.9","version_date":"2020-01-07 10:24:12.000 +0800","version_description":"Danke für das zahlreiche gute Feedback, wir arbeiten weiter daran die App zum besten Vogelbestimmungstool in Deutschland auszubauen.<br><br>Was ist neu?<br><br>- umfangreiches Update zu iOS 13<br>- neues Gesangs Icon im Artportrait<br>- Id-Funktion funktioniert jetzt ausschließend"},{"version_id":"835174287","version_name":"1.12","version_date":"2020-04-09 20:12:29.000 +0800","version_description":"Danke für das zahlreiche gute Feedback, wir arbeiten weiter daran die App zum besten Vogelbestimmungstool in Deutschland auszubauen.<br><br>Das ist Neu:<br><br>- All-in-One In App Kauf - jetzt können alle 4 in-App Pakete für nur 19.99 € auf einmal heruntergeladen werden. Das mühsame nacheinander entfällt somit. Vervollständigen Sie die NABU Vogel App mit Vogelstimmen, Videos, Eier und Verbreitungskarten Deutschland und sparen 5 € im Vergleich zum Einzelkauf<br><br><br>- 15 weitere Arten sind nun mit vervollständigten Tafeln mit Kennzeichen und allen Gefiederkleidvariationen hinzugekommen.  <br>- NEUER In-App Kauf: Verbreitungskarten DEUTSCHLAND mit Sommer und Winterverbreitung - erstmals für alle Vögel im Land - App Premiere in Deutschland!"},{"version_id":"835680203","version_name":"1.13","version_date":"2020-04-30 10:42:12.000 +0800","version_description":"Danke für das zahlreiche gute Feedback, wir arbeiten weiter daran die App zum besten Vogelbestimmungstool in Deutschland auszubauen.\n<br>\n<br>Das ist Neu:\n<br>\n<br>- Wir haben die App in der Geschwindigkeit optimiert: das Nachladen beim Scrollen der A-Z Liste geht nun rasend schnell<br>- All-in-One In App Kauf - jetzt können alle 4 in-App Pakete für nur 19.99 € auf einmal heruntergeladen werden. Das mühsame nacheinander entfällt somit. Vervollständigen Sie die NABU Vogel App mit Vogelstimmen, Videos, Eier und Verbreitungskarten Deutschland und sparen 5 € im Vergleich zum Einzelkauf\n<br>\n<br>\n<br>- 10 weitere Arten sind nun mit vervollständigten Tafeln mit Kennzeichen und allen Gefiederkleidvariationen hinzugekommen.  \n<br>- NEUER In-App Kauf: Verbreitungskarten DEUTSCHLAND mit Sommer und Winterverbreitung - erstmals für alle Vögel im Land - App Premiere in Deutschland!"},{"version_id":"835830331","version_name":"1.14","version_date":"2020-05-07 14:37:00.000 +0800","version_description":"Danke für das zahlreiche gute Feedback, wir arbeiten weiter daran die App zum besten Vogelbestimmungstool in Deutschland auszubauen.\n<br>\n<br>Das ist Neu:<br><br><br>- Wir haben einige Fehler behoben, auf die uns User aufmerksam gemacht haben<br>- Wir haben die App in der Geschwindigkeit optimiert: das Nachladen beim Scrollen der A-Z Liste geht nun rasend schnell\n<br>- All-in-One In App Kauf - jetzt können alle 4 in-App Pakete für nur 19.99 € auf einmal heruntergeladen werden. Das mühsame nacheinander entfällt somit. Vervollständigen Sie die NABU Vogel App mit Vogelstimmen, Videos, Eier und Verbreitungskarten Deutschland und sparen 5 € im Vergleich zum Einzelkauf\n<br>\n<br>\n<br>- 10 weitere Arten sind nun mit vervollständigten Tafeln mit Kennzeichen und allen Gefiederkleidvariationen hinzugekommen.  \n<br>- NEUER In-App Kauf: Verbreitungskarten DEUTSCHLAND mit Sommer und Winterverbreitung - erstmals für alle Vögel im Land - App Premiere in Deutschland!"},{"version_id":"839325872","version_name":"1.15","version_date":"2020-12-16 10:55:53.000 +0800","version_description":"WIr haben eine Menge für Euch verbessert und ergänzt:<br><br>- Echtzeit Id Funktion - man kann jetzt Vögel filtern und auf einem Screen die Auswahl direkt sehen<br>- 35 Vogelarten haben jetzt neue Tafeln mit allen Kennzeichen<br>- Vergleichen-Funktion wurde stark verbessert im Design und Handling<br>- genaue Beschreibungstexte hinzugefügt<br>- 2er Vergleichen Funktion jetzt mit Texten zu Unterscheidungsmerkmalen ausgestattet von 450 Vogelpärchen!<br><br>Lasst uns wissen ob Euch die Neuerungen gefallen und was Ihr Euch noch wünscht, Danke!"},{"version_id":"841049763","version_name":"1.16","version_date":"2021-04-03 06:49:16.000 +0800","version_description":"Wir haben die NABU App aktualisiert und weitere Funktionen hinzugefügt \n<br>\n<br>1. zahlreiche Tafeln wurden angepasst und Morphen ergänzt und Kennzeichen hinzugefügt\n<br>2. jetzt gibt es Vögel in 3D, lebensecht sowie AR Vögel, projizieren Sie virtuelle Vögel auf den Tisch in Lebensgröße"},{"version_id":"841523371","version_name":"1.17","version_date":"2021-04-20 08:43:32.000 +0800","version_description":"Wir haben die NABU App aktualisiert und weitere Funktionen hinzugefügt <br><br>1. 30 weitere Tafeln wurden angepasst und Morphen ergänzt sowie Kennzeichen hinzugefügt<br>2. holen Sie sich die Vögel in 3D, lebensecht sowie AR Vögel, projizieren Sie virtuelle Vögel auf den Tisch in Lebensgröße!"}]