[{"version_id":"826894725","version_name":"1.3","version_date":"2018-05-02 23:45:18.000 +0800","version_description":"Added more review options:<br>- Sort by SRS level (novice then apprentice, etc.) or Wanikani level (current level radicals first, then kanji, etc.)<br>- Back-to-back mode: display the reading and meaning together.<br>- Reveal answer automatically.<br>- Added a button to open information about the last item you answered.<br><br>Minor features:<br>- Haptic feedback (small vibration) when you get an answer right.<br>- Disable the submit button until you type an answer.<br>- Turn the answer red when it's incorrect.<br><br>Bug fixes:<br>- Fix a bug where you would see lots of lessons from higher levels.<br>- Fix a bug where the top of the screen would be covered in blue bars after scrolling.<br>- Replace 'n' with 'ん' properly.<br>- Replace '-' (hyphen) with 'ー' (full-width hyphen).<br>- Fix the size of some radicals in search results."},{"version_id":"828084360","version_name":"1.4","version_date":"2018-08-02 16:24:23.000 +0800","version_description":"- Include context sentences and a \"used in\" list in the Kanji details view.<br>- Add a \"Show all\" button that shows all Kanji in each level, grouped by your progress.<br><br>Minor features:<br>- During a review, warn if you wrote the Kanji reading for a Vocabulary (e.g. the question was 子 and you typed し instead of こ).<br>- During a review, warn if you got the Okurigana wrong (e.g. the question was 入れる and you typed いれろ instead of いれる).<br>- You can now go back by swiping on the whole screen - not just the left edge.<br>- Show an animation when you level up to Apprentice.<br>- Add \"Your Response\" / 「答え」 hint text.<br>- Add a \"Try again later\" option.<br>- Sort lessons by level first.<br>- Now available on iOS 10 and above.<br><br>Bug fixes:<br>- Fix a sync issue where a review would appear as done in the app, but still be available on the WaniKani website.<br>- Fix strange pie chart sizes when going back to the main screen after a review.<br>- Updated to better Radical images.<br>- Handle 'n' followed by 'm' properly.<br>- Convert 'n' to 「ん」 after answering a question incorrectly.<br>- Fix the cursor colour in the search bar.<br>- Fix the mis-sized blue header on the main screen on iPhone 8.<br>- You can now search for Kanji entered by a Japanese keyboard."},{"version_id":"828280546","version_name":"1.5","version_date":"2018-10-18 10:25:21.000 +0800","version_description":"- Added Visually Similar Kanji<br>- Added a Katakana input mode (use caps)<br>- Fix a date parsing bug that caused incorrect number of reviews and start date to be shown<br>- Update to work with the new WaniKani API"},{"version_id":"829541891","version_name":"1.6","version_date":"2018-12-06 16:29:30.000 +0800","version_description":"- Fixed a crash on startup with the new WaniKani content update.<br>- Add audio for all vocabulary.  Options to play automatically and to download for offline use.<br>- Correctly handle keyboard resizing.<br>- Fix text colour of some words in hints.<br>- Fix a bug where some users could see Kanji from higher levels."},{"version_id":"829580559","version_name":"1.7","version_date":"2018-12-10 17:07:03.000 +0800","version_description":"* Fixed a crash when you have a cached pending review for a radical that was deleted.  This most commonly crashed when swiping through levels in the \"View all\" screen.<br>* Fixed an empty blue radical review screen.<br>* Fixed the position of the keyboard in lesson reviews.<br>* Fixed a rare bug that kept data from the old user when logging out and switching accounts.<br>* Allow the text in context sentences to be copied to the clipboard.<br>* Added \"Part of Speech\" display."},{"version_id":"830108512","version_name":"1.8","version_date":"2019-01-28 22:56:15.000 +0800","version_description":"- Fix a bug where completed reviews would sometimes be lost<br>- Add review notifications (thanks André Arko)<br>- Add a random font option for reviews (thanks hesch)<br>- Add a setting to hide old mnemonics from radicals (thanks Christoph Nakazawa)<br>- Add a quick settings side menu to the review screen<br>- Fix a bug where the review counts on the app icon and the main screen wouldn't refresh<br>- Make \"Ask again later\" put the item back at the very end of the queue<br>- Fix \"mark as correct\" behaviour when answering a question a second time<br>- Fix a small animation glitch when the labels would be replaced with \"...\" for a short time"},{"version_id":"830132167","version_name":"1.9","version_date":"2019-01-30 15:41:04.000 +0800","version_description":"Fix a crash when opening certain Kanji"},{"version_id":"830725500","version_name":"1.10","version_date":"2019-03-25 15:10:39.000 +0800","version_description":"- Fix an API key error on login.<br>- Better keyboard support for iPads (thanks André Arko)<br>- Increase the font size on iPads (thanks André Arko)"},{"version_id":"831305717","version_name":"1.11","version_date":"2019-08-15 18:45:07.000 +0800","version_description":"Fixed major bugs where review and lession progress would stop being uploaded after some time.<br><br>New features:<br>- Added an option to use Katakana for Onyomi readings.<br>- Added remaining level time and SRS level counts to the main screen.<br>- Added new items and pronounciation audio files from Wanikani.<br>- Added some new lesson customization settings.<br>- Added a \"lowest level first\" review sort option.<br>- Added a count of how many Kanji the user knows to the main screen.<br>- Added more keyboard shortcuts.<br><br>Bug fixes:<br>- Fix a bug where fonts would be chosen that couldn't render certain characters.<br>- Fix a bug with music ducking when playing pronunciation audio.<br>- Use Japanese fonts even when the iOS system language is Chinese."},{"version_id":"832428941","version_name":"1.12","version_date":"2019-08-19 18:25:53.000 +0800","version_description":"- Fixed a major bug where review progress was not uploaded after upgrading to a new version of the app.<br>- Fixed a bug where it was not possible to answer reviews containing long-dashes (ー)."},{"version_id":"833557752","version_name":"1.13","version_date":"2019-11-11 22:51:53.000 +0800","version_description":"New features:<br>- Highlight Kanji in context sentences.<br>- Add an option for an SRS level indicator in reviews.<br><br>Bug fixes:<br>- Hopefully fix a crash on iOS 13 when swiping back from a subject details view.<br>- Blacklisted meanings are now marked as incorrect.<br>- Keyboard shortcut improvements.<br>- UI fixes for iOS 13.<br>- Convert n-space to ン instead of ん in Katakana mode.<br>- Correctly calculate level up times for 90% of Kanji.<br>- Use the system font for the Part of Speech label."},{"version_id":"833569274","version_name":"1.14","version_date":"2019-11-12 17:57:04.000 +0800","version_description":"This version fixes an issue with dark mode on iOS 13."},{"version_id":"833703694","version_name":"1.15","version_date":"2019-11-21 18:45:23.000 +0800","version_description":"- Fix a bug that allowed submitting empty answers.<br>- Add a font-size selector.<br>- Fix a bug where incorrect readings wouldn't be highlighted on the review summary screen.<br>- Always show Kanji hints - not just during lessons.<br>- Add a tiny animation to the SRS level dots."},{"version_id":"834329849","version_name":"1.16","version_date":"2020-01-15 22:55:21.000 +0800","version_description":"New features:<br>* iOS Dark mode support<br>* WaniKani vacation mode support<br>* You can now force refresh by pulling down on the main screen<br>* Add an option to automatically switch to a Japanese keyboard<br>* Add an option to show all readings for Kanji<br>* Add options for newest &amp; oldest available sort<br>* Show the time until the next review for the current level<br><br>Bug fixes:<br>* Don't randomize fonts during lessons<br>* Hide success rate percentage in lessons"},{"version_id":"834390249","version_name":"1.17","version_date":"2020-01-17 08:30:46.000 +0800","version_description":"New features:<br>* iOS Dark mode support<br>* WaniKani vacation mode support<br>* You can now force refresh by pulling down on the main screen<br>* Add an option to automatically switch to a Japanese keyboard<br>* Add an option to show all readings for Kanji<br>* Add options for newest &amp; oldest available sort<br>* Show the time until the next review for the current level<br><br>Bug fixes:<br>* Don't randomize fonts during lessons<br>* Hide success rate percentage in lessons<br>* Fixed a crash on startup for some users"},{"version_id":"835295412","version_name":"1.19","version_date":"2020-03-27 22:34:53.000 +0800","version_description":"New features:<br>* Add a dark mode toggle.<br>* Add limited Siri shortcut support.<br>* Blur the English text in context sentences until you tap them.<br>* Show user-created notes for items.<br>* Add a Descending SRS Stage review sort option<br>* Add a review batch size option.<br><br>Bug fixes:<br>* Fix a bug where reviews for the same items would keep re-appearing.<br>* Add some missing titles for settings pages.<br>* Fix a bug where reviews might be rejected if the device's clock was wrong.<br>* iPad: Fix font size setting issues.<br>* Fix a crash when starting lessons or reviews on iOS 13.4"},{"version_id":"835485442","version_name":"1.20","version_date":"2020-04-10 16:36:05.000 +0800","version_description":"* Fixed a bug where the \"Hills\" radical would keep appearing in reviews.<br>* Updated to the latest version of the WaniKani data."},{"version_id":"836603373","version_name":"1.21","version_date":"2020-06-27 16:54:31.000 +0800","version_description":"* Fixed a crash when trying to play audio while offline.<br>* Added a skip button to skip a review.<br>* Updated to the latest version of the WaniKani data."},{"version_id":"840972495","version_name":"1.22","version_date":"2021-03-20 15:59:24.000 +0800","version_description":"New features:<br>* Always use the latest WaniKani meanings, mnemonics and levels.<br>* Add an option that makes repeated incorrect answers count as multiple SRS-level penalties.<br><br>Bug fixes and cleanups:<br>* Allow hardware keyboard control during wrong answers.<br>* Allow trailing n-kana completion in Gboard Godan layout.<br>* Many internal changes to convert from Objective-C to Swift."},{"version_id":"841131506","version_name":"1.22.2","version_date":"2021-03-30 20:15:23.000 +0800","version_description":"New features:<br>* Always use the latest WaniKani meanings, mnemonics and levels.<br>* Add an option that makes repeated incorrect answers count as multiple SRS-level penalties.<br><br>Bug fixes and cleanups:<br>* Allow hardware keyboard control during wrong answers.<br>* Allow trailing n-kana completion in Gboard Godan layout.<br>* Many internal changes to convert from Objective-C to Swift.<br>* Fix a bug that would prevent new users from logging in for the first time (with error \"API token not found\")<br>* Fix a bug that would prevent the main screen from refreshing when the user was offline."}]