[{"version_id":"829265741","version_name":"1.3.18","version_date":"2018-11-13 07:09:56.000 +0800","version_description":"修复已知BUG，让用户体验更好。"},{"version_id":"829462006","version_name":"3.18.66","version_date":"2018-12-03 08:39:45.000 +0800","version_description":"--正版授权、全新火影羁绊策略手游《火影忍者OL-忍者新世代》面世，让我们共同奔向木叶，在木叶的世界里共同守护最初的羁绊！<br><br>--博人传大型主题活动来袭！火影忍者新世代篇章《博人传（BORUTO）》也将同期推出，修行之路不再孤独，新内容时刻相伴。<br><br>--波风水门、干柿鬼鲛、手鞠[泳装]等丰富新忍者定期推出，参与活动即可获得丰厚奖励~<br><br>--12月签到忍者：森乃伊比喜来袭<br><br>--每日一签系统上线，获取属于你的专属签文，分享获得好运哦！<br><br>--开服狂欢系列活动<br>1）累计登录：送A级忍者五选一<br>2）木叶祭庆典：S级忍者红免费领取<br>3）战力比拼赢四代火影，战力达标送月光疾风<br>4）每日签到：送人气忍者[海野伊鲁卡]<br>5）超值封印返利：封印宝箱3倍返利<br>6）忍者新世代开启：登录领取漩涡博人<br>7）忍界对战助力：完成任务助力战力UP<br>8）招募狂欢：前二十连招募必得S级忍者旗木卡卡西<br>9）福禄丸献礼：首次开启充值界面即送元宝奖励，每日充值任意金额送李洛克[杜门]碎片<br><br>--其他优化和调整"},{"version_id":"829562883","version_name":"3.35.9","version_date":"2018-12-13 20:07:53.000 +0800","version_description":"全新版本“疾风传”开启，木叶村雪景震撼登场！<br>登录和加载界面更新全新疾风传主题；<br>疾风传、暗部等全新忍者即将上线；<br>英雄副本[传承]即将开放，将不服输的精神贯彻到底！<br><br>全新内容<br>【全新副本开启】<br>通关英雄副本第四章[传承]，即可获得樱[疾风传]。<br><br>【全新忍者来袭】<br>鸣人[疾风传]、樱[疾风传]、卡卡西[暗部]、鼬[暗部]即将上线，请关注游戏内活动。<br><br>【全新界面调整】<br>木叶村替换为木叶村雪景，皑皑白雪相伴冬日。<br><br>【全新地图上线】<br>新增3张新地图：川之国峡谷、一线天、沙忍村，新故事即将上演。<br><br>【疾风传焕新颜】<br>更换了疾风传新Icon、新登录界面、新Loading图。<br><br>【体验优化与调整】<br>&gt;&gt;&gt;商店优化<br>*黑市商店每天可免费刷新一次，且增加了红点提示。<br>*封印商店增加批量兑换功能。<br>*物品兑换商店可以选择要兑换的物品数量，同时调整了部分道具的售卖个数，单价保持不变。<br>*商城中购买次数为0的礼包显示为灰色，并且后置。<br><br>&gt;&gt;&gt;玩法优化<br>*优化组队副本的自动匹配功能的规则。<br>*竞技场新增装备调整功能。<br>*排位战挑战对手时，如果对手排名发生变化，会再次确认是否挑战。<br>*忍者派遣界面，增加返回按钮。<br>*玩家每日最多可接受2次押镖援助。<br>*战斗中新增快速发言功能。<br>*当进入战斗、打开排行榜、兑换、布阵界面时，滚动公告条会暂时隐藏，以避免干扰。<br>*忍者考试的战败提示中的“参考阵容”会跳转至视频中心。<br><br>&gt;&gt;&gt;美术优化<br>*玩家主角在非时装状态下也增加了闲暇动作。<br>*主线副本第五章、第七章背景图替换为高清图。<br>*选中NPC时的地圈效果更新。<br>*调整了主角表情立绘。<br>*优化了博人传忍者招募图。<br><br>&gt;&gt;&gt;其他优化及BUG修复<br>*新增部分忍者羁绊。<br>*优化排行榜的信息展示。<br>*布阵界面忍者列表筛选优化。<br>*应版权方要求，笕堇[鵺] 更名为 笕堇[战斗装束]。<br>*应版权方要求，优化了部分忍者羁绊的背景图。<br>*博人传忍者新增音效。<br>*优化了游戏内部分通用音效。<br>*修复了千鸟佐助追打【火遁·凤仙火之术】只打1体的问题。<br>*修复了牙奥义打多体时，红豆会错误抵挡的问题。"},{"version_id":"829849364","version_name":"3.36.10","version_date":"2019-01-09 21:41:53.000 +0800","version_description":"新年新气象，2019新年特别版本，震撼来袭！<br>全新跨服竞技场开启，打破边界，登顶\"六道之力\"！<br>全新生存开启，决战终末之谷，拿专属忍具套装！<br>更多全新组队副本、组织玩法、剧情副本，尽在新年特别版本！<br><br>全新内容<br>【全新跨服竞技场】<br>*玩家可以自由选择竞技场本服匹配或者跨服匹配。<br>*同时新增了跨服竞技场排行榜，呼朋唤友，一较高下，问鼎跨服第一。<br><br>【全新生存开启】<br>*新增生存探险关卡——终末谷。<br>*新增新忍具套装——终末谷套装，集齐后可以激活“奥义特训”，用于提升奥义伤害。<br>*新增终末谷忍具召唤。<br><br>【全新碎片炼化系统】<br>通过炼化多余的忍者碎片，提升炼化等级，获得战斗特权，专属称号和物品奖励。<br><br>【全新特训派遣】<br>*忍者派遣中新增一种特训派遣，可以提升派遣的忍者的等级和觉醒等级。<br><br><br>【全新场景来袭】<br>新增场景——五封结界。<br><br>【体验优化与调整】<br>&gt;&gt;&gt;战斗信息优化<br>*忍者本回合是否行动过可以通过手位牌来识别。<br>*优化忍者必杀技能的状态，使其更为明显。<br>*优化队伍选中状态，使其在多队伍战斗中可以被区分。<br>*为选中忍者增加特效，现在选中忍者更容易被察觉了。<br><br>&gt;&gt;&gt;属性相关调整<br>*之前火影OL有一个隐藏系统，根据忍者总星级会获得一定的属性。但是考虑到难以理解，所以将这部分属性迁移到头衔系统。<br>*删掉之前的隐藏系统的属性，同时将属性迁移到头衔系统。<br>*更新后玩家的战力会有不同幅度的提升哟。<br><br>&gt;&gt;&gt;玩法优化<br>*优化了组队匹配的规则。<br>*优化生存试炼的跳转逻辑。<br>*调整第二套忍具的节点效果：<br> Lv3：第二回合额外回复最大生命上限12%的生命。<br> Lv6：第一回合额外回复最大生命上限12%的生命。<br> Lv9：第三回合额外回复最大生命上限12%的生命。<br> Lv12：第四回合额外回复最大生命上限12%的生命。<br><br>&gt;&gt;&gt;玩法界面信息优化<br>*新增玩法小报，介绍各玩法的核心看点。<br>*完善各玩法入口下方的进度显示，方便查看当前状态。<br>*翻页提醒改为箭头指引，现在左右滑动或者点击箭头，均可翻页。<br><br>&gt;&gt;&gt;其他优化及BUG修复<br>*优化战败提示。<br>*优化了部分忍者的技能音效。<br>*战斗血条增加血量百分比显示。<br>*[镜返]技能增加反弹路径显示。<br>*根据监修意见，修改了元月活动副本部分对白。<br>*属性提示优化：现在显示属性的所有详细来源。<br>*忍者技能提示上增加此忍者技能的会造成的状态解释。<br><br>全新内容<br>【全新跨服竞技场】<br>*玩家可以自由选择竞技场本服匹配或者跨服匹配。<br>*同时新增了跨服竞技场排行榜，呼朋唤友，一较高下，问鼎跨服第一。<br><br>【全新生存开启】<br>*新增生存探险关卡——终末谷。<br>*新增新忍具套装——终末谷套装，集齐后可以激活“奥义特训”，用于提升奥义伤害。<br>*新增终末谷忍具召唤。<br><br>【全新碎片炼化系统】<br>通过炼化多余的忍者碎片，提升炼化等级，获得战斗特权，专属称号和物品奖励。<br><br>【全新特训派遣】<br>忍者派遣中新增特训派遣，可以提升派遣忍者的等级和星级。<br><br><br>【全新场景来袭】<br>新增场景——五封结界，<br><br>【体验优化与调整】<br>&gt;&gt;&gt;战斗信息优化<br>*忍者本回合是否行动过可以通过手位牌来识别。<br>*优化忍者必杀技能的状态，使其更为明显。<br>*优化队伍选中状态，使其在多队伍战斗中可以被区分。<br>*为选中忍者增加特效，现在选中忍者更容易被察觉了。<br><br>&gt;&gt;&gt;属性相关调整<br>*之前火影OL有一个隐藏系统，根据忍者总星级会获得一定的属性。但是考虑到难以理解，所以将这部分属性迁移到头衔系统。<br>*删掉之前的隐藏系统的属性，同时将属性迁移到头衔系统。<br>*更新后玩家的战力会有不同幅度的提升哟。<br><br>&gt;&gt;&gt;玩法优化<br>*优化了组队匹配的规则。<br>*优化生存试炼的跳转逻辑。<br>*调整第二套忍具的节点效果：<br> Lv3：第二回合额外回复最大生命上限12%的生命。<br> Lv6：第一回合额外回复最大生命上限12%的生命。<br> Lv9：第三回合额外回复最大生命上限12%的生命。<br> Lv12：第四回合额外回复最大生命上限12%的生命。<br><br>&gt;&gt;&gt;玩法界面信息优化<br>*新增玩法小报，介绍各玩法的核心看点。<br>*完善各玩法入口下方的进度显示，方便查看当前状态。<br>*翻页提醒改为箭头指引，现在左右滑动或者点击箭头，均可翻页。<br><br>&gt;&gt;&gt;其他优化及BUG修复<br>*优化战败提示。<br>*优化了部分忍者的技能音效。<br>*战斗血条增加血量百分比显示。<br>*[镜返]技能增加反弹路径显示。<br>*根据监修意见，修改了元月活动副本部分对白。<br>*属性提示优化：现在显示属性的所有详细来源。<br>*忍者技能提示上增加此忍者技能的会造成的状态解释。"},{"version_id":"830370630","version_name":"3.37.40","version_date":"2019-02-27 19:43:16.000 +0800","version_description":"全新版本[忍者·无禁季]重磅登场！<br>新玩法无尽之域，挑战副本冲击忍界之巅！<br>全新饰品系统，无需养成、战力飙升！<br>解锁通行证，更可免费得SS忍者-蝎[百机操演]、永久时装—夜樱呢喃以及海量道具！<br><br>【全新系统-战斗通行证，限定橙色时装、SS忍者等你拿】<br>全新系统战斗通行证登场，在2个月的赛季内获取通行证经验提升通行证等级，领取专属限定橙色时装和SS级忍者碎片；<br>日常任务活跃度、周常任务、竞技场段位奖励与新玩法无尽之域都会产出通行证经验；通行证等级越高，额外奖励也越多，除此以外还可购买通行证经验快速获取限定奖励；<br>除时装与忍者外，还有封印碎片、VIP经验、通灵之卷、忍者觉醒道具礼盒等奖励等你来拿；<br>第一赛季的限定SS忍者为：蝎[百机操演]，橙色限定时装为：夜樱呢喃；<br><br>【全新SS忍者-蝎[百机操演]】<br>全新SS忍者蝎[百机操演]登场，他可以在释放奥义时消耗剩余查克拉召唤大量傀儡，且场上的傀儡越多，百机傀儡们的伤害也就越高，以摧城 之势击败自己的对手。<br>蝎[百机操演]目前仅在战斗通行证系统第1赛季中限定产出，在未来的赛季中可以通过“SS忍者传承宝箱”继续获取。<br><br>【全新橙色时装-夜樱呢喃】<br>全新橙色时装夜樱呢喃登场，身着华丽和服的五位主角定会成为赏樱季节中最亮丽的风景；<br>夜樱呢喃时装目前仅在战斗通行证系统第1赛季中限定产出，激活黄金通行证可获取其中3套永久，在赛季结束后会以其他形式返场。<br><br>【全新玩法-无尽之域】<br>全新玩法无尽之域登场，在2个月的赛季内，挑战限时关卡，掉落赛季限定饰品，提升战力，激活饰品套装效果；<br>每个赛季将提供大量全新关卡以供挑战，每隔7天解锁20关，未解锁关卡被视作禁区，禁区难度将大幅提升，挑战成功可获高额奖励；<br><br>【全新系统-饰品】<br>全新系统饰品登场，阵上的忍者增加可以装备的饰品，饰品可提升装备忍者属性，且相同主题达到一定件数还可激活套装效果；<br>饰品获得后即可装备，立即发挥效果，且无需额外培养；<br><br>【全新饰品套装-火之套装、音符套装、樱花套装、镰鼬套装、查克拉套装】<br>5套全新饰品饰品目前仅在无尽之域第1赛季中限定产出，在赛季结束后会以其他形式返场。<br>火之套装：6件套，达到4件时可提升装备忍者的奥义伤害，并大幅提升必杀奥义伤害；<br>音符套装：6件套，达到4件时可在战斗开始时，为装备忍者施加护盾；<br>樱花套装：4件套，达到4件时可为樱[少年篇]、樱[疾风传]的奥义降低冷却；<br>镰鼬套装：4件套，达到4件时可为手鞠[少年篇]、手鞠[泳装]、手鞠[疾风传]的奥义提升目标数；<br>查克拉套装：6件套，达到4件时可为装备忍者降低奥义查克拉消耗。<br><br>【其他优化】<br>1）时装阵法保存体验优化<br>*修复了切换主角或阵法时导致时装需要重新穿戴的问题，目前时装选择将记录在所在阵容上；<br>*主角天赋页面增加“时装”入口，方便在布阵时选择自己喜爱的时装。<br>2）组织相关优化<br>*组织礼包分配时改为显示玩家的最高战力而非当前阵容的战力，便于更准确识别玩家实力；<br>*组织护送时护送者阵容将采用当前阵容而非战力最高阵容，减少以不合适的阵容进行护送。<br>*当组织首领超过指定天数未登录时，高层或成员可发起弹劾，成为新的首领；<br>3）生存试炼体验优化<br>*生存试炼也可以保存3套任意切换的阵容了，减轻大家反复拖拽忍者的负担；<br>4）播放录像时增加“上一回合”“下一回合”功能，方便反复查看；<br>5）主线剧情第1章、第2章、第3章增加全新录制配音，原版声优倾力演绎；<br>6）界面细节及美术表现优化，为您带来更佳的视听盛宴！"},{"version_id":"830694422","version_name":"3.38.32","version_date":"2019-03-27 20:10:01.000 +0800","version_description":"春樱对决，跨服开战。忍界对战玩法跨服升级！<br>究极之战，一触即发。全服备战竞争跨服荣耀！<br>春樱烂漫，游赏花祭。樱花祭主题活动唯美开启！<br><br>【全新系统-跨服忍界对战】<br>*组织最强对决——跨服忍界对战重磅来袭！忍界对战冠亚军将代表本服参与跨服对战，竞争跨服荣耀。<br>*每两周为一个跨服对战周期：其中第一周为跨服资格赛周，本服前128名组织参与本服忍界对战，决出名次；第二周为跨服竞赛周，每个服务器上周产生的冠亚军拥有跨服竞赛资格 ，将代表本服参与跨服忍界对战，其余组织本周依旧参与本服忍界对战。<br>*每个跨服周期，将本服和邻近的其他的服务器中随机选取8个组成一个跨服赛区进行对战。<br>*跨服忍界对战比赛由淘汰赛和友谊赛组成，跨服忍界对战赛程时间表如下：<br>周三20:00~20:05  跨服八强晋级赛准备时间<br>周三20:00~20:25  跨服八强晋级赛战斗时间<br>周三20:25~20:30  跨服四强晋级赛、十六强友谊赛准备时间<br>周三20:30~20:50  跨服四强晋级赛、十六强友谊赛战斗时间<br>周六20:00~20:05  跨服半决赛、八强友谊赛、十六强友谊赛准备时间<br>周六20:05~20:25  跨服半决赛、八强友谊赛、十六强友谊赛战斗时间<br>周六20:25~20:30  跨服总决赛准备时间<br>周六20:30~20:50  跨服总决赛战斗时间<br>*配合跨服忍界对战，忍界对战每轮战斗时长将延长5分钟。<br><br>【全新活动-樱花祭，唯美开启！】<br>开启时间：3月28日更新后-4月11日5:00<br>参与范围：等级33级或以上的全部玩家<br>活动介绍：<br>*樱花祭活动期间，通过活动页面参与丰富活动，收集樱花勋章，勇夺排行榜！<br>*活动奖励：樱花饰品、鸣佐樱忍具、限定蓝色称号“樱花满开”和紫色称号“樱花烂漫”；个人和组织累积樱花勋章可获得鸣佐樱忍具、\"橙色樱花饰品\"、\"活动限定头像框\"、\"活动限定组织徽章\"等丰厚奖励。<br><br>【组队副本优化】<br>*降低组队副本整体种类数量，将组队副本划分为37、48、64、73四个等级段副本，同时取消战场效果，每次挑战将遭遇随机主题敌人。<br>*奖励机制优化，不再通过roll点确定奖励归属，改为每位玩家在战斗胜利后从3件道具从中选择1件心仪的获取。<br>*为提高组队成功率，组队副本将改为限时开启，每日中午12点至2点，晚上18点至22点开启。<br><br>【头衔系统更新】<br>*在头衔达到上忍，并满足特定条件后，可从多个顶级头衔中选择晋升。<br>*顶级头衔仅有14天的持续时间，晋升后14天会自动下降回上忍，需要重新选择进行晋升。<br>*首批上线的顶级头衔包括：指导上忍、精英上忍、暗部精英和忍界传奇。<br><br>【封印商店增加万能碎片兑换】<br>*封印商店增加初级万能碎片兑换，消耗2个封印精华兑换，每个月至多兑换160个。<br>*封印商店增加中级万能碎片兑换，消耗4个封印精华兑换，每个月至多兑换40个。<br>*只有在拥有大蛇丸SS、纲手SS、自来也SS中至少1位时，才将解锁万能碎片兑换功能。<br><br>【忍者兑换增加新忍者】<br>*忍者兑换商店增加鸣人[疾风传]碎片兑换，初始每20片碎片消耗特别上忍之证15个、上忍之证3个、封印之卷2个兑换，头衔达到上忍的玩家可以兑换。<br><br>【新增功能-二级密码】<br>*新增二级密码功能，玩家可以在个人信息-系统设置界面开启并设置二级密码，开启后游戏内的敏感操作需要输入正确的二级密码才可以执行。<br>*进行敏感操作确认二级密码时可以选择今天内不再验证。<br>*目前需要验证二级密码的敏感操作包括：元宝充值、元宝（含绑定）消费、商城直购、封印招募、活动招募、8级含以上勾玉合成，15级含以上装备精炼。<br><br>【饰品相关优化】<br>*饰品增加加锁功能，在饰品界面可以对饰品进行加锁操作，在物资基地中，加锁饰品灰化显示，且不可被选中分解。<br>*饰品图标上增加了前缀提示文字，现在可以从图标上区分出不同的前缀了。<br>*在物资基地中，增加了一键回收饰品功能。<br><br>【体验优化】<br>*木叶村将在版本更新后冰雪消融，部分场景迎来了更多围观的村民。<br>*称号“六道意志”“六道之魂”更新全新的美术风格。<br>*忍者考试、无尽之域战斗增加“重试”功能，战斗中按下后可立即重新开始当前对局，跳过布阵和其他点击步骤。<br><br>更多精彩活动，尽在新版本火影忍者OL！"},{"version_id":"831029533","version_name":"3.39.52","version_date":"2019-04-24 18:38:33.000 +0800","version_description":"【新玩法】羁绊战场八人混战，卡组PK脑力对决！<br>【新赛季】S2赛季开启！免费领取SS千代[十机近松之集]！<br>【新突破】半周年庆典！四代目来袭！<br><br>【新玩法羁绊战场——抢先开启】<br>-全新玩法羁绊战场来袭，公平竞技，策略为王！<br>-紧张刺激的战场对局：八人混战，对决到底，一人脱颖，夺得冠军；<br>-千变万化的策略思考：羁绊组合，忍法升级，排兵布阵，忍者突破；<br>-每一局游戏将体验从零开始的忍者收集，可强而示弱，可厚积薄发，可孤注一掷，可时来运来；新玩法，新期待，呼朋唤友随时来一场酣畅淋漓的策略冒险吧！<br><br>【等级上限90级解禁，主线副本第10章天地桥开启】<br>-等级上限在版本更新后将拓展至90级，随之在90级之前将无法获取等级勋章，变更为正常的经验获取；<br>-等级勋章商店将在等级上限拓展后7天暂时关闭，其中未消耗的兑换次数将保留；<br>-第5主角转职任务将在玩家达到85级时开启；<br>-第十章副本天地桥开启，和新第七班一起执行刺探秘密情报任务！主线副本80级可挑战，困难副本85级可挑战；<br>-忍者觉醒等级上限由橙+3提升至橙+4；<br><br>【全新系统-成就】<br>-全新系统成就上线，在火影忍者的世界成长、积累、探索未知，以解锁多种多样的成就；<br>-解锁成就将激活对应的成就奖杯，提升成就等级，并获得额外的道具奖励；<br>-成就等级达到特定级别时将解锁聊天框底色，让你在聊天频道秀出最酷的自己。<br><br>【通行证S2赛季开启】<br>-战斗通行证S2赛季开启，在2个月的赛季内获取通行证经验提升通行证等级，领取专属限定橙色时装和SS级忍者碎片；<br>-在S2赛季中，新玩法羁绊战场将产出通行证经验，同时无尽之域不再产出通行证经验；<br>-除时装与忍者外，还有封印碎片、VIP经验、通灵之卷、忍者觉醒道具礼盒等奖励等你来拿；<br>-直购激活黄金通行证以领取额外奖励，通行证等级越高，额外奖励也越多，除此以外还可购买通行证经验快速获取限定奖励；<br>-白银通行证中的宝箱将变为“SS忍者传承宝箱”，打开时可以任选蝎[百机操演]或千代[十机近松之集]碎片;<br>-第二赛季的限定SS忍者为：千代[十机近松之集]，橙色限定时装为：侍之信仰；<br>-战斗通行证第二赛季时间为：2019年5月1日5点-2019年7月1日5点。<br><br>【全新SS忍者-千代[十机近松之集]】<br>-全新SS忍者千代[十机近松之集]登场，她可以运用十机傀儡进行超出常规次数的追打，且每次追打都会为小队恢复查克拉，以一己之力或配合强力奥义忍者击败自己的对手。<br>-千代[十机近松之集]目前在战斗通行证系统第二赛季中产出，在未来的赛季中可以通过“SS忍者传承宝箱”继续获取。<br><br>【全新橙色时装-侍之信仰】<br>-全新橙色时装侍之信仰登场，身着和式战甲的五位主角将展示出自己能征善战的一面；<br>-侍之信仰时装目前在战斗通行证系统S2赛季中产出，激活黄金通行证可获取其中3套永久，在赛季结束后会以其他形式返场。<br><br>【无尽之域S2赛季即将开启】<br>-无尽之域S2赛季即将开启，在2个月的赛季内，挑战限时关卡，掉落赛季限定饰品，提升战力，激活饰品套装效果；<br>-新增全新S2专属赛季活动——禁符之战，挑战神秘敌手，赢取限定饰品套装；<br>-S2赛季将提供全新120关以供挑战，每隔7天解锁20关，未解锁关卡被视作禁区，禁区难度将大幅提升，挑战成功可获高额奖励；<br>-除了一次性通关关卡外，无尽之域还将继续提供历战关卡，消耗门票可反复挑战以获取更好的饰品，扫荡剧情副本、困难副本、英雄副本即有概率获取门票；<br>-通关关卡可获取川之结晶，个人与组织会基于获取的川之结晶数量领取额外奖励；<br>-历战关卡拥有全新的历战任务，除了击败对手以外，尽可能达成历战任务可提高川之结晶获取量；<br>-个人、组织的川之结晶数量计入排行，在赛季结束时会为个人排行发放专属称号，为组织排行发放专属头像在内的丰厚奖励；                                       <br>-无尽之域第二赛季时间为：2019年5月1日5点-2019年6月26日10点，开启等级：60级。<br><br>【忍者快速觉醒功能】<br>-根据主角等级，低于一定觉醒等级的觉醒可以选择消耗一定数量铜币而非觉醒材料进行觉醒；<br>-获得新忍者时可以消耗铜币快速觉醒至一定的等级参与战斗了；<br>  主角等级达70级  可快速觉醒至紫<br>  主角等级达80级  可快速觉醒至橙<br>-通过快速觉醒获得的觉醒等级仍可以进行正常的归元，获取对应的觉醒材料，而非铜币。<br><br>【体验优化与bug修复】<br>-新版本全新载入动画更新；<br>-主角天赋页面中追打详情，拥有特殊普攻和奥义的忍者（勘九郎、蝎、鸣人[新年]等）现在可以正确显示追打状态了；<br>-忍者升星界面点击碎片来源后可以一键扫荡该忍者所有相关的英雄副本，且点击跳转时不会打开英雄副本主界面，而是打开侧边栏；<br>-组织战主界面增加聊天窗口，现在可以在备战阶段与组织成员交流了；<br>-永久时装礼盒不再可以批量打开，且不再可以重复选择已经拥有（无论在背包还是已经激活）的时装；<br>-饰品系统现在可以选择未放置忍者的位置操作相关饰品了；<br>-个人信息和查看他人小队信息时，增加了通灵兽技能的显示；<br>-通灵兽升星与修炼的部分提示文字优化。"},{"version_id":"831420134","version_name":"3.40.52","version_date":"2019-05-29 17:16:06.000 +0800","version_description":"“斩断的牵绊与全新的关系，只是为了打倒那个男人！”——人气忍者佐助[疾风传]来袭！<br>五大主角配音重制，原版声优加盟助阵，覆盖更多招式场景，尊享视听盛宴！<br>通灵兽、护送劫掠、忍界对战全面升级，福利加码，乐趣多多！<br><br>【玩法升级】<br>&gt;&gt;&gt;通灵兽系统新增援助属性，任务减负，奖励提升；<br>&gt;&gt;&gt;护送劫掠增加全新护送路线，川之国峡谷、五封结界、沙忍村等你探索；<br>&gt;&gt;&gt;忍界对战翻牌奖励优化，奖励加码；修行灵玉、高级修行灵玉出现概率提升，下忍之证、中忍之证出现概率降低；<br>&gt;&gt;&gt;忍界对战增加每轮战斗在第4回合开始时自动启用2倍速的规则，势均力敌的对手快来一争高下吧； <br>&gt;&gt;&gt;排位战优化界面展示，奖励信息更为清晰；70级以上玩家可以立即结束战斗啦！<br>&gt;&gt;&gt;签到奖励调整与新增兑换<br>1）签到奖励和周常任务活跃度奖励中的忍者碎片将调整为等量的“签到币”，可使用“签到币”在忍者兑换中自由兑换心仪的忍者了！<br>2）忍者兑换中，可消耗“签到币”和其他道具兑换伊鲁卡、森乃依比喜、白[和服]、樱[新年]、兜[疾风传]等忍者；<br><br>【便捷功能】<br>全新聊天辅助，随心交流，沟通无忧！<br>&gt;&gt;&gt;在部分无聊天窗界面增加可随意定位的聊天按钮，点击后可打开聊天界面，更方便与其他玩家交流；<br>1)覆盖无尽之域主界面、玩法界面（包括主界面和所有子界面）、副本界面等；<br>2)在系统设置中可通过“聊天辅助”项控制此项功能的开启，版本更新后默认开启。<br><br>【其他优化】<br>*调整了PVP战斗中技能吟唱时间规则，现在任何玩家在技能吟唱时间内释放新的技能将重置吟唱时间，确保双方有时间对新技能进行反应；<br>*竞技场战报中增加查看录像功能；<br>*视频中心增加试用阵容规则，更方便参考其他玩家的通关阵容；同时试用阵容规则优化，现在只有玩家同时拥有对应忍者、通灵兽技能和主角天赋时才可以试用阵容；<br>*部分系统中增加了消耗充值元宝时的二次确认弹窗；<br>*小队信息界面增加了点击具体属性后显示属性加成来源的功能；<br>*使用增加体力道具后如若体力将超过9999上限，则将无法使用道具；<br>*在设置中选择了关闭追打闪光后，胜负已分的白色衬底也将被屏蔽，减少闪光；<br>*斗祭战场中增加战报功能，可以查看自己的历史战斗情况；<br>*成就系统中部分重复造型奖杯更换造型。"},{"version_id":"831978413","version_name":"3.41.48","version_date":"2019-07-17 19:48:26.000 +0800","version_description":"重燃计划·开篇！全面优化开启，界面交互升级！<br>疾风传新忍者陆续登场，努力绽放的少女井野[疾风传]揭开篇序幕！<br>无尽之域、生存探险、排位赛玩法减负优化，忍者、主角、装备、勾玉等功能优化升级。<br><br>【新增内容】<br>&gt;&gt;&gt;生存探险新增“风之国”区域，新的关卡等你来战！还可获得新的忍具套装哦。<br>&gt;&gt;&gt;新增忍具：“傀儡特训”系列忍具。同时忍具界面与动画效果优化。<br><br>【玩法优化】<br>&gt;&gt;&gt;无尽之域新增扫荡功能，助力玩法减负；<br>&gt;&gt;&gt;生存探险所有战场进度共享，扫荡规则优化更加便捷；<br>&gt;&gt;&gt;排位赛增加赛季结算奖励，新赛季初始排名将根据上一赛季排名进行初始排名定位。<br><br>【功能优化】<br>&gt;&gt;&gt;忍者升星优化：调整了忍者升星的方式，不再需要逐步点亮激活升星，升星后属性加成修改为给全体上阵忍者提供属性加成；<br>&gt;&gt;&gt;主角优化：取消了主角觉醒和星级，已经获得的战力会直接加入到主角等级之中，原主角升星消耗的碎片会进行转换和返还；<br>&gt;&gt;&gt;头像框优化：头像框面板全新改版，部分头像框新增属性加成。获得后可为所有上阵忍者提供属性加成；<br>&gt;&gt;&gt;称号优化：称号面板全新改版，并且新增了属性加成；<br>&gt;&gt;&gt;头衔优化：头衔界面全新改版，调整了头衔晋级的材料消耗以及部分头衔的晋级方式；<br>&gt;&gt;&gt;勾玉优化：<br>1、生命勾玉、体术勾玉、忍术勾玉、防御勾玉、抗性勾玉调整至主角身上，可以使用勾玉晶石进行升级，并且更新后勾玉可以为所有上阵忍者加成属性；<br>2、先攻勾玉更名为速玉，保持在装备上，可以使用速之晶石或原石进行升级；<br>3、更新后勾玉和速玉初始都为1级，已拥有的先攻勾玉在更新后将会返还为速之晶石，其他勾玉会返还为勾玉晶石。<br><br>【其他优化】<br>&gt;&gt;&gt;饰品回收增加筛选功能；<br>&gt;&gt;&gt;忍者碎片炼化星级调整为给全体上阵忍者提供属性加成。<br><br>更多新版本内容就在《火影忍者：忍者新世代》"},{"version_id":"832663374","version_name":"3.43.47","version_date":"2019-09-11 19:15:29.000 +0800","version_description":"重燃计划·征程！金秋助力·佳期如梦！<br>当日漫碰上国风，忍者穿上华服；<br>当金秋已经降临，重燃时节乍暖；<br>当木叶仍在飞舞，未来正在改变！<br><br>【新增内容】<br>&gt;&gt;&gt;新忍者：SS猿飞日斩[三代火影]<br>&gt;&gt;&gt;新时装：【佳期如梦】全新国风时装上线，金秋活动限定获得；<br>&gt;&gt;&gt;新玩法：【密林奇袭】<br>1、据点争夺，收集物资：在密林中与其他玩家进行据点争夺，收集物资；<br>2、升级据点，获取奖励：升级自己的据点，获得海量奖励。布置防守阵容，抵御其他玩家掠夺；<br>3、限时开放，争夺荣耀：活动期间每日限时开放，金秋时节，来一场据点大作战吧！<br>&gt;&gt;&gt;新玩法：【组织副本】<br>1、组织作战，集体推进：组织成员齐心协力，共同推进副本进度；<br>2、击败奖励，组织福袋：击败副本敌人可以获得奖励，通关副本组织内所有成员都能获得一份福袋奖励。<br><br>【优化内容】<br>&gt;&gt;&gt;斗祭战场优化，优化了斗祭战场的开放时间和段位分组规则，新增阵营模式，海、林、峰三方阵营比拼作战；<br>&gt;&gt;&gt;组织技能优化，优化了组织技能的升级方式，增加了新的研习技能，已经升级的原组织技能会转化为新的组织技能等级，属性加成不变；<br>&gt;&gt;&gt;封印招募“奖励更换”新增忍者，原封印招募中的SS忍者千手扉间[二代火影]将替换为SS忍者猿飞日斩[三代火影]。<br><br>沉浸忍者大世界，即刻进入《火影忍者：忍者新世代》！"},{"version_id":"833508550","version_name":"3.44.62","version_date":"2019-11-13 19:22:28.000 +0800","version_description":"佩恩新篇，现已上线！<br>木叶被毁，痛楚降临；等待英雄，拯救木叶！全新版本内容：新忍者SS佩恩[天道]、新玩法佩恩之战、新剧情任务佩恩入侵。<br><br>【佩恩新篇】<br>&gt;&gt;&gt;新忍者：SS佩恩[天道]<br>&gt;&gt;&gt;新玩法：佩恩之战：<br>“晓”的神秘六人组——佩恩抵达木叶，村子已被战火笼罩，你能做的唯有举起手中的武器清除入侵者。<br> 在“佩恩之战”中，你需要在多个战场中持续抵御佩恩的进攻，并在最后与组织成员、其他玩家一起对佩恩发动总攻。<br>&gt;&gt;&gt;新剧情任务：佩恩入侵<br>一队巡逻小队的神秘失联，拉开了佩恩入侵木叶的序幕。为九尾人柱力而来的佩恩，将木叶村陷入战火之中。木叶没有出卖同伴的忍者，你将与同伴一起，抵抗佩恩，守护木叶村！<br><br>【新增内容】<br>&gt;&gt;&gt;全新赛季忍者-大蛇丸[晓]<br>&gt;&gt;&gt;新时装：朋克状态<br><br>体验火影忍者大世界，即刻进入《火影忍者：忍者新世代》！"},{"version_id":"834196800","version_name":"3.45.27","version_date":"2020-01-08 18:09:41.000 +0800","version_description":"在这里打倒佩恩组织“晓”，将忍界从毁灭的边缘挽救回来。——自来也<br>【新剧情】自来也豪杰物语<br>全新剧情“自来也豪杰物语”来袭，在游戏中体验经典还原的剧情任务，跟随自来也解开佩恩的真相，重温感人瞬间！<br><br>【贺新春】春之庆典<br>2020新年之际，参与“春之庆典”新年系列活动，领取海量游戏福利，趣味玩法鸣人接金币陪你过大年！<br><br>【新忍者】佐助[新年]、白[漂泊武士]<br><br>【新增内容】<br>1、幻境探险<br>增益：击败幻境探险每一层的最后一个关卡或探险升级时，可以选择一个增益；<br>幻境之力：每通关一层关卡，可以获得一定数量的幻境能量，消耗幻境能量可以解锁幻境之力中的天赋，天赋只针对幻境探险玩法生效；<br>赛季：幻境探险玩法拥有赛季概念，赛季结束时会进行结算并发放赛季奖励；<br><br>2、神器系统<br>本次更新将开放第一件神器：爆刀·飞沫，消耗神器精华可以提升神器的层级，神器层级的提升也将解锁新的封印点，消耗神器精粹以升级封印点，参与玩法“幻境探险”可以获得提升神器的所需材料。<br><br>3、主角表情包上线<br>新增五位主角表情包，获得后可以在聊天中使用主角表情包；<br>表情包可以通过参与限时活动获得；<br><br>4、忍者图鉴更新<br>篇章“火之意志”增加2个羁绊；<br>新增篇章“晓的野心”，包含4个羁绊；<br><br>体验火影忍者大世界，即刻进入《火影忍者：忍者新世代》！"},{"version_id":"835089289","version_name":"3.46.32","version_date":"2020-03-18 17:09:21.000 +0800","version_description":"鸣人归来，拯救木叶！<br>时空间大战，决战忍界巅峰！<br>【全新内容】<br>&gt;&gt;&gt;新忍者：志乃[疾风传]、老紫[四尾人柱力]、汉[五尾人柱力]<br><br>&gt;&gt;&gt;新玩法：时空间：<br>跨服PK，巅峰对决！时空间玩法将按照赛季开启，每个赛季分为积分赛和淘汰赛两个阶段，在淘汰赛阶段将进行实时的在线战斗。<br><br>&gt;&gt;&gt;新剧情：新的袭击者I <br>为了快速提升实力，鸣人在卡卡西的指导下，开始了新一轮的修炼。而另一边，火之寺来了两名身穿红云黑袍的不速之客，最终火之寺住持地陆大师身死，遗体下落不明。得知消息后，纲手发布了追捕犯人的指令。阿斯玛小队出动，火速赶往火之寺进行调查。<br><br>&gt;&gt;&gt;新副本：英雄副本第十章 <br>通关副本可获得忍者志乃[疾风传]<br><br>&gt;&gt;&gt;新主题：鸣人归来<br>木叶村变成一片废墟，在小樱绝望的呐喊下，鸣人以仙人模式回归，迎战佩恩天道。最终一战，一触即发！<br><br>&gt;&gt;&gt;新场景：樱花场景 <br>迎来暖春的木叶村悄然间已被盛开的樱花装点。木叶村民们也纷纷停下工作，走上街头欣赏这云蒸霞蔚的花树点缀而成的粉白世界。忍者学员们也切莫误了这一期一会的繁花，快与樱花季限定场景合影留念吧！<br><br>&gt;&gt;&gt;新忍符：穿透之卷<br><br>体验火影忍者大世界，即刻进入《火影忍者：忍者新世代》！"},{"version_id":"835867319","version_name":"3.47.25","version_date":"2020-05-13 17:00:24.000 +0800","version_description":"兄弟对决，宿命之战！<br>吞噬大蛇的力量，踏上复仇的道路，复仇之战，一触即发；<br>相同血色的瞳孔，隐藏内心的深爱，传说之忍，强势来袭！<br><br>【新篇章·兄弟对决】<br>&gt;&gt;&gt;新忍者：<br>SS宇智波鼬[须佐能乎]、SS漩涡鸣人[仙人模式]、SS干柿鬼鲛[鲛肌融合]<br>&gt;&gt;&gt;新主题：宇智波的恩怨<br>在大蛇丸的指导下，佐助的实力大增。就在大蛇丸企图夺取佐助身体进行转生仪式时，反被佐助吞噬。佐助组建了自己的小队，准备向自己的哥哥——宇智波鼬，进行复仇。宇智波的基地上空，乌云密布，这对兄弟之间最后的对决，一触即发。<br>&gt;&gt;&gt;新玩法：叛忍追击<br>前往大地图追击叛忍，可以组队进行挑战，胜利后可以获得奖励。<br><br>【新增内容】<br>&gt;&gt;&gt;新主线任务：新的袭击者II<br>阿斯玛小队在陆金所外围捕“晓”的不死二人组飞段和角都。经过苦战，阿斯玛牺牲。卡卡西和第十班成员，重新组建了新的小队，继续执行未完成的任务。另一边，第七班作为这次任务的增援小队，也赶往了枯木之森。复仇之战，开始了……<br><br>&gt;&gt;&gt;新活动：命运特典<br>包含命运之钥、宿命兑换、相伴有礼、特典助力、幻术之境系列活动，参与活动即领取丰厚奖励。<br><br>体验火影忍者大世界，即刻进入《火影忍者：忍者新世代》！"},{"version_id":"836790773","version_name":"3.48.39","version_date":"2020-07-15 17:01:05.000 +0800","version_description":"宅居木叶村，锁住小美好！7月16日全新“忍者部屋”版本上线！<br><br>&gt;&gt;&gt;新系统：忍者部屋<br>忍者学员们可以在木叶村拥有一个自己的忍者部屋啦，通过挑战关卡，获得打造家具的材料，使用材料打造家具，在部屋房间里自由摆放，享受宅居木叶村的生活，同时还可以拜访其他忍者的小屋哦！<br>&gt;&gt;&gt;新活动：宅基计划<br>木叶村宅基计划开始了！活动期间，各位忍者学员可以自主选择安家的小区，成为该小区的业主。完成宅基任务提升小屋等级，还能获得活动限定家具。为了鼓励大家齐心协力共建没好家园，当所选小区的热度达到指定要求，小区全体业主将获得特别奖励一份，赶紧行动吧！<br>&gt;&gt;&gt;新剧情：开始行动的人们<br>佐助叛出大蛇丸，组建了自己的小队。另一边，纲手派出搜捕宇智波鼬的小队。搜捕小队根据线索，一路追踪佐助和鼬的下落，却遇到预料之外的敌人。而被仇恨蒙蔽双眼的佐助，与鼬在宇智波基地，进行了兄弟之间的最后对决……<br>&gt;&gt;&gt;新忍者：自来也[青年]、纲手[青年]、波风水门[青年]<br>&gt;&gt;&gt;新时装：时装商店更新，奇妙物语时装，萌趣上架！<br><br>体验火影忍者大世界，即刻进入《火影忍者：忍者新世代》！"},{"version_id":"837848902","version_name":"3.49.48","version_date":"2020-09-24 18:08:01.000 +0800","version_description":"【全新内容】\n<br>&gt;&gt;&gt;新系统：忍界远征队\n<br>忍界远征队上线，进行地图探索，获取玩法独占SS忍者，饰品，时装等奖励！\n<br>\n<br>&gt;&gt;&gt;新忍者：\n<br>志村团藏、艾[四代雷影]，达鲁伊，希\n<br>\n<br>&gt;&gt;&gt;新剧情：第十五章剧情副本——佩恩入侵\n<br>在得知自来也牺牲的消息后，鸣人大受打击。幸亏在鹿丸的开导下，鸣人重燃斗志，跟随深作前往妙木山修习仙术。与此同时，“晓”组织的首领“佩恩”入侵木叶，企图夺取鸣人身上的九尾之力⋯⋯\n<br>\n<br>&gt;&gt;&gt;新通灵兽：梦貘\n<br>以梦为食，吞噬梦境，梦貘将是游戏内首个1回合可以追打2次的通灵兽，可通过通灵商店兑换获得。\n<br>\n<br>&gt;&gt;&gt;新场景：木叶村·秋\n<br>木叶村大地图更新为秋景，首个被秋天染色的金秋木叶村，一起来共赏美景吧！\n<br>\n<br>&gt;&gt;&gt;新系统：时光屋\n<br>时光屋系统全新上线。游走在光影之间执行绝密任务、与同伴一起解决忍村危机事件⋯⋯多个精彩忍者故事，现在都可以在时光屋中再次重温啦。完成挑战，还有机会兑换限定奖励，千万不要错过了。\n<br>\n<br>体验火影忍者大世界，即刻进入《火影忍者：忍者新世代》！"},{"version_id":"838552534","version_name":"3.50.12","version_date":"2020-11-11 17:33:12.000 +0800","version_description":"五影之约，共赴周年！2周年五影会谈版本上线！<br><br>【缤纷活动 福利相赠】<br>&gt;&gt;&gt;五影之约：<br>五影会谈主题活动，参与水影的修行，水影的试炼，求爱大作战等活动带你全面了解水影---照美冥；<br>&gt;&gt;&gt;共赴周年：<br>周年特别馈赠每日活动招募首次十连抽免费！！十连必出整卡，快来一试，不要错过！<br>还有周年蛋糕，周年烟花等系列活动，参与活动可以免费获得S忍者、永久时装、点券、永久称号等奖励；<br><br>【新增内容】<br>&gt;&gt;&gt;新忍者：照美冥、君麻吕[化装舞会]<br>&gt;&gt;&gt;新时装：礼服派对<br>&gt;&gt;&gt;新剧情：第16章主线剧情五影会谈Ⅰ<br>&gt;&gt;&gt;新忍考：新增忍者考试241-260关，通关可获得六道卷轴，升阶装备至红色+3<br>&gt;&gt;&gt;新图鉴：最佳搭档、云隐护卫、水影传承、雾隐护卫、男生班、女生班<br>&gt;&gt;&gt;新神器：开放第三把神器，当第二把神器达到60层后将解锁双刀·鲆鲽的强化。<br>&gt;&gt;&gt;新成就：新增神器、称号、组织护送等系统相关成就。<br><br><br>体验火影忍者大世界，即刻进入《火影忍者：忍者新世代》！"},{"version_id":"840047796","version_name":"3.51.19","version_date":"2021-01-20 17:59:32.000 +0800","version_description":"蛤蟆文太参上，巨型通灵兽加入战斗！<br>全新组织玩法，组织通灵兽玩法上线！<br><br>【新玩法：组织通灵兽】<br>组织通灵兽玩法首次开放巨型通灵兽：蛤蟆文太，将带来新的战斗机制以及数值提升，详细玩法内容如下：<br>&gt;&gt;&gt;供奉：<br>1、供奉通灵查克拉给组织通灵兽，可提升个人的通灵术等级，获得属性加成和助阵技能点；<br>2、通灵术达到一定等级后开启对应召唤功能，可在忍者考试、副本、英雄副本玩法中进行召唤；<br>&gt;&gt;&gt;助阵：<br>1、消耗技能点可激活组织通灵兽的助阵天赋，获得属性和个人通灵兽的技能加成；<br>2、当激活技能点满一圈后，可激活或升阶助阵核心技能效果；<br>3、组织通灵兽助阵技能和属性，在离开组织后仍然生效。<br>&gt;&gt;&gt;试训和试训技能：<br>全体组织成员通过对组织通灵兽进行训练，达到不同进度时可提升试训技能等级，从而提升组织通灵兽的各项能力；<br>&gt;&gt;&gt;副本召唤：<br>通过供奉成功解锁召唤功能后，可以在忍者考试、副本、英雄副本玩法中进行召唤，每周有一定的召唤次数限制。<br>&gt;&gt;&gt;忍界对战召唤：<br>1、在忍界对战中，首领或高层可以布阵通灵兽在不同的战场中，每只通灵兽仅能上阵一个战场；<br>2、战场的召唤权限由当前小队最高战力的玩家操控，战斗属性则取决于小队主角的平均属性进行一定的动态调整。<br><br>【新增内容】<br>&gt;&gt;&gt;新忍者：宇智波鼬[唐装]、大野木、天天[新年]将陆续和大家见面<br>&gt;&gt;&gt;新剧情：第17章主线剧情五影会谈Ⅱ<br>&gt;&gt;&gt;新羁绊图鉴：合作者、亲密好友、蛇小队、猪鹿蝶<br>&gt;&gt;&gt;新主题：冬日竞速主题活动<br><br>【内容优化】<br>&gt;&gt;&gt;忍界对战奖励优化：<br>1、忍界对战功勋礼包将增加橙色、紫色礼包的数量，同时蓝色礼包还会根据参战人数进行动态调整，参加人数越多，数量越多；<br>2、优化忍界对战的翻牌奖励内容，去除忍证相关的奖励，加入了新的其他奖励；<br>3、优化忍界对战拍卖中的奖励，增加部分有吸引力的奖励内容；<br>4、增加忍界对战中掉落红包概率，并且会增加领取数量以及奖励的数量。<br><br>体验火影忍者大世界，即刻进入《火影忍者：忍者新世代》！"},{"version_id":"840967392","version_name":"3.52.11","version_date":"2021-03-24 18:05:27.000 +0800","version_description":"新的赛季开启，完成赛季任务获得：SS志村团藏[伊邪纳岐]<br>此外鸣人也出发岛龟，开始了新的试炼！<br><br>【新剧情：联军备战 I】<br>一直昏迷的纲手，终于苏醒，并以火影的身份参加了忍者联军的联合会议。会议结束后，纲手马上派鸣人等人前往云隐某个秘密之地，执行S级任务！秘密之地究竟是岛还是龟？<br><br>【新赛季：忍界远征】<br>忍界远征队全新赛季“大战前夕”开启！新赛季的新特性如下：<br>1、全新的远征地图，等待你去探索；<br>2、全新的远征饰品，饰品补给及首领奖励中新增“蛮牛”、“冰晶”套装获取；<br>3、全新的令状奖励，新赛季可获得令状专属忍者“团藏[伊邪那岐]”、专属时装“奇幻之旅”、专属头像框“大战前夕”等丰富奖励！<br><br>同时，新赛季远征还有以下新特性更新：<br>1、全新地块“瞭望塔”，占领地块后可降低附近地块的战斗难度；<br>2、全新地块“传送点”，激活后可通过传送点在远征地图上快速移动；<br>3、全新地块“试炼场”，占领可从试炼场的敌人夺取强力增益；<br>4、全新地块“营地”，占领后可获得额外的粮草和行动次数；<br>5、新增饰品补给自选奖池，可自由选择想要抽取的远征饰品套装奖池。<br><br>【新增内容】<br>&gt;&gt;&gt;新饰品：新增蛮牛套装和冰晶套装饰品，参与忍界远征玩法即可获得。<br>&gt;&gt;&gt;新忍考：新增忍者考试261-280关，通关可获得六道秘卷，升阶装备至红色+4。<br>&gt;&gt;&gt;新神器：开放第四把神器，当第三把神器达到60层后将解锁大刀·鲛肌的强化。<br>&gt;&gt;&gt;新活动：樱的生日会，春野樱，生日快乐！<br><br>体验火影忍者大世界，即刻进入《火影忍者：忍者新世代》！"}]