[{"version_id":"829996333","version_name":"3.1.2","version_date":"2019-01-18 11:03:18.000 +0800","version_description":"You can now log in to your account from the slide out drawer located on the main screen. Logged in users will be able to access all decks for learning and testing as well as the review queue. Stay tuned for more updates. To find out more about Skritter accounts visit: https://skritter.com"},{"version_id":"830412944","version_name":"3.1.5","version_date":"2019-03-07 21:35:21.000 +0800","version_description":"Unlock Skritter Premium and gain access to Review mode, hundreds of textbook and hand-made Skritter lists, custom mnemonics and more! If you're enjoying Skritter: Write Japanese please take a moment to rate and review the app, and help spread the word to your language learning friends!"},{"version_id":"830572082","version_name":"3.3.0","version_date":"2019-08-15 17:20:19.000 +0800","version_description":"• Advanced 4-button SRS grading option on Study Settings<br><br>• Improvements to spacing for cards in the Review queue<br><br>• Faster load times for Home, Decks, My Words screens<br><br><br>• Improvements to Learning activities to give you more control over what and how much you're studying<br><br>• New ink-like strokes and study streaks!<br><br>• Better canvas sizing for some devices<br><br>• Added user-language localization support<br><br>Enjoying the app? Be sure to rate and review! <br><br>Questions, comments, or issues? <br>Reach us at team@skritter.com so we can help!"},{"version_id":"832558347","version_name":"3.3.3","version_date":"2019-08-30 19:38:05.000 +0800","version_description":"General bug fixes and performance improvements.<br><br>Love the app? Rate us! Your feedback spreads the word to other language learners and helps us make things better and better. Have questions? Use the contact button in-app or email team@skritter.com. Happy studying!"},{"version_id":"834337658","version_name":"3.3.6","version_date":"2020-01-22 04:28:01.000 +0800","version_description":"- Daily Review<br>- Continuous Review<br>- (NEW) Time Attack game mode<br>- New icons and docs for new study modes<br>- Updated interface and improved Preview cards<br>- Hiragana stroke improvements for え, ぬ, の, ゆ, and か<br>- Improved deck management options (Copy, Hide, Reset)<br>- General bug fixes and improvements<br><br>Questions, comments, or feedback? Be sure to email team@skritter.com or use the Help button in the app menu for a full guide to 3.3.6. Happy studying!"},{"version_id":"834675133","version_name":"3.3.7","version_date":"2020-02-11 23:49:19.000 +0800","version_description":"- Added the option to disable streak effects on non-basic writing canvas<br>- Added the option to disable grading colors on writing canvas<br>- Improved Study Settings sort on Account Settings and Quick Settings screens<br>- Improved positioning and tracing animations for kana on the basic writing canvas<br>- Fixed an issue preventing items from being marked as learned and added to the review queue when studying from decks with limited study parts selected<br>- General bug fixes and improvements<br><br>If you're enjoying the app please consider leaving a rating and review. Questions? Email team@skritter.com and we'll be happy to help. Happy studying!"},{"version_id":"834783952","version_name":"3.3.8","version_date":"2020-02-20 17:25:59.000 +0800","version_description":"- Improved scheduling logic for Continuous Review mode<br>- Fixed a bug on Test activity complete screen—it’ll now show accurate percentages<br>- Fixed an issue causing Basic Writing Canvas setting from staying preserved when enabled<br>- General bug fixes and improvements"},{"version_id":"834880312","version_name":"3.4.0","version_date":"2020-04-09 17:18:59.000 +0800","version_description":"- New vocabulary info screen with contained character drill-down support<br>- New hint access on the top area of study cards (swipe-left for sentences, swipe-right for mnemonics)<br>- New word-level grading control for writing cards<br>- New \"Rawest Squigs\" writing option for a pen &amp; paper style experience<br>- Added \"Submit Correction\" support to vocab info screen<br>- Fixed an issue preventing deck-level resetting on guest accounts<br>- Improvements to initial account sync behavior<br>- General bug fixes and improvements<br><br>Have questions, comments, concerns? Reach out to team@skritter.com and we’ll be sure to help. Happy studying!"},{"version_id":"835624791","version_name":"3.4.1","version_date":"2020-04-22 01:12:17.000 +0800","version_description":"- Added “Delete” option to the individual deck menu<br>- Added toggle option to show popular mnemonics on User Study Settings screen<br>- Added the ability to edit mnemonics directly from study cards<br>- General bug fixes and improvements"},{"version_id":"836160366","version_name":"3.4.3","version_date":"2020-05-27 19:27:02.000 +0800","version_description":"- Fixed bug causing some accounts to falsely appear as expired"},{"version_id":"838110154","version_name":"3.5.1","version_date":"2020-10-09 10:54:58.000 +0800","version_description":"- Added deck section description and video support<br>- Stylus mode allowing for pressure-sensitive input<br>- General bug fixes and improvements<br><br>Turn on the rawest squigs mode and stylus mode and start making art! Be sure to share it on our Instagram or Twitter by searching for Skritter. Happy studies!"},{"version_id":"838320468","version_name":"3.5.2","version_date":"2020-11-18 20:18:48.000 +0800","version_description":"- More study control with the new deck and deck section Rejuvenation feature<br>- Copy to clipboard support on Info screen (happy tapping!)<br>- Improved sync stability when editing words<br>- Added tap to check answer support for Rawest Squigs setting<br>- General bug fixes and improvements"}]