[{"version_id":"834885390","version_name":"5.2","version_date":"2020-03-04 03:52:31.000 +0800","version_description":"RetailBox 5.2 includes improvements, bug fixes and support for sharing and recommending screen savers.<br><br>Haptic Touch<br><br>• Press on screen savers to share with friends and family using Messages or supported third-party apps like Telegram<br>• Recommend screen savers to help improve future releases based on user feedback with a tap<br><br>Download Indicators<br><br>• Access download indicators to quickly determine if screen savers have been downloaded<br>• Easily disable in Settings &gt; Data Usage<br>• Displays \"4K HDR\" labels for supported screen savers<br><br>This update also includes bug fixes and other improvements. This update:<br><br>• Adds the ability for users to copy and paste the User ID from Settings &gt; About<br>• Return to the top by tapping the tab bar <br>• Fixes an issue that prevented Quick Status from properly recognizing iPhone 11 and iPhone 11 Pro<br>• Addresses an issue that caused an inconsistent font width in Settings"},{"version_id":"835560423","version_name":"5.2.4","version_date":"2020-04-26 17:26:01.000 +0800","version_description":"RetailBox 5.2.4 fixes an issue that caused RetailBox to quit unexpectedly or become unavailable after using Search."},{"version_id":"835707089","version_name":"5.3","version_date":"2020-04-30 19:21:25.000 +0800","version_description":"RetailBox 5.3 adds support for disliking screen savers and introduces in-app notifications. This update also provides additional stability and performance improvements. <br><br>• Tap and hold on content to Dislike screen savers and help improve future releases<br>• In-app notifications display important announcements, new releases, and promotional news when you next open RetailBox<br>• Adds an option in Settings to join the RetailBox Preview to test pre-release versions and provide feedback<br>• Improves the experience when sharing screen savers with third-party apps<br><br>Other improvements and fixes include:<br><br>• Adds support for iPhone SE (2nd generation)<br>• Adds support for iPad Pro 11-inch (2nd generation) and iPad Pro 12.9-inch (4th generation)<br>• Updated and additional control over push notification subscriptions<br>• Fixes an issue that caused RetailBox to crash when sharing content on iPad<br>• Addresses an issue where push notifications could fail to be delivered<br>• Resolves an issue where playback might resume to a black screen after screen recording<br>• Resolves an issue that could cause RetailBox to unexpectedly quit after playing multiple screen savers<br>• Fixes an issue that caused Quick Status device icons to have an unexpected appearance in Dark Mode on iPhone 8 and earlier"},{"version_id":"835775700","version_name":"5.3.5","version_date":"2020-05-07 09:01:46.000 +0800","version_description":"RetailBox 5.3.5 includes improvements and bug fixes, including a fix for an issue that impacted the appearance of Settings in Light mode."},{"version_id":"835863519","version_name":"5.4","version_date":"2020-05-18 17:05:33.000 +0800","version_description":"RetailBox 5.4 introduces a new Pride Home Screen Icon, inspired by the rainbow flag, and includes enhancements for iPad. This release also provides additional bug fixes and performance improvements.<br><br>• New Pride (2020) Home Screen Icon, inspired by the rainbow flag<br>• A new layout in Featured for iPad puts even more screen savers on each row<br>• Introduces audio support during screen saver playback for some third-party apps<br>• Includes additional information in Settings about app release type and device information<br><br>Other improvements and fixes<br><br>• Fixes an issue that prevented content suggestions from being accurately recorded<br>• Addresses issues on iPhone SE (1st generation) which could cause some content to become clipped or misaligned<br>• Addresses an issue on iPad Pro 12.9-inch (4th generation) and iPad Pro 11-inch (2nd generation) that could prevent device icons from changing between Light and Dark modes in Quick Status"},{"version_id":"836013495","version_name":"5.4.2","version_date":"2020-06-09 21:36:11.000 +0800","version_description":"RetailBox 5.4.2 includes important bug fixes and improvements and is recommended for all users."},{"version_id":"836348375","version_name":"5.5","version_date":"2020-06-26 04:38:18.000 +0800","version_description":"RetailBox 5.5 introduces in-app notifications and improvements to Library Lock. This update also contains bug fixes and stability improvements.<br><br>• In-app notifications display important announcements, new releases and promotional news when you next open RetailBox<br>• Adds a setting to confirm new Library Lock passwords<br><br>Other improvements and fixes include<br><br>• Fixes an issue that could cause screen savers to not play on launch even when the Autoplay setting is enabled<br>• Resolves an issue where push notifications could fail to be delivered <br>• Addresses an issue that caused the Privacy Policy link in Settings to load to an incorrect page"},{"version_id":"836601525","version_name":"5.5.1","version_date":"2020-07-09 21:28:56.000 +0800","version_description":"RetailBox 5.5.1 includes new features, improvements and bug fixes and is recommended for all users. This update:<br><br>• Introduces the ability to open RetailBox from supported apps with universal links<br>• Adds additional and updated preferences over notification subscription topics in Settings<br><br>This update also includes bug fixes and improvements:<br><br>• Support for iOS &amp; iPadOS 13.5 and later<br>• Addresses launch performance and stability issues <br>• Fixes an issue that caused the Share sheet on iPad to appear in an incorrect location <br>• Resolves an issue that temporarily prevented new screen savers from downloading on the 1st day of each month<br>• Fixes an issue on iPad that caused certain interface elements in Settings to appear in an unexpected size"},{"version_id":"837648230","version_name":"5.6.2","version_date":"2020-09-05 22:29:23.000 +0800","version_description":"RetailBox 5.6.2 includes bug fixes and improvements."}]