[{"version_id":"827983716","version_name":"4.0","version_date":"2018-07-26 02:49:15.000 +0800","version_description":"- Contact group feature<br>- Notification for scheduled texting task and credit status<br>- Multiple language support: English, French, Simplified and Traditional Chinese<br>- Multiple nations support<br>- Bug fixing"},{"version_id":"828606005","version_name":"5.0","version_date":"2018-09-25 02:09:19.000 +0800","version_description":"- Allow users create new text messages from historical tasks as template<br>- Support more languages and countries<br>- Earn free credits by inviting your friends to the app"},{"version_id":"828715585","version_name":"5.1","version_date":"2018-09-26 03:13:38.000 +0800","version_description":"- Bug fixing."},{"version_id":"828897932","version_name":"5.4","version_date":"2018-10-18 13:00:05.000 +0800","version_description":"In this version we try to bring more benefits to you without purchasing any credits. We hope it can better help your life and business and reduce your cost.<br>- Reminding to manually send scheduled messages at pre-defined time, without any credits<br>- Support more languages<br>- Improve the inviting features to easier earn free credits<br>- Minor bug fixing"},{"version_id":"829097807","version_name":"5.5","version_date":"2018-11-01 20:51:24.000 +0800","version_description":"In this version we put our effort on the app performance. You can quickly create an auto send texting task or reminder task now.<br>- Improve the performance of loading phonebook when creating texting task;<br>- Users can now type in the phone number even it is not in their phonebook;<br>- Bug fixing."},{"version_id":"829356268","version_name":"6.0","version_date":"2018-11-28 18:51:29.000 +0800","version_description":"In this version we now support automated text and picture messaging (MMS, Multimedia Messaging Service) feature."},{"version_id":"830230723","version_name":"7.0","version_date":"2019-02-11 19:23:45.000 +0800","version_description":"- Support iPad and iPad Pro (Please use a mobile phone number that can receive SMS to sign up at iPad devices)<br>- Support Super Retina screen and Liquid Retina HD display for different iPhone devices<br>- Provide subscription features and services<br>- bug fixed"},{"version_id":"830622426","version_name":"7.1","version_date":"2019-03-16 01:24:49.000 +0800","version_description":"This version improves the successful rate of auto text sending. We have implemented a new  sms scheduler engine in cloud. The newer version app can interwork with the new engine to provide high performance for group texting."},{"version_id":"830963182","version_name":"7.2","version_date":"2019-04-15 01:06:30.000 +0800","version_description":"- This version improves automation process, and add sms reply phone number<br>- Add link to AutoSender Pro version,  which provides preset e-cards and texts<br>- Bug fixed"},{"version_id":"831319943","version_name":"7.5","version_date":"2019-06-12 23:04:26.000 +0800","version_description":"We provide multiple-level of subscriptions in this version: 30 days, 90 days and 365 days. With the subscription you will get below benefits,<br>(1) All purchased credits will not expire;<br>(2) Get bonus credits in the subscription period;<br>(3) Premium message delivery channel for better quality-of-service;<br>(4) 2 business days response time for tech support;<br>(5) Permanent cloud storage for all sent messages."},{"version_id":"832052345","version_name":"7.6","version_date":"2019-07-19 14:48:30.000 +0800","version_description":"- Add reference to the free app supporting auto text and e-mail<br>- Bug fixing"},{"version_id":"832251092","version_name":"7.8","version_date":"2019-08-09 02:36:34.000 +0800","version_description":"- We enable the in-app subscription level change feature in this version. <br>- Bug fixing."},{"version_id":"832654502","version_name":"8.0","version_date":"2019-09-22 19:42:32.000 +0800","version_description":"We provide the Private Number feature in this version. The Private Number is a real and unique US or Canadian phone number that can be used to send your scheduled messages from. It is the 2nd number on your phone. With this feature your AutoSender will be much more reliable and trustable. It can be better used in your private life and business world. And it works with your iPad devices. You can use this 2nd phone number inside AutoSender in iPad to send messages."},{"version_id":"833309929","version_name":"8.4","version_date":"2019-10-28 17:55:37.000 +0800","version_description":"- Bug fixing"},{"version_id":"834038306","version_name":"8.8","version_date":"2019-12-28 14:46:07.000 +0800","version_description":"In this version we have below improvements,<br>1. UI improvement for better user experience;<br>2. Highlight the Private Number entry point;<br>3. Bug fixing."},{"version_id":"834439208","version_name":"9.0","version_date":"2020-01-22 10:30:41.000 +0800","version_description":"From this version we offer the Inbox based on the Private Number to receive SMS messages for FREE. No matter where you live in the world, you can exclusively own&amp;use this North American phone number to automatically send SMS&amp;MMS messages, and receive unlimited amount of text messages free-of-charge!"},{"version_id":"835058890","version_name":"10.0","version_date":"2020-03-13 20:24:56.000 +0800","version_description":"Below new features are introduced in this release. They are based on the in-app United States or Canadian mobile number (Private Number).  <br>1. Text Auto Reply - Automatically reply incoming text messages over the in-app mobile number using the pre-defined content;<br>2. Text Auto Forwarding - Automatically forward all incoming text messages over the in-app mobile number to others;<br>3. Shared line:  An AutoSender (Pro) account used by unlimited number of iOS devices and share the same in-app mobile number for sending and receiving text messages. This is a perfect solution for a group of people to communicate with outsiders through a single mobile line."},{"version_id":"835110408","version_name":"10.1","version_date":"2020-03-16 14:43:04.000 +0800","version_description":"Below new features are introduced in this release. They are based on the in-app United States or Canadian mobile number.  <br>1. Text Auto Reply - Automatically reply incoming text messages over the in-app mobile number using the pre-defined content;<br>2. Text Auto Forwarding - Automatically forward all incoming text messages over the in-app mobile number to others;<br>3. Shared line:  An AutoSender (Pro) account used by unlimited number of iOS devices and share the same in-app mobile number for sending and receiving text messages. This is a perfect solution for a group of people to communicate with outsiders through a single mobile line."},{"version_id":"835500101","version_name":"10.2","version_date":"2020-04-13 15:23:54.000 +0800","version_description":"We bring below improvements for the new tide of remote working and social distancing,<br>1)  Discount the international texting rate to the lowest level in AppStore when using Private Number to send texts to the USA and Canada recipients.<br>2) Get free credits to send text messages through watching the in-app mobile ads.<br>3) UI optimization."},{"version_id":"837605724","version_name":"10.3","version_date":"2020-09-11 21:07:45.000 +0800","version_description":"- Support for the latest iOS<br>- Enhanced portal for earning free credits<br>- Bug fixing"}]