[{"version_id":"828942179","version_name":"0.1.15","version_date":"2018-10-17 19:22:09.000 +0800","version_description":"• The Diner venue is open for business!<br>• Play to reveal the heartwarming story<br>• New town plots to improve<br>• Bug fixes and other improvements to game performance"},{"version_id":"829428221","version_name":"0.3.5","version_date":"2018-12-03 21:03:57.000 +0800","version_description":"Welcome to the Grand Re-opening of the famous DinerTown Inn!<br> <br>• Introducing a new way to play - Hotel Dash!<br>• Guide customers to their rooms and provide prompt room service!<br>• Help Gladys, Queenie, Norbert, and the rest of the gang fix up the Inn and nearby pond!<br>• Cook up delectable dishes like tasty Scones, Pesto Pasta, and Mini Quiches!<br>• Thwart Mr. Big and his Goons’ evil plans to wreck your hotel!<br> <br>Improved loading times and optimizations - get in and play even faster!"},{"version_id":"829640547","version_name":"0.4.2","version_date":"2018-12-20 17:32:30.000 +0800","version_description":"• Fog has set all over DinerTown! What could be underneath? Play to find out!<br>• Bug fixes (yay!) plus gameplay and stability improvements!"},{"version_id":"830063950","version_name":"0.5.6","version_date":"2019-01-29 17:31:42.000 +0800","version_description":"• Introducing Daily Goals! Complete tasks every day to earn rewards!<br>• Watch Flo return to DinerTown in a brand new opening cinematic trailer!<br>• Bug fixes (yay!) plus gameplay and stability improvements!"},{"version_id":"830268427","version_name":"0.6.2","version_date":"2019-02-19 22:32:14.000 +0800","version_description":"• So close to beating a level? You can now Continue without starting over!<br>• Get bonus Hearts &amp; Coins every time you use Rainbow Match, Quick Customers, and Fast Flo!<br>• Heart Cupcake, Order Up, and Jetpack are now supercharged with improved performance!<br>• Improved loading times and stability!"},{"version_id":"830524683","version_name":"0.7.9","version_date":"2019-03-12 16:01:02.000 +0800","version_description":"Head down to Bistro Bay to open Gil's Floating Fish Shack!<br> <br>• Introducing a brand new diner serving up scrumptious seafood!<br>• Help Gil and Barb clean up Bistro Bay and bring the Fish Shack back to life!<br>• Stay ahead of the rush by shucking oysters and catching fresh Lobster and Crab!<br>• Build up new areas like the mysterious Seal Cove, Bistro Beach, and more!<br>• Thwart Mr. Big and his Goons’ evil plans to ruin Bistro Bay!<br>• Cook up delectable dishes like fresh Steamed Lobster, Fish 'n Chips, and Key Lime Pie!<br>• Bug fixes (yay!) plus gameplay and stability improvements!"},{"version_id":"830770760","version_name":"0.8.5","version_date":"2019-04-06 00:15:19.000 +0800","version_description":"• Introducing a brand new look for Character Loyalty! Check out character upgrades, journals, and more!<br>• Feeling stuck? Breeze through The Greasy Spoon Diner with updated level tuning!<br>• Bug fixes (yay!) plus gameplay and stability improvements!"},{"version_id":"830970455","version_name":"0.9.8","version_date":"2019-05-01 16:00:55.000 +0800","version_description":"• Earn awesome rewards every day just by checking in!<br>• Introducing Mementos! Unlock collectible Mementos by completing fun goals!<br>• View your Mementos in the all-new Town Hall!<br>• Customize your Town Hall with a variety of amazing looks!<br>• Not a fan of doing laundry? Then you'll love the new flow in Hotel DASH!<br>• Bug fixes (yay!) plus gameplay and stability improvements!"},{"version_id":"831408349","version_name":"0.10.5","version_date":"2019-05-24 17:42:19.000 +0800","version_description":"• Introducing our first event - Game of Thorns!<br>• Mr. Big and his goons have covered Grandma's house in a prickly bramble!<br>• Roll up your sleeves and clear that bramble - Big won't get away with this!<br>• Fix up Grandma's house and restore her prized collection from her world travels!<br>• Redecorate the DinerTown Inn with a brand new Pretty Piggy Princess theme!<br>• Map optimizations and bug fixes! Woohoo!"},{"version_id":"831597887","version_name":"1.6.5","version_date":"2019-12-18 22:05:37.000 +0800","version_description":"• Chapter 18 has arrived! Meet the mysterious dognapper to find out what happened to Skillet!<br>• Serve up fun new carnival foods like Churros, Funnel Cakes, and Ice Cream Sandwiches!<br>• Blow up colorful balloons for your customers - just make sure they don't pop!<br>• Check out the new Venue Navigation buttons to quickly browse through levels from all Venues!"},{"version_id":"831597887","version_name":"1.0.2","version_date":"2019-06-14 00:20:25.000 +0800","version_description":"Play Diner DASH Adventures to reveal the heartwarming story of our hero, Flo, as she returns to her hometown to help the citizens and adorable animals of DinerTown.<br><br>• Join our DASH community to get email updates from the team!<br>• Connect your Facebook account to earn rewards!<br>• Map optimizations and bug fixes! Woohoo!"},{"version_id":"832049746","version_name":"1.1.1","version_date":"2019-07-24 22:03:37.000 +0800","version_description":"What's that? Is that… yes, it's a Cruise Ship!<br> <br>• Play Hotel DASH at a brand new Cruise Ship venue!<br>• Send your guests to the Ship's relaxing Spa and hoppin' Nightclub!<br>• Fix up the Cruise Ship, beautiful Plotte Point cliffs, and more!<br>• Grandma Florence returns! With a mysterious new companion...<br>• Serve up tasty treats like Tropical Fruit Cups, Margherita Pizza, Pineapple Punch and more!<br>• Bug fixes (yay!) plus gameplay and stability improvements!"},{"version_id":"832356627","version_name":"1.2.5","version_date":"2019-08-26 22:00:50.000 +0800","version_description":"• The Game of Thorns event is now at the DinerTown Inn!<br>• Cook up all new Grandma Florence-inspired recipes at the hotel kitchen!<br>• Check out a whole new section of Grandma's House and all of her wacky inventions!<br>• Earn Grandma Cookies at the Hotel to explore and fix up Grandma's House!<br>• Join our new fun adventure at Norbert's Summer BBQ!<br>• Decorate the plaza and dress up characters in sizzlin' summer style!<br>• The improved Cupcake Boost now automatically applies to all Customers in venues!"},{"version_id":"832685060","version_name":"1.2.7","version_date":"2019-09-10 21:00:36.000 +0800","version_description":"• The Game of Thorns event is now at the DinerTown Inn!<br>• Cook up all new Grandma Florence-inspired recipes at the hotel kitchen!<br>• Check out a whole new section of Grandma's House and all of her wacky inventions!<br>• Earn Grandma Cookies at the Hotel to explore and fix up Grandma's House!<br>• Join our new fun adventure at Norbert's Summer BBQ!<br>• Decorate the plaza and dress up characters in sizzlin' summer style!<br>• The improved Cupcake Boost now automatically applies to all Customers in venues!"},{"version_id":"832926611","version_name":"1.3.8","version_date":"2019-09-30 21:06:10.000 +0800","version_description":"• Halloween has come to DinerTown, bringing all kinds of spooky surprises!<br>• Dress Flo, Barb, Shakes, and Beatrix in fun, new costumes!<br>• Collect Limited Time mementos to earn the Haunted House decorations for your Town Hall!<br>• Pumpkins, bats, and cats, oh my! Can you find all the creepy critters on the map?<br>• Cook Halloween-inspired food all month in a special Game of Thorns!<br>• Play through the new Game of Thorns quests to learn about Grandma’s past, uncover treasure and solve her mysterious riddle!"},{"version_id":"833346093","version_name":"1.4.5","version_date":"2019-11-04 22:15:38.000 +0800","version_description":"• Fall has arrived in DinerTown! Check out all of the colorful autumn leaves and pumpkins!<br>• Get ready for our first limited-time storyline just in time for Thanksgiving - to be released very soon!<br>• Explore a brand new section of Grandma's house filled with her wild and crazy training obstacles!<br>• Ran out of new levels to play? Not anymore! Introducing challenging new VIP Levels!"},{"version_id":"833661385","version_name":"1.5.5","version_date":"2019-11-21 17:09:32.000 +0800","version_description":"• Chapter 17 is here!! Find out what happened to Grandma Florence's Snack Shoppe at the boardwalk!<br>• Smash Piñatas to earn exclusive rewards like new outfits for Flo and all her friends!<br>• Head to Grandma's Snack Shoppe to cook up Cotton Candy, Funnel Cakes, Donut Burgers, and more!<br>• Mr. Big and his goons have transformed the old boardwalk into something awful - help Flo turn drab into fab!<br>• Look out for a new Limited-Time Holiday Storyline and killer Black Friday deals!"},{"version_id":"834007257","version_name":"1.6.5","version_date":"2019-12-18 22:05:37.000 +0800","version_description":"• Chapter 18 has arrived! Meet the mysterious dognapper to find out what happened to Skillet!<br>• Serve up fun new carnival foods like Churros, Funnel Cakes, and Ice Cream Sandwiches!<br>• Blow up colorful balloons for your customers - just make sure they don't pop!<br>• Check out the new Venue Navigation buttons to quickly browse through levels from all Venues!"},{"version_id":"834472321","version_name":"1.7.3","version_date":"2020-01-31 00:41:45.000 +0800","version_description":"• Chapter 19 is here! Will the Tunnel of Love be Devon’s downfall?<br>• Build some new carnival rides! Tea Cups anyone?<br>• It’s Palentine’s Day in DinerTown! Join in our limited time events, collect Valentine’s Day cards and celebrate all kinds of love!<br>• Watch our latest Animated Short on YouTube - Love Stories from DinerTown!<br>• Serve and cook some lovely new food - Boxed Chocolates, Passion Fruit Tart &amp; Grilled Oysters!<br>• A MYSTERY singer is about to rock a Palentine’s Day Concert. Check it out!"},{"version_id":"834783546","version_name":"1.8.5","version_date":"2020-02-27 23:12:22.000 +0800","version_description":"CHAPTER 20 is here!<br>• Will Flo &amp; Grandma finally get their dog Skillet out of the hands of Mr. Big?<br>• There is more to build at the Amusement Park - Design the Ferris Wheel and Roller Coaster!<br><br>NEW LIMITED EVENT - Come celebrate the ladies of Dinertown!<br>• One of the ladies is up to no good! Go undercover and join Flo &amp; her squad in a Spy Mission to find out who is messing with the town in a surprising way<br>• Find &amp; Collect diary pages to complete the event and reveal the mysterious trouble maker<br>• Cook some chic and unexpected new Food items in a redesigned Dinertown Inn<br>• New SPY outfits for Flo, Queenie &amp; Minnie! <br><br>NEW CONTENT EVERY DAY!<br>• Discover our limited time and exclusive content only this month at the Dinertown Inn where you can serve up special Food items - Squid Ink Pasta, Carnivorous Plants, and oh-so Saucy Novels! <br>• Up to 5 chances a day to complete your task"},{"version_id":"835202585","version_name":"1.9.4","version_date":"2020-03-30 17:14:53.000 +0800","version_description":"NEW CHAPTER! Big - Big things are happening in Dinertown!<br>• New venue! Queenie opened up a Bakery! <br>• Reach Chapter 21 to discover lots of sweet treats including Cake Pops and a cool new Selfie Station! #smileandsmize #nofilter<br><br>NEW LIMITED EVENT! It’s all about cleaning!<br>• Beatrix and Flip are up to no good to impress Mr Big turning the town into a battlefield…<br>• Collect Magnets to clean everything up<br>• New spring decorations all over the town<br>• Catch colorful eggs and a new friend might just hippity-hop onto your map!<br>• New Food: smoothie, cucumber roll, frittatas and grilled tofu steak<br><br>Game of Thorns - experience an improved game loading performance!"},{"version_id":"835595309","version_name":"1.10.7","version_date":"2020-04-27 21:00:46.000 +0800","version_description":"CHAPTER 22 is HERE!<br>• Create a fanciful butterfly garden ~ a picture perfect backdrop for Queenie and Kingston’s engagement photos. #ButterfliesandBae<br>• Snap some sweet shots at the SELFIE STATION! Al Paca is poised ‘n’ pink and ready for his close-up.<br>• Bake up some NEW treats including Crème Brûlée and Confetti Cream Puffs! Yum!<br><br>The NEW LIMITED EVENT is all about Flo’s MOM!<br>• Flo finds a secret about her Long Lost MOM!!!<br>• Collect blueprints and solve the Mysterious Puzzle Cookbook Flo’s mom left for her! -Will Flo and her mother be REUNITED at LAST?!<br>• Decorate Flo’s childhood home with kitschy and cool lawn ornaments!<br>• The new foods are all of Flo’s childhood faves: Pizza Bagels, Grilled Cheese, PLUS a super sticky and sweet PB&amp;J station!"},{"version_id":"835925555","version_name":"1.11.8","version_date":"2020-05-27 17:00:41.000 +0800","version_description":"It’s the ONE YEAR anniversary of Diner Dash Adventures!<br>It’s time to Party On, Flo! <br><br>• Introduce Flo’s mom, Fairly, to all of Flo’s friends (and foes) in DinerTown.<br>• NOW!!! Florence’s Snack Shoppe is open to ALL who are playing the LIMITED time Block Party episode. <br>• Cook up some DinerTown signature Potluck dishes including Kingston’s Artisanal Pickles and Cookie’s special Anniversary Cake!<br><br>This month, it’s all about the DASH Community!<br>• Be ready for surprises throughout the month: sweepstakes, community video and anniversary bundles!<br>• Get a chance to win a 1 Year Free Play reward and lots of other prizes<br><br>CHAPTER 23 has arrived!<br>• Meet sassy Wedding Belle, Quinn, and help her build a Dino Paradise fit for a Kingston.<br>• Some cool penguin friends are waddling into the bakery to help with the new Ice Pop Station!<br>• Macarons and Red Velvet Cookies are fresh and hot from the oven!"},{"version_id":"836531919","version_name":"1.12.7","version_date":"2020-06-29 19:03:16.000 +0800","version_description":"DinerTown is making a BIG splash this summer!<br><br>• Mr. Big and his mother take on Minnie and Max in a Splash contest for DinerTown’s NEW POOL!<br>• Players who collect all of Max’s Sunscreen Bottles will get our BIGGEST episode reward ever!<br><br>CHAPTER 24 is HERE!!!<br>• Help Quinn create the PERFECT engagement backdrop for Kingston and Queenie! <br>• Snap some cool shots of Dinah the baby dinosaur at the Selfie Station.<br>• NEW! Serve up a magical UNICORN CAKE!<br><br>Coming SOON!<br>• Watch for Shakes when he rolls up in his FOOD TRUCK for a NEW cooking event!<br>• Prepare Breakfast Sandwiches, Crispy Bacon, Home Fries, Cinnamon Rolls, and of course - Shakes' famous coffee!"},{"version_id":"836634926","version_name":"1.12.8","version_date":"2020-07-01 19:46:59.000 +0800","version_description":"DinerTown is making a BIG splash this summer!<br><br>• Mr. Big and his mother take on Minnie and Max in a Splash contest for DinerTown’s NEW POOL!<br>• Players who collect all of Max’s Sunscreen Bottles will get our BIGGEST episode reward ever!<br><br>CHAPTER 24 is HERE!!!<br>• Help Quinn create the PERFECT engagement backdrop for Kingston and Queenie! <br>• Snap some cool shots of Dinah the baby dinosaur at the Selfie Station.<br>• NEW! Serve up a magical UNICORN CAKE!<br><br>Coming SOON!<br>• Watch for Shakes when he rolls up in his FOOD TRUCK for a NEW cooking event!<br>• Prepare Breakfast Sandwiches, Crispy Bacon, Home Fries, Cinnamon Rolls, and of course - Shakes' famous coffee!"},{"version_id":"836864838","version_name":"1.13.2","version_date":"2020-07-28 19:00:41.000 +0800","version_description":"Join us for our Biggest update yet!<br><br>CHAPTER 25 is HERE!!!<br>• Join the industrious gardener Barb on her quest to set up an authentic English TeaHouse!<br>• Serve up scrumptious Crumpets, Jam Tarts, and Rose Petal Tea!<br>• Mr. Big’s indomitable mother Vera Big arrives in DinerTown, threatening its very existence.<br><br>Help Flo sneak inside Big Corp!<br>• Go inside Big Corp. to fight Mr. Big on his own turf in an All New Venue!<br>• The once-a-decade “Annual Big Corp Expo” is underway!  Help Flo sneak into the mysterious Big Corp to find out what Mr. Big is up to!<br>• Serve Big Corp TV Dinners, Tubes of Pudding, Vegetable Jello, and many more items of questionable nutrition!<br><br>Let’s Get Cooking: GRAND OPENING of Shakes’ Food Truck!<br>• Cook and serve food in All New Game Play!<br>• Prepare Breakfast Sandwiches, Crispy Bacon, Home Fries, Cinnamon Rolls, and of course--Shakes’ Famous Coffee!"},{"version_id":"837377085","version_name":"1.14.7","version_date":"2020-09-01 15:59:55.000 +0800","version_description":"CHAPTER 26 is HERE!!!<br>• The Treehouse Teahouse is blossoming into a Royal Wedding Venue, but will Queenie ever set the wedding date?<br>• Serve up fresh Strawberry &amp; Spinach Salad and a scrummy Victoria Sponge. <br>• Your new friend Harvey will help out in the kitchen the only way a giant squirrel can.<br>• Who will find ROMANCE in The Snuggle Bug Suite? Wait… Is that FLIP?!!!<br><br>The Queen of The Internet!<br>• Queenie creates the perfect ViewTube video, Pig Plays Keyboard, but is Mr. Big her biggest competition? <br>• Get Likes &amp; Shares with Trendy Food - Matcha Waffles, Extreme Milkshakes, and Noodle Bun Burgers.<br>• Create a double rainbow all the way with your own Mister. <br>• Watch Queenie’s NEW SelfieTalk dance - The DishDash! Uh oh! Looks like Mr. Big has created a dance of his own! <br><br>Shakes’ Food Truck is back with NEW menu items!<br>• Cook and serve up Country Biscuits, Shakes’ exclusive Koffee Krunch Cereal, and of course, his favorite hot weather beverage - Nitro Cold Brew Coffee!"},{"version_id":"837868289","version_name":"1.15.2","version_date":"2020-09-28 18:01:30.000 +0800","version_description":"CHAPTER 27 is HERE!!!<br>• Gladys and Quinn are creating The Wedding of the Century, just as Beatrix hatches a plan to STEAL it! <br>• In the end, one couple will say “I do” but will it be Kingston and Queenie? ... Or SOMEONE ELSE?!!!<br>• High Tea is on the menu with Lavender Tea and Watercress Soup.<br><br>Time for Tricks and Treats<br>• Shakes is celebrating Halloween by building a spooky scene in DinerTown, but could it actually be HAUNTED?!!!<br>• Serve up ghoulish goodies like Spaghetti Brains, Dirt ‘N’ Worms, and Halloween Donuts.<br><br>Shakes’ Food Truck is revving up!<br>• PSL Season has hit the Food Truck Park with Shakes’ new Pumpkin Spice Latte - it goes great with his new Cranberry Spice Muffin. <br>• Get to the top of The Leaderboard and win Shakes' Food Truck Sign -and earn a SWEET bonus on your Truck Bucks!"},{"version_id":"838114283","version_name":"1.15.3","version_date":"2020-10-08 20:31:45.000 +0800","version_description":"CHAPTER 27 is HERE!!!<br>• Gladys and Quinn are creating The Wedding of the Century, just as Beatrix hatches a plan to STEAL it! <br>• In the end, one couple will say “I do” but will it be Kingston and Queenie? ... Or SOMEONE ELSE?!!!<br>• High Tea is on the menu with Lavender Tea and Watercress Soup.<br><br>Time for Tricks and Treats<br>• Shakes is celebrating Halloween by building a spooky scene in DinerTown, but could it actually be HAUNTED?!!!<br>• Serve up ghoulish goodies like Spaghetti Brains, Dirt ‘N’ Worms, and Halloween Donuts.<br><br>Shakes’ Food Truck is revving up!<br>• PSL Season has hit the Food Truck Park with Shakes’ new Pumpkin Spice Latte - it goes great with his new Cranberry Spice Muffin. <br>• Get to the top of The Leaderboard and win Shakes' Food Truck Sign -and earn a SWEET bonus on your Truck Bucks!"},{"version_id":"838338297","version_name":"1.16.4","version_date":"2020-11-03 03:06:57.000 +0800","version_description":"NEW EVENT at The Fish Shack: Shiver Me Timbers!<br>• Piper Li has stumbled on The Story of a Lifetime. After Cookie’s houseboat is hit with a Freeze Ray, a compelling clue to Cookie’s mysterious, seafaring past is revealed!<br>• Serve up some Sea Urchin Stew, and get ready for an ocean adventure with chills, thrills, and Gils!<br><br>November SURPRISE!<br>• Just in time for Turkey Day, there’s a new and improved way to gobble up the Special Event Rewards you earn EVERY month!<br><br>Hang out at The Harvest Market!<br>• Flo helps Barb create a Fall Farmer’s Market, but with Cookie out of town, who will cook Thanksgiving Dinner?<br>• The Harvest Market has something for everyone! Grilled Sweet Potatoes, Cranberry Italian Ices, Turkey Legs &amp; MORE!!!<br><br>CHAPTER 28 is here!!!<br>• Kingston and Queenie are going to finally tie the knot, like, for real this time. Totes. But does Beatrix have one FINAL trick up her sleeve?<br>• Cater the wedding with food fit for a King and a Queenie: Beef Wellington, Shepherd’s Pie, and English Trifle.<br><br>Coffee Time!<br>• Shakes’ Food Truck has a NEW French Press! You can also frost the new Ring Donuts and shake on some Sprinkles. Wait. Is bacon a sprinkle? When it’s on Maple Frosting, it is!<br>• Keep on truckin’ up that leaderboard to unlock the Shakes Fountain and Shakes Fire Pit!"},{"version_id":"839214394","version_name":"1.17.4","version_date":"2020-11-23 20:08:49.000 +0800","version_description":"Holiday Cheer and BigCorp Jeers!<br>• December is here, and it’s time for cheerful celebrations and family traditions. <br>• Find out more about Mr. Big’s strange childhood holiday traditions. His mother, Vera Big, really hated Santa Claus, but  who is this mysterious Mr. Business? <br>• Flip and Flo decorate BigCorp, and an unconventional tree lighting just might make Mr. Big’s heart grow a size or two.<br>• Serve up seasonal treats: Present Cakes, Holiday Meringues, and Wreath Cookies.<br><br>Sugar and Spice and Everything Ice<br>• Do you want to build a snowman? Collect presents to build your very own Winter Wonderland. <br>• Play the Shiver Me Timbers event and get to the top of the leaderboard to unlock festive Holiday Sweaters. Watch out! Beatrix’s sweater is extra prickly this year.<br><br>Coming up!<br>• Get ready for the 12 Days of Giftmas! After December 14th, you’ll get a gift every day until the 25th, when you’ll get a VERY special gift!<br>• Don’t forget to sign up for our Emails and turn your notifications ON, some exclusive rewards to grab if you do!<br>• STAY TUNED! Later this month, keep your eyes peeled for our latest chapter set in a mysterious new area of DinerTown."},{"version_id":"839653673","version_name":"1.18.3","version_date":"2020-12-22 00:06:00.000 +0800","version_description":"The NEW chapter is FINALLY here! <br>• Explore a dark and mysterious corner of DinerTown where it’s perpetually nighttime, and no one knows why! - Except Shakes, who’s pretty sure that it was ALIENS!<br><br>The Shiver Me Timbers event continues at the Cruise Ship! <br>• Go island hopping with Flo and Cookie and try to find the Cutter Family Treasure!<br><br>Ring in the New Year in a BIG way!<br>• This January, everyone in DinerTown is making and breaking New Year’s Resolutions, but will Mr. Big’s temper break something else? Something BIG?! <br>• Serve up frrrrrrrosty winter party treats like Brrrrrrrrrgers, Chilly Mac, and Very Cold Brew.<br><br>Shake’s Food Truck is SPICING things up!<br>• Everything Bagel Sandwiches, Hot Sauce and Yogurt Parfaits are ALL NEW! Shakes is also bringing back some old favorites: Avocado, Nitro Cold Brew, and Country Biscuits.<br>• Get to the top of the leaderboard to earn a special prize- your very own Robo Barista!<br><br>Everyone gets a GIFT!!!<br>• There’s only a few days left in the 12 Days of Giftmas! Don’t forget, on Dec. 25th, you’ll get the BIGGEST gift of them all!"},{"version_id":"840146688","version_name":"1.19.6","version_date":"2021-02-02 19:35:24.000 +0800","version_description":"Love is in the air!<br>• This February, do some glamping at the Sweetheart Singles Retreat and meet our newest character, Hal!<br>• Throw down a Picnic Blanket and serve up Wood Oven Heart Pizzas and Campfire Cones. <br>• Complete the Limited Time Event and you’ll meet a pair of snuggly Lovebirds, sitting pretty on a sweet little perch!<br><br>Chapter 30 emerges from the shadows!<br>• Follow Flo and Shakes as they delve deeper into the Dark Roast Forest and try to solve a ghostly mystery.<br>• Watch out! Mr. Big has been sneaking around DinerTown and now he wants YOU to take his order.<br>• Mr. Big is an impatient customer who might even break a table if he waits too long. Yikes! Good thing Flo has her DASH!<br><br>Something new is brewing at Shakes’ Food Truck... <br>• Making French Press coffee can be a real grind, but when Shakes shows you how, it’s as easy as 1, 2, 3!<br>• Cook up some Cheesy Grits and put out a French Toast bar with all the toppings: maple syrup, blueberries, sliced strawberries, and even whipped cream!"},{"version_id":"840630008","version_name":"1.20.3","version_date":"2021-03-04 16:01:40.000 +0800","version_description":"Minnie’s Food Truck is Rolling Out!<br>• Look out! Minnie is rolling into DinerTown with a brand new food truck with an all new sweet and savory Asian fusion menu.<br>• Use Minnie’s happy li’l Rice Cooker and the rolling mat to create your own Bulgogi Burritos. <br>• Serve up some Ube Boba Tea… and don’t forget the Matcha Ice Cream for dessert!<br><br>Rosie’s Spy Adventure!<br>• This March, Flo helps Rosie with her final exam for Spy School.<br>• Keep the Toasted Baguette Diamond from falling into BigCorp’s hands, just watch out for the piranha tank! <br>• Visit DinerTown’s new fine arts museum The FLOMA!<br>• Tap into your inner artist as you serve up creative treats like Polkadot Cheesecake, Rainbow Mochi and Pop Soup!<br><br>The Cat is Out of the Bag!<br>• Here’s a secret for you: If you activate Flo’s Secret Menu you’ll earn a BUNCH of special rewards and cool prizes!<br>• Finish the whole menu during the upcoming March episode and you’ll earn an exclusive Top Secret Kitty - Cypher the Spy Cat! <br><br>I Mustache if You’re Ready for Chapter 31!<br>• Shakes has a treasure trove of mint condition Little Baby Mustache merch for you to place in Dark Roast Forest.<br>• Will the real Little Baby Mustache please stand up?"},{"version_id":"840815540","version_name":"1.20.5","version_date":"2021-03-10 19:19:35.000 +0800","version_description":"Minnie’s Food Truck is Rolling Out!<br>• Look out! Minnie is rolling into DinerTown with a brand new food truck with an all new sweet and savory Asian fusion menu.<br>• Use Minnie’s happy li’l Rice Cooker and the rolling mat to create your own Bulgogi Burritos. <br>• Serve up some Ube Boba Tea… and don’t forget the Matcha Ice Cream for dessert!<br><br>Rosie’s Spy Adventure!<br>• This March, Flo helps Rosie with her final exam for Spy School.<br>• Keep the Toasted Baguette Diamond from falling into BigCorp’s hands, just watch out for the piranha tank! <br>• Visit DinerTown’s new fine arts museum The FLOMA!<br>• Tap into your inner artist as you serve up creative treats like Polkadot Cheesecake, Rainbow Mochi and Pop Soup!<br><br>The Cat is Out of the Bag!<br>• Here’s a secret for you: If you activate Flo’s Secret Menu you’ll earn a BUNCH of special rewards and cool prizes!<br>• Finish the whole menu during the upcoming March episode and you’ll earn an exclusive Top Secret Kitty - Cypher the Spy Cat! <br><br>I Mustache if You’re Ready for Chapter 31!<br>• Shakes has a treasure trove of mint condition Little Baby Mustache merch for you to place in Dark Roast Forest.<br>• Will the real Little Baby Mustache please stand up?"},{"version_id":"841049874","version_name":"1.21.6","version_date":"2021-04-01 19:31:35.000 +0800","version_description":"Chow Bella’s Grand Opening<br>• Holy Cannoli! There’s a saucy new trattoria in DinerTown. Check out Restaurant Row’s cornerstone eatery, Chow Bella, for authentic Italian classics like Mozzarella Caprese, Lasagna, Meatballs, and Focaccia.<br><br>April Love Fool<br>• Dorbert is trying online dating and thinks he’s landed a real catch! But could she be a catfish?! Kingston thinks so. Help Flo and Dorbert create a picture perfect Little Italy for Dorbert’s dream date with his mystery lady!<br><br>Island Hopping<br>• The Shiver Me Timbers event is back! Help Flo and Cookie search for treasure as they explore yet another mysterious island.<br><br>Dash into the Spring Sweepstakes<br>• Starting mid April, enter your email and reach level 12 in the Greasy Spoon to have a chance to win some AMAZING prizes!<br><br>Rock out with Daily Jams<br>• DJ Kingston is spinning a phresh collection of gems for you to use every day you play!• Will the real Little Baby Mustache please stand up?"},{"version_id":"841183639","version_name":"1.21.7","version_date":"2021-04-05 20:26:01.000 +0800","version_description":"Chow Bella’s Grand Opening<br>• Holy Cannoli! There’s a saucy new trattoria in DinerTown. Check out Restaurant Row’s cornerstone eatery, Chow Bella, for authentic Italian classics like Mozzarella Caprese, Lasagna, Meatballs, and Focaccia.<br><br>April Love Fool<br>• Dorbert is trying online dating and thinks he’s landed a real catch! But could she be a catfish?! Kingston thinks so. Help Flo and Dorbert create a picture perfect Little Italy for Dorbert’s dream date with his mystery lady!<br><br>Island Hopping<br>• The Shiver Me Timbers event is back! Help Flo and Cookie search for treasure as they explore yet another mysterious island.<br><br>Dash into the Spring Sweepstakes<br>• Starting mid April, enter your email and reach level 12 in the Greasy Spoon to have a chance to win some AMAZING prizes!<br><br>Rock out with Daily Jams<br>• DJ Kingston is spinning a phresh collection of gems for you to use every day you play!"},{"version_id":"841241446","version_name":"1.21.8","version_date":"2021-04-08 18:01:50.000 +0800","version_description":"Chow Bella’s Grand Opening<br>• Holy Cannoli! There’s a saucy new trattoria in DinerTown. Check out Restaurant Row’s cornerstone eatery, Chow Bella, for authentic Italian classics like Mozzarella Caprese, Lasagna, Meatballs, and Focaccia.<br><br>April Love Fool<br>• Dorbert is trying online dating and thinks he’s landed a real catch! But could she be a catfish?! Kingston thinks so. Help Flo and Dorbert create a picture perfect Little Italy for Dorbert’s dream date with his mystery lady!<br><br>Island Hopping<br>• The Shiver Me Timbers event is back! Help Flo and Cookie search for treasure as they explore yet another mysterious island.<br><br>Dash into the Spring Sweepstakes<br>• Starting mid April, enter your email and reach level 12 in the Greasy Spoon to have a chance to win some AMAZING prizes!<br><br>Rock out with Daily Jams<br>• DJ Kingston is spinning a phresh collection of gems for you to use every day you play!"},{"version_id":"841329847","version_name":"1.21.10","version_date":"2021-04-15 01:01:32.000 +0800","version_description":"Chow Bella’s Grand Opening<br>• Holy Cannoli! There’s a saucy new trattoria in DinerTown. Check out Restaurant Row’s cornerstone eatery, Chow Bella, for authentic Italian classics like Mozzarella Caprese, Lasagna, Meatballs, and Focaccia.<br><br>April Love Fool<br>• Dorbert is trying online dating and thinks he’s landed a real catch! But could she be a catfish?! Kingston thinks so. Help Flo and Dorbert create a picture perfect Little Italy for Dorbert’s dream date with his mystery lady!<br><br>Island Hopping<br>• The Shiver Me Timbers event is back! Help Flo and Cookie search for treasure as they explore yet another mysterious island.<br><br>Dash into the Spring Sweepstakes<br>• Starting mid April, enter your email and reach level 12 in the Greasy Spoon to have a chance to win some AMAZING prizes!<br><br>Rock out with Daily Jams<br>• DJ Kingston is spinning a phresh collection of gems for you to use every day you play!"},{"version_id":"841664991","version_name":"1.22.6","version_date":"2021-05-03 18:33:04.000 +0800","version_description":"There’s a NEW Ice Cream Parlor in town!<br>• Get the Scoop on DinerTown’s NEW ice cream parlor, The Big Scoop. <br>• The COOLEST new spot in Restaurant Row is dishing out Rainbow Sherbet and Banana Splits and also pouring some super sweet soda fountain classics like Lemon Lime Soda and Root Beer Floats.<br>• But wait… who’s that behind the counter in a little paper hat? Is that MR. BIG?!<br><br><br>Chillin’ Like a Villain<br>• Mr. Big opens up an ice cream parlor, The Big Scoop, for the same reason he does everything - to impress his mother. Knowing Vera, it’s probably not going to work.  But will it bring Flo and her mother, Fairly, closer together?<br>• Help Fairly build her latest invention - a super-secret, highly technical, very sciency time-saving device. <br>• Finish this episode in the Secret Menu to earn a pink poodle with a house fit for a rock star!<br><br>Chapter 32 is HERE!<br>• Help Flo and Shakes deck out Mustache Park with an outdoor theater complete with a sweet and salty snack stand for the GRAND PREMIERE of his movie. <br>• Lilworth Big is demanding that you roll out the red carpet for him, but is he the real Little Baby Mustache? And if not… who is?"},{"version_id":"842411478","version_name":"1.23.7","version_date":"2021-06-01 23:18:55.000 +0800","version_description":"Celebrate the Anniversary of Diner Dash Adventures!<br>• June marks TWO YEARS of Diner Dash Adventures. <br>• We’re so grateful to the Dash Community for helping us reach this milestone, we’ll be giving you some very special prizes and surprises this month! <br><br>Father’s Day <br>• Fairly and Flo have a plan to find Flo’s father, and it involves going back in time...sort of. <br>• Find out what DinerTown looked like over 30 years ago as Fairly tries to remember her first date with Fred!<br>• Serve retro Boardwalk snacks like Butterfly Fries, Giant Pretzels and a Bucket of Cookies! <br>• But make shroom for Mushroom Caps and Cream of Mushroom Soup because it’s Mushroom Day at the BigCorp cafeteria. <br><br>Chapter 33 is HERE! Call it a Comeback.<br>• Fresh from his re-debut as Little Baby Mustache, Mr. Big wants to find his old agent and rekindle his career.<br>• When Flo and Big find Grandbert they find a run-down comedy club that’s short on laughs and in bad need of an upgrade. <br>• Meet DinerTown’s oldest resident, Grandbert, and give his sassy senior cockatoo, Grandbird, a feathery makeover. Skwawk!"}]