[{"version_id":"832062678","version_name":"2.0.3","version_date":"2019-07-22 14:30:01.000 +0800","version_description":"We've lowered the minimum age required to use our bikes to 16 years old (from 18 years old), meaning more people than ever can get on a Beryl Bike. We've also added some clearer notifications telling you when you are outside our operating zone. Remember to finish your ride inside the operating zone to avoid a penalty. Finally, a few small big fixes... thank you to everyone that has given us feedback. Keep it coming!"},{"version_id":"832466807","version_name":"2.0.4","version_date":"2019-09-02 08:58:54.000 +0800","version_description":"A small update that fixes a few bugs under the hood. We now pass a little more information through to the customer service team so they can help resolve any queries even faster."},{"version_id":"832682054","version_name":"2.0.5","version_date":"2019-09-13 10:52:47.000 +0800","version_description":"This update introduces support for Strong Customer Authentication (SCA). This lets us comply with new European requirements for authenticating payments, so payments you make through our app are more secure."},{"version_id":"832767645","version_name":"2.0.6","version_date":"2019-09-15 18:37:27.000 +0800","version_description":"This update introduces support for Strong Customer Authentication (SCA). This lets us comply with new European requirements for authenticating payments, so payments you make through our app are more secure."},{"version_id":"832922901","version_name":"2.1.0","version_date":"2019-09-28 09:19:32.000 +0800","version_description":"We've improved the way you unlock our bikes! It is now clearer how to unlock and lock our bikes; with clearer errors when bikes fail to unlock and more tips to help you out when using our bikes."},{"version_id":"837859002","version_name":"2.7.3","version_date":"2020-09-23 09:17:03.000 +0800","version_description":"Beryl Scooters are coming! As part of trials with the UK Department for Transport, we will be making our brand new e-scooters available to hire through the app. This update gives you everything you need to get started, including instructions on how to use e-scooters, where you can find them and how much they cost. Beryl Scooters aren't available in all our schemes so if you don't see them in the app, hang tight as they might be coming soon!<br><br>This update also includes a fix to help with the problems some users experience in receiving the login email."},{"version_id":"837927274","version_name":"2.7.4","version_date":"2020-10-14 08:29:28.000 +0800","version_description":"It's now easier than ever to get around with Beryl! Our brand new scooters are hitting the streets meaning you have more choice than ever on how to get around. Check the app to find any available bikes, e-bikes and scooters nearby. To use a Beryl Scooter you need to provide a valid driving licence and phone number. This update enables you to add a phone number to your account along with several other small improvements."},{"version_id":"838300307","version_name":"2.7.5","version_date":"2020-11-03 15:11:21.000 +0800","version_description":"It's now even clearer if there are any promotions that could apply to your next ride on a Beryl Bike, E-Bike or Scooter! We've made improvements to show which vehicles the promotions apply to; and you'll be able to see more information about the promotions in the improved \"promotions\" screen. As always, please check the details of any promotion before taking your ride and if you have any questions, our in-app support team are there to help."},{"version_id":"839371049","version_name":"2.7.6","version_date":"2020-12-02 10:05:56.000 +0800","version_description":"It's now even clearer if there are any promotions that could apply to your next ride on a Beryl Bike, E-Bike or Scooter! We've made improvements to show which vehicles the promotions apply to; and you'll be able to see more information about the promotions in the improved \"promotions\" screen. As always, please check the details of any promotion before taking your ride and if you have any questions, our in-app support team are there to help."},{"version_id":"839592647","version_name":"2.7.7","version_date":"2021-01-04 11:15:06.000 +0800","version_description":"It's now even clearer if there are any promotions that could apply to your next ride on a Beryl Bike, E-Bike or Scooter! We've made improvements to show which vehicles the promotions apply to; and you'll be able to see more information about the promotions in the improved \"promotions\" screen. As always, please check the details of any promotion before taking your ride and if you have any questions, our in-app support team are there to help."}]