[{"version_id":"827249606","version_name":"0.2.2","version_date":"2018-06-01 22:33:55.000 +0800","version_description":""},{"version_id":"827636595","version_name":"1.0.0","version_date":"2018-06-29 09:18:01.000 +0800","version_description":"Time to start HODLing your ETH and BTC with Celsius! Version 1.0 brings the first functioning version of the Celsius wallet where you can deposit and withdraw Ethereum and Bitcoin."},{"version_id":"827843743","version_name":"1.1.0","version_date":"2018-07-13 14:56:27.000 +0800","version_description":"Thanks everyone for the great feedback! We've made some tweaks to the UX and cleaned up a bunch of little bugs. We love to hear from you, so please let us know if there are more features you'd like us to add. We'll have another update in a few weeks."},{"version_id":"827977697","version_name":"1.5.0","version_date":"2018-07-26 09:04:13.000 +0800","version_description":"Ok CELmates, CEL tokens are here! You can now transfer your CEL tokens directly to your wallet on our app. <br><br>We've also added the ability to sign up for our private beta to either borrow dollars or earn interest on your deposits, so be sure to open the app and apply fro the Borrow and Lend screens."},{"version_id":"828095988","version_name":"1.5.1","version_date":"2018-08-06 14:41:28.000 +0800","version_description":"- Updates to the wallet to allow you to set a wallet address for withdrawals. Note: once it's set, it cannot be changed in the app for security reasons. If you need to change your wallet address in the future you'll need to contact us by emailing app@celsius.network<br>- Minor bug fixes<br>- New bugs introduced to keep the developers busy next week"},{"version_id":"828267546","version_name":"1.6.5","version_date":"2018-08-23 07:40:18.000 +0800","version_description":"What's new? How about weekly interest? <br><br>In this surprise release, we're soft launching our interest feature. If you deposited ETH or BTC on or before August 20th you should now be receiving weekly interest payments to your wallet every Wednesday.<br><br>We also added everyone's favorite diet cryptocurrency, Litecoin (LTC), so you can now deposit and withdraw LTC within the app as well."},{"version_id":"828384676","version_name":"2.0.0","version_date":"2018-09-10 13:18:19.000 +0800","version_description":"It’s in everyone’s best interest.<br><br>We are now officially offering interest on deposits. When you make Bitcoin (BTC), Ethereum (ETH), Litecoin (LTC) and Ripple (XRP) deposits you'll automatically start getting interest on your balance.<br><br>Did you say Ripple? Yup, you can now deposit and earn interest on Ripple as well. Your week just keeps getting better and better.<br><br>Love telling people about Celsius? We love you too, which is why we’re giving you your very own referral link to help spread the word. Give it to five people, get some swanky swag, everyone wins."},{"version_id":"828933436","version_name":"2.0.1","version_date":"2018-10-22 08:37:19.000 +0800","version_description":"- You can send crypto to your friends via link<br>- We now support Bitcoin Cash (BCH)<br>- Security improvements<br>- Bugs fixes and tweaks under the hood"},{"version_id":"829102715","version_name":"2.1.0","version_date":"2018-11-01 11:15:09.000 +0800","version_description":"- UI/UX upgrades<br>- security upgrades<br>- bug fixes"},{"version_id":"829518646","version_name":"2.5.0","version_date":"2018-12-19 13:31:31.000 +0800","version_description":"What’s New?<br>We’ve added the ever-popular Two-Factor Authentication, 0x Token, amped up our security, improved our UI/UX all for YOU. Happy interest-earning!<br><br>- Two Factor Authentication<br>- 0x Token<br>- Additional KYC fields for enhanced security and compliance<br>- UI/UX Upgrades<br>- Bug Fixes<br>- Security upgrades"},{"version_id":"829767808","version_name":"2.6.0","version_date":"2019-02-07 09:13:55.000 +0800","version_description":"What’s New?<br><br>We’ve got a jam-packed update for you filled with fun (new coins! Referral program!). Of course, there are a few yawns, too (compliance, bug fixes, improved analytics).<br><br>- Invite your friends! Earn up to $20 in BTC for bringing in your pals. <br>- 8 new coins! ZEC, BTG, XLM, PAX, GUSD, USDC, DAI, TUSD <br>- Compliance updates<br>- Bug fixes<br>- Improved UX/UI"},{"version_id":"830413067","version_name":"2.6.2","version_date":"2019-03-04 09:27:21.000 +0800","version_description":"- Under the hood updates <br>- Bug fixes"},{"version_id":"830713297","version_name":"3.0.0","version_date":"2019-05-09 18:22:15.000 +0800","version_description":"What's New? <br>We've completely redesigned our app in our biggest update ever. Expect a faster, more intuitive, and prettier experience. <br>UI/UX adjustments<br>CEL utility implementation <br>Streamlined onboarding<br>Improved security and safety"},{"version_id":"831663672","version_name":"3.1.0","version_date":"2019-06-21 08:19:08.000 +0800","version_description":"Dark theme is here! Summer is coming, the days are getting longer, but you can enjoy them in your fresh new dark Celsius wallet.<br><br>We heard your feedback! Interest rate calculator is coming back with the latest version of your favorite crypto app. You can also calculate loan terms, even if you haven't deposited enough collateral to your wallet, yet. And the price of each individual asset is back, along with the change in previous 24h. Thank you for improving the product with us!<br><br>You can now change your withdrawal addresses through the app. In order to secure your funds - email confirmation is required and when changing the existing withdrawal address, withdrawals are locked for that specific coin in the next 24h.<br><br>We’ve improved account safety - the PIN strength checker has been added, 2FA is now requested after login as well, and users needs to confirm 2FA activation via email. Security screen is live and it shows the latest account activity logs and possible steps to improve account security.<br><br>Improved KYC flow- Image upload, photo manipulation, and compression have been improved. Users who were rejected in the process will get a message explaining what went wrong, so they can address the issue when they re-apply."},{"version_id":"833063271","version_name":"4.0.0","version_date":"2019-10-16 10:29:00.000 +0800","version_description":"You can now borrow stable coins through the app. We redesigned the borrow page, you can now pay back your loan through the app.<br>New community screen -  more information about our community is now available.<br>New coins in the app - you can now deposit EOS, TGBP, THKD, TAUD and TCAD"},{"version_id":"833232627","version_name":"4.0.1","version_date":"2019-10-18 18:05:44.000 +0800","version_description":"- You can now borrow stable coins, pay interest and principal, and respond to a margin call, all directly through the app.<br>- Added more information on our community screen.<br>- Added new coins that you can now deposit and earn interest on: EOS, TGBP, THKD, TAUD and TCAD.<br>- Fixed bugs and improved the UI."},{"version_id":"833950322","version_name":"4.1.0","version_date":"2019-12-12 09:17:28.000 +0800","version_description":"What's new in the app:<br>• New Modals - Redesigned all the modals in the application <br>• Filter and download transactions - Users can now filter their transactions and download a CSV file of transaction history via email<br>• MCDAI added to app - User can now deposit Multi Collateral DAI to the app<br>• Added 'Interest Due' modal for interest payments - User can see outstanding debt for interest payments and the time period for which the interest is due"},{"version_id":"834634392","version_name":"4.2.0","version_date":"2020-02-17 19:43:28.000 +0800","version_description":"- Buy crypto with a credit card<br>- Weekly compounding interest on all coins<br>- CelPay enhancements and improvements<br>- Recaptcha on sign-up and login <br>- Bug fixes"},{"version_id":"835590060","version_name":"4.3.0","version_date":"2020-04-22 12:41:04.000 +0800","version_description":"- Enhanced push notifications - Be sure to turn on your push notifications! Users will now receive important notices via push notification.<br>- HODL Mode - A new security mode allowing HODLers to enter a restricted mode to improve security. HODL Mode stops withdrawals while allowing incoming transfers.<br>- Security Overview Screen - Users can now review the state of their account security and improve it based on best industry practices.<br>- Transaction Details Redesign - A complete redesign of all transaction states in the app to simplify communication.<br>- Password Strength Meter - Users will now receive suggestions on how to make their password as strong as possible while setting a new password or changing an old one."},{"version_id":"836578328","version_name":"4.4.0","version_date":"2020-06-29 08:44:40.000 +0800","version_description":"- Bank Linking - Purchase coins directly from your wallet using your SEPA or ACH enabled bank account<br>- App loading - Improved app loading time and performance<br>- CEL membership - Users can now use Celsius services without owning CEL tokens<br>- New coins - ETC and BSV are now available in Celsius Network wallet<br>- One Click email open - Open default email app with one click in the app"},{"version_id":"837044236","version_name":"4.5.0","version_date":"2020-09-09 09:48:07.000 +0800","version_description":"Welcome to the new Celsius app! We have completely refreshed the brand and updated the look and feel of the app. <br>Alongside with brand and language, we have updated the security switching from four-digit to six-digit PIN. <br>We also made improvements to the KYC flow allowing new users to start using Celsius services seamlessly."},{"version_id":"837905234","version_name":"4.6.0","version_date":"2020-10-19 11:15:52.000 +0800","version_description":"What's new<br>1. Biometric authentication - log in authenticate actions with touch, face, etc.<br>2. Bug fixes and improvements to in-app margin call monitoring<br>3. Enhanced in-app interest payment process for borrowers"},{"version_id":"839555248","version_name":"4.6.1","version_date":"2020-12-10 17:01:27.000 +0800","version_description":"Bug fixes and improvements"},{"version_id":"839602701","version_name":"4.7.0","version_date":"2021-01-25 12:05:14.000 +0800","version_description":"What’s new in v4.7.0:<br><br>- AAVE coin is now supported in the Celsius app<br>- Apple authentication implemented<br>- Under the hood libraries upgraded<br>- Bug fixes and improvements"},{"version_id":"840563725","version_name":"4.8.0","version_date":"2021-02-25 11:07:48.000 +0800","version_description":"- Say hi to in-app support! Our new chatbot, Dana, is now available in the Celsius app! She can help answer questions and provide additional support resources. <br>- Security upgrades to keep you protected 24/7<br>- Promo code enhancements (check the Celsius website to get a new user promo code!)<br>- Updated minimum USD loan amount (except in Texas and New York)<br>- Bug fixes and UI improvements<br>- Under the hood infrastructure improvements"}]