[{"version_id":"827481036","version_name":"1.0","version_date":"2018-10-02 03:26:48.000 +0800","version_description":""},{"version_id":"828843230","version_name":"1.1","version_date":"2018-10-12 03:12:16.000 +0800","version_description":"• Added custom Sorting and Filtering to the Watch List.<br>• Wikipedia links have been added to the external options in the Movie/TV Show/People screens.<br>• You can now swipe left/right within the Calendar to go forward/backwards alternatively to tapping the arrows.<br>• Fixed a crash when trying to access the external options in the TV Show/People screens on iPad.<br>• Fixed an issue causing the Show Progress screen to crash upon opening in some instances.<br>• Fixed an issue causing the History screen to crash in some instances.<br><br>Thank you to everyone who sent feedback, suggestions &amp; bug reports so far! Enjoy."},{"version_id":"828921582","version_name":"1.2","version_date":"2018-10-28 22:07:00.000 +0800","version_description":"• Improved visibility for Watched Items, and added visibility for Ratings, Watch Listed Items and Collected Items.<br>• Added support for removing Ratings, Watch Listed Items and Collected Items within the item viewers, and improved support when viewing and sorting them within the lists of items.<br>• Improved the external sharing options including an issue with some Wikipedia links, and added toggling for opening links internally instead of externally.<br>• Improved navigation via tapping the title button in episode/season viewers so you can get to the various overviews and other seasons/episodes.<br>• Added toggle for displaying the Behind Count in the Up next to watch section of the Dashboard, found in the ••• menu. <br>• Added sorting to the Show Progress screen, along with the poster image for the Show. <br>• Added support for hiding the top comments in the overview screens until you tap to reveal them by selecting the Profile tab &gt; Settings button &gt; Preferences option &gt; Toggle.<br>• Added support to close Search by tapping on the tab that you’re currently in again, as an alternative to having to tap the Cancel button at the top of the screen.<br>• Added recent Friends Activity history in the Dashboard."},{"version_id":"829249883","version_name":"1.3","version_date":"2018-11-10 22:43:23.000 +0800","version_description":"• Added support for managing custom Lists! Accessed via the Watch List tab, you can view, create and delete lists, along with removing list items within lists. Add items to lists through the overview screens “Add to List” button and choosing the “Custom Lists…” option. <br>• The Collected Items screen has been updated to support item type filtering and sorting. <br>• The History screen has been updated to support item type filtering.<br>• Fixed a set of crashes when trying to use some actions within the action menus on iPad. Oops, again!<br>• Tapping on the bottom tabs will scroll you to the top if you’re already on the tab. On the Dashboard at the top, it will scroll the Up next to watch section to the beginning.<br>• Trying to add ratings or items to your history that aren’t released yet will warn you first.<br>• Fixed a silly issue causing Movie posters in the History screen from being displayed!<br>• Fixed an issue causing episode background images from falling back to their show’s image in cases where they might not have an image yet.<br>• Added an external link to IMDb Metacritic reviews to the list of movie external links.<br><br>Thank you once again to everyone who sent feedback, suggestions and bug reports!"},{"version_id":"829423591","version_name":"1.4","version_date":"2018-11-28 07:44:13.000 +0800","version_description":"• Calendar Episode Notifications! You can now opt in to receive notifications about upcoming Episodes in your Calendar. Accessed via Profile &gt; Settings &gt; Preferences... &gt; Calendar Episode Notification options. You can choose to receive alerts at air time, or with a custom offset. By default this will send notifications about all upcoming Episodes in your Calendar, however you can mute (or unmute) specific Shows via tap-holding on Episodes in the Calendar and choosing the option to toggle that setting.<br>•&nbsp;Movie Check in Reminders. In addition to Checking in normally, you can schedule Check in reminders, so that you can set it up before you’re in the cinema or wherever you might be, and receive a notification at the time with a manual action to Check in once you're ready, rather than fiddling around before the Movie starts.<br>•&nbsp;Added access to Custom Lists via Profile &gt; More (•••) &gt; View Custom Lists, in addition to the access via Watch List.<br>• Added access to a guide for the app via Profile &gt; Settings &gt; Watcht Guide.<br>• Fixed a typo with the Rating description for 5/10, which was 'Med' instead of 'Meh'. Now you can Meh correctly at those items!<br>• Fixed calculation of ages in the People overviews.<br>• The History screen should now remember your last filter.<br>• Tapping anywhere in the area of the 'Last Watched', 'Most Watched' etc. list items in the Profile will open the overviews, instead of just the 'View Info' buttons.<br><br>Thanks again to everyone who submitted feedback, suggestions &amp; bugs."},{"version_id":"829664719","version_name":"1.5","version_date":"2018-12-17 02:40:04.000 +0800","version_description":"• Improved visibility of the navigation via Season/Episode overview titles, and added similar navigation to the Show overview title. You can now jump to the first episode of a show or to one of the seasons from the Show overview.<br>• Added some extra filters to the History screen for viewing Movies and/or Shows by last play. These filters don’t require paging in, as the information is synced with your data, compared to by “each play” which isn’t synced. You’re not able to manage your history directly from the ‘last play’ filters but its easier to view with sorting available, and once synced, using those filters means your items are available for offline viewing also.<br>• Updated watched status visibility for Shows and Seasons to include a progress ring around the tick icon to indicate the percentage complete.<br>• The Collection screen should now remember your last filter.<br>• Episode Calendar Notification information has been improved.<br>• Tap on the currently checked in item on the dashboard to open it’s overview.<br>• Access your Ratings history from the Profile’s more button, or tapping on the ratings graph.<br>• Sorting for Custom Lists, including those accessible in Movie and Show overviews.<br>• Ability to hide completed shows in the Show Progress screen so sorting by things like most complete doesn’t include all the completed shows.<br>• Tap hold on shows in the Calendar for an option to hide them from your Calendar (and Upcoming Schedule on the dashboard).<br>• Tap hold on recommendation items in the Dashboard for an option to hide them.<br>• Added number of days count to calendar headers.<br>• Fixed inconsistent capitalisation for the genres in the Profile genres graph.<br>• Other miscellaneous improvements.<br><br>Thanks to everyone who’s submitted feedback and suggestions, and for your patience in the resolving of those issues!"},{"version_id":"829853055","version_name":"1.6","version_date":"2019-01-07 23:10:21.000 +0800","version_description":"• Themes are here! Choose from Dark, Light, or keep it Original. Switch your Theme via Profile &gt; Settings &gt; Preferences &gt; Theme.<br>• Navigation has been updated so screens are presented horizontally rather than vertically so that you can swipe from the left edge of the screen to dismiss.<br>• You can now view Poster &amp; Banner Images within the overviews for Movies, Shows, Seasons, Episodes &amp; People. Additionally, in the Show Overview, you can tap-hold on an actor to see their full name and character name, as well as an option to view their character image.<br>• Added the ability to view the full list of Cast and Crew for Movies and Shows.<br>• Fixed a UI issue which caused some weird alignments for horizontally scrollable content on iPad (and iPhone in certain cases).<br>• Improved the Show Overviews to include their status if they’ve Ended or Canceled, as well as adding the time they air if they’re Upcoming/Ongoing Shows.<br>• Fixed number of days count in calendar headers being wrong in some cases.<br>• Added sorting for your Rating items.<br>• Fixed visibility of some show progress rings that are on top of images.<br>• Added option for beginning the calendar and upcoming schedule “From Yesterday” instead of “From Today”. Accessed via Profile &gt; Settings &gt; Calendar Begins From Yesterday.<br>• Fixed an issue where a spoiler would show up as a link due to conflicting markdown in comments (not revealing the spoiler however, you just wouldn’t be able to see it at all).<br><br>As always, thanks to everyone who's submitted feedback and suggestions!"},{"version_id":"830060440","version_name":"1.7","version_date":"2019-01-24 02:08:11.000 +0800","version_description":"• Grid Poster Layouts available as alternatives to Lists! On by default in Explore, however other places (eg. Calendar, Watch List) can be turned on in Profile &gt; Settings &gt; Grid Layout.<br>• Added a proper Settings screen rather than using the system sheet style of options. Most things are in a similar spot in terms of steps to get there, but the whole experience is much nicer.<br>• Updated launch screen now that there are multiple themes and the original one doesn’t fit the purpose anymore.<br>• Added ability to add comments to Movies, Shows, Seasons, Episodes, and Lists (personal and public, where applicable). Includes support for editing and deleting your comments where applicable.<br>• Added support to view all comments for Seasons, Episodes and Lists (could already do so for Movies and Shows).<br>• Added support for copying the description for Movies, Shows, Seasons, Episodes and People. Tap-hold to bring up an option to copy.<br>• Added ability to remove all plays of Movies and Episodes, along ability to remove all plays of episodes in a Show or all episodes in a Season. You can do this from the overview screens and from the \"Last Play\" filters in the History screen.<br>• Adjusted the list of episodes in the Season overview to allow adding to history directly from there rather than entering the Episode overview.<br>• Added logic so that when you try to add an episode within the Season overview to your history, you’ll be prompted for the option to add all prior unwatched episodes of that season to your history also.<br>• Fixed an issue with Shows thinking they were on a Custom List if an Episode of that Show was on the List already, making it impossible to add it to the list without removing the Episode first.<br>• Fixed issue causing List Creation screen to not dismiss after creating a list.<br>• Calendar tab now includes movies to be consistent with the Upcoming Schedule section of the Dashboard.<br>• Calendar tab now displays status icons for the items (whether you’ve watched, collected, added to watch list etc.).<br>• Fixed issue where you could get stuck in the calendar screen when opened via “See more” on the Dashboard’s Upcoming Schedule section.<br>• Pull to refresh added to Explore sections.<br>• Fixed appearance of the Watch List filter button when filters are active in the Light theme.<br>• A bunch of other appearance fixes for different elements in themes."},{"version_id":"830185866","version_name":"1.8","version_date":"2019-02-04 22:47:29.000 +0800","version_description":"• Added an alternative to the horizontal Up next to watch section that can go vertically within the Dashboard. Adjust the “Vertical List” setting via the more button on that section (•••). By default it will have a toggle to see more/less, but there’s an option to have it always expanded also.<br>• Improved likelihood of recently aired episodes showing up in your Up Next section. Sometimes there was a large delay due to some issues out of the app’s control in regards to how soon that information is available. More improvements will be made in the future, due to requiring some larger changes.<br>•&nbsp;Fixed some issues where the calendar would display yesterday's items, or was missing some items, when it wasn't supposed to do either of those things. The option to explicitly start from \"Yesterday\" is still a thing, but overall the contents of the calendar should be accurate now.<br>•&nbsp;The calendar tab list layout now shows the status icons of the episodes, ie. watched, collected, watch listed, your rating.<br>•&nbsp;Adjusted some default settings, such as Theme now defaults to Dark, and Up next section defaults to showing the behind count which can both be set back if preferable.<br>• Support for editing Custom List details.<br>• Custom Lists can now be sorted by rating, and votes. Both Watch List and Custom Lists can now be sorted by popularity (based on rating and votes together).<br>• Fixed issue with people not showing up correctly in Grid Layout Custom Lists.<br>• Fixed issue with scrolling to top via not working as expected on some tabs.<br>• Support for importing from IMDb History/Ratings. See more information in the screen via Profile &gt; Settings &gt; Import from IMDb.<br>•&nbsp;Fixed issue with screen titles in some places not showing up on iOS 10.<br><br>Thanks to everyone who’s submitted feedback and suggestions, and thanks for your patience in resolving those."},{"version_id":"830556349","version_name":"1.9","version_date":"2019-03-10 03:32:30.000 +0800","version_description":"• Added the ability to switch default actions of the main buttons within viewers, so that you can make them \"Add Now\", or \"At Release Date” etc. instantly. You can always fall back to the full list of options by tap-holding on the button. Adjustments can be made from Profile &gt; Settings &gt; Button Behavior.<br>• Added some loading indicators while waiting for certain actions to complete, such as adding items to your History or Watch List, to avoid not knowing whether it's doing anything when taking those actions.<br>• Added some basic support for the Trakt \"Progress Reset\" VIP feature, meaning those reset shows will appear in Up next to watch etc. Currently you experience data missing for those shows, such as the Episode name, but otherwise should work as expected. Please let me know if you run into any issues with it.<br>• As Watcht is free to use and doesn't contain any ads, I've added a contributions section, via Profile &gt; Settings &gt; Contribute, as an optional way to say thanks for the app.<br>• Fixed an issue causing some actions on Shows with a text identifier which was actually just numbers, such as the Show \"24\", being treated as actions on a different Show with that value as it’s actual unique numeric identifier.<br>• Added support for sorting your list of Custom Lists, along with the ability to rearrange the rank order while sorted by rank.<br>• Added the ability to sort List items by popularity.<br>• Added the ability to swipe right on the vertical list of Up next Episodes in order to mark them as watched \"now\". You can also swipe left for the option to hide.<br>• Fixed number of days count in calendar headers being wrong in some cases, again. It should be correct now!<br>• Added ability to skip between months and years while choosing a date during History addition etc.<br>• Added more accessible link to viewing the trailer for Movies and Shows within their overviews. All available links still within the Share options.<br>• Added links in the settings to the Watcht App Store listing, Trakt itself, and the Trakt API status.<br>• Added a link in settings to the Trakt General Settings, most of which are not possible to be changed by Watcht, such as your username, profile picture etc.<br>• Added the ability to unhide Shows that have been hidden from your Show Progress, via Profile &gt; ••• &gt; View Hidden Show Progress Items. Additionally, you can use the Hidden Items on Trakt option, which includes the other sections such as the Calendar, Reset Progress sections which haven't/can't, respectively, be implemented just yet.<br>• Made the ability to Rate items more obvious.<br>• Added ability to update your Ratings without having to remove them first.<br>• The Rating picker now starts from the middle value (5), rather than the start value (1), or from your previous Rating value if you're updating it.<br>• Added additional filtering to your list of Ratings, so you can view, for example, all your Ratings of 10 (or any other specific Rating value) by their added date.<br>• Fixed some logic with comments which were marked as spoilers yet had their content shown. Instead, only specific spoiler markdown tags were being taken into account as to whether it would hide the content.<br>• Fixed a crash while trying to save images such as the Poster and Banner images to your Photos.<br>• Fixed an issue with your own Profile not displaying some information correctly, such as your profile picture, in the case where your account is marked as private.<br>• Added ability to see the current watching status of another user within their Profile.<br>• Added support for removing all Episodes of a Show/Season from your Collection.<br>• Fixed some other various UI layout issues, including some only seen while displaying right-to-left languages.<br><br>Thanks again to everyone who has sent feedback, suggestions, bugs, and submitted ratings and/or reviews. Please continue to enjoy the app, and further updates, and if you'd like to say thanks, head over to the Contribute section within the Settings."},{"version_id":"830559588","version_name":"1.9.1","version_date":"2019-03-11 13:59:21.000 +0800","version_description":"•&nbsp;Quick fix for some issues with the basic Trakt \"Reset Progress\" VIP feature support, added in 1.9, being out of sync in some cases.<br><br>Some other noteworthy changes in 1.9:<br>•&nbsp;Ability to switch default actions of the main buttons within overviews to make them \"Add Now\", or \"At Release Date\" etc.<br>• As Watcht is free and doesn’t contain any ads, I've added contribution section in the settings as an optional way to say thanks for the app.<br>•&nbsp;Sorting/Reordering of your list of Custom Lists.<br>•&nbsp;Swipe right on Episodes in the vertical list of the Up next to watch section for a gesture based history addition action.<br><br>If you haven't seen them, for a full list of changes from 1.9 (there were a lot, actually too many to even include them all here due to the length on top of the actual changes for this version), check out the Version History section's release notes for 1.9.<br><br>Thanks again to everyone who has sent feedback, suggestions, bugs, and submitted ratings and/or reviews. Please continue to enjoy the app, and further updates, and if you'd like to say thanks, head over to the Contribute section within the Settings."},{"version_id":"831128823","version_name":"1.10","version_date":"2019-04-29 02:25:57.000 +0800","version_description":"• Now displaying IMDb, Rotten Tomatoes, and Metacritic ratings for Movies and Shows, where available, within their overviews. Additionally, added the DVD release date for Movies, where available.<br>• Support for filtering Explore list results by things such as year, genre, country and ratings. Additionally you can filter results by your personal watch status.<br>• Support for filtering and sorting custom lists, personal and otherwise, by your personal watch status.<br>• Updated Watch List filtering to be similar to the Explore layout with separate lists rather than turning types on and off.<br>• Added option in the Settings to display the count of items for the Watch List tabs.<br>• Added Setting with the ability to choose default Explore Tab (Switch between Movies and TV Shows tab).<br>• Added support for viewing emoji in comments since the Trakt API started supporting shortcode emoji such as :heart: to display the heart emoji. Using emoji when creating comments is also supported, without needing to use the shortcode, it's up to you!<br>• Fixed an issue potentially preventing the ability to edit or delete your own comments.<br>• Fixed an issue relating to inaccurate search results with content that included apostrophes.<br>• Added support for importing “TV Movies” and “TV Mini Series” through the IMDb importer, along with batching requests to avoid issues when importing a lot of items.<br>• Added the ability to turn off the “Readable” layout, which when turned off will extend content to the edges of the screen on wide devices such as the 12.9” iPad Pro. Adjusted via Profile &gt; Settings &gt; Readable Layout. A restart of the app is required for that toggle to kick in.<br>• Added an option to switch to a “condensed” layout within the Watcht Show Progress Screen. Toggle it within that screen’s more button (•••) options.<br>• Added option to sort the Watched Progress screen by recently/previously aired, as you can with the Up next to watch section.<br>• Added support to display the total number of episodes behind as a badge on the app. Toggled via Profile &gt; Settings &gt;  Episode Behind Count App Badge.<br>• Added a “See all” link to your history via the “Recently Watched” section on the Dashboard.<br>• Added support for swiping on items in several list style screens to display an option to remove items from the list as an alternative to tap-holding for options. Screens include History, Collection, and Ratings.<br>• Added support for viewing the list of your “Liked” lists. Accessed from Lists &gt; Tap Title Button &gt; Switch to Liked Lists.<br><br>As usual, thanks to everyone who has sent feedback, suggestions, bugs, and submitted ratings and/or reviews. Also a big thank you to everyone who has contributed any amount. Your support means a lot! Please continue to enjoy the app!"},{"version_id":"831528381","version_name":"1.11","version_date":"2019-06-03 04:29:20.000 +0800","version_description":"• Added full support for displaying cast and crew for Movies and Shows, as well as for cast and crew specific to each Season and Episode, where available.<br>•&nbsp;Added a \"See all\" to the credits for people (actors, etc.) along with filtering by your personal watched status and some basic sorting for them also.<br>• Added filtering and sorting by personal watch status to the Watch List.<br>• Fixed issue with episode behind badge count including hidden episodes.<br>• Fixed issue causing Rotten Tomatoes ratings to truncate the percent value.<br>• Sorted the display of Lists shown when adding items to them via the Overview screens.<br>• Fixed an issue with the current Watch List tab changing in some cases after adding or removing items.<br>•&nbsp;Added additional source for TV Show banner images.<br>• Added support to view more poster/banner images for Movies, Shows, Seasons, and Episodes, where available. Tap the respective images within the Overviews and swipe to view more, or tap the “See All” button to preview all of them.<br>• Fixed an issue causing the “Begin Calendar from Yesterday” not actually working in some cases within the Calendar.<br>• Moved the Settings option to hide comments in Overviews into a new section within Settings called “Spoilers”.<br>• Added support to hide episode and season screenshot banner images from being displayed when you haven’t watched it yet to avoid spoilers. Accessible within the Spoilers section of Settings.<br>• Fixed an issue causing some episode screenshots to be blurry within Overviews.<br><br>As usual, thank you to everyone who has sent feedback, suggestions, bugs, ratings and/or reviews, and any amount of contribution!"},{"version_id":"832088799","version_name":"1.12","version_date":"2019-07-22 03:18:38.000 +0800","version_description":"•&nbsp;Added support for searching for Episodes, People, Lists, and Movies or Shows individually, in addition to both Movies and Shows as usual.<br>•&nbsp;Added support for filtering by Collection and Rating status in Explore, Watch List, and Custom Lists.<br>•&nbsp;Added support to Explore Filters to filter values such as Genres, Countries etc by different methods, such as “All” or “None” in addition to the existing default “Any”.<br>•&nbsp;Watch List filters are now saved and applied the next time you open the app after it was closed or quit.<br>•&nbsp;Fixed an issue where cast and crew weren’t displayed if there was no regular series cast, and instead only guest stars.<br>•&nbsp;Added support for “Large Mode” in the Poster Grid Layout, so that where previously you might see 3 or 6 posters in a row, you’ll now see 2 or 4. Accessible via Profile &gt; Settings &gt; Grid Layout &gt; toggle Large Mode.<br>•&nbsp;Updated support for link opening behaviour to include opening in Google Chrome.<br>•&nbsp;Added basic support for liking and unliking Custom Lists via the more button (•••) in those screens. Note that the app doesn’t currently keep your liked lists in sync, so it always shows options for liking AND unliking, however the action is saved on Trakt, and liked lists will show up in the Liked List section (via Watch List tab &gt; Lists &gt; Tap title &gt; Switch to Liked Lists).<br>•&nbsp;Added support for swiping to delete items from custom lists.<br>•&nbsp;Made a few changes to try address some crashes. Unfortunately haven’t run into them while testing, so it’s difficult to tell if they’ve been fixed. Apologies to anyone experiencing those!<br><br>As usual, thank you to everyone who has sent feedback, suggestions, bugs, ratings and/or reviews, and contributed any amount!"},{"version_id":"832690875","version_name":"1.13","version_date":"2019-09-09 20:48:50.000 +0800","version_description":"•&nbsp;Added local results to Search when searching for Movies and/or Shows. Currently all “Watched” items (Movies/Shows) will be returned locally straight away, alongside results as usual from the Trakt API.<br>•&nbsp;Adjusted the way episode air dates are displayed and used for US based Shows in US Time Zones so they match more directly with the expected US Time Zone airings and what is seen on the Trakt website. This includes the calendar notification alerts.<br>•&nbsp;Added a button within Movie/Show overviews for quick access to “Where To Watch” via Trakt. All items have the button, as there’s currently no way to check if a service exists. Tapping on the services should redirect you to the them as expected.<br>•&nbsp;Updated some Image retrieval behaviour so that images fall back to other services if some are not available (such as TMDb not being accessible, meaning images will be retrieved from Fanart.tv or TVDB where applicable).<br>•&nbsp;Updated some image retrieval behaviour to support languages other than just english so that items without english images will actually have an image now, rather than none.<br>•&nbsp;Added support for sorting Watch List by random.<br>•&nbsp;Added support for filtering cancelled and/or ended shows from the Show Progress list.<br>•&nbsp;Added total unique play counts to the Show and Season overviews when you’ve watched episodes more than once.<br>•&nbsp;Fixed an issue where some Episode screenshot images were being shown in specific sections of the Show and Season overviews when they shouldn’t be (if toggled off in the settings).<br>•&nbsp;Made a few changes to refresh certain sections of the Dashboard and Profile (such as Recently watched) when some actions are taken so that they’re less likely to be stale and require a pull to refresh.<br><br>As usual, thank you to everyone who has sent feedback, suggestions, bugs, ratings and/or reviews, and any amount of contribution!"},{"version_id":"832973756","version_name":"1.14","version_date":"2019-09-30 20:24:05.000 +0800","version_description":"• Support for iOS 13 Dark Mode, including a new “Pure Black” Theme. You may need to change your theme manually to use the System modes if you’ve changed your theme before.<br>• Added support to the List status icons on items to include a badge count of how many lists they’re on (Watch List + Custom Lists). There’s an option in the Settings to switch the behaviour so that you can turn off the badge, or have a separate badge for if the item is on your Watch List. <br>• Local search results for movies and shows now include more than just your watched items, and should present more relevant items first, such as those on your Watch List or Shows that are in progress. <br>• Added support for filtering Explore, Watch List, and Custom lists by items that are on your Watch List and/or Custom Lists. Additionally added the ability to filter by items which aren’t watched, collected, rated, or listed. <br>• Added the option to display the Season poster as an alternative to the Show poster in the Up Next section of the Dashboard. <br>• Added support to be notified about calendar episode notifications at some time after the episode aired. <br>• Added total aired episode count to Show and Season overviews next to their total runtime.<br>• Sorting items by title now ignores prefixed words such as “The”, “A” and “An”.<br><br>As usual, thank you to everyone who has sent feedback, suggestions, bugs, ratings and/or reviews, and any amount of contribution!"},{"version_id":"833398023","version_name":"1.14.1","version_date":"2019-10-30 17:36:12.000 +0800","version_description":"•&nbsp;Fixed an issue causing the a crash when attempting to search for people when search was in Grid Layout.<br>•&nbsp;Fixed an issue causing the app to freeze when displaying comments in certain cases.<br>•&nbsp;Fixed an issue causing episode notifications to not be delivered if you had a lot of episodes coming up all at the same time.<br>•&nbsp;Adjusted some US episode air times due to being incorrect for some time zones, and added support in Settings to override the time zone used for US episodes. <br>•&nbsp;Made a few changes to address more potential crashes. Apologies again to anyone experiences those! Don't hesitate to get in touch with any details that might help resolve those.<br><br>As usual, thanks to everyone who’s sent feedback, suggestions, bugs, ratings and/or reviews, and contributed any amount!"},{"version_id":"833964028","version_name":"1.15","version_date":"2019-12-11 20:51:06.000 +0800","version_description":"•&nbsp;Added support for calendar movie notifications, so you can be alerted when a movie is premiering. <br>•&nbsp;Added initial support for iOS 13 context menus. Many Movies, Shows, Seasons, and Episodes (such as Explore, and within Overviews) should allow you to bring up context menus with actions and a preview, alongside any previous actions you could take by long-pressing them.<br>•&nbsp;Added certification to TV Show, Season, and Episode overviews.<br>•&nbsp;Fixed an issue with the dates displayed by the calendar being incorrect in some cases where Time Zone adjustments are involved.<br>•&nbsp;Added support for hiding the “Lists” section of the Movie, TV Show, Season, and Episode overviews. Toggled via Profile &gt; Settings &gt; List Section Display.<br>•&nbsp;Fixed an issue where Custom List Item counts could become out of sync in certain cases.<br>•&nbsp;More adjustments to improve stability for those who’re experiencing crashes.<br>•&nbsp;Fixed an issue causing Import from IMDb not working as expected when importing more than 50 items into History or Watch List. <br>•&nbsp;Added support for more IMDb item types to the IMDb importer.<br>•&nbsp;Added support for using the Season poster as an alternative to the Show poster for the upcoming schedule episodes.<br>•&nbsp;Added support for hiding the upcoming schedule from the Dashboard, via Settings.<br>•&nbsp;Made a change to refresh the calendar and upcoming schedule at certain times to avoid showing stale (or yesterdays) information when returning to the app.<br>•&nbsp;Added a link to Rotten Tomatoes via the sharing options within Movie, Show, Season and Episode overviews.<br>•&nbsp;Fixed an issue causing Watch List filters to sometimes not be applied correctly when switching between sections.<br><br>As usual, thanks to everyone who’s sent feedback, suggestions, bugs, ratings, and/or reviews, and contributed any amount!"},{"version_id":"834116471","version_name":"1.15.1","version_date":"2019-12-23 21:53:22.000 +0800","version_description":"•&nbsp;Fixed an issue causing the the Explore Filter’s rating parameters to not be used as expected.<br>•&nbsp;Fixed an issue potentially causing a crash for some users during a sync.<br><br>Changes from 1.15:<br>•&nbsp;Added support for calendar movie notifications, so you can be alerted when a movie is premiering. <br>•&nbsp;Added initial support for iOS 13 context menus. Many Movies, Shows, Seasons, and Episodes (such as Explore, and within Overviews) should allow you to bring up context menus with actions and a preview, alongside any previous actions you could take by long-pressing them.<br>•&nbsp;Added certification to TV Show, Season, and Episode overviews.<br>•&nbsp;Fixed an issue with the dates displayed by the calendar being incorrect in some cases where Time Zone adjustments are involved.<br>•&nbsp;Added support for hiding the “Lists” section of the Movie, TV Show, Season, and Episode overviews. Toggled via Profile &gt; Settings &gt; List Section Display.<br>•&nbsp;Fixed an issue where Custom List Item counts could become out of sync in certain cases.<br>•&nbsp;More adjustments to improve stability for those who’re experiencing crashes.<br>•&nbsp;Fixed an issue causing Import from IMDb not working as expected when importing more than 50 items into History or Watch List. <br>•&nbsp;Added support for more IMDb item types to the IMDb importer.<br>•&nbsp;Added support for using the Season poster as an alternative to the Show poster for the upcoming schedule episodes.<br>•&nbsp;Added support for hiding the upcoming schedule from the Dashboard, via Settings.<br>•&nbsp;Made a change to refresh the calendar and upcoming schedule at certain times to avoid showing stale (or yesterdays) information when returning to the app.<br>•&nbsp;Added a link to Rotten Tomatoes via the sharing options within Movie, Show, Season and Episode overviews.<br>•&nbsp;Fixed an issue causing Watch List filters to sometimes not be applied correctly when switching between sections.<br><br>As usual, thanks to everyone who’s sent feedback, suggestions, bugs, ratings, and/or reviews, and contributed any amount!"},{"version_id":"834428389","version_name":"1.16","version_date":"2020-01-21 10:49:10.000 +0800","version_description":"•&nbsp;Filters applied in Explore are now saved across launch.<br>•&nbsp;Added support for filtering the calendar tab in the same way Explore can be filtered.<br>•&nbsp;Added support for sorting list items by individual runtime instead of total runtime, mainly for sorting shows by their episode runtime.<br>•&nbsp;Added the ability to hide the “At A Glance” section of the Dashboard. Toggle in Settings.<br>•&nbsp;Updated the way adding items to custom lists works so that you can add them to multiple lists more easily.<br>•&nbsp;Updated the Grid layout to be more dynamic based on the available space rather than being kept to a certain number of columns.<br>•&nbsp;Added the ability to “Select All” in addition to “Clear All” in filter info selection screens.<br>•&nbsp;Importing from IMDb now supports importing the Ratings data into your History by using the rated date where previously it would require a Created date from the IMDb Watch List or Check in List data.<br>•&nbsp;Fixed an issue causing “Hide Show from Calendar” not working from the new context menu.<br>•&nbsp;Added support to lists for filtering by release date.<br>•&nbsp;Fixed an issue with the ordering of cast/crew credits using only the release year rather than the actual release date.<br>•&nbsp;Fixed an issue with action feedback alerts not being visible when the system Reduce Transparency setting is on.<br>•&nbsp;Allow continuing manually if no “Where to Watch” info is found, for in the case you need to accept terms before proceeding.<br><br>As usual, thanks to everyone who’s sent feedback, suggestions, bugs, ratings, and/or reviews, and contributed any amount!"},{"version_id":"834499703","version_name":"1.16.1","version_date":"2020-01-27 20:29:10.000 +0800","version_description":"•&nbsp;Fixed an issue causing the one-tap “Add to Watch List” actions not to work.<br>•&nbsp;Added support for filtering unwatched shows from Upcoming Schedule and/or Episode Notifications. Toggle in Settings via Profile. Schedule toggle is in the Preferences section, and Notifications toggle is in the Notifications section. <br>•&nbsp;Added list descriptions to the list screens.<br>•&nbsp;Added support for filtering by rating votes in Explore and Calendar.<br><br>Changes from 1.16:<br>•&nbsp;Filters applied in Explore are now saved across launch.<br>•&nbsp;Added support for filtering the calendar tab in the same way Explore can be filtered.<br>•&nbsp;Added support for sorting list items by individual runtime instead of total runtime, mainly for sorting shows by their episode runtime.<br>•&nbsp;Added the ability to hide the “At A Glance” section of the Dashboard. Toggle in Settings.<br>•&nbsp;Updated the way adding items to custom lists works so that you can add them to multiple lists more easily.<br>•&nbsp;Updated the Grid layout to be more dynamic based on the available space rather than being kept to a certain number of columns.<br>•&nbsp;Added the ability to “Select All” in addition to “Clear All” in filter info selection screens.<br>•&nbsp;Importing from IMDb now supports importing the Ratings data into your History by using the rated date where previously it would require a Created date from the IMDb Watch List or Check in List data.<br>•&nbsp;Fixed an issue causing “Hide Show from Calendar” not working from the new context menu.<br>•&nbsp;Added support to lists for filtering by release date.<br>•&nbsp;Fixed an issue with the ordering of cast/crew credits using only the release year rather than the actual release date.<br>•&nbsp;Fixed an issue with action feedback alerts not being visible when the system Reduce Transparency setting is on.<br>•&nbsp;Allow continuing manually if no “Where to Watch” info is found, for in the case you need to accept terms before proceeding.<br><br>As usual, thanks to everyone who’s sent feedback, suggestions, bugs, ratings, and/or reviews, and contributed any amount!"},{"version_id":"835073284","version_name":"1.17.1","version_date":"2020-03-12 12:50:57.000 +0800","version_description":"•&nbsp;Added alternative App Icons with various different colours - check them out via Settings.<br>•&nbsp;Added support for getting translated titles, taglines, and overviews for Movies and Shows, where available. It’s off by default and can be turned on via Settings at the bottom of the Preferences section. Note that not all the available languages will have translations available via Trakt.<br>•&nbsp;Added support for a Grid-only Up next section via the more button (•••) on the Dashboard’s Up next to watch section. This feature removes the other items from the Dashboard screen but can be turned off and on pretty easily.<br>•&nbsp;Added a basic “Smart” sort to Up next sorting, which keeps the latest watched items near the top, and then after a period of time it will move toward the end of the list. Between the latest and end will be shows with new episodes which have had new episodes released within the last month or so.<br>•&nbsp;Added support for copying titles and tag lines in overview screens (long press on them to bring up an option to copy)."}]