[{"version_id":"827578908","version_name":"1.0.0","version_date":"2018-12-19 21:51:36.000 +0800","version_description":""},{"version_id":"829950757","version_name":"1.1.0","version_date":"2019-02-01 15:44:25.000 +0800","version_description":"We've updated your colouring pages with two royal sisters, a strapping iceman, his reindeer, a snowman who loves hugs, a too-good-to-be-true prince and much more. Yes, FROZEN has arrived into Disney Coloring World!<br><br>Who will you color... Elsa, Anna Olaf, Kristoff, Sven, Snowgies, or Hans?<br>There's so much more Frozen characters to unlock and discover.<br><br>But that's not all. Once you've finished coloring, transport yourself to Arandelle’s fair kingdom. This update features a stunning, beautifully constructed, interactive playset. It's Elsa's Ice Palace!<br><br>Hang out in Elsa's Palace, climb a staircase made from ice! There are so many fun things to discover. Explore and relive Disney's Frozen Magic!"},{"version_id":"830281872","version_name":"2.0.0","version_date":"2019-03-06 17:06:38.000 +0800","version_description":"We've made big improvements to the coloring tools. Updated brushes textures and tools will give you much more artistic freedom and control. The app now works great with Apple Pencil too!<br><br>The Parr family seem ordinary but they have an incredible secret. They have superpowers! Yes, when there's trouble, it's time to call on the Incredibles!  The whole family is here: Elastigirl, Mr. Incredible, Violet, Dash, and of course baby Jack-Jack. <br><br>Color and customize your favorite superheroes and super-villains from both The Incredibles movies. Discover and paint characters like Syndrome, Frozone, Edna Mode, Screenslaver and many more!<br><br>But that's not all. Once you've finished coloring play out your own exciting, hilarious Incredible adventures in our new interactive playset - SYNDROME'S LAIR! There's so many cool things for you to discover inside the volcano.<br><br>- Will you be a super or a villain?<br>- Take a ride on the monorail<br>- Do you dare touch the hot lava?<br>- Who will you trap in the lightning field?<br>- Hidden secrets to discover!"},{"version_id":"830532200","version_name":"2.1.0","version_date":"2019-03-28 09:04:11.000 +0800","version_description":"We've added the ability to draw and paint your own versions of Disney characters and props! Place them inside the playset of your choosing.<br>Unlock your creativity with our powerful, easy-to-use design tools and sticker templates. This gives you even more artistic freedom and artistic control. <br><br>A shy and lovable circus elephant with supersized ears has arrived. We've aded new stickers from the classic movie Dumbo.<br><br>There's a new 3D playset too. The Imperial Palace is the grandest monument in all of China. Now this magnificent palace from the Mulan movie is yours to explore!<br>- Set off fireworks from the balcony!<br>- Enjoy a shadow puppet show from The Imperial Study.<br>- Lots more surprises and hidden interactions to discover."},{"version_id":"830961758","version_name":"2.2.0","version_date":"2019-04-30 17:00:23.000 +0800","version_description":"Aladdin, Princess Jasmine and The Genie are here!<br>- New stickers featuring all your favorite characters from Aladdin.<br>- Place your stickers around the new 3D playset: Jasmine's Palace!<br>- Fill the throne room with music and dance, then find its hidden secret.<br>- Wonder at the riches in the Treasure Room, including the magic lamp.<br>- Cook a feast fit for a Sultan in the kitchen!<br>- Can you find the mouse in the dungeon?<br>- And lots more!"},{"version_id":"831336037","version_name":"2.2.1","version_date":"2019-05-17 21:27:32.000 +0800","version_description":"Aladdin, Princess Jasmine and The Genie are here!<br>- New stickers featuring all your favorite characters from Aladdin.<br>- Place your stickers around the new 3D playset: Jasmine's Palace!<br>- Fill the throne room with music and dance, then find its hidden secret.<br>- Wonder at the riches in the Treasure Room, including the magic lamp.<br>- Cook a feast fit for a Sultan in the kitchen!<br>- Can you find the mouse in the dungeon?<br>- And lots more!"},{"version_id":"831484060","version_name":"3.0.0","version_date":"2019-06-21 05:07:30.000 +0800","version_description":"Buzz, Woody, Bo peep and all the Toy Story characters<br>- Enjoy the our new Carnival playset, including interactive games for the first time<br>- Fill it up with Toy Story characters, including Duke Caboom, Forky, Ducky and Bunny<br>- Get your angles right on the Wheeee Ball stand!<br>- Keep space itself clear with Star Adventurer!<br>- Knock over all those ducks in Kersplash!<br>- And lots more, check out what prizes are available as you complete each challenge"},{"version_id":"831885823","version_name":"4.1.1","version_date":"2019-12-13 19:48:33.000 +0800","version_description":"It's the holiday season! And to celebrate we've got some free festive friends for you to color and play with. Some of your favorite Disney Princesses and Classic characters are back with cozy new Christmas coloring pages. In fact, your app gets a complete winter wonderland makeover during the holiday season. Have a magical time!"},{"version_id":"831885823","version_name":"3.1.0","version_date":"2019-07-18 19:56:10.000 +0800","version_description":"Simba, Nala, Zazu and Scar are here. And so are a whole cast of Lion King characters<br>- Explore Pride Rock. Who will you chose to be lifted aloft by Rafiki to join The Circle Of Life?<br>- What animal will you discover drinking from the river?<br>- Hang out and interact with The Tree Of Life<br>- Make beautiful music and set off geysers in The Elephant Graveyard."},{"version_id":"831885823","version_name":"3.3.0","version_date":"2019-10-03 09:02:54.000 +0800","version_description":"We're excited to announce that Sleeping Beauty's castle is here. Princess Aurora, Flora, Fauna, Merryweather, and of course the evil Maleficent have arrived. The entire cast of this classic Disney movie are yours to color and play with in our amazing new playset:<br>- Have a fun food fight in the dining hall<br>- Discover the spooky surprise in the stairway<br>- Beware Maleficent's evil magic in the throne room<br>- And much more to discover<br>And that's not all! To celebrate Halloween we've got spooky new stickers for limited time only for FREE users including characters from Vampirina!<br>In fact your app gets a complete spooky makeover during the trick or treat season. We hope it's mostly treats!"},{"version_id":"832395853","version_name":"3.2.0","version_date":"2019-08-29 08:02:48.000 +0800","version_description":"We're so rumbly in our tumblys! Winnie-the-Pooh Tigger, Eeyore, Piglet, Owl, Rabbit, Kanga, and Roo are here! We've added beautifully rendered new stickers from Hundred Acre Wood for you to color and play with."},{"version_id":"832914330","version_name":"3.3.0","version_date":"2019-10-03 09:02:54.000 +0800","version_description":"We're excited to announce that Sleeping Beauty's castle is here. Princess Aurora, Flora, Fauna, Merryweather, and of course the evil Maleficent have arrived. The entire cast of this classic Disney movie are yours to color and play with in our amazing new playset:<br>- Have a fun food fight in the dining hall<br>- Discover the spooky surprise in the stairway<br>- Beware Maleficent's evil magic in the throne room<br>- And much more to discover<br>And that's not all! To celebrate Halloween we've got spooky new stickers for limited time only for FREE users including characters from Vampirina!<br>In fact your app gets a complete spooky makeover during the trick or treat season. We hope it's mostly treats!"},{"version_id":"833192168","version_name":"3.4.0","version_date":"2019-11-04 10:09:42.000 +0800","version_description":"An adorable cocker spaniel named Lady and a street-smart, schnauzer called Tramp have arrived. We’ve updated your coloring templates with lots of characters and poses from Lady and the Tramp! We can't wait for the upcoming live-action version of this Disney classic."},{"version_id":"833475660","version_name":"4.0.0","version_date":"2019-11-21 10:01:47.000 +0800","version_description":"Frozen is here just in time for the holidays! Color and paint Elsa, Anna, Kristoff, Sven and, of course, the delightful Olaf."},{"version_id":"833984617","version_name":"4.1.1","version_date":"2019-12-13 19:48:33.000 +0800","version_description":"It's the holiday season! And to celebrate we've got some free festive friends for you to color and play with. Some of your favorite Disney Princesses and Classic characters are back with cozy new Christmas coloring pages. In fact, your app gets a complete winter wonderland makeover during the holiday season. Have a magical time!"},{"version_id":"834397444","version_name":"4.2.1","version_date":"2020-01-23 10:04:41.000 +0800","version_description":"Journey into the unknown in Frozen 2's Enchanted Forest playset!<br>- Take a boat ride along the river<br>- Reveal the ancient elemental spirits with the monoliths<br>- Beware the Earth Giants slumbering amongst the trees!<br>- With much, much more to discover!"},{"version_id":"834500583","version_name":"4.3.0","version_date":"2020-02-07 22:22:35.000 +0800","version_description":"Follow your heart with Disney Coloring World's new Valentine's sticker pack. Make a fairytale come true with this new content featuring brand new stickers from Frozen 2!"},{"version_id":"834796211","version_name":"5.0.0","version_date":"","version_description":""},{"version_id":"835134874","version_name":"5.0.1","version_date":"2020-03-19 02:43:32.000 +0800","version_description":"Make some noise with 2 new sticker packs! <br>- Celebrate the release of Disney Pixar’s Onward and become your own quest master with elf brothers Ian and Barley Lightfoot in this new sticker pack<br>- Monsters make the best friends in a new sticker pack including your scariest favorites; Mike, Sulley and the adorable Boo from Monsters, Inc. and Monsters University!"},{"version_id":"835329874","version_name":"5.1.0","version_date":"2020-03-06 15:13:08.000 +0800","version_description":"Make some noise with 2 new sticker packs! <br>- Celebrate the release of Disney Pixar’s Onward and become your own quest master with elf brothers Ian and Barley Lightfoot in this new sticker pack<br>- Monsters make the best friends in a new sticker pack including your scariest favorites; Mike, Sulley and the adorable Boo from Monsters, Inc. and Monsters University!"},{"version_id":"835622946","version_name":"5.2.0","version_date":"2020-05-07 09:01:34.000 +0800","version_description":"On your bark...get set...go! <br>This paw-some update is packed full of new four-legged friends from Puppy Dog Pals and Whisker Haven Tales with the Palace Pets! In 2 new sticker packs that feature all your furry favorites from Bingo, Rolly and A.R.F to Bibbidy, Seashell and Blondie.  A cute'n'cuddly update for all!<br><br>Having trouble reaching those hard to color details? We've increased zooming into all coloring pages! Now you can color every diamond in a princess's crown just the way you wish."},{"version_id":"835859948","version_name":"5.3.0","version_date":"2020-06-11 09:10:07.000 +0800","version_description":"Say Aloha to Lilo and Stitch and welcome her royal highness Princess Sofia the First in two new sticker packs!<br>We're adding new coloring tools all the time! Get your magic sparkle on with the brand new Glitter Brush!"},{"version_id":"836379249","version_name":"5.4.0","version_date":"2020-07-02 09:07:16.000 +0800","version_description":"Ride waves with Moana in her very own sticker pack and get ready for some summer fun with new stickers of Mickey Mouse and friends - Adventures await! We've also added a new coloring tool to this month's update. Create dazzling masterpieces with our new Pattern Brush!"},{"version_id":"836687383","version_name":"5.5.0","version_date":"2020-07-31 11:17:55.000 +0800","version_description":"In this update we've added 22 new Princess and the Frog stickers: from Tiana and Naveen, to the musical alligator, Louis! Dream big and get creative!"},{"version_id":"837314779","version_name":"5.6.0","version_date":"2020-08-27 09:00:42.000 +0800","version_description":"-We know that sometimes is hard for little fingers to color inside the lines. That’s why we’ve introduced a new feature which helps them do just that. You can turn it on or off really easily. <br>-We’ve also added an exciting new sticker pack: join Phineas and Ferb on their adventures along secret agent platypus, Perry and the evil Doctor Doofenshmirtz! Create a secret mission of your own!"},{"version_id":"837561181","version_name":"5.7.0","version_date":"2020-09-03 00:15:28.000 +0800","version_description":"Now updated with bug fixes and improvements!"},{"version_id":"837699871","version_name":"5.8.0","version_date":"2020-09-17 18:20:03.000 +0800","version_description":"In this update we've added a sparkling Cinderella sticker pack to make your dreams come true.<br>-With 25 new stickers from Gus and Jaq the helpful mice, to Lucifer the cunning cat! <br>-Watch out for the jealous stepsisters Drizella and Anastasia, and the mean stepmother Lady Tremaine. <br>-Fairy Godmother stickers are here too, to help Cinderella along with a bibbidi-bobbidi-boo!"},{"version_id":"837890425","version_name":"5.9.0","version_date":"2020-09-25 22:00:37.000 +0800","version_description":"Step into Halloween Town with the dreadfully dashing Pumpkin King Jack Skellington and his friends in this seasonal update!<br>We've added 18 new stickers from the Nightmare Before Christmas and some brand new spooky patterns to try on all your stickers; from pumpkins and spiders to Monsters’ eyes!<br>Trick or treat!"},{"version_id":"837967635","version_name":"5.9.1","version_date":"2020-10-16 09:09:52.000 +0800","version_description":"We've added new Frozen patterns to the pattern brush!"},{"version_id":"838252729","version_name":"5.9.5","version_date":"2020-11-01 10:06:03.000 +0800","version_description":"In this update we've added a brand new sticker from the Disney/Pixar film Coco! Including 16 new stickers from Miguel and Ernesto, to Dante the dog! We're also adding new patterns for the pattern brush all the time. Seize your moment and get creative!"},{"version_id":"838486109","version_name":"6.0.0","version_date":"2020-11-12 10:05:42.000 +0800","version_description":"We’re excited to announce that the Magic Kingdom has arrived! <br>In this amazing new play set you can:<br><br>-Use the watering can to sprinkle some pixie dust and see what will grow in the magic vegetable patch<br>-Unlock the first room of the Magic Kingdom, the main entrance hall <br>-Explore the castle inside and out to discover hidden magic and creative possibilities!<br>-We will be updating the castle and revealing more rooms in future updates"},{"version_id":"839224830","version_name":"6.0.1","version_date":"2020-11-18 09:58:44.000 +0800","version_description":"We’re excited to announce that the Magic Kingdom has arrived!\n<br>In this amazing new play set you can:\n<br>\n<br>-Unlock the first room of the Magic Kingdom, the main entrance hall\n<br>-Sprinkle pixie dust using the watering can to see what will grow in the magic vegetable patch\n<br>-Create a winter wonderland when the seasons change\n<br>-Explore the castle inside and out to discover hidden magic and creative possibilities!\n<br>-We will be updating the castle and revealing more rooms in future updates"},{"version_id":"839552907","version_name":"6.1.1","version_date":"2020-12-10 10:02:23.000 +0800","version_description":"- It’s winter time. Come and celebrate with your favorite festive princesses. From Merida and Rapunzel getting ready for Christmas; to Mulan, Pocahontas and Jasmine wrapping up in new costumes to color. This fun new sticker pack is a real winter warmer!<br> <br>- With the seasons changing from fall to winter that can only mean it’s nearly time to give the Magic Kingdom playset a make over! Tap around with the magic paint brush to cast a seasonal spell and create a snowy scene. Paint away the fall colors to create a winter wonderland with the season switcher game!<br> <br>-Get cozy and get creative!"},{"version_id":"839663752","version_name":"6.2.0","version_date":"2020-12-24 09:04:47.000 +0800","version_description":"To celebrate the release of Disney Pixar's new feature film ‘Soul’ on Christmas Day, we have a brand new sticker pack featuring a host of new characters from Joe Gardner and his precocious pal 22, to Mr. Mittens the therapy cat. We have also added 2 new 'Soul' patterns to the pattern brush! Get ready to explore creative cosmic realms!"},{"version_id":"840039940","version_name":"6.3.0","version_date":"2021-01-21 10:08:27.000 +0800","version_description":"Join Princess Ariel under the sea with all of her finned friends in a brand new Little Mermaid sticker pack! There are 18 new stickers to enjoy. From Sebastian the crab, and Flounder the fish; to Ursula the powerful sea witch there's so much to explore. We've also added some aquatic patterns to the pattern brush for this nautical update. Find your inner artistic voice and make some waves!"},{"version_id":"840409824","version_name":"6.4.0","version_date":"2021-02-11 10:03:14.000 +0800","version_description":"It’s the Valentine’s update and we’ve got 18 brand new coloring pages full of characters who just LOVE to be bad. From Captain Hook to the Queen of Hearts. This Valentine’s will be FIERCE!<br>We’re always adding to the coloring tools with 3 new patterns for the pattern tool!"},{"version_id":"840653459","version_name":"6.5.0","version_date":"2021-03-04 15:25:37.000 +0800","version_description":"- To celebrate the release of Disney's new feature film, 'Raya and the Last Dragon', we've added 19 brand new coloring pages. Featuring a host of new characters from the fearless Raya, to the legendary last dragon Sisu, to Noi the tiny thief. <br>- We've also added 2 new 'Raya' patterns to the pattern brush! <br>- In this update we've given the glitter brush a magical make over with sparkling new rainbow colors and gradients.<br>- Find your true creative power today!"},{"version_id":"841039573","version_name":"7.0.0","version_date":"2021-03-28 09:52:06.000 +0800","version_description":"In this update we've added 8 new Princess &amp; Pets coloring pages!\n<br>We’re always adding to the coloring tools with 3 new patterns for the pattern tool!"},{"version_id":"841153446","version_name":"7.0.1","version_date":"2021-04-02 14:25:50.000 +0800","version_description":"In this update we've added 8 new Princess &amp; Pets coloring pages! <br>We’re always adding to the coloring tools with 3 new patterns for the pattern tool!"},{"version_id":"841315936","version_name":"7.1.0","version_date":"2021-04-17 04:38:37.000 +0800","version_description":"To celebrate Earth Day, we've added 9 new WALL-E coloring pages! Color your favorite characters: from WALL-E and EVE, to MO the cleaning robot and AUTO the secretive steering wheel. We've even added some planetary patterns to this update. \n<br>\n<br>The Magic Kingdom playset is getting a springtime makeover and a brand NEW room is opening up. It’s time to open the Kitchen and fall in love with cooking! From musical cakes to stinky burritos what kind of chef are you? Time to get creative.\n<br>- Explore the magic recipe book. See what ingredients are on the shelves or hidden around the kitchen. Can you create all the dishes?\n<br>- Place your characters at the table and feed them your creations! What happens when you’ve cooked with a stinky sock or a magic ukulele? \n<br>- Have you made a mess? What happens when you tap the magic mop and bucket? \n<br>With an ever-expanding castle. There’s so much to explore!\n<br>\n<br>And that's not all - We've been working on an entire new look. In this update we've added a new artist's studio coloring experience. Get painting!"},{"version_id":"841636257","version_name":"7.1.1","version_date":"2021-04-20 14:25:40.000 +0800","version_description":"To celebrate Earth Day, we've added 9 new WALL-E coloring pages! Color your favorite characters: from WALL-E and EVE, to MO the cleaning robot and AUTO the secretive steering wheel. We've even added some planetary patterns to this update. \n<br>\n<br>The Magic Kingdom playset is getting a springtime makeover and a brand NEW room is opening up. It’s time to open the Kitchen and fall in love with cooking! From musical cakes to stinky burritos what kind of chef are you? Time to get creative.\n<br>- Explore the magic recipe book. See what ingredients are on the shelves or hidden around the kitchen. Can you create all the dishes?\n<br>- Place your characters at the table and feed them your creations! What happens when you’ve cooked with a stinky sock or a magic ukulele? \n<br>- Have you made a mess? What happens when you tap the magic mop and bucket? \n<br>With an ever-expanding castle. There’s so much to explore!\n<br>\n<br>And that's not all - We've been working on an entire new look. In this update we've added a new artist's studio coloring experience. Get painting!"}]