[{"version_id":"830907856","version_name":"2.4.3","version_date":"2019-04-09 15:17:06.000 +0800","version_description":"Updates to code<br>Fixed error with Alfaxalone concentration"},{"version_id":"831077739","version_name":"2.5","version_date":"2019-05-16 01:20:56.000 +0800","version_description":"New option to save or share Calculator results as a PDF file<br>Fixed concentration error for Atropine, Cerenia. Added Midazolam to Emergency drugs<br>Fixed sorting issue on My Drugs list where settings were not saved. Improved notes display for added drugs.<br>New option to add and save your own Test Protocols<br>Calculator now opens similarly to the App keyboard, at the bottom of the page, not covering the page. <br>Fixed a bug where the calculator keypad was occasionally hidden<br>Improved Help page<br>Updated and improved menus used for Adding and Editing Drugs/Links/CRI's<br>Added Modified Glasgow Coma Scale in References<br>Numerous Code updates and layout improvements.<br>Updated App to use WKwebview, which should increase speed and improve responsiveness. <br>Improved App layout when device is in landscape mode.<br>Due to core code updates, some saved settings, such as App colors, Menu sorting order and drugs that were hidden for Anesthetics and Emergency drugs, may need to be reset after this update"},{"version_id":"831525294","version_name":"2.6","version_date":"2019-06-04 18:02:59.000 +0800","version_description":"Fixed error in CRI loading dose calculations in some versions of iOS<br>Added link too dailymed.com for drug label search.<br>Fixed bug where drugs were not being saved in My Drugs.<br>updated code and minor layout fixes."},{"version_id":"831710263","version_name":"2.7","version_date":"2019-06-21 02:06:01.000 +0800","version_description":"Added Dental Charts to References. <br>Improved layout and input in form used for Adding drugs to My Drugs page.<br>Fixed sorting save bug in My Drugs<br>Added option to format text when adding notes to My Drugs.<br>Improved layout for iPad.<br>Code updates and minor bug fixes."},{"version_id":"831903449","version_name":"2.8","version_date":"2019-07-27 01:41:03.000 +0800","version_description":"App Pages now open faster!<br>Add your own drugs to Emergency or Anesthetic drug pages in addition to My Drugs page. <br>Added a Drug Searchbar for Emergency and Anesthetic drugs<br>Added ACVIM Mitral Valve Disease 2019 Consensus Guidelines to Reference page<br>Added Vertebral Heart Score to Reference page<br> Interactive Help now available for each page<br> Added images for each Chocolate type<br> Fixed numerous printing bugs<br>Code updates and layout improvements for Fluids, Chocolate, Transfusions and CRI's.<br>Added in-App mini Text editor for adding Notes to any added drug and for patient info notes."},{"version_id":"832383959","version_name":"2.8.1","version_date":"2019-08-19 20:35:40.000 +0800","version_description":"Added new Blood pressure page.<br>Moved Lab Test Protocols into Reference section.<br>New duotone icons.<br>Code updates and minor bug fixes."}]