[{"version_id":"830764327","version_name":"1.11.0","version_date":"2019-03-28 14:10:11.000 +0800","version_description":"Aktuell verfügbar für AOK Bayern, AOK Niedersachsen und AOK PLUS!<br>Bald wird die Meine AOK-App als mobile Geschäftsstelle auch für Ihre AOK erhältlich sein.<br><br>Für die Nutzer der Meine AOK-App beinhaltet dieses Update neue Features, so kann man jetzt auch Bescheinigungen anfordern und Kontakt zu seinem persönlichen Ansprechpartner aufnehmen.  Da wir auch die AOK-App für Sie weiter optimieren wollen, können Sie uns über die neue Feedback-Funktion Ihre Meinung und Anregungen weitergeben."},{"version_id":"831115414","version_name":"2.0.0","version_date":"2019-05-02 08:18:45.000 +0800","version_description":"Dieses Update beinhaltet Fehlerbehebungen sowie Performance-Verbesserungen. Des Weiteren haben Sie nun Zugriff auf Ihre persönliche Daten und können diese in der App einsehen. Mit diesem Update wurden die Vorraussetzungen geschaffen, sodass die Meine AOK-App in Kürze auch für Ihre AOK verfügbar ist."},{"version_id":"831210548","version_name":"2.2.0","version_date":"2019-05-17 06:39:35.000 +0800","version_description":"Mit diesem Update ist die Meine AOK-App bundesweit für alle Versicherten der AOK nutzbar.<br>Das Update beinhaltet Fehlerbehebungen sowie Performance-Verbesserungen. Des Weiteren haben Sie nun Zugriff auf Ihre persönliche Daten und können diese in der App einsehen."},{"version_id":"831351958","version_name":"2.2.2","version_date":"2019-05-21 13:19:04.000 +0800","version_description":"Das Update beinhaltet Fehlerbehebungen sowie Performance-Verbesserungen. Des Weiteren haben Sie nun Zugriff auf Ihre persönliche Daten und können diese in der App einsehen."},{"version_id":"831659451","version_name":"2.5.0","version_date":"2019-06-24 11:12:03.000 +0800","version_description":"Das Update beinhaltet Fehlerbehebungen sowie Performance-Verbesserungen. <br>Des Weiteren erfolgte eine Optimierung des Scanners, wodurch Sie nun Ihre Dokumente noch einfacher und schneller an uns übermitteln können."},{"version_id":"831855605","version_name":"2.6.0","version_date":"2019-07-08 10:25:13.000 +0800","version_description":"Vielen Dank, dass Sie die Meine AOK-App nutzen. Dank Ihres Feedbacks können wir in diesem Update folgende Verbesserungen zur Verfügung stellen:<br>• Optimierung des Postfachs<br>• Anzeige Ihrer Bankverbindung(en)<br>• Performance-Verbesserungen<br>• Fehlerbehebungen"},{"version_id":"832156361","version_name":"2.8.0","version_date":"2019-08-05 11:05:38.000 +0800","version_description":"Vielen Dank, dass Sie die Meine AOK-App nutzen. Dank Ihres Feedbacks konnten wir die App in vielen Bereichen weiter verbessern."},{"version_id":"832572158","version_name":"2.9.1","version_date":"2019-09-03 08:40:34.000 +0800","version_description":"Vielen Dank, dass Sie die Meine AOK-App nutzen. <br>Dieses Update beinhaltet einen verbesserten Wartungsmodus bei umfassenderen Arbeiten im Hintergrund und eine Optimierung im Bereich der Registrierung."},{"version_id":"833293311","version_name":"3.0.0","version_date":"2019-11-13 09:06:10.000 +0800","version_description":"Vielen Dank, dass Sie die Meine AOK-App weiterhin nutzen. Dieses Update beinhaltet ein umfassendes Design-Update. Zudem können Sie jetzt direkt über die App auf die AOK-Leistungsübersicht zugreifen und der Scanner wurde optimiert."},{"version_id":"833814473","version_name":"3.0.1","version_date":"2019-12-10 14:29:40.000 +0800","version_description":"Vielen Dank, dass Sie die Meine AOK-App nutzen!<br><br>Mit diesem Update liefern wir Leistungs- und Stabilitätsverbesserungen im Vergleich zu v3.0.0 an Sie aus.<br><br>Senden Sie uns Ihr Feedback gerne an meineaokapp@by.aok.de, rufen Sie uns an oder nutzen Sie die Feedback-Funktion der App. <br>Wir freuen uns auf Ihre Anregungen!"},{"version_id":"833998112","version_name":"3.2.0","version_date":"2019-12-18 11:36:56.000 +0800","version_description":"Schön, dass Sie die Meine AOK-App weiterhin nutzen!<br> <br>Mit diesem Update können Sie nun Ihre Adresse direkt in der App ändern. Zudem haben wir ein paar kleine Fehler behoben und die Performance für Sie weiter verbessert."},{"version_id":"835341358","version_name":"3.4.0","version_date":"2020-04-06 07:09:57.000 +0800","version_description":"Schön, dass Sie die Meine AOK-App weiterhin nutzen!<br>Mit diesem Update können Sie nun eine elektronische Gesundheitskarte in der App anfordern.<br>Ebenso wurden die Möglichkeiten der Änderung Ihrer persönlichen Daten erweitert und die Performance weiter verbessert."},{"version_id":"835627466","version_name":"3.6.0","version_date":"2020-05-04 08:12:46.000 +0800","version_description":"Schön, dass Sie die Meine AOK-App weiterhin nutzen! Mit diesem Update können Sie nun Ihren Benutzernamen in der App anzeigen lassen und Ihre persönlichen Daten vielseitiger verwalten. Ebenso wurde die Performance weiter verbessert."},{"version_id":"836353527","version_name":"3.6.1","version_date":"2020-06-22 14:44:06.000 +0800","version_description":"Schön, dass Sie die Meine AOK-App weiterhin nutzen! Dieses Update behebt einen Fehler, der bei der Verlinkung zur Datenschutzerklärung sowie den Teilnahme- und Nutzungsbedingungen während der Registrierung zu einer leeren Seite führt."},{"version_id":"836646564","version_name":"3.6.2","version_date":"2020-07-06 08:04:32.000 +0800","version_description":"Schön, dass Sie die Meine AOK-App weiterhin nutzen! Mit diesem Update können Sie wie gewohnt Ihre Nachrichten in Ihrem Postfach löschen, archivieren, wiederherstellen und als gelesen markieren. Bitte entschuldigen Sie eventuelle Unannehmlichkeiten."},{"version_id":"837125953","version_name":"3.10.0","version_date":"2020-08-10 08:23:38.000 +0800","version_description":"Wir freuen uns, dass Sie weiterhin die Meine AOK-App nutzen. In diesem Update haben wir durch Fehlerbehebungen in unserer App weiter die digitale Kommunikation während der Corona-Zeit mit Ihrer AOK optimiert."},{"version_id":"838136449","version_name":"3.11.3","version_date":"2020-10-15 10:24:33.000 +0800","version_description":"Vielen Dank, dass Sie die Meine AOK-App weiterhin nutzen!<br><br>Mit diesem Update bereiten wir die Meine AOK-App auf zukünftige Funktionen und größere Veränderungen vor. Wir bitten alle Kunden, die App nach dem Update einmalig zu öffnen und zu entsperren.<br>Darüber hinaus beheben wir kleine Fehler, die wir auch dank Ihrer Unterstützung entdeckt haben. Bitte geben Sie uns gerne weiter Feedback über die App Store-Bewertungen oder das eingebaute Feedback-Formular.<br><br>v3.11.0: Mit diesem Update wurde die Meine AOK-App um weitere Funktionen ergänzt. So können Sie ab dieser Version auch Ärzte und Krankenhäuser in Ihrer Nähe suchen."},{"version_id":"838947800","version_name":"4.0.1","version_date":"2020-11-16 13:33:48.000 +0800","version_description":"Vielen Dank, dass Sie die Meine AOK-App weiterhin nutzen! Mit diesem Update haben wir die Anmeldung und das Entsperren in der Meine AOK-App vereinfacht.<br><br>Hinweis: Zu Ihrer Sicherheit beenden wir demnächst die Unterstützung für iOS 12. Bitte denken Sie über ein Update auf iOS 13 oder neuer nach."},{"version_id":"839368680","version_name":"4.2.0","version_date":"2021-01-13 08:56:15.000 +0800","version_description":"Vielen Dank, dass Sie weiterhin die Meine AOK-App nutzen! Dieses Update beinhaltet Fehlerbehebungen.<br><br>Hinweis: Bitte beachten Sie, dass diese Version letztmalig iOS 12 unterstützt. Mit dem nächsten Update setzt die App aus Sicherheitsgründen iOS 13 oder neuer voraus."},{"version_id":"840038272","version_name":"4.3.0","version_date":"2021-01-25 11:14:47.000 +0800","version_description":"Vielen Dank, dass Sie weiterhin die Meine AOK-App nutzen! Dieses Update beinhaltet Fehlerbehebungen.\n<br>\n<br>Hinweis: Bitte beachten Sie, dass dieses Update aus Sicherheitsgründen iOS 13 oder neuer voraussetzt."},{"version_id":"840264340","version_name":"4.3.1","version_date":"2021-02-02 11:43:37.000 +0800","version_description":"Vielen Dank, dass Sie weiterhin die Meine AOK-App nutzen! Dieses Update beinhaltet Fehlerbehebungen.<br><br>Hinweis: Bitte beachten Sie, dass dieses Update aus Sicherheitsgründen iOS 13 oder neuer voraussetzt."},{"version_id":"840503053","version_name":"4.4.0","version_date":"2021-03-01 09:58:26.000 +0800","version_description":"Mit diesem Update haben wir einige Optimierungen vorgenommen, damit die App jederzeit rund läuft. Sie werden kaum optische Änderungen wahrnehmen, aber technische Verbesserungen spüren.\n<br>\n<br>Hinweis: Bitte beachten Sie, dass dieses Update aus Sicherheitsgründen iOS 13 oder neuer voraussetzt"},{"version_id":"840793593","version_name":"4.5.0","version_date":"2021-03-22 11:04:09.000 +0800","version_description":"Mit diesem Update stellen wir Ihnen das Scan-Archiv vor. Hier können Sie künftig Ihre hochgeladenen Dokumente einsehen.&nbsp;<br>Zusätzlich wurden weitere Optimierungen vorgenommen, damit die App schneller und zuverlässiger wird.<br><br>Hinweis: Bitte beachten Sie, dass dieses Update aus Sicherheitsgründen iOS 13 oder neuer voraussetzt."},{"version_id":"841082480","version_name":"4.5.1","version_date":"2021-04-12 10:00:57.000 +0800","version_description":"Vielen Dank, dass Sie weiterhin die Meine AOK-App nutzen.&nbsp;<br><br>In dieser Version haben wir uns erneut auf die Behebung Fehlern und auf die Steigerung der Performance konzentriert.&nbsp;<br>Wenn Sie dennoch einen Fehler finden, dann zögern Sie nicht uns zu kontaktieren.<br><br>Ihre AOK."},{"version_id":"842095564","version_name":"4.7.0","version_date":"2021-05-26 08:41:04.000 +0800","version_description":"Mit diesem Update wurde ein Scan-Archiv eingeführt – hier können Sie künftig Ihre hochgeladenen Dokumente einsehen. Zusätzlich wurden Optimierungen vorgenommen, damit die App jederzeit rund läuft. Sie werden kaum optische Änderungen wahrnehmen, aber technische Verbesserungen spüren. Des Weiteren wurde die Barrierefreiheit ausgebaut, um allen Usern ein besseres Nutzungserlebnis zu ermöglichen. \n<br> <br>Hinweis: Bitte beachten Sie, dass dieses Update aus Sicherheitsgründen iOS 13 oder neuer voraussetzt."},{"version_id":"842398671","version_name":"4.7.1","version_date":"2021-06-01 10:35:13.000 +0800","version_description":"Vielen Dank, dass Sie weiterhin die Meine AOK-App nutzen.<br><br>Mit diesem Update beheben wir einen Fehler, der dazu führen konnte, dass Sie sich nicht mehr an der App anmelden können, wenn das Passwort beim Anmeldeversuch einmal falsch eingegeben wurde. Sollten Sie von dem Fehler betroffen sein, so ist leider eine Neuinstallation der neusten Version notwendig.<br><br>Hinweis: Diese Version benötigt aus Sicherheitsgründen iOS 13 oder neuer."},{"version_id":"842624532","version_name":"4.8.2","version_date":"2021-06-21 14:15:39.000 +0800","version_description":"Vielen Danke, dass sie die Meine AOK-App nutzen!<br><br>Mit diesem Update wurde die Barrierefreiheit innerhalb der Meine AOK-App erweitert, um allen Usern ein besseres Nutzungserlebnis zu ermöglichen. Zusätzlich wurden Optimierungen vorgenommen, damit die App jederzeit rund läuft. Sie werden kaum optische Änderungen wahrnehmen, aber technische Verbesserungen spüren. \n<br>\n<br>Hinweis: Bitte beachten Sie, dass dieses Update aus Sicherheitsgründen iOS 13 oder neuer voraussetzt."}]