[{"version_id":"828095717","version_name":"1.1","version_date":"2018-08-03 01:01:06.000 +0800","version_description":"The main feature released on this new version is Adjustments.<br><br>You can apply basic adjustments like Brightness, Contrast, Vibrance, or some special ones like Smooth Skin or Strength.<br><br>The amazing fact is that you can append all of them through a Layers System.<br><br>Select one adjustment, set the desired value and then press on the blue + icon to append it to the current layer stack. Then you can continue with the following adjustment to be added.<br><br>In order to see the stack of layers you can press on the new layers button (top left on the screen, below the Menu button) or you can just swipe right to show it and swipe left to hide it. <br><br>If you want to remove an adjustment from the layers, you just need to drag the item and drop it outside.<br><br>You can adjust the values of every item at anytime by pressing on it in the Layers stack.<br><br>Apart from this new feature, bug fixes and little tweaks are included. Always keeping in mind your feedbacks to start with new features.<br><br>Enjoy it!"},{"version_id":"828758258","version_name":"1.6","version_date":"2018-09-28 21:37:55.000 +0800","version_description":"This new version is coming with plenty of new features.<br><br>We have added 4 new effects in order to give your videos a vintage look (Old Movie, VHS1, VHS2 and VHS3).<br><br>In addition, we have included a new category called \"Particles\" including rain, sparks or dust, which will add a special touch to your videos.<br><br>We also have created one more category called \"Frames\" which includes different modes to modify and frame your videos. Tap with two fingers on the screen when you select a frame mode in order to change the background filter.<br><br>Apart from this feature, bug fixes and little tweaks are always included on new releases.<br><br>Thank you for your feedbacks.<br><br>See you on next release with new surprises!"}]