[{"version_id":"831849008","version_name":"0.9984","version_date":"2019-07-02 05:25:12.000 +0800","version_description":"** Nominated for the UN's World Summit Awards<br>NEW - The free summaries of Tim Ferriss' favorite book, Vagabonding and The Art of Travel by the founder of The School of Life, Alain de Botton. As always, enjoy and let us know what you think about our cur"},{"version_id":"832066618","version_name":"0.9991","version_date":"2019-07-20 01:22:45.000 +0800","version_description":"* We've added the key ideas of the #1 NY Times bestseller, Designing Your Life by Stanford professors, Bill Burnett and Dave Evans. We also updated Can't Hurt Me by David Goggins. As always, enjoy and let us know what you think about our curation.<br>* We"},{"version_id":"832244554","version_name":"0.9992","version_date":"2019-08-06 22:57:37.000 +0800","version_description":"* We've added the key ideas of the #1 Wall Street Journal bestseller, The Obstacle is the Way by Ryan Holiday that is recommended by Arnold Schwarzenegger, Tim Ferriss, and Robert Greene. As always, enjoy and let us know what you think about our curation."},{"version_id":"832285695","version_name":"0.9994","version_date":"2019-08-10 00:34:45.000 +0800","version_description":"* Premium users can now upvote new books by using the \"Vote for new books\" option under the menu<br>* We added a feedback survey under the app's menu that we'd love you to take<br>* You can now upvote and suggest new features from under the app's menu<br>"},{"version_id":"832342521","version_name":"0.9995","version_date":"2019-08-12 23:58:49.000 +0800","version_description":"* You can now play FREE audiobooks or longer talks/interviews from the overflow menu in the book's screens<br>* We've added the key ideas of Educated, the mega-bestseller by Tara Westover that is recommended by Barack Obama, Bill Gates, and Oprah Winfrey."},{"version_id":"832401284","version_name":"0.99955","version_date":"2019-08-17 01:54:35.000 +0800","version_description":"* You can now try the premium subscription for free<br>* We added the key ideas of Unlimited Memory, the Wall Street Journal bestseller of Grandmaster Kevin Horsley. Please rate our curation using the new feedback form under the overflow menu in the book'"},{"version_id":"832575169","version_name":"0.99965","version_date":"2019-08-31 03:22:40.000 +0800","version_description":"* This release includes minor bug fixes and performance improvements<br>* We added the key ideas of the #1 NYT bestseller, You Are a Badass by Jen Sincero. This book was the most upvoted one by you. Please rate our curation using the new feedback form und"},{"version_id":"832667488","version_name":"0.99973","version_date":"2019-09-09 05:59:42.000 +0800","version_description":"* Check out the new What's New page under the menu to stay in the loop about new or updated storyshots<br>* We added the key ideas of the timeless leadership and strategy bestseller, The Art of War by Sun Tzu. Please rate our curation using the new feedba"},{"version_id":"832714511","version_name":"0.99980","version_date":"2019-09-12 08:38:34.000 +0800","version_description":"* We fixed a bug that caused premium users to see ads<br>* We added the key ideas of the timeless leadership and strategy bestseller, The Art of War by Sun Tzu. Please rate our curation using the new feedback form under the menu in the book's screen.<br><"},{"version_id":"832831890","version_name":"0.99983","version_date":"2019-09-20 01:07:49.000 +0800","version_description":"* The app now automatically skips the intro for audiobooks and long audio storyshots<br>* We fixed a bug that stopped premium users from upvoting new books<br>* We added the key ideas of the NY Times and WSJ bestseller, The $100 Startup by Chris Guillebea"},{"version_id":"833027731","version_name":"0.99993","version_date":"","version_description":""},{"version_id":"833117125","version_name":"0.99994","version_date":"2019-10-11 10:25:09.000 +0800","version_description":"* The key takeaways of Ramit Sethi's NY Times bestseller, I Will Teach You to Be Rich<br>* A simple feature that allows you to resume audio storyshots from the main screen<br>* Book sharing links now use go.getstoryshots.com instead of storyshots.page.lin"},{"version_id":"833217468","version_name":"0.99996","version_date":"2019-10-19 00:37:24.000 +0800","version_description":"* We made it easier to see our NEW and UPDATED books and browse categories. Just use the second icon on the top left on the main screen.<br>* Use Contribute to StoryShots from under the app's menu to submit your own key ideas or suggest different ones<br>"},{"version_id":"833288410","version_name":"0.99997","version_date":"2019-10-23 22:41:12.000 +0800","version_description":"* We added POPULAR and TIM FERRISS RECOMMENDS categories to the redesigned category section. Use the second icon on the top left on the main screen's top bar to access them.<br>* We redesigned the bookmarks screen and added two new sections for you to acc"},{"version_id":"833581424","version_name":"1.0","version_date":"2019-11-13 10:52:58.000 +0800","version_description":"We added<br>* Ryan Holiday's new #1 NY Times bestseller, Stillness is the Key and the Tim Ferriss-endorsed, The Art of Learning by Josh Waitzkin<br>* resume support for audiobooks and improved its design<br>* landscape support for text shots <br>* book re"},{"version_id":"833674439","version_name":"1.0.1","version_date":"2019-11-20 09:23:31.000 +0800","version_description":"We added<br>* Arianna Huffington's #1 NY Times bestseller, Thrive<br>* Related books / You may also like feature that many of you had requested<br>* Subtitle and other language support through video playlists that was also highly requested by you<br><br>F"},{"version_id":"833789396","version_name":"1.0.55","version_date":"2019-11-29 00:20:09.000 +0800","version_description":"* BLACK FRIDAY LIFETIME DEAL - Do not miss out. <br>* Improved iPad support<br>* Added the list of books you can resume listening to<br>* Added support for automatically dismissing the video when it reaches the end<br>* Improved the app's performance<br><"},{"version_id":"833862484","version_name":"1.0.65","version_date":"2019-12-05 07:38:08.000 +0800","version_description":"*** BLACK WEEK LIFETIME DEAL - Act fast.<br>* Sign in with Apple is added<br>* Premium subscribers can now resume listening to a book on another iPhone/iPad<br>* Improved Dark mode support<br><br>Previous release:<br><br>* Reordered the main buttons to Re"},{"version_id":"834014585","version_name":"1.0.70","version_date":"2019-12-16 08:54:25.000 +0800","version_description":"* We made it to the finals of the UN's World Summit Awards for social impact<br>* We have so far \"organically\" ranked top 10 in 14 and top 100 in 120+ other countries. Thanks for choosing us!<br>* Added the #1 NY Times bestseller, Dare to Lead by Brené Br"},{"version_id":"834074132","version_name":"1.0.74","version_date":"2019-12-21 00:35:06.000 +0800","version_description":"* Added recommended books by Elon Musk and a \"New Year. New Beginning\" category<br>* Added the mega-bestseller, The Secret by Rhonda Byrne and the NY Times bestseller, Everything is F*cked by Mark Manson<br>* Cloud sync for bookmarks is now activated by d"},{"version_id":"834108978","version_name":"1.0.78","version_date":"2019-12-23 05:00:30.000 +0800","version_description":"* Fixed a bug that caused the video playback to be automatically dismissed for some new users<br>* Added recommended books by Elon Musk and a \"New Year. New Beginning\" category<br>* Added the mega-bestsellers, Fire and Fury by Michael Wolff, The Secret by"},{"version_id":"834153678","version_name":"1.0.81","version_date":"2019-12-30 02:41:04.000 +0800","version_description":"* Added Steve Jobs and Oprah Winfrey's book recommendations under Categories<br>* Added several new bestsellers in diet/fitness, personal finance, and spiritual categories. Look under the NEW category to see the whole list.<br>* Fixed a crash that happene"},{"version_id":"834238520","version_name":"1.0.85","version_date":"2020-01-09 04:11:10.000 +0800","version_description":"* Added some audiobooks and long audio shots in Spanish, Portuguese, French, Russian, Chinese, German, Hindi, Arabic, Persian and more<br>* Added Atomic Habits by James Clear, Girl, Stop Apologizing by Rachel Hollis, Indistractable by Nir Eyal, The Promis"},{"version_id":"834388587","version_name":"1.0.86","version_date":"2020-01-18 01:45:53.000 +0800","version_description":"* Added offline support: You can now access your bookshelf and downloaded audio shots/books without an Internet connection<br>* Added Hindi and Spanish text and video shots for some books<br>* Added 5 new bestselling books and audiobooks in multiple langu"},{"version_id":"834447855","version_name":"1.2.0","version_date":"2020-01-23 03:49:41.000 +0800","version_description":"* Added the highly-requested highlighting, note-taking, quote-sharing, and text-to-speech support to some text shots for premium subscribers<br>* Fixed a bug that caused the audio shot playback to behave erratically from the lock screen<br>* Added Portugu"},{"version_id":"834622728","version_name":"1.4","version_date":"2020-02-07 23:38:14.000 +0800","version_description":"* Fixed a few minor bugs of the new highlighting and quote-sharing support<br>* Added support for several new languages (both audio and video shots). Some books now have content in up to 18 languages.<br>* Added several new books (Look under NEW and UPDAT"},{"version_id":"834738037","version_name":"1.5","version_date":"2020-02-17 14:39:30.000 +0800","version_description":"* Fixed a critical bug for users who had used Sign in with Apple<br>* Added Spanish and Hindi categories <br>* Fixed a few minor bugs of the new highlighting and quote-sharing support<br>* Added several new books including Jocko Willink's new bestseller: "},{"version_id":"834820441","version_name":"1.5.3","version_date":"2020-02-23 01:03:33.000 +0800","version_description":"* Fixed a bug that caused the long audio shots not to resume properly from the main screen<br>* Fixed several bugs with the new audio and video multilingual support<br>* Added several new books including Everything Store: Jeff Bezos and The Age of Amazon "},{"version_id":"834865951","version_name":"1.5.5","version_date":"2020-02-26 10:02:07.000 +0800","version_description":"* Fixed a bug that caused the app to crash after opening a push notification<br>* Fixed a bug that caused the app to crash when you tried to open the Categories screen<br>* Added The Mamba Mentality by Kobe Bryant, Super Attractor by Gabrielle Berstein an"},{"version_id":"835384742","version_name":"1.5.8","version_date":"2020-04-03 07:37:00.000 +0800","version_description":"* Added categories for full ebooks and audiobooks<br>* Added time-based categories for audio shots that are under 20 and 40 minutes long<br>* Added Career &amp; Job Hunting, Investing and Creativity categories<br>* Added Portuguese, Arabic, and French cat"},{"version_id":"835478714","version_name":"1.6.1","version_date":"2020-04-12 04:36:38.000 +0800","version_description":"* Thanks to your feedback, we added time-based categories for audio shots that are under 10 and 30 minutes long<br>* Added Ebook and Audiobook categories to make it easier for you to access this content<br>* Added Career &amp; Job Hunting, Investing and C"},{"version_id":"835593354","version_name":"1.7","version_date":"2020-04-19 21:49:48.000 +0800","version_description":"* You can now highlight, take notes and share image quotes on ALL books and in full-screen mode<br>* We fixed a bug that was prompting some premium subscribers to restore their purchase repeatedly<br>* Added How to Get Rich without Getting Lucky by Naval "},{"version_id":"835672841","version_name":"1.7.4","version_date":"2020-04-25 02:24:51.000 +0800","version_description":"* Read text shots and full ebooks offline<br>* Set daily reminders from the side menu to develop a reading habit and complete your \"Reading Challenge\"<br>* Added Awaken the Giant Within by Tony Robbins<br>* StoryShots organically ranked top 2 in Pakistan "},{"version_id":"835816012","version_name":"1.7.8","version_date":"2020-05-06 00:35:44.000 +0800","version_description":"* Got featured by Apple as the #1 book summary app in 10 countries!<br>* Fixed a bug that caused the bookmark screen to be empty for premium subscribers<br>* Added The Snowball - the biography of Warren Buffet, Made to Stick, The Truth by Neil Strauss, Th"},{"version_id":"835890811","version_name":"1.7.91","version_date":"2020-05-12 11:24:50.000 +0800","version_description":"* Minor bug fixes<br>* THE GUARDIAN ranked StoryShots as one of the top learning apps<br>* Organically ranked top 2 in Hungary, Spain and Pakistan, top 3 in Italy and Nigeria, top 6 in Canada, Portugal and The Netherlands.<br><br>Love the app? Please rate"},{"version_id":"835940750","version_name":"1.7.92","version_date":"2020-05-14 07:22:36.000 +0800","version_description":"* Minor bug fixes<br>* THE GUARDIAN ranked StoryShots as one of the best learning apps<br>* Added several new bestselling books<br>* Organically ranked top 2 in Hungary, Spain and Pakistan, top 3 in Italy and Nigeria, top 4 in the UK and Slovakia, top 6 i"},{"version_id":"836060364","version_name":"1.8.0","version_date":"2020-05-23 05:07:26.000 +0800","version_description":"* Fixed a crash that happened while rotating the phone to landscape<br>* Change playback rate of audio at increments of 0.05x<br>* Added several new bestselling books<br>* Organically ranked top 2 in Romania, top 3 in Swaziland, top 6 in Austria, top 7 in"},{"version_id":"836105456","version_name":"1.8.0","version_date":"2020-05-23 05:07:26.000 +0800","version_description":"* Fixed a crash that happened while rotating the phone to landscape<br>* Change playback rate of audio at increments of 0.05x<br>* Added several new bestselling books<br>* Organically ranked top 2 in Romania, top 3 in Swaziland, top 6 in Austria, top 7 in"},{"version_id":"836159496","version_name":"1.8.1","version_date":"2020-05-29 00:57:25.000 +0800","version_description":"* GO LIFETIME. GIFT LIFETIME (Limited-time offer for new subscribers)<br>* Added several new bestselling books including Switch, Influence, Zen and The Art of Motorcycle Maintenance, The Audacity of Hope, Competitive Strategy, Make Your Bed and You Are a "},{"version_id":"836275874","version_name":"1.8.6","version_date":"2020-06-11 23:12:04.000 +0800","version_description":"* Premium members can now enjoy experimental subtitle support for some videos<br>* Improved the pitch and sound quality of audio shots at 0.9x or slower playback<br>* Added How to Be an Antiracist, The Autobiography of Martin Luther King, Malcolm X, and A"},{"version_id":"837110471","version_name":"1.8.8","version_date":"2020-07-31 09:26:22.000 +0800","version_description":"* Google featured StoryShots in 175 countries (＾ｖ＾) Thank you for spreading the word to your network!<br>* Made it more clear how to mark a book as finished by changing the button title on the book screen to \"Start a Reading Challenge &amp; Mark as Finish"},{"version_id":"837569602","version_name":"1.9.0","version_date":"2020-09-03 02:22:39.000 +0800","version_description":"* Added White Fragility, Too Much and Never Enough, The Infinite Game, Sapiens, Factfulness, How to Destroy America in 3 Easy Steps, Gandhi, Rich Dad's Cashflow Quadrant, Traffic Secrets and more<br>* Added recommended books by Naval Ravikant, Joe Rogan, "},{"version_id":"838300380","version_name":"1.9.1","version_date":"2020-10-22 09:02:04.000 +0800","version_description":"* Apple featured StoryShots on both iPadOS and iOS in 12 countries!<br>* Added/updated books by Tim Ferriss, Bob Woodward, Robin Sharma, Robert Greene, Angela Duckworth, Jocko Willink, Kevin Hart, Esther Perel, Gary John Bishop, Jim Kwik, Eric Schmidt, Ry"},{"version_id":"838405553","version_name":"1.9.15","version_date":"2020-10-29 00:20:32.000 +0800","version_description":"* Fixed a critical bug on iPad that caused the app to freeze in iOS 14<br>* Added Pitch Anything by Oren Klaff and Feeling Good by Dr David Burns<br><br>Love the app? Please write us a review to help us grow!<br>Got feedback? Shoot us an email at hello@ge"},{"version_id":"838449948","version_name":"1.9.21","version_date":"","version_description":""},{"version_id":"839055413","version_name":"1.9.25","version_date":"2020-11-22 02:56:04.000 +0800","version_description":"* BLACK FRIDAY Deal for new subscribers<br>* Added &amp; Updated Think Like a Monk, Breath, Hacking Growth, Educated, A New Earth, Awaken the Giant Within, Flow, Creativity, Inc., Linchpin, Difficult Conversations<br>* Minor bug fixes<br><br>Love the app?"},{"version_id":"839491669","version_name":"1.9.26","version_date":"2020-12-11 10:28:12.000 +0800","version_description":"* Added &amp; updated Tribe of Mentors by Tim Ferriss, The Personal MBA by Josh Kaufman, A Brief History of Time by Stephen Hawking, Man’s Search for Meaning by Viktor Frankl, Who Will Cry When You Die? by Robin Sharma, Ego is The Enemy by Ryan Holiday, P"},{"version_id":"839638528","version_name":"1.9.27","version_date":"","version_description":""},{"version_id":"839741249","version_name":"1.9.41","version_date":"2020-12-21 09:50:21.000 +0800","version_description":"* Limited-time offer: Free 30-day trial for new annual premium subscribers<br><br>* Added &amp; updated Deep Work, How Not to Die, Elon Musk, Eat that Frog!, The 80/20 Principle recommended by Tim Ferriss, Caste from Oprah's Book Club, The Effective Execu"},{"version_id":"839824137","version_name":"1.9.42","version_date":"2020-12-30 08:49:27.000 +0800","version_description":"* Limited-time offer: Free 30-day trial for new annual premium subscribers<br><br>* Added &amp; updated Think and Grow Rich, Designing Your Life, The 5 Love Languages and The Dip. As always share to show you care and keep giving us feedback on the content"},{"version_id":"841123702","version_name":"1.9.82","version_date":"2021-04-06 06:39:01.000 +0800","version_description":"* Improved the sleep timer<br>* Bug fixes including an offline cache bug<br>* Added &amp; updated several new books<br><br>Got feedback or any questions? Contact us at support@getstoryshots.com from inside the app.<br>Love the app? Please write us a revie"}]