[{"version_id":"828785304","version_name":"1.0.4","version_date":"2018-10-02 13:45:51.000 +0800","version_description":"This version fixes a minor issue on the iPhone XS Max in landscape mode when opening the New Feed or New Folder Interface. <br><br>If you feel generous and have a couple of minutes, please leave a review. It makes a huge difference for me. Thank you in advance. :)"},{"version_id":"828827511","version_name":"1.0.5","version_date":"2018-10-05 16:16:47.000 +0800","version_description":"[IMPROVE]<br>- Elytra's Action Extension is now much much faster. It interacts directly with a webpage if one is available to find the RSS Feeds advertised by that web page.<br>- Improved VoiceOver​ text for Settings, Recommendations, New Folder and New Feed buttons on the Feeds Interface.<br><br>[FIX]<br>- Renaming a Folder is now an instant action and no longer requires a refresh.<br>- Deleting a renamed folder no longer crashes the app.<br>- Changing the theme followed by opening an article and then tapping on search now correctly presents the search bar and associated buttons. Previously, the search bar did not appear at all showing just the keyboard.<br>- The Appearance Interface now uses the current Accent color when tapping on cells.<br><br>If you feel generous and have a couple of minutes, please leave a review. It makes a huge difference for me. Thank you in advance. :)"},{"version_id":"828960336","version_name":"1.0.6","version_date":"2018-10-17 21:15:11.000 +0800","version_description":"• Fixes an issue with restoring In-App Purchases.<br><br>If you feel generous and have a couple of minutes, please leave a review. It makes a huge difference for me. Thank you in advance. :)"},{"version_id":"829486793","version_name":"1.1.3","version_date":"2018-12-01 22:50:38.000 +0800","version_description":"Fixes an issue with OPML imports sometimes getting stuck after importing the first feed. <br><br>If you feel generous and have a couple of minutes, please leave a review. It makes a huge difference for me. Thank you in advance. :)"},{"version_id":"829589011","version_name":"1.1.4","version_date":"2018-12-11 18:16:40.000 +0800","version_description":"Happy Holidays! <br><br>This build fixes a few crashes which snuck up on us in v.1.1.3. Sorry about those. <br><br>If you feel generous and have a couple of minutes, please leave a review. It makes a huge difference for me. Thank you in advance. :)"},{"version_id":"830247353","version_name":"1.2.2","version_date":"2019-02-13 02:29:39.000 +0800","version_description":"This version fixes a few bugs and adds the Reader and Flutter App Icon options to the Spring Update.<br><br>Release notes from the Spring Update: <br><br>[NEW]<br>- A new Reader theme<br>- New interface for adding and finding feeds.<br>- Article lists can now show tags for you to discover articles about similar topics.<br>- Mark All Read button is now split into two actions:<br>- Mark All Articles which are currently loaded as read.<br>- Mark All Articles including backdated ones as read. (Default)<br>- Renaming Feeds. Long tap on a feed to bring up the rename option.<br><br>[IMPROVED]<br>- The two finger swipe up or down gesture will now cycle through the available themes.<br>- Improved memory management. The app on startup now consumes 5% less RAM. This also improves restoration times when waking the app from the background.<br>- Youtube videos are now rendered natively within the app when possible. This removes the last piece dependant on webviews.<br>- Reduced memory usage on boot.<br>- Reduced memory usage when showing cover images.<br>- Fixed jumpy scroll views when loading additional content.<br>- Reduced power usage when syncing new Feeds &amp; Unread items information.<br>- When opening links inside Safari within the app, the Safari view is now tinted as per your preference.<br><br>[FIXED]<br>- fixed the jerky scroll animation when showing cover images.<br>- fixed a rare crash when opening the Unread Feed. <br>- fixed a crash that would occur when showing the share options for a feed on iPads.<br>- fixed a crash that would occur when toggling the Cover Images option on certain devices.<br>- The app will no longer try to open an article when receiving a push notification for a batch of articles.<br>- fixed a bug with Bookmarks sometimes not loading correctly for some users.<br><br>If you feel generous and have a couple of minutes, please leave a review. It makes a huge difference for me. Thank you in advance. :)"},{"version_id":"830468341","version_name":"1.2.3","version_date":"2019-03-05 04:34:18.000 +0800","version_description":"This build fixes two major issues:<br><br>- Both Mark All Read actions now behave exactly alike and Marking backdated articles no longer has a delay and works more reliably. <br>- Selecting and copying text inside an article could crash the app since iOS 12.1.x. This has been patched and does not currently support rich text copying. <br><br>If you feel generous and have a couple of minutes, please leave a review. It makes a huge difference for me. Thank you in advance. :)"}]