[{"version_id":"828624852","version_name":"1.0.1","version_date":"2018-09-19 21:48:43.000 +0800","version_description":"- Upload your photos to pexels! Select items from your device, and upload for our curation team to review.<br>- Dropped a search form onto the initial screen for you search-happy folks<br>- Style improvements (and fixes) to the header<br>- Style improvements to photos in the feed. (Sometimes it wasn't clear which photo the 'like' button belonged to)<br>- Gesture adjustments<br>- Fixed a navigation bug that would result in the visible photo not updating<br>- Fixed scrolling on signup screens<br>- Fixed email changes to user accounts not updating in the UI correctly"},{"version_id":"828685022","version_name":"1.0.2","version_date":"2018-09-25 14:26:04.000 +0800","version_description":"- Take control of your uploads - added the ability to delete photos you own<br>- Better feedback for new users that are collecting photos for the first time<br>- Fixed tablet layouts for photo and collection grids (goodbye ugly grey area, hello better multitasking!)<br>- Fixed occasional crashes when downloading<br>- Fixed layout and cosmetic issues<br>- Fixed preview images on uploads not displaying"},{"version_id":"828886663","version_name":"1.1.0","version_date":"2018-10-11 16:48:33.000 +0800","version_description":"Thanks for using the offical Pexels app! Here's what we've worked on for this update:<br><br>- Added loading indicators to the bottom of photo lists for scroll-happy users that get there quickly<br>- Added a download progress bar to the photo action sheet<br>- Added related searches to the top of the search results screen<br>- Better, more welcoming screen for users that haven't uploaded any photos yet<br>- Better support for notched devices<br>- Fixed display issues for top photographer lists<br>- Fixed tappable area for checkboxes<br>- Fixed a potential problem for downloads that might have been deleted outside the app"},{"version_id":"828901161","version_name":"1.1.1","version_date":"2018-10-12 13:58:25.000 +0800","version_description":"Thanks for using the official Pexels app! Here's what we've worked on for this update:<br><br>- Added loading indicators to the bottom of photo lists for scroll-happy users that get there quickly<br>- Added a download progress bar to the photo action sheet<br>- Added related searches to the top of the search results screen<br>- Better, more welcoming screen for users that haven't uploaded any photos yet that includes custom icons<br>- Better support for notched devices<br>- Improved gesture support for dismissing photo screens<br>- Fixed display issues for top photographer lists<br>- Fixed tappable area for checkboxes<br>- Fixed a potential problem for downloads that might have been deleted outside the app"},{"version_id":"829107264","version_name":"1.1.4","version_date":"2018-10-30 18:01:24.000 +0800","version_description":"Thanks for using the official Pexels app!<br><br>There aren't any major changes in this release, just some small adjustments to try to make your experience better."},{"version_id":"829700194","version_name":"1.2.1","version_date":"2018-12-27 19:00:47.000 +0800","version_description":"Thanks for using the official Pexels app!<br>We've updated our icon.  We hope you like it.<br>This release contains a new and improved photo screen, where you can see more details about the photograph as well as some similar/related photos, as well as some much-needed \"bug fixes and performance improvements\". ;)"},{"version_id":"829826390","version_name":"1.2.4","version_date":"2019-01-05 17:21:26.000 +0800","version_description":"Thanks for using the official Pexels app!<br><br>This update rolls back some of the overzealous haptic use that we pushed out in our previous update. We appreciate the feedback from our users, and will continue to respond to make using our app enjoyable.<br><br>Also included is a fix to put the 'New Collection' button back where it belongs."},{"version_id":"829898603","version_name":"1.3.0","version_date":"2019-01-10 15:22:43.000 +0800","version_description":"Thanks for using the official Pexels app!<br><br>Some improvements in this update:<br>- Evaluate upload sizes immediately - 4MP minimum<br>- Improved device detection for layout bugs on certain phone models (ending in Max and R :D)<br>- A nicer photo layout on your Profile page<br><br>And last but not least, due to popular demand...<br>- Improved User and Profile screen to include stats, social, sharing &amp; donate buttons!<br><br>Enjoy!"},{"version_id":"830051163","version_name":"2.2.0","version_date":"2019-08-03 19:01:09.000 +0800","version_description":"Thanks for using the official Pexels app!<br><br>This release contains no new user-facing features, merely some upgrades to boost performance."},{"version_id":"830051163","version_name":"1.4.0","version_date":"2019-01-23 18:30:02.000 +0800","version_description":"Thanks for using the official Pexels app!<br><br>This update includes a few small visual touch-ups, and introduces the ability to add tags your uploaded photos."},{"version_id":"831110801","version_name":"2.0.0","version_date":"2019-04-26 19:20:35.000 +0800","version_description":"Thanks for using the official Pexels app!<br><br>This release includes a bunch of big updates and fixes.<br> - Moved primary navigation to the bottom of the screen to be more thumb-friendly<br> - Updated styling of the splash screen<br> - A return of round avatars<br> - Removed haptics from photo interactions due to popular demand<br> - Added in-app notifications!"},{"version_id":"831678044","version_name":"2.1.0","version_date":"2019-06-15 15:48:00.000 +0800","version_description":"Thanks for using the official Pexels app!<br><br>With this release, you can now search for your favorite photographer by name with user search!<br>We've also added support to view photos and browse the app in landscape mode."},{"version_id":"831714064","version_name":"2.1.1","version_date":"2019-06-19 15:45:28.000 +0800","version_description":"Thanks for using the official Pexels app!<br><br>This is a minor update to correct some issues with the last major update which included:<br>- You can now search for your favorite photographer by name with user search!<br>- Added support to view photos and browse the app in landscape mode."},{"version_id":"831794674","version_name":"2.1.2","version_date":"2019-06-26 18:45:18.000 +0800","version_description":"Thanks for using the official Pexels app!<br><br>This is a minor update to correct some issues with the last major update which included:<br>- You can now search for your favorite photographer by name with user search!<br>- Added support to view photos and browse the app in landscape mode."},{"version_id":"831980382","version_name":"2.2.0","version_date":"2019-08-03 19:01:09.000 +0800","version_description":"Thanks for using the official Pexels app!<br><br>This release contains no new user-facing features, merely some upgrades to boost performance."},{"version_id":"834899239","version_name":"3.0.2","version_date":"2020-04-04 08:01:20.000 +0800","version_description":"Thanks for using the official Pexels app!<br><br>This release includes initial support for video! See if you can spot some great clips in the feed.<br>We're also happy to release challenges. Upload your best work and win some great prizes!"},{"version_id":"835478858","version_name":"3.0.3","version_date":"2020-04-09 19:12:39.000 +0800","version_description":"Thanks for using the official Pexels app!<br><br>This release includes a fix for social (facebook) sign-in."},{"version_id":"836041951","version_name":"3.1.1","version_date":"2020-05-21 01:29:20.000 +0800","version_description":"Thanks for using the official Pexels app!<br><br>This update includes support for Sign in with Apple, as well as some underlying upgrades that should hopefully boost performance."},{"version_id":"836081925","version_name":"3.1.2","version_date":"2020-05-24 01:49:07.000 +0800","version_description":"This release fixes a bug that prevented users from signing in with their email address."},{"version_id":"836531592","version_name":"3.1.3","version_date":"2020-06-23 20:54:07.000 +0800","version_description":"Thanks for using the official Pexels app!<br><br>This release contains some minor fixes and a new share to instagram feature."},{"version_id":"840094751","version_name":"4.0.3","version_date":"2021-01-27 00:51:08.000 +0800","version_description":"The Pexels app has a fresh new design! We hope you'll find it easier to use."},{"version_id":"840229140","version_name":"4.0.4","version_date":"2021-01-28 15:38:42.000 +0800","version_description":"The Pexels app has a fresh new design! We hope you'll find it easier to use.<br> - This is a minor update to the design release that fixes images loading in iOS 14"},{"version_id":"840471686","version_name":"4.0.8","version_date":"2021-02-13 00:15:20.000 +0800","version_description":"The Pexels app has a fresh new design! We hope you'll find it easier to use.<br> - This update improves the share extension, and includes support for a fun new iOS 14 widget."},{"version_id":"841053102","version_name":"4.0.11","version_date":"2021-03-25 20:49:33.000 +0800","version_description":"We've squashed some bugs, and are happy to introduce a feature to save your data when browsing without wifi!"},{"version_id":"842013653","version_name":"4.0.14","version_date":"2021-05-03 23:37:48.000 +0800","version_description":"Thanks for using the official Pexels app! This update unlocks avatar uploads so you can personalize your profile. We also fixed some bugs for you. Enjoy!"},{"version_id":"843061149","version_name":"4.1.4","version_date":"","version_description":""}]