[{"version_id":"835781100","version_name":"1.10.0","version_date":"2020-05-04 07:53:07.000 +0800","version_description":"Jump into the arena with your most powerful line-up of heroes as we have created a new matchmaking system which will give you more fair, fun and rewarding matches. However, before you set your team you might need to reconsider your strategy because towers and castles are now immune to critical damage. Furthermore, we have implemented some quality-of-life improvements to the UI like for example status icons on the hero portraits for when your heroes become enraged, dazed etc."},{"version_id":"838056368","version_name":"1.13.0","version_date":"2020-10-05 11:08:43.000 +0800","version_description":"It's time for things that go bump in the night as we head into the Halloween month! The \"Creatures of the Dark\" event will play out over two weekends in October, and the month will also feature several new mini events! In the campaign, explore the horros of the Darkfire Citadal. Make sure you also check out the new multi-salvage feature, share loadouts and replays in the clans, and challenge clanmates to friendly battles!"},{"version_id":"838350920","version_name":"1.14.1","version_date":"","version_description":""},{"version_id":"839484970","version_name":"1.15.0","version_date":"2020-12-07 12:43:05.000 +0800","version_description":"Update 1.15 is ready and we have prepared an action-packed update filled with new Campaign levels, new Events, a new Clan Bonus offer, a Reminder system, new Leaderboards and more. So, get ready to set your sails and journey to Darbad, the fabled island of treasure, where fortune, mysteries and also new heroes are waiting for you and the rest of the Darkfire Heroes."},{"version_id":"840010661","version_name":"1.16.2","version_date":"2021-01-15 09:22:56.000 +0800","version_description":"Gear up for 2021 with this update! Explore the Bandit Mountains in the campaign, and prepare for Moonlight Monsters, the event theme for January - complete with new heroes, spells, skins, and gear. Don your monster hunting outfit and head out in the darkness, in search of beasts and treasure! All this and more in update 1.16!\n<br>\n<br>1.16.2 features an improved network protocol to optimize bandwidth and traffic."},{"version_id":"840441631","version_name":"1.17.2","version_date":"2021-02-12 10:17:43.000 +0800","version_description":"After fighting their way up the Bandit Mountains, the Darkfire Heroes find themselves at the gates of the ancient City on the Mountain. The city has recently been attacked by evil trolls and they are now controlling everything. Besides a new campaign level, the Darkfire Heroes will also revisit two events from 2020: The Prince’s Tournament and Treasures of Darbad! And there’s more: Player level increased from 30 to 50! Spells can now be leveled all the way to 25! And more clan ranks!"},{"version_id":"840871953","version_name":"1.18.4","version_date":"2021-03-15 12:43:06.000 +0800","version_description":"This update is full of epic battles! Fight the restless dead on \"The Battle Plains\" and join the ferocious event \"Battle for Southmarsh.\" Great rewards are to be had as new heroes make their debut. What's more, the Elemental Dungeon has received a big visual upgrade and a player requested feature to switch between \"auto-play\" and \"speed up\" independently of each other has been added."},{"version_id":"840939159","version_name":"1.19.0","version_date":"2021-04-06 11:37:52.000 +0800","version_description":"Magical mists sweep the realm and portals to other realms open up. Re-enter the Dimension of Dread in the campaign. From the mist also emerges new magic, introducing a new hero and a new spell with the ability to clear your heroes of debuffs! We’re opening the Deeper Dungeons where the souls of ancient heroes hide. These souls can be captured and used to boost your heroes for a limited time!"},{"version_id":"841978950","version_name":"1.20.0","version_date":"","version_description":""}]