[{"version_id":"829664682","version_name":"0.1.1","version_date":"","version_description":""},{"version_id":"830655400","version_name":"2.0.0","version_date":"2019-03-21 22:39:46.000 +0800","version_description":"تحسينات عامة و إصلاح بعض الأخطاء<br><br>Bug fixes and general improvements"},{"version_id":"830715339","version_name":"2.0.1","version_date":"2019-04-25 01:29:34.000 +0800","version_description":"تحسينات عامة و إصلاح بعض الأخطاء.<br>General improvements and bug fixes."},{"version_id":"831142209","version_name":"2.0.2","version_date":"2019-05-22 15:39:32.000 +0800","version_description":"General improvements and bug fixes.<br>تحسينات عامة و إصلاح بعض الأخطاء."},{"version_id":"831455791","version_name":"2.1.0","version_date":"2019-06-26 23:14:50.000 +0800","version_description":"1. New payment methods.<br>2. New app features. <br>3. General improvements and bug fixes.<br>1. إضافة طرق دفع جديدة.<br>2. ميّزات جديدة للتطبيق.<br>3. تحسينات عامة و إصلاح بعض الأخطاء."},{"version_id":"831859030","version_name":"2.2.0","version_date":"2019-07-03 22:30:50.000 +0800","version_description":"1. راح تجيك إشعارات مباشرة وتقدر تدخل على سجل حسابك.<br>2. عدل أو وقف باقتك وقت ماتحب<br>3. ادفع بسهولة بالبطاقة اللي تناسبك ائتمانية أو مدى<br><br>1. Get real-time notifications and access your complete account history.<br>2. Change or pause your plan whenever you like.<br>3. Pay easily with credit, debit or mada card."},{"version_id":"831909927","version_name":"2.2.1","version_date":"2019-07-06 22:04:18.000 +0800","version_description":"تحسينات عامة و إصلاح بعض الأخطاء.<br><br>General improvements and bug fixes."},{"version_id":"831964213","version_name":"2.2.2","version_date":"2019-07-16 17:42:55.000 +0800","version_description":"General improvements and bug fixes.<br>تحسينات عامة و إصلاح بعض الأخطاء."},{"version_id":"832709845","version_name":"2.3.0","version_date":"2019-09-16 19:29:42.000 +0800","version_description":"1. إعادة تصميم و تحسين تجربة إنضمام العملاء عبر التطبيق.\n<br>2. تحسينات عامة في التصميم و تجربة العملاء.\n<br>3. تعديلات عامة في الأداء و إصلاح بعض الأخطاء.<br><br>1. Redesigned and enhanced customer onboarding experience.\n<br>2. General design and experience improvements. \n<br>3. General performance enhancements and bug fixes"},{"version_id":"832938529","version_name":"2.3.1","version_date":"2019-09-27 17:59:32.000 +0800","version_description":"General improvements and bug fixes.<br>تحسينات عامة و إصلاح بعض الأخطاء"},{"version_id":"833074479","version_name":"2.4.0","version_date":"2019-11-10 04:06:08.000 +0800","version_description":"1. تحسين تجربة إنضمام العملاء و إضافة خصائص جديدة عبر التطبيق.<br>2. تعديلات عامة في الأداء و إصلاح بعض الأخطاء.<br><br>1. Enhanced customer onboarding experience and added new features.<br>2. General performance enhancements and bug fixes"},{"version_id":"833793710","version_name":"2.5.0","version_date":"2019-12-15 08:26:08.000 +0800","version_description":"1- Social Login with Apple ID<br>2- Customer number port-in (MNP)<br>3- Display PAYGO rates when client plan expires<br>4- General Bug Fixes <br><br>1- تسجيل الدخول بواسطة حساب Apple ID<br>2-توفير خدمة نقل الأرقام من مشغلين آخرين إلى فيرجن موبايل<br>3- عرض اسعار خدمة الدفع حسب الإستخدام عند انتهاء باقة العميل<br>4- إصلاح الأخطاء العامة"},{"version_id":"834180322","version_name":"2.6.0","version_date":"2020-01-08 17:26:13.000 +0800","version_description":"1- Onboard with quick self-activation<br>2- Keep track of your family with Family Tag<br>3- Manage multiple accounts with Family Plan<br>4- Twitter as social login<br>5- Fingerprint or face ID for sensitive transactions<br>6- Eligibility check during family onboarding<br>7- General enhancements and bug fixes<br><br>1- تفعيل ذاتي سريع لشريحة فيرجن موبايل<br>2-  تتبع عائلتك مع جهاز رابط العائلة<br>3- إضافة باقة العائلة الجديدة<br>4- إضافة خاصية التسجيل عن طريق Twitter<br>5- إضافة خاصية استخدام بصمة اليد أو الوجه للإتمام المعاملات الحساسة<br>6- تحقق الأهلية قبل إضافة جهاز رابط العائلة أو باقة العائلة<br>7-  إجراء تحسينات عامة وإصلاح الأخطاء"},{"version_id":"834443592","version_name":"2.6.1","version_date":"2020-01-21 22:15:53.000 +0800","version_description":"General enhancements and bug fixes<br> إجراء تحسينات عامة وإصلاح الأخطاء"},{"version_id":"834656134","version_name":"2.7.0","version_date":"2020-02-17 02:40:27.000 +0800","version_description":"New Features: <br>Promo code during onboarding<br>Enhancements: <br>Renew current plan now<br>Scan SIM for home delivery after receiving SIM<br>UI changes for plan selection during onboarding and change plan<br>Production Fixes and performance enhancements<br><br>مميزات جديدة:<br>إضافة رمز ترويجي أثناء التسجيل<br>التحسينات:<br>تجديد الباقة الحالية فوراً<br>إمكانية مسح الشريحة عند طلب استلام الشريحة من موقعك<br>تغييرات وتحسينات في واجهة المستخدم عند اختيار وتغيير الباقة<br>إجراء إصلاحات عامة وتحسينات في الأداء"},{"version_id":"834985382","version_name":"2.8.0","version_date":"2020-03-08 07:14:07.000 +0800","version_description":"- New features:<br>Pop ups to promote new and exciting offers/ packages<br>Customize the names of your Family plan members<br>Now you can give feedback on our products and services in the app through surveys<br><br>- Enhancements:<br>Dashboard modifications for Family plan<br>Improvement to the Home delivery experience<br>Improvements to social log in<br>New appearance of the app in store and on your phone<br>Improvements on Self Activation<br>- General bug fixes and performance enhancements<br><br>- مميزات جديدة:<br>سوف تظهر شاشة ترويجية لتعريف بالباقات والعروض الجديدة<br>إضافة خاصية التعديل والتحكم بأسماء مستخدمين خاصية باقة العائلة<br>تستطيع الآن مشاركتنا ملاحظاتك حول منتجاتنا وخدماتنا عن خلال استطلاع سريع<br><br>- التحسينات:<br>تعديل الإشعارات للوحة التحكم لخاصية باقة العائلة<br>تحسينات على خاصية توصيل الشرائح للمنزل<br>تحسينات في تسجيل الدخول عن طريق وسائل التواصل الاجتماعي<br>مظهر جديد للتطبيق في المتجر<br>تحسينات على خاصية التفعيل الذاتي للشريحة<br>- إجراء إصلاحات عامة وتحسينات في الأداء"},{"version_id":"835340598","version_name":"2.9.0","version_date":"2020-03-31 19:54:44.000 +0800","version_description":"- New Features:<br>Sign up for Family SIMs is now easier! You can now have multiple Family SIMs at the same time<br>Take full control of your mobile experience by adding and editing your family’s SIMs<br>You can now buy more than one Family Tag device at the same time!<br><br>- General enhancements, improvements and bug fixes.<br><br>- مميزات جديدة:<br>الآن صارت عميلة الاشتراك لخاصية باقة العائلة أسهل، تستطيع الآن إضافة العديد من الشرائح في نفس الوقت!<br>تحكم بشكل كامل في تجربتك الرقمية من خلال إضافة أو تعديل شرائح عائلتك<br>يمكنك الآن شراء أكثر من جهاز رابط العائلة في نفس الوقت!<br><br>- إجراء إصلاحات عامة وتحسينات في الأداء"},{"version_id":"835410274","version_name":"2.9.1","version_date":"2020-04-05 03:09:56.000 +0800","version_description":"- General bug fixes and performance enhancements<br>- إجراء إصلاحات عامة وتحسينات في الأداء"},{"version_id":"835415623","version_name":"2.9.2","version_date":"2020-04-06 01:54:21.000 +0800","version_description":"- General bug fixes and performance enhancements<br>- إجراء إصلاحات عامة وتحسينات في الأداء"},{"version_id":"835638110","version_name":"2.10.0","version_date":"2020-04-23 07:45:53.000 +0800","version_description":"New Features:<br>- Change your email settings and manage your account better.<br>Enhancements:<br>- Family plan and Family Tag settings improvements to the experience<br>- Vanity Number changes<br>- Exciting promo screens<br>- Better Notification experience<br>- Better Navigation in the app from notifications that we send you<br>General improvements and bug fixes to improve performance.<br>مميزات جديدة:<br>- قم بتغيير إعدادات بريدك الإلكتروني وإدارة حسابك بشكل أفضل.<br>التحسينات:<br>- تحسينات في تجربة التحكم بالإعدادات لخاصية باقة العائلة وجهاز رابط العائلة.<br> -تغييرات في الأرقام المميزة.<br> -شاشات ترويجية تحمسك.<br> -تحسين تجربة الإشعارات.<br> -تنقل بشكل أفضل في التطبيق من خلال الإشعارات التي سوف نرسلها لك.<br>إجراء إصلاحات عامة وتحسينات في الأداء."},{"version_id":"835960266","version_name":"2.11.0","version_date":"2020-05-17 23:36:30.000 +0800","version_description":"New features:<br>- New features for upcoming new products and services to be released soon.<br><br>Enhancements:<br>- Improvements on the display of current plans the customer has and the bonuses that they are eligible for. Better descriptions and separation to display what the customer has and until when<br>- Faster loading of app pages<br><br>General improvements and bug fixes<br><br>مميزات جديدة:<br>- إضافة مميزات لمنتجات وخدمات جديدة قادمة قريبًا.<br><br>التحسينات:<br>- تحسينات في طريقة عرض الباقات الحالية التي يمتلكها العميل والمكافآت التي يستحقها. شرح وتفصيل أفضل عن الباقات الحالية والمكافآت التي يمتلكها العميل والى متى تستمر.  <br>- تحميل أسرع لصفحات التطبيق<br><br>تحسينات عامة وإصلاح الأخطاء"},{"version_id":"836376633","version_name":"2.12.0","version_date":"2020-06-14 06:54:57.000 +0800","version_description":"New Features:<br>- Add another payment card ( Now you can have a total of 2 payment cards to top up your wallet)<br>- Top up with Apple pay ©  (Apple iOS only)<br><br>Enhancements:<br>- Improved Account statement visibility<br>- Screen enhancements for Family plan payment management<br>- Other Screen enhancements<br>- Login using fingerprint/Face ID will be enabled by default once it loads<br><br>General bug fixes and performance enhancements<br><br>مميزات جديدة:<br>- تستطيع الآن إضافة بطاقة دفع أخرى _يمكنك إضافة بطاقتين دفع لتعبئة رصيد محفظتك)<br>- قم بتعبئة رصيد محفظتك عن طريق استخدام Apple Pay<br><br>التحسينات:<br>- تحسين رؤية كشف الحساب<br>- تحسينات لشاشة إدارة المدفوعات لخاصية باقة العائلة<br>- تحسينات للشاشات الأخرى<br>- سيتم تمكين تسجيل الدخول باستخدام بصمة الإصبع / Face ID بشكل افتراضي بمجرد تحميله<br><br>إجراء إصلاحات عامة وتحسينات في الأداء"},{"version_id":"836461273","version_name":"2.12.1","version_date":"2020-06-17 19:46:07.000 +0800","version_description":"General bug fixes and performance enhancements<br>إجراء إصلاحات عامة وتحسينات في الأداء"},{"version_id":"836505258","version_name":"2.12.2","version_date":"2020-06-21 20:30:51.000 +0800","version_description":"General bug fixes and performance enhancements<br>إجراء إصلاحات عامة وتحسينات في الأداء"},{"version_id":"836629104","version_name":"2.13.0","version_date":"2020-06-30 01:02:59.000 +0800","version_description":"New Features:<br>- New and improved Apple Pay experience<br>- Visibility of e-SIM QR codes in the app settings and notifications<br><br>Enhancements:<br>- Keep up to date with our latest promotions in the Change plan screens<br>- Better information in the activation screens<br><br>General improvements and bug fixes<br><br>مميزات جديدة:<br>- تجربة جديدة ومحسنة لخدمة Apple Pay<br>- بإمكانك الآن رؤية رمز الباركود (QR) لشريحة الـeSIM في إعدادات التطبيق والإشعارات<br> <br>التحسينات:<br>- خلك على إطلاع بأحدث العروض الترويجية لدينا في شاشة تغيير الباقة<br>- توفر معلومات أفضل في شاشة التفعيل<br><br>إجراء إصلاحات عامة وتحسينات في الأداء"},{"version_id":"836982723","version_name":"2.14.0","version_date":"2020-07-26 02:09:28.000 +0800","version_description":"New Features:<br>- Linkage of notifications received to wallet top up screens in the app<br> <br>Enhancements:<br>- Various Screen enhancements on the application for plans, payment history and help menus.<br><br>General improvements and bug fixes<br><br>مميزات جديدة:<br>- ربط الإشعارات الواردة إلى شاشات تعبئة المحفظة في التطبيق<br> <br>التحسينات:<br>- تحسينات في شاشات مختلفة على تطبيق للباقات، سجل الدفع وقوائم المساعدة.<br> <br>تحسينات عامة وإصلاح الأخطاء"},{"version_id":"838159364","version_name":"2.15.0","version_date":"","version_description":""},{"version_id":"838229756","version_name":"2.16.1","version_date":"2020-11-04 13:07:44.000 +0800","version_description":"General bug fix<br><br>تحسينات عامة و إصلاح بعض الأخطاء"},{"version_id":"838519471","version_name":"2.16.2","version_date":"2020-11-13 23:02:27.000 +0800","version_description":"Enhancements:<br>- Waive eSIM charge for certain SIMs during onboarding<br>- Welcome Get Started screen for more clarity during on-boarding.<br>- Replace side drawer with navigation bar<br>- Minimal view of top bar in dashboard<br>- Cancel MNP request<br>- Remove customer email and image from top bar<br><br>تحسينات:<br>- تصميم جديد للصفحة الرئيسية لتصفح أفضل<br>- تطوير في القائمة الجانبية لتصفح أسهل<br>- تحسينات في خطوات نقل رقمك إلى فيرجن موبايل<br>- تطوير في طريقة عرض بياناتك<br>- تحسينات عامة و إصلاح بعض الأخطاء"},{"version_id":"839210291","version_name":"2.16.3","version_date":"","version_description":""},{"version_id":"839625063","version_name":"2.17.2","version_date":"2020-12-12 22:07:18.000 +0800","version_description":"General improvements and bug fixes.<br><br>تحسينات عامة و إصلاح بعض الأخطاء"},{"version_id":"839667884","version_name":"2.18.0","version_date":"2020-12-20 12:25:40.000 +0800","version_description":"New Features:<br>- You can take Anghami plus with selected Superstar+ plans or the buy-through option<br>- Customer information during check eligibility<br>- Enhancing customer onboarding journey<br>  <br>General improvements and bug fixes<br><br>مزايا جديدة:<br>- تقدر تأخذ ميزة أنغامي بلس من التطبيق عن طريق الاشتراك بباقات مختارة من باقات سوبرستار+ أو الاشتراك بباقة أنغامي من خلال تطبيق فيرجن موبايل<br>- إضافة خطوة معلومات العميل وقت الاشتراك<br>- تحسين تجربة اشتراك العميل<br> <br>تحسينات عامة وإصلاح بعض الأخطاء"},{"version_id":"839802943","version_name":"2.18.1","version_date":"2020-12-30 02:05:50.000 +0800","version_description":"General improvements and bug fixes<br><br>تحسينات عامة وإصلاح بعض الأخطاء"},{"version_id":"839865661","version_name":"2.19.0","version_date":"2021-01-27 17:06:08.000 +0800","version_description":"Dashboard User experience and User interface enhancements.<br>Easier and more intuitive Voucher top up screen.<br>Better Error messaging for Activations in case of failure.<br>Better information in case of non-connectivity of the app.<br>Profile picture enhancement for the account owner.<br><br>تطوير تجربة المستخدم مع تحسينات لواجهة المستخدم.<br>تحسين إضافة القسائم للحساب.<br>تحسين رسائل الخطأ في حالة فشل تفعيل الشريحة.<br>معلومات أفضل في حالة عدم اتصال التطبيق.<br>تحسين صورة الملف الشخصي لصاحب الحساب."},{"version_id":"840457176","version_name":"2.20.0","version_date":"2021-02-17 20:35:24.000 +0800","version_description":"Improving the home delivery experience with additional verification during the on-boarding<br>Updating the Pause plan experience for your plan<br>Improving the adding a payment card experience<br>Updating and improving the one-off payment card and voucher top-up experience<br>Updating and improving the add payment amount screen<br>Introduction of Payment in progress screen to avoid confusion<br>Improving  the auto top-up experience<br>Updating the wallet management experience<br>Updating the get a sim screen design during new customer sign up<br>Updating number selection screen design during new customer sign up<br><br>تحسين تجربة توصيل الشريحة<br>تحسين طريقة ايقاف الباقة<br>تطوير طريقة إضافة بطاقات الدفع<br>تحسين تجربة إعادة الشحن ببطاقات الشحن و الشحن لمرة واحدة<br>تحسين طريقة إختيار مبلغ الشحن<br>إضافة شاشة اثناء عملية الدفع لتوضيح حالة الدفع<br>تطوير تجربة الشحن التلقائي<br>تطوير طريقة إدارة المحفظة<br>تحسين شاشة الحصول على شريحة<br>تحسين شاشة إختيار الرقم"},{"version_id":"840541561","version_name":"2.21.0","version_date":"2021-02-26 02:00:47.000 +0800","version_description":"Frequently Asked Questions (FAQ) and Customer Help improvements- Easier navigation  and better experience.<br>New and enhanced Auto top up and one off top up experience for your wallet<br>Updating of Family plan auto top up, one off top up and request top up experience<br>Improved navigation on the top menu bar to manage your accounts and family plan<br>Updated and simpler Dashboard to view your details at a glance and improved detailed view.<br>Improved and dismissible promo banner to see the latest offers from Virgin.<br><br>اضافة الأسئلة الشائعة و تحسينات لمساعدة العملاء مع تصفح أسهل و تجربة أفضل.<br>تحسين استخدام ميزة الشحن التلقائي و اعادة الشحن لمرة واحدة.<br>تحسين استخدام ميزة الشحن التلقائي و عادة الشحن لمرة واحدة للأرقام التابعة أو أرقام أفراد العائلة.<br>تحسين استخدام القائمة لعرض الأرقام التابعة أو أرقام أفراد العائلة.<br>تحسين و تسهيل استخدام لوحة التحكم الرئيسية بشكل سريع و عرض تفاصيل أكثر.<br>تحسين لوحة العرض لطرح آخر العروض من فيرجن."},{"version_id":"840709449","version_name":"2.22.0","version_date":"","version_description":""},{"version_id":"841102395","version_name":"2.23.1","version_date":"2021-04-22 19:27:38.000 +0800","version_description":"The release  contain the following:<br>STARZPLAY and Anghami enhancements<br>General improvements and bug fixes.<br><br>الإصدار الجديد يحتوي على:<br>تحسينات ستارزبلاي و أنغامي<br>تحسينات عامة و اصلاح بعض الخلل في التطبيق"},{"version_id":"842095152","version_name":"2.24.0","version_date":"2021-05-30 23:06:20.000 +0800","version_description":"IDD User experience improvement<br>Roaming User experience improvement<br><br>تحسين تجربة الاتصال الدولي المباشر للمستخدم<br>تحسين تجربة التجوال للمستخدم"},{"version_id":"842483410","version_name":"2.25.0","version_date":"2021-06-10 21:26:37.000 +0800","version_description":"New:<br>Application rating feature<br> <br>Enhancements:<br>OTP verification expiry<br><br>الجديد:<br>خاصية تقييم التطبيق<br> <br> <br>التحسينات:<br>انتهاء صلاحية التحقق من كلمة المرور لمرة واحدة"},{"version_id":"842706890","version_name":"2.26.0","version_date":"2021-07-18 09:32:49.000 +0800","version_description":"تحسينات عامة و إصلاح الأخطاء<br>General Improvement and bug fixes"},{"version_id":"843262099","version_name":"2.27.0","version_date":"2021-08-12 09:22:04.000 +0800","version_description":"The following features are included with Release v2.27:<br>    eSIM Double Data Promotion for Virgin Digital Plans<br>    New Family Data Sharing Feature which allows you to share up to 20gb for five friends or family<br>    Order a SIM Replacement directly in the Virgin Mobile App<br>: 27.2v سيتم تضمين الميزات التالية في الإصدار<br>-عرض الشريحة الالكترونية مع البيانات المضاعفة لباقات فيرجن موبايل الرقمية.<br>-ميزة مشاركة البيانات للباقة العائلية التي تتيح لك مايصل الى 20 جيجا بايت لخمسة أصدقاء أو لأحد افراد عائلتك.<br>-إطلب استبدال شريحتك مباشرة في تطبيق فيرجن موبايل."}]