[{"version_id":"833586822","version_name":"2.2.0","version_date":"2019-11-17 23:05:10.000 +0800","version_description":"Financial stability is important. That’s why in this version we added stablecoins! You can now store and purchase Dai, USD Coin, Paxos Standard, Tether and more. \n\nYou’ll also find a convenient way to organize your wallet so you can see all the assets we support and keep your app nice and uncluttered.\n\nGot any feedback for us? Reach out to us from inside the app and we’ll get back to you in minutes. We love chatting with our customers :)"},{"version_id":"834573719","version_name":"2.7.0","version_date":"2020-02-04 19:07:39.000 +0800","version_description":"You know that nice picture on your ZenGo home screen? Now you can customize it with several beautiful options from our new image gallery!\n\nWe also added a way for you to export your activity history to a CSV file, delivered to your inbox. You can also share completed transactions in one tap.\n\nWe hope you enjoy this version, and as always you can reach out to us from inside the app with any feedback. We love chatting with our customers :)"},{"version_id":"834926288","version_name":"2.8.0","version_date":"2020-03-08 13:45:05.000 +0800","version_description":"Savings is here! Now you can earn daily interest and rewards on Dai, USD Coin, Tezos, and more, all in a few taps. \n\nIt’s the easiest way to earn passive income in crypto. Safe and simple. \n\nLet us know what you think :)"},{"version_id":"835163989","version_name":"2.9.2","version_date":"2020-03-22 15:35:09.000 +0800","version_description":"Buying crypto with SEPA and GBP bank transfers is now available to our European customers! Enjoy lower fees than purchasing with a credit card. \n\nOther than that, we’ve been hard at work tightening a few loose screws under the hood. The app runs like a charm now :)"},{"version_id":"835520724","version_name":"2.10.1","version_date":"2020-04-19 21:25:56.000 +0800","version_description":"Ever wondered, “what if my face suddenly becomes unrecognizable?” Believe it or not, we get this question all the time, so we built a solution! Now you (and only you) can use a close family member or friend’s face to restore your wallet. Here’s to a little extra peace of mind :) \n\nWe also now support custom Tezos bakers, so you can earn staking rewards from any baker of your choice."},{"version_id":"835801090","version_name":"2.11.0","version_date":"2020-05-05 20:40:47.000 +0800","version_description":"Crypto for everyone! Now you can easily buy crypto with a credit card or bank transfer in 188 countries around the world with our new Coinmama integration.\n\nWe also made several other improvements to make your ZenGo experience even smoother. \n\nWe hope you enjoy this version, and as always you can reach out to us from inside the app with any feedback. We love chatting with our customers :)"},{"version_id":"836055837","version_name":"2.12.0","version_date":"2020-05-27 11:15:48.000 +0800","version_description":"Now you can swap one crypto asset for another, all from the safety of your ZenGo wallet!\n\nAll the assets in your ZenGo wallet are tradeable, including Bitcoin, Ethereum, Tezos, USD Coin, and more. \n\nLet us know what you think :)"},{"version_id":"836420657","version_name":"2.13.0","version_date":"2020-06-16 21:14:13.000 +0800","version_description":"Local currencies are here! Watch your crypto grow in dollars, euros, pounds sterling, or any other currency.\n\nReach out in the app and let us know what you think. We love hearing from you :)"},{"version_id":"836717209","version_name":"2.14.0","version_date":"2020-07-07 18:35:04.000 +0800","version_description":"Now you can store COMP and WBTC in ZenGo. With WBTC, you can also invest in ZenGo Savings, giving you exposure to the value of Bitcoin while also earning interest!"},{"version_id":"836811414","version_name":"2.14.2","version_date":"2020-07-13 14:04:45.000 +0800","version_description":"Start your engines! After a little tinkering under the hood, opening the app is now blazing fast. Four times faster to be exact :)"},{"version_id":"837194474","version_name":"2.15.0","version_date":"2020-08-04 20:58:53.000 +0800","version_description":"Invite your friends and followers to try ZenGo and get 50% of our commission every time they buy crypto! They'll receive a nice cashback reward, too. \n\nEarning free crypto was never so easy :)"},{"version_id":"837939125","version_name":"2.16.3","version_date":"2020-09-25 23:53:07.000 +0800","version_description":"Historical charts — Now you can see your portfolio investment performance and market data over time! No need for that old portfolio tracker anymore :)\n\nTerraUSD, TerraKRW, Luna — We also added support for a suite of fast-settling, low-fee, price-stable assets geared toward global payments from the Terra project. Buy them at zero fees for a limited time, only in ZenGo!"},{"version_id":"838886610","version_name":"2.17.2","version_date":"2020-11-11 22:06:52.000 +0800","version_description":"This update includes a few bug fixes and performance improvements. "},{"version_id":"839382374","version_name":"2.18.0","version_date":"2020-12-01 19:16:29.000 +0800","version_description":"Earned free crypto yet? If not, check out our referral program. We just increased the cashback reward your friends get on their first purchase to $10, and you’ll get 50% of our commissions every time they purchase during their first year!\n\nOther than that, we made some improvements and squashed a few bugs to make the app run smoother than ever :)"},{"version_id":"839465510","version_name":"2.18.1","version_date":"2020-12-03 00:48:38.000 +0800","version_description":"Earned free crypto yet? If not, check out our referral program. We just increased the cashback reward your friends get on their first purchase to $10, and you’ll get 50% of our commissions every time they purchase during their first year!\n\nOther than that, we made some improvements and squashed a few bugs to make the app run smoother than ever :) "},{"version_id":"839708650","version_name":"2.19.0","version_date":"2020-12-24 16:34:54.000 +0800","version_description":"Want to sell your crypto and take some well-earned profits to the bank? If you’re an EU or UK resident with a SEPA or GBP bank account, you can now cash out in a few taps!\n\nWe also added support for purchasing crypto with Google Pay, Samsung Pay, and instant GBP bank transfers.\n\nBuying and selling crypto has never been so zen :)"},{"version_id":"840044345","version_name":"2.20.0","version_date":"2021-01-18 17:46:03.000 +0800","version_description":"Now you can add a secondary email to your account, in case you lose access to your primary one. You can restore your wallet with both emails. A little extra peace of mind :)"},{"version_id":"840428427","version_name":"2.21.0","version_date":"2021-02-14 15:50:04.000 +0800","version_description":"Now you can copy your ZenGo backup file into additional cloud services for extra security, and for a smooth transition between mobile platforms if you ever choose to switch.\n\nIn other news, our referral program now supports Bitcoin! Invite your friends to ZenGo and earn BTC when they join and purchase crypto.\n\nEnjoy :)"},{"version_id":"840541563","version_name":"2.21.1","version_date":"2021-02-21 17:15:31.000 +0800","version_description":"Now you can copy your ZenGo backup file into additional cloud services for extra security, and for a smooth transition between mobile platforms if you ever choose to switch.\n\nIn other news, our referral program now supports Bitcoin! Invite your friends to ZenGo and earn BTC when they join and purchase crypto.\n\nEnjoy :)"},{"version_id":"840616110","version_name":"2.21.2","version_date":"2021-02-28 15:01:40.000 +0800","version_description":"This version includes a few small fixes and improvements. \n\nJust in case you missed it, now you can copy your ZenGo backup file into additional cloud services for extra security, and for a smooth transition between mobile platforms if you ever choose to switch.\n\nIn other news, our referral program now supports Bitcoin! Invite your friends to ZenGo and earn BTC when they join and purchase crypto."},{"version_id":"841051524","version_name":"2.22.1","version_date":"2021-03-25 15:27:55.000 +0800","version_description":"Have a need for speed, or prefer to save money by sending a slower transaction? Now you can adjust the blockchain network fees for transactions according to your preference.\n\nIn other news, we had to stop using referral links, but you can still share the referral code itself with your friends. They just need to enter it manually when they sign up.\n\nAlso, you may find a nice little surprise if your portfolio performs well, but we’ll let you discover that by yourself :)"},{"version_id":"841963569","version_name":"2.23.0","version_date":"2021-05-12 14:56:16.000 +0800","version_description":"Now you can earn daily compound interest on your Bitcoin! Just deposit your BTC into Savings, sit back, relax, and watch your portfolio grow. Safe and simple.\n\nIn other news, we added support for over 20 new ERC20 tokens including 1inch, FTX Token, Polygon, and more. Ka-ching :)"},{"version_id":"842711298","version_name":"2.24.0","version_date":"2021-06-22 18:44:26.000 +0800","version_description":"Support for Doge is finally here! Much wow. Very coin.\n\nYou can now stop or speed up a transaction before it’s confirmed on the blockchain. Works for BTC, ETH, and ERC20 tokens. \n\nTransactions are now easier to understand with our new simplified transaction details screen. We added a user-friendly summary of all the key information instead of just linking to an external explorer."},{"version_id":"842894201","version_name":"2.24.1","version_date":"2021-07-01 20:23:51.000 +0800","version_description":"This version includes several bug fixes and stability improvements. \n\nIf you didn't catch the last update, Dogecoin is now available in ZenGo! Much wow. Very coin. "},{"version_id":"842914509","version_name":"2.24.2","version_date":"2021-07-03 00:22:02.000 +0800","version_description":"This version includes several bug fixes and stability improvements. \n\nIf you didn't catch the last update, Dogecoin is now available in ZenGo! Much wow. Very coin. "},{"version_id":"843775787","version_name":"3.0.1","version_date":"2021-08-29 15:34:23.000 +0800","version_description":"Check out our new look! We redesigned the entire app, carefully hand-crafting every pixel for you.\n\nYou now have an Actions screen where you can send, receive, buy, sell, trade, and earn from one central and easy-to-find location.\n\nYou’ll also notice the new and improved Home screen where all the assets in your wallet and savings are combined into a single balance.\n\nWe hope you enjoy the new design as much as we enjoyed creating it :)"},{"version_id":"844115572","version_name":"3.1.0","version_date":"2021-09-19 17:54:37.000 +0800","version_description":"United States customers: You can now sell your BTC for USD, deposited directly into your bank account! So go cash out some profits. You deserve it ;)"},{"version_id":"844525879","version_name":"3.1.1","version_date":"2021-10-10 15:52:38.000 +0800","version_description":"In this version, we've ended the ability to deposit into the Compound lending protocol in preparation for the switch to Nexo, our new lending partner. Get ready for much higher APYs and lower fees! Earning passive crypto income has never been so Zen :)"},{"version_id":"845145103","version_name":"3.1.3","version_date":"2021-11-08 16:52:52.000 +0800","version_description":"We made a few adjustments to improve the app experience. They're not changes you'll see, but ones you'll surely notice. "},{"version_id":"845281618","version_name":"3.2.0","version_date":"2021-11-15 21:06:04.000 +0800","version_description":"Woof! Shiba Inu (SHIB) tokens are now supported on ZenGo. Buy, sell, send, receive, and trade SHIB in a few simple taps.\n\nWe're also introducing an easier, faster, cheaper way to trade crypto, nearly anywhere in the world. Ready, Zen, Go :)"},{"version_id":"845419370","version_name":"3.2.1","version_date":"2021-11-21 17:11:39.000 +0800","version_description":"Well, hello there. You found us! You're pretty detail-oriented, aren't you? We are too. Nice :)\n\nJust a few odds and ends to fix up. Onward!"},{"version_id":"845906333","version_name":"3.3.0","version_date":"2021-12-14 16:17:17.000 +0800","version_description":"Want to trade one asset for another? Our improved trading platform is faster, smoother, fun-ner? Enjoy!"}]