[{"version_id":"831660621","version_name":"2.2.0","version_date":"2019-06-20 08:49:26.000 +0800","version_description":"Pour vous garantir une application toujours plus adaptée à vos besoins, nous prenons en compte vos remarques !<br>Nous avons intégré des correctifs et des petites améliorations afin de vous offrir une expérience plus fluide.<br><br>Vous aimez l'application ? Notez-la ! Grâce à vos commentaires, votre application MY Renault évolue en permanence pour vous garantir la meilleure expérience."},{"version_id":"834815304","version_name":"4.0.4","version_date":"2020-03-17 08:35:55.000 +0800","version_description":"Nous mettons à jour l’application MY Renault aussi souvent que possible, pour plus d’efficacité et de fiabilité. Voici quelques-unes des améliorations apportées lors de la dernière mise à jour : \n<br>-Correction de bugs visant à améliorer notre produit\n<br>-Plus d’informations relatives aux bornes de recharge (position, heure d’ouverture, type de prise…) \n<br>-Possibilité de contacter un concessionnaire directement depuis l’app"},{"version_id":"839353957","version_name":"4.63.5","version_date":"2020-12-01 07:10:48.000 +0800","version_description":"Correction de bugs et amélioration des performances."},{"version_id":"839761493","version_name":"4.64.2","version_date":"2021-01-07 13:53:10.000 +0800","version_description":"Corrections de bogues et améliorations des performances:\n<br>Nous avons amélioré l'affichage du mode de charge et de l'horaire. Il est désormais plus facile de sélectionner la manière dont vous souhaitez recharger votre voiture et de gérer votre emploi du temps.\n<br>Il se fait tard ? Activez notre nouveau mode sombre pour une expérience visuelle exceptionnelle dans des environnements peu éclairés! Épargnez vos yeux et continuez à profiter de notre application;)"},{"version_id":"841104444","version_name":"4.68.3","version_date":"2021-04-07 10:10:26.000 +0800","version_description":"Nous mettons à jour l'application MY Renault le plus souvent possible, pour plus d'efficacité et de fiabilité. Voici quelques-unes des améliorations apportées lors de la dernière mise à jour:\n<br>- Amélioration globale de l'ergonomie\n<br>- Nous avons amélioré l'interface de nos de nos e-guides afin de vous permettre d'apprendre et de découvrir de nouvelles choses sur votre voiture en toute simplicité ! \n<br>-La refonte de notre UI vous permet dorénavant de pour directement contacter notre service client afin de souscrire à de nouveaux contrats\n<br>-Le compte à rebours affiché sur l'application a été augmenté à 10 minutes dans le cadre de la climatisation à distance.\n<br>- Nous avons également corrigé un bogue qui faisait planter l'application pour certains utilisateurs. \n<br>\n<br>\n<br>Merci pour votre fidélité ! :)"}]