[{"version_id":"829244056","version_name":"0.2","version_date":"2020-01-24 23:05:30.000 +0800","version_description":""},{"version_id":"834487228","version_name":"0.2.1","version_date":"2020-01-27 16:49:06.000 +0800","version_description":"just a few small bug fixes!"},{"version_id":"834557392","version_name":"0.2.2","version_date":"2020-02-01 21:59:53.000 +0800","version_description":"hello! thanks for a great first week. this update has a few features and fixes you've been asking for:<br><br>* added the ability to copy and share links to bytes<br>* added a way to view your followers and people you're following. use the \"...\" button from your profile<br>* added the ability to pause bytes by tapping and holding on them<br>* added settings to control audio volume when viewing comments: default (do nothing), quiet (lower audio when viewing comments), mute (silence audio when viewing comments)<br>* changed like and comment #'s above 1000 be abbreviated as 1K, etc.<br>* fixed an issue with bytes randomly pausing in some instances<br>* you can now tap the blank area to dismiss search on the explore tab<br>* you can now tap the explore icon when you have the explore tab open to scroll to the top<br>* an issue that caused comments to jump around when leaving them should be fixed<br><br>more on the way!<br><br>*team byte"},{"version_id":"834801852","version_name":"0.2.3","version_date":"2020-02-21 22:06:13.000 +0800","version_description":"hello again! this update has a bunch of new features and fixes you've been asking for:<br><br>* added new feed called Your Mix to the main tab which recommends bytes to you<br>* added \"zen mode\", which turns off numbers and other distractions. it's on by default in Your Mix but can be turned on everywhere or turned off entirely<br>* audio on new bytes has been changed to stereo and compression quality has been increased<br>* video quality on bytes made with the in-app camera has been increased a bit as well<br>* added a self timer to the camera<br>* you can now save a byte to your camera roll before posting it by using the \"...\" menu on the preview screen<br>* you can now filter the activity tab by comments/likes/follows/mentions<br>* byte.co links will now open in the app<br>* the follow button now shows if someone is following you (\"follow back\") or if you are following each other (\"mutuals\")<br>* you can now copy a link to someone's profile from the \"...\" menu<br>* the date a byte was posted is now viewable from the comments/details screen<br>* commas for numbers above 1,000 have been added to loop counts and your stats<br>* fixed a bug that caused loop counts to be underreported. this fix will apply to new loops going forward<br>* the player will now start over and continue playing after 25 loops<br>* fixed a bug that caused bytes to pause when inserting/removing headphones<br>* profile feeds scroll with fewer hiccups<br>* sharing bytes over text has been improved<br>* the watermark on saved bytes no longer says beta (whoops!)<br><br>coming next: hashtags, grid view, new creation tools and way more on the way!<br><br>*team byte"},{"version_id":"834881022","version_name":"0.2.4","version_date":"2020-02-27 19:09:28.000 +0800","version_description":"another update! here's what's in this one:<br><br>* hashtags! there's a few features missing (autocomplete, search, sorting posts by trending) but we'll add that soon<br>* captions now show up in zen mode and are truncated to 1 line<br>* the \"insert clip\" tool has returned<br>* some bug fixes and minor improvements<br><br>thx,<br>byte"},{"version_id":"835046622","version_name":"0.2.5","version_date":"2020-03-11 14:37:56.000 +0800","version_description":"byte beats! now you can add perfectly looping music to your bytes. they’re kind of like audio filters and are really fun. we’ll add new beats every week.<br><br>here’s what else is new in this release:<br><br>* some posts in your mix will now have an explanation for how they got there (e.g. \"you follow this creator\", \"you like this creator\", \"spotlight”)<br>* hashtags with non-latin characters now work properly<br>* going forward the app should no longer use insane multi gigabyte amounts of storage<br>* other bugfixes and adjustments<br><br>more on the way soon!<br><br>ty,<br>byte"},{"version_id":"835183572","version_name":"0.2.6","version_date":"2020-03-20 13:54:14.000 +0800","version_description":"floaties allow you to add floating text or photos to the world w/ the rear camera, or make them float above your head w/ the selfie camera.<br><br>some tips:<br>- floaties work best in well lit areas with some definition (e.g. not a blank wall)<br>- w/ rear facing camera, you can select a floatie after you've placed it and pinch to scale it, or delete it<br>- w/ selfie camera, you can move a floatie by dragging it, or pinch to scale it<br><br>also added:<br>- an optional grid view on profiles!<br>- bug fixes and small improvements<br><br>*please note that floaties currently only work on newer devices. we're working on compatibility with more devices :)<br><br>thank u,<br>byte"},{"version_id":"835201330","version_name":"0.2.7","version_date":"2020-04-14 19:36:47.000 +0800","version_description":"* bytes can now be up to 8 seconds long<br>* you can now add text to your bytes. you can also tap any text you've added to change its timing and duration<br>* you can now add gif floaties to your bytes (requires an iPhone X or newer)<br><br>more soon!"},{"version_id":"835754987","version_name":"0.2.9","version_date":"","version_description":""},{"version_id":"835944861","version_name":"0.3","version_date":"2020-05-21 20:27:59.000 +0800","version_description":"Introducing Channels, a new way to discover and post videos on Byte. Channels are video communities on topics like cinematic, animation, funny, soothing, horror, and many more.<br><br>* Channels are moderated and include clear descriptions and rules so content stays relevant<br>* You can follow Channels, and their best bytes will show up in Your Mix<br>* Each Channel has a unique design and a Spotlight section for featured bytes<br><br>Also: removed Popular Now and squashed bugs."},{"version_id":"836106176","version_name":"0.3","version_date":"2020-05-21 20:27:59.000 +0800","version_description":"Introducing Channels, a new way to discover and post videos on Byte. Channels are video communities on topics like cinematic, animation, funny, soothing, horror, and many more.<br><br>* Channels are moderated and include clear descriptions and rules so content stays relevant<br>* You can follow Channels, and their best bytes will show up in Your Mix<br>* Each Channel has a unique design and a Spotlight section for featured bytes<br><br>Also: removed Popular Now and squashed bugs."},{"version_id":"836396787","version_name":"0.3.1","version_date":"2020-06-16 20:18:23.000 +0800","version_description":"bug fixes and improvements"},{"version_id":"836811816","version_name":"0.3.2","version_date":"2020-07-13 02:57:43.000 +0800","version_description":"new features based on your feedback:<br><br>- you can now like comments. replies are coming very soon<br>- you can can now change the color of your text<br>- follow creators by tapping the + on their posts<br>- add links to your usernames on other apps<br>- get notifications when a creator posts by tapping the bell on their page<br><br>some changes to make things easier:<br>- tapping now pauses the video, tapping and holding now opens the comments<br>- the app will now go to your profile after you make a post so you can see it<br>- and lots of bug fixes<br><br>thank you for being amazing. we love hearing your feedback and are already working on more new stuff for you, including sounds, comment replies, and way more. keep the feedback coming!"},{"version_id":"836949516","version_name":"0.3.3","version_date":"2020-07-22 23:40:24.000 +0800","version_description":"new features based on your feedback:<br><br>* SOUNDS!<br>* upload them from videos in your library<br>* name them and give them custom artwork<br>* see and use sounds from other bytes<br>* COMMENT REPLIES!<br><br>next up:<br>* color customizer<br>* better algorithm<br>* search and fav sounds<br>* and much more<br><br>thank you for being amazing. we love hearing your feedback and are already working on more new stuff as mentioned above. keep the feedback coming!"},{"version_id":"837003102","version_name":"0.3.5","version_date":"","version_description":""},{"version_id":"837244933","version_name":"0.3.6","version_date":"2020-08-07 14:22:03.000 +0800","version_description":"two new things:<br>- your rebytes and likes are now tabs on your profile. you can choose to hide or show your likes in profile settings.<br>- we now display approximate seconds watched instead of loop count. note that there’s a slight margin of error (the number we’re showing tends to be a bit lower than the true total). that’ll be fixed soon."},{"version_id":"837387222","version_name":"0.3.7","version_date":"2020-08-17 15:34:19.000 +0800","version_description":"the explore tab has been completely redesigned! next up: search + fav sounds, color customizer, and then a few surprises"},{"version_id":"837399047","version_name":"0.4","version_date":"2020-09-11 18:57:40.000 +0800","version_description":"this update includes a test of a new layout for posts in your feed, as well as some bug fixes and behind the scenes updates in preparation for new features. we're adding more features very soon!"},{"version_id":"837965623","version_name":"0.5","version_date":"2020-09-28 01:24:02.000 +0800","version_description":"why hello there. here's what's new:<br><br>* search and browse sounds in the camera<br>* add images on top of your video<br>* rotate text (and images!)<br>* favorite sounds<br>* improved video quality when making videos<br>* bug fixes<br><br>more soon!"},{"version_id":"838147710","version_name":"0.5.1","version_date":"2020-10-11 17:25:51.000 +0800","version_description":"* introduction to channels for new users<br>* bug fixes and improvements<br><br>more soon!"},{"version_id":"838321936","version_name":"0.5.2","version_date":"2020-10-23 22:47:49.000 +0800","version_description":"bug fixes and improvements. more features soon!"},{"version_id":"839270523","version_name":"0.5.3","version_date":"2020-11-19 17:23:01.000 +0800","version_description":"videos should load much faster. more features soon!"},{"version_id":"839289752","version_name":"0.5.4","version_date":"2020-11-22 00:56:41.000 +0800","version_description":"* videos should load much faster<br>More updates coming soon!"},{"version_id":"839469967","version_name":"0.6.0","version_date":"2020-12-03 23:54:13.000 +0800","version_description":"new on byte:<br>* direct messaging! tap the envelope icon on your home screen to start chatting with friends.<br>* bug fixes and improvements"}]