[{"version_id":"829929133","version_name":"0.0.6","version_date":"","version_description":""},{"version_id":"830035381","version_name":"1.0.1","version_date":"","version_description":""},{"version_id":"830059521","version_name":"1.0.2","version_date":"2019-01-24 20:17:24.000 +0800","version_description":"- Easier identity verification flow with example images<br>- More relaxed button colors<br>- Explanations in Markets about price<br>- Explanation in Vault about its functionality<br>- \"All-in\" quickbutton to buy an asset for all your credit amount<br>- \"100%\" quickbutton to sell all of an asset back to credit"},{"version_id":"830879287","version_name":"2.0.2","version_date":"2019-04-10 04:58:18.000 +0800","version_description":"Het gebruik van de BLOX app is nog eenvoudiger geworden. We hebben verbeteringen doorgevoerd op de account &amp; orderpagina en gewerkt aan de vertalingen. Ook kun je nu inloggen met een enkele klik via de go-social buttons.<br><br>Zoals altijd hebben we ook nog een hele reeks aan kleine aanpassingen doorgevoerd om te komen tot een optimale gebruikerservaring, zodat jij zorgeloos kunt beleggen in een veilige omgeving!"},{"version_id":"831018242","version_name":"2.3.1","version_date":"2019-04-24 17:03:05.000 +0800","version_description":"Ja ja, we zijn er weer met een update! Vanaf nu kun je;<br><br>- Direct zien hoe je euro balans er voor staat met de nieuwe euro teken tab. Vanaf nu dus nog makkelijker geld storten en opnemen.<br>- In de kluis is buiten de geïnvesteerde crypto’s nu ook je Euro krediet te zien zodat het overzicht nog duidelijker is.<br>- De dagelijkse limieten om geld te storten zijn opgehoogd.<br><br>Happy trading!"},{"version_id":"831096748","version_name":"2.4.0","version_date":"2019-04-30 20:28:57.000 +0800","version_description":"Wij zijn verheugd om weer met een update te komen!  Wat is er deze week allemaal veranderd?<br><br>- Verbetering van de e-mail verificatie flow<br>- Toevoeging van coin icoontjes in het orderhistorie overzicht<br>- Optimaliseren van de \"1 klik\" social registreer &amp; log in functie<br>- Automatisch updates van je euro saldo na een bankopname<br>- Vereenvoudiging van het storten en opnemen van euro’s<br><br>Happy trading!"},{"version_id":"831269656","version_name":"2.5.0","version_date":"2019-05-12 11:37:55.000 +0800","version_description":"We zijn weer hard aan het werk gegaan en hebben de volgende verbeteringen voor jou doorgevoerd!<br><br>- Verbetering van de weergave van historisch trade orders, dat maakt het allemaal wat overzichtelijker :)<br>- Toevoegen van de Nederlandse taal in het proces van id verificatie, wel zo handig<br>- Verbetering van de gebruiksvriendelijkheid van het aan en verkoopproces binnen de app<br><br>Happy trading!"},{"version_id":"831422778","version_name":"2.6.0","version_date":"2019-05-27 11:07:33.000 +0800","version_description":"Dit is wat jij in deze update van ons kunt verwachten!<br><br>- We hebben het orderhistorie overzicht aangepast en hiermee overzichtelijker gemaakt.<br>- We hebben de Nederlandse taal toegevoegd in het id verificatie proces.<br>- Tot slot hebben we het aan- en verkoopproces verbeterd op basis van waardevolle feedback van users.<br><br>Happy trading!"},{"version_id":"831457232","version_name":"2.6.1","version_date":"2019-05-28 10:50:53.000 +0800","version_description":"Dit is wat jij in deze update van ons kunt verwachten!<br><br>- We hebben het orderhistorie overzicht aangepast en hiermee overzichtelijker gemaakt.<br>- We hebben de Nederlandse taal toegevoegd in het id verificatie proces.<br>- Tot slot hebben we het aan- en verkoopproces verbeterd op basis van waardevolle feedback van users.<br><br>Happy trading!"},{"version_id":"831474551","version_name":"2.7.0","version_date":"","version_description":""},{"version_id":"831518072","version_name":"2.7.1","version_date":"2019-05-31 15:37:15.000 +0800","version_description":"Deze app release bevat een fix om weer makkelijk voor het gehele bedrag te kunnen kopen, all-in!"},{"version_id":"832268288","version_name":"2.8.3","version_date":"2019-08-07 19:07:04.000 +0800","version_description":"Het gebruik van de app is verbeterd met een aantal tekstuele aanpassingen. Ook hebben we het nog makkelijker gemaakt om je identiteit te uploaden. Tot slot is de stabiliteit van de app verder verbeterd."},{"version_id":"832330650","version_name":"2.8.4","version_date":"2019-08-11 19:07:14.000 +0800","version_description":"In deze release is de basis gelegd voor de komst van promo codes zodat jij binnenkort je vrienden kan uitnodigen om het gemak van BLOX te ervaren."},{"version_id":"832413061","version_name":"2.8.5","version_date":"2019-08-17 10:11:51.000 +0800","version_description":"In deze release is de basis gelegd voor de komst van promo codes zodat jij binnenkort je vrienden kan uitnodigen om het gemak van BLOX te ervaren."},{"version_id":"832663396","version_name":"2.9.0","version_date":"2019-09-06 09:25:57.000 +0800","version_description":"Het gebruik van de live in app chat functie is verbeterd! Heb jij een vraag? Spreek ons aan in de chat :)"},{"version_id":"832755674","version_name":"2.9.2","version_date":"2019-09-13 10:32:59.000 +0800","version_description":"Promotie codes staan live! Neem contact op met onze support om een BLOX affiliate te worden."},{"version_id":"833218889","version_name":"2.10.1","version_date":"2019-10-29 17:46:12.000 +0800","version_description":"Bancontact betalingen zijn weer volledig up and running! Fund je account direct met jouw favorite betaalmethode. Ook hebben we de kluis view wat aangepast. Vanaf nu kun je de euro balans altijd direct vanaf de kluis pagina zien :)."},{"version_id":"833397328","version_name":"2.11.0","version_date":"2019-10-30 17:37:44.000 +0800","version_description":"The live chat functie werkte na onze laatste release niet altijd even goed. We fixed it!"},{"version_id":"833794922","version_name":"2.12.0","version_date":"2019-12-05 17:33:17.000 +0800","version_description":"Yes! BLOX is nu nog beter. Check hier onze updates:<br><br>Maandelijks meer kopen en verkopen<br>Vanaf nu kan je maandelijks voor een bedrag van 50.000 euro crypto kopen. Happy trading!<br><br>Bekijk wachtwoord tijdens inloggen<br>Zo maak je nooit meer een typefout. Maar kijk eerst goed links, rechts, en achter je. Staat er niemand mee te gluren?<br><br>Meer informatie over je kluis<br>Wij houden van lekker duidelijk. Klik op het i-icoontje in je kluis voor meer informatie. Hier lees je hoe het bedrag in je kluis is opgebouwd.<br><br>Hulp bij registreren<br>Lukt het drie keer niet om je documenten op te sturen? Dan verschijnt er een knop waarmee je handmatig documenten kan versturen. Gaat het deze keer zeker goed!"},{"version_id":"833982927","version_name":"2.13.0","version_date":"2019-12-13 13:47:34.000 +0800","version_description":"In deze update van BLOX de volgende verbeteringen:<br><br>Account aanmaken, een fluitje van een cent<br>Maak je een account aan en heb je een foutje gemaakt door bijvoorbeeld een afwijkend tweede wachtwoord in te vullen? Maakt niet uit! Vanaf nu blijven alle gegevens ingevuld en hoef je alleen het verkeerde invulveld te fixen. Ook wordt overal waar je een e-mailadres moet invullen standaard het juiste toetsenbord inclusief @ getoond. <br><br>Blox maakt het leven makkelijk<br>In alle velden waar je alleen getallen hoeft in te vullen verschijnt vanaf nu een numpad.<br><br>Mijn eerste aankoop<br><br>Voor het eerst in je leven geld gestort op BLOX? Nice! Om het je makkelijk te maken krijg je nu eerst een tussenscherm zodat het duidelijk is dat je met een storting niet direct crypto’s hebt gekocht.<br><br>Fijne kerst gewenst!"},{"version_id":"835244115","version_name":"2.14.1","version_date":"2020-03-24 15:22:01.000 +0800","version_description":"We hebben een aantal kleine verbeteringen doorgevoerd om jou de best mogelijke ervaring te geven. Download de nieuwste versie vandaag nog!"},{"version_id":"835473937","version_name":"2.15.0","version_date":"2020-04-09 15:10:54.000 +0800","version_description":"Verdien geld met BLOX! Vanaf vandaag staat het vriendenprogramma live. Help je vrienden en vriendinnen op weg met crypto en nodig ze uit voor BLOX. Je ontvangt beide direct een bonus bedrag aan euro's in je account. Veel succes!&nbsp;"},{"version_id":"835568447","version_name":"2.15.1","version_date":"2020-04-21 20:34:56.000 +0800","version_description":"Vanaf vandaag is het storten via een bankoverschrijving nog makkelijker en kunnen de algemene voorwaarden met een druk op de knop worden geaccepteerd. Happy trading!"},{"version_id":"835744171","version_name":"2.15.2","version_date":"2020-04-30 09:02:17.000 +0800","version_description":"Onze nieuwe maintenance mode notificatie pagina staat vanaf vandaag live."},{"version_id":"839956949","version_name":"3.2.1","version_date":"","version_description":""}]