[{"version_id":"830320458","version_name":"1.3.2","version_date":"2019-12-28 14:21:30.000 +0800","version_description":"- New: Use Option+K to pick a key to highlight when browsing an array of dictionaries. Navigate the list of possible keys to highlight using the arrow keys.<br>- New: Use CMD+Shift+O to present already open documents.<br>- New: Press enter to start editing text when viewing a single value. Press escape to stop editing.<br>- New: Use Option+S to share the document or the current value.<br>- New: Settings can now be navigated with the arrow keys. <br>- New: The JSON parser is now much faster.<br>- New: Choose if keys and values should be auto-capitalized and autocorrected in settings.<br>- New: \"Read from Clipboard\" have been renamed to \"Open from Clipboard\".<br>- Bugfix: Sometimes characters couldn't be deleted when editing a value.<br>- Bugfix: Numbers written with scientific notation could not be parsed if they included an uppercase E.<br>- Bugfix: The document browser did not display a progress indicator while opening a document.<br>- Bugfix: Creating a split or tab by long pressing a breadcrumb would result in an incorrect navigation hierarchy."},{"version_id":"830320458","version_name":"1.1.1","version_date":"2019-02-18 05:32:34.000 +0800","version_description":"- New: On first launch, new users are now presented with a sample JSON file in order to quickly get started with the app.<br>- New: The value of highlighted keys can now be copied by long pressing an item in an array.<br>- Bugfix: Fixed issue where floating point numbers were sometimes displayed with an incorrect value."},{"version_id":"830810377","version_name":"1.1.2","version_date":"2019-03-31 16:06:38.000 +0800","version_description":"- New: Enabling the new “Compact JSON” setting for the plain text view, will show reduce the number of lines and the amount of indentation used when displaying the JSON as plain text.<br>- Bugfix: Fixed issue where decimal numbers were sometimes displayed with an incorrect value.<br>- Bugfix: Fixed issue where dictionary keys weren’t correctly escaped."},{"version_id":"833638324","version_name":"1.3","version_date":"2019-12-11 05:01:44.000 +0800","version_description":"Jayson is now available on the Mac! Bringing Jayson to the Mac also benefits the iOS and iPadOS versions of Jayson. This update adds support for navigating JSON with an external keyboard, improves drag and drop of splits and tabs, more customisation options, better error handling and much more.<br><br>- New: There's a bunch of new keyboard shortcuts for navigating and editing JSON on the iPad.<br>- New: Dragging a split into a tab will now move the split rather than copy it.<br>- New: Creating a new window from a split or a tab will now move the split or tab rather than copy it.<br>- New: Adds more type icon styles. Choose your style in the app settings.<br>- New: Long pressing a value now presents you with the options to edit, duplicate and delete the value.<br>- New: Values can be added without entering edit mode. You can configure your toolbar to always show the \"Add Value\" tool in the settings.<br>- New: Values can now be swiped to be deleting without being in edit mode.<br>- New: Choose any folder in which imported documents and documents created from the clipboard will be saved.<br>- New: Change the default name of new files and files crated from the clipboard from the settings. There's also a setting to use the current date and time as the default name.<br>- New: The menu presented when long pressing a value now shows icons.<br>- New: When failing to parse JSON documents, Jayson will show a short error message explaining why the parsing failed.<br>- New: Replaces the \"zooming\" transition with a fade transition when opening documents. <br>- Bugfix: Values in an array would sometimes have an incorrect index after being reordered.<br>- Bugfix: Fixed an issue where changes to the document wouldn't always be properly reflected when they were made in a different app.<br>- Bugfix: Sometimes the app would crash when navigating back after editing a value."},{"version_id":"833959410","version_name":"1.3.1","version_date":"2019-12-12 21:18:47.000 +0800","version_description":"- New: Adds support for pasting values into arrays and dictionaries using CMD+V. Values can be primitive values such as strings or numbers or entire JSON objects.<br>- New: Adds support for cutting values from arrays and dictionaries using CMD+X.<br>- New: Simplified the document creation flow. When creating a document, you will only need to choose if the root of the document should be a dictionary or an array. The new document is a temporary document, meaning that you will be prompted to save it when closing.<br>- New: Dims the background color of selected values in splits that are inactive. Only the active split responds to keyboard shortcuts.<br>- New: Adds a new setting on the iPad to dim the content of inactive splits. <br>- New: Adds the Shift+CMD+S keyboard shortcut for saving a copy of a document."},{"version_id":"834120110","version_name":"1.3.2","version_date":"2019-12-28 14:21:30.000 +0800","version_description":"- New: Use Option+K to pick a key to highlight when browsing an array of dictionaries. Navigate the list of possible keys to highlight using the arrow keys.<br>- New: Use CMD+Shift+O to present already open documents.<br>- New: Press enter to start editing text when viewing a single value. Press escape to stop editing.<br>- New: Use Option+S to share the document or the current value.<br>- New: Settings can now be navigated with the arrow keys. <br>- New: The JSON parser is now much faster.<br>- New: Choose if keys and values should be auto-capitalized and autocorrected in settings.<br>- New: \"Read from Clipboard\" have been renamed to \"Open from Clipboard\".<br>- Bugfix: Sometimes characters couldn't be deleted when editing a value.<br>- Bugfix: Numbers written with scientific notation could not be parsed if they included an uppercase E.<br>- Bugfix: The document browser did not display a progress indicator while opening a document.<br>- Bugfix: Creating a split or tab by long pressing a breadcrumb would result in an incorrect navigation hierarchy."},{"version_id":"834609092","version_name":"1.3.3","version_date":"2020-03-05 04:47:00.000 +0800","version_description":"- New: Adds the JetBrains Mono font.<br>- Bugfix: Opening a file located on a network drive would give an error."},{"version_id":"835365770","version_name":"1.3.4","version_date":"2020-04-02 05:13:02.000 +0800","version_description":"This update enhances the experience when using the app with a pointing device on the iPad.<br><br>- Pulls the pointer toward buttons in the toolbar when close to a button.<br>- Shows a tooltip when hovering the pointer over a button in the toolbar.<br>- Shows a move icon when hovering a pointer over the toolbar in a split, indicating that the split can be moved."},{"version_id":"836209570","version_name":"1.4","version_date":"2020-05-31 15:48:34.000 +0800","version_description":"- New: Adds the Prettify JSON action to Shortcuts. It takes a dictionary, list or text as input and outputs a pretty JSON string.<br>- New: Integrates better with the document browser for creating new files. Files will now be created in the folder you're browsing.<br>- New: Adds +/- button in the keyboard when adding or editing a number value.<br>- Bugfix: Numbers written with scientific notation (e.g. 7e+16) could not be parsed when they contained a plus.<br>- Bugfix: Sometimes decimal numbers weren't displayed correctly.<br>- Bugfix: The Get File action in Shortcuts no longer requires the file extension in order to find the file."},{"version_id":"839889858","version_name":"1.4.1","version_date":"2021-01-04 21:34:56.000 +0800","version_description":"Fixes issue where error messages would sometimes not be shown when Jayson failed to open a URL scheme."}]