[{"version_id":"833726776","version_name":"1.4","version_date":"2019-12-04 19:18:22.000 +0800","version_description":"iPad Support is Here<br><br>By pitchforks-and-torches levels of popular demand, Nebula now supports iPadOS. Enjoy your favorite Nebula Originals on your favorite tablet.<br><br>Also new in 1.4:<br><br>• Fixed a nasty cache bug which led to \"no videos found\" on the Featured view.<br>• Overhauled search to be more search-y.<br>• \"All Creators\" under \"Browse\" contains an option for viewing all recent videos.<br><br>A couple of secret features:<br>• Pull to silently refresh the featured view<br>• Double-tap on the right or left of the player to skip ahead or backwards.<br><br><br>We're working on more, but we wanted to hurry up and ship the iPad version before things got ugly. Thanks for your support, everyone. Enjoy."},{"version_id":"834108791","version_name":"1.4.1","version_date":"2019-12-22 16:00:11.000 +0800","version_description":"Merry Christmas, ya filthy animals. We wanted to get a few fixes and improvements out before we hit the egg nog. New in this release:<br>• Launch/loading experience is much improved.<br>• Videos in search are now sorted by date, newest first.<br>• Airplane mode will no longer sign you out of the app. Sorry, Mick.<br>• Channel view headers now collapse gracefully, giving more space to the content.<br>• Fixed an awkward crash when downloading videos.<br>• Thumbnails load faster.<br>• Not really an app update but have you seen Working Titles? So great."},{"version_id":"834371402","version_name":"1.5","version_date":"2020-01-23 00:54:28.000 +0800","version_description":"Hello darkness, my old friend.<br><br>• Dark mode. Total smoke show. You can manually toggle it in settings.<br>• Optional dark app icon, if you’re into that sort of thing.<br>• Featured tab now shows the latest videos.<br>• iOS can now auto-fill your password.<br><br>We’ve also dropped iOS 12 support so we can focus on new features. Sorry, iPhone 5 users."},{"version_id":"834581355","version_name":"1.6","version_date":"2020-02-06 21:54:49.000 +0800","version_description":"Assorted bug fixes and improvements. Just kidding; here’s what we actually did:<br><br>• There’s now a list of Originals right up at the top of the Featured view.<br>• About screen now supports dark mode.<br>• “Browse” has been reorganized slightly to make content easier to find.<br>• Swiping on hero images no longer sends images flying.<br>• Fixed some SSL errors.<br>• Fixed disappearing video descriptions when rotating.<br>• Thomas Frank did an episode of Working Titles and honestly the last four minutes are super weird. We’ll check in on him."},{"version_id":"834637711","version_name":"1.6.1","version_date":"2020-02-08 19:48:20.000 +0800","version_description":"Assorted bug fixes and improvements. Just kidding; here's what we actually did:<br><br>1.6.1<br><br>• Every Original in the Originals row had the word \"Original\" so we removed it because it's like okay, we get it, there are lots of Originals.<br><br>1.6<br><br>• There's now a list of Originals right up at the top of the Featured view.<br>• About screen now supports dark mode.<br>• \"Browse\" has been reorganized slightly to make content easier to find.<br>• Swiping on hero images no longer sends images flying.<br>• Fixed some SSL errors.<br>• Fixed disappearing video descriptions when rotating.<br>• Thomas Frank did an episode of Working Titles and honestly the last four minutes are super weird. We'll check in on him."},{"version_id":"834943989","version_name":"1.6.2","version_date":"2020-03-04 11:01:59.000 +0800","version_description":"This update is boring. Just a quick fix to help people log out of their account in some circumstances. Sorry to get your hopes up, but don't worry, fun stuff is still on the way."},{"version_id":"836346064","version_name":"1.7","version_date":"2020-06-12 11:42:58.000 +0800","version_description":"We're close to the finish line with the Apple TV app, but wanted to sneak out a quick update:<br><br>• Support for subtitles. We're still adding them to the videos, but our app is ready.<br>• You can now contact support from within the app."},{"version_id":"836830402","version_name":"1.7.1","version_date":"2020-07-15 18:09:25.000 +0800","version_description":"We wore masks while we worked on these updates.<br><br>• Manuel found a bug in My Shows where a channel doesn’t get properly updated upon refresh. We fixed it.<br>• Rene got a tweet from “Techinterested1” about our mis-colored player background. We changed it to black.<br>• Gruber asked us to make the gray channel names darker to improve accessibility. Done.<br>• Chris noted that our status bar stayed in place even in fullscreen mode on iPad. We fixed that.<br>• While fixing things for these nice people we spotted some minor UI things and fixed those too."},{"version_id":"836969457","version_name":"1.7.2","version_date":"2020-07-23 23:41:03.000 +0800","version_description":"• Look everyone, keyboard shortcuts for the iPad video player!<br>• Sometimes the app would crash when loading a video description. We put an end to that nonsense.<br>• Brave iPadOS beta users noticed that our tab labels were truncated. We fixed that too."},{"version_id":"837722442","version_name":"1.8","version_date":"2020-09-29 19:33:03.000 +0800","version_description":"• Added a sneak peek for podcasts. (Feature-length debut forthcoming.)<br>• Background audio makes its triumphant return for iOS 14 users.<br>• Downloads were acting out. We've shown them some love and added background support, download progress tracking, and fixed a number of bugs.<br>• \"Bug fixes\" and \"improvements\"."},{"version_id":"840646007","version_name":"1.9","version_date":"2021-02-26 19:13:59.000 +0800","version_description":"• Nebula Originals and Nebula Plus content are now badged as you browse around your favorite creators, making their exclusive content easier to spot.<br>• Improved podcast support. You can now browse and listen to podcasts natively within the app. <br>• A crash could occur in Browse on iPads. That's been fixed.<br>• Our image caching has been overhauled to address a few related bugs."},{"version_id":"841030687","version_name":"1.9.1","version_date":"2021-03-31 18:58:20.000 +0800","version_description":"• Fixed visual bug in Browse view where cells weren’t highlighting correctly.<br>• Changes under the hood to prepare for using the new API in the future."},{"version_id":"841176874","version_name":"1.9.2","version_date":"2021-04-02 11:52:25.000 +0800","version_description":"• Fixed a crash that some users were encountering while the app was loading data."},{"version_id":"841971762","version_name":"2.0","version_date":"2021-05-11 22:44:59.000 +0800","version_description":"• Remember how the app used to take forever to load? We fixed that. New API. Loads much, MUCH faster than before. Thank you all for being so patient."}]