[{"version_id":"833223229","version_name":"20191018","version_date":"","version_description":""},{"version_id":"833351353","version_name":"20191025","version_date":"","version_description":""},{"version_id":"833406333","version_name":"20191030","version_date":"2019-11-01 01:38:05.000 +0800","version_description":"Rec Room PATCH- rolling back last update!\n<br>Yesterday's update was very unstable. We are sorry about that :-/\n<br>We've rolled back the update while we investigate what went wrong. This means that some new features (e.g., the Maker Pen Audio, account logout functionality) will temporarily be unavailable.\n<br>We apologize for the confusion, and appreciate your patience while we get things back to a stable state!\n<br>Please see here for convenient links to controls, tutorials, comfort options, etc.: https://recroom.com/community\n<br>Thanks for playing Rec Room! As always, don't hesitate to give us your feedback =]"},{"version_id":"833465618","version_name":"20191101","version_date":"2019-11-07 15:07:40.000 +0800","version_description":"Rec Room Update - the \"More Tools, Fewer Bugs\" Edition!\n<br>\n<br>Creator Tools and Game Updates: \n<br>\n<br>When we released Stunt Runner, we also added a bunch of new features to our creative tools. But, whether you’re a creator yourself, of just someone who enjoys experiencing player created rooms, these features introduced some new forms of instability for all of us. \n<br>\n<br>For the past several weeks, we’ve been heads-down smashing all the newly introduced bugs we could find (and you’ve helped us find!), and we’ve also burned through a good amount of our creative community’s top-requested bug fixes. We greatly appreciate your patience and feedback in response to our last couple updates.\n<br>\n<br>Okay, here we go:\n<br>\n<br>* Impulse Volumes and Bounce Pads should now use their correct settings when loading a room or cloning an object\n<br>* You can now configure spawn points so that players keep tools on respawn instead of dropping them\n<br>* You can now select and change other objects from within trigger zones, without selecting the trigger zone itself\n<br>* We fixed a movement bug where multiple chained gizmos weren’t behaving as expected – they should move all gizmos and objects together correctly now\n<br>* You're now immediately prompted with a selection menu when merging new shapes into a costume\n<br>* Maker Pen objects should no longer collide while being transformed\n<br>* Moving Maker Pen objects which are parented should no longer put things in incorrect positions\n<br>\n<br>Halloween may be over but the \"Crank the Volume\" update is back from the dead!: \n<br>\n<br>It's alive! Maker Pen Audio is back!\n<br>\n<br>* Turn your volume up and get creating, Maker Pens have been upgraded to have new audio effects! \n<br>* Also we re-tuned some sound effects in other places too! Keep an ear out!\n<br>\n<br>Haunting you again, it's social upgrades: \n<br>\n<br>* Seeing how long you have to hold a button on iOS devices is now visible\n<br>* Screen mode can relax their hands, auto-pointing has been readjusted \n<br>* Tired of pushing a physical button to enter the shop? Screen mode players can now point at items to buy them!\n<br>* iOS devices should also find that scrolling requires less work\n<br>* Made some adjustments for iOS devices so menus won't get as clogged up\n<br>* iOS devices also got some fresh looks throughout, they are very fashionable now\n<br>* Do the wave! Now able to wave while doing a gesture on iOS devices\n<br>* Made some adjustments to prompts to make sure no one high fives behind your back\n<br>* No more phantom keyboard sounds when making an expression\n<br>* Talking with room chat and someone says something funny? Now able to laugh with them while typing\n<br>* Fixed tossing animation on screens\n<br>* Room chat gremlins now will only put you in time out if you're messaging too quickly, rather than after every message\n<br>* Inspect Mode now allows you to do \"roll\" rotations with two fingers and rotating on iOS devices\n<br>* Night vision goggles no longer required to see equipment you are holding on iOS devices\n<br>* Reserved item slots now have a lock icon on iOS devices \n<br>* No longer hiding your equipment on iOS devices, extra slot has reappeared\n<br>* Fixed up selfie mode, say cheese!\n<br>\n<br>Other spooky bugs crushed and improvements we made: \n<br>\n<br>* Fixed a shortcut in Stunt Runner so no one gets an early start\n<br>* Fixed performance in ^Paintball.Spillway for Oculus Quest by removing the big scoreboard\n<br>* Fixed rotation on iOS devices, should be snappy now!\n<br>* Fixed being able to hit buttons while holding bows\n<br>* Fixed not being able to drop offhand item on screen mode \n<br>RecTV mainenance request: \n<br>* Something seems to be caught in the ventilation system, can someone please fish it out? It's getting a little stuffy in here.\n<br>\n<br>Please see here for convenient links to controls, tutorials, comfort options, etc.: https://recroom.com/community\n<br>\n<br>Thank you for playing, and, as always, we love to hear your feedback! See you again soon! =]"},{"version_id":"833726879","version_name":"20191122","version_date":"2019-11-25 19:10:24.000 +0800","version_description":"Rec Room PATCH - for the \"Fixin' to Ship on iOS\" edition<br><br>Welcome iOS and iPad OS players! This update will be the first version of Rec Room that is available globally on the App Store. <br><br>This update is a patch release that contains a single fix:<br>* Fixed issue where you'd see all (non-friend) players as \"Level 1\" instead of their correct level.<br><br>Logout support:<br>We tried shipping this once before and it... er... didn't go well. We fixed a bunch more issues and we're trying again!<br>* There's now a Logout button in Watch &gt; Profile. This lets you log out and log in with a different account without quitting the app.<br>* Please note that logout is not currently supported on Oculus Rift or Oculus Quest. We hope to add support in the future.<br>* As part of this work, we also added a \"Retry\" button if login fails for any reason (e.g., network hiccup causes a login failure)<br><br>General tweaks and improvements:<br>* Screens - screen players on all platforms can now *draw on whiteboards!* To do this, pick up a marker (or anything that makes a mark on a drawable surface) and walk up to a whiteboard (or sticky note, or art canvas, etc.).<br>* rec.net - you can now see who you're subscribed to, and who is subscribed to you, on your rec.net profile page.<br>* Radio is now paused during new user flow (so you don't hear two music tracks at once)<br>* Revised layout of merch booths in Rec Center, Paintball, etc.<br>* Updated \"party up\" VFX!<br>* Updated pick up glow for dropped objects (e.g., paintball guns)<br>* Tidied up presentation of Room Chat<br>* Improved contrast of player chat (so you can read it against dark backgrounds)<br>* Screens - Improved throwing objects... you should be able to make a basket in the Rec Center now!<br>* Screens - Improved holding objects... use inspect mode to adjust your grip!<br>* Screens - watch menu no longer clips through walls (well, much less often...)<br>* Screens - you can now properly throw wood planks in ^LostSkulls<br><br>We've made a lot of improvements to our iOS build as we prepare for full launch on iOS:<br>* iOS - Rec Room now supports *full duplex voice chat with echo cancellation* (no longer need to tap mic icon to talk, etc). You can still toggle mic on/off with same button for privacy, etc.<br>* iOS - Many improvements to touch control layout, icons, etc.<br>* iOS - Made watch menu take up whole screen, and you can now tap \"outside\" the menu to close it<br>* iOS - We now support cut and paste in various keyboard fields<br>* iOS - Rooms will be auto-saved when app is backgrounded, so you don't lose work if iOS kicks us out of memory!<br>* iOS - Added a control help screen in Watch &gt; Settings &gt; Help<br>* iOS - Disabled Rec Royale to reduce crashing on iOS devices :<br><br>Bug squishin':<br>* Fixed a bug where VR players could spawn outside their Dorm/fall out of rooms too easily. Sorry about that!<br>* Paintball - can no longer throw the flag through the ground on PS4/Quest<br>* Stunt Runner - you should now get a notification when you achieve a new personal best<br>* Laser Tag - pulled the plug on some overzealous robots that would keep fighting even though the game was over...<br>* Rec Royale - fixed floating in the air after teleporting off the glider<br>* Dodgeball - fixed an issue where the game could get into a weird state. (Yes, even weirder than usual)<br>* Soccer - fixed some broken textures<br>* Players standing on top of other respawning players should no longer respawn with them.<br>* Fixed an issue where you couldn't see your score on non-Stunt Runner leaderboards.<br>* Fixed an issue where players could sometimes switch teams when they weren't supposed to.<br>* Fixed an issue that could cause your hair to go missing when you loaded into the Dorm Room.<br><br>Please see here for convenient links to controls, tutorials, comfort options, etc.: https://recroom.com/community<br><br>Thanks for playing Rec Room! As always, we love to hear your feedback, so please don't hesitate to let us know what you think =]"},{"version_id":"833859970","version_name":"20191204","version_date":"","version_description":""},{"version_id":"833911839","version_name":"20191205","version_date":"","version_description":""},{"version_id":"834006827","version_name":"20191206","version_date":"2019-12-11 03:01:35.000 +0800","version_description":"Rec Room UPDATE - the \"Fixin’ to Ship on iOS\" edition<br><br>Just a quick iOS specific update:<br><br>* Fixed an issue where push notifications stopped working - sorry about that! =]<br><br>Please see here for convenient links to controls, tutorials, comfort options, etc.: https://recroom.com/community<br><br>Thanks for playing Rec Room! As always, we love to hear your feedback, so please don’t hesitate to let us know what you think."},{"version_id":"834053616","version_name":"20191217","version_date":"2019-12-19 16:21:30.000 +0800","version_description":"Rec Room UPDATE - the \"Happy New Decade!\" edition\n<br><br>OK remember we said last update was probably our last for the year? Well we lied! We're sneaking one more in before taking a short break over Xmas/New Years. We'll be back in the new year (decade!) with more craziness!<br><br><br>Here's what's in today's update:\n<br><br><br>* New \"Fancy Bubbly\" item - share a fancy bottle of bubbly with up to five friends to ring in the new year! Pop the cork, then toast with the glasses, complete with a satisfying \"clink!\" sound =]\n<br><br>And some bug fixes:<br>* Issue where players could get teleported to center of room<br>* StuntRunner - air control is back to normal, sorry about that<br>* Some other minor bug fixes and clean up<br><br>Please see here for convenient links to controls, tutorials, comfort options, etc.: https://recroom.com/community<br>Thanks to all for a great year! It's been a lot of fun for us, and we appreciate y'all. Please be excellent to each other in-game and out, and we'll see you in 2020!<br><br>As always, we love to hear your feedback, so please don't hesitate to let us know what you think..."},{"version_id":"834309704","version_name":"20200114","version_date":"","version_description":""},{"version_id":"834406668","version_name":"20200115","version_date":"2020-01-21 18:48:42.000 +0800","version_description":"Rec Room PATCH - for the \"On Again/Off Again\" Edition\n<br><br>* You can now *search* for friends in the watch! Want to send a gift someone, but it's hard to find them by paging through the watch? Well, now you can search. And it's a \"fuzzy\" search... e.g., searching for \"grb\" will find \"gribbly\"\n<br>* Added a \"Gift\" button to player's profile, so you can send 'em something right from their profile page! (This actually went out last week, forgot to mention it!)\n<br>* Fixed an issue where bows wouldn't reload properly on non-VR platforms (sorry about that!)\n<br>* Fixed an issue where UI could flicker annoyingly on some platforms. For the curious, this turned out to happen when someone in the room was drawing on a whiteboard (or similar drawing surface)!\n<br>* Fixed an issue where you could get stuck on a loading screen when re-joining a room automatically after a disconnect.\n<br><br>Please see here for convenient links to controls, tutorials, comfort options, etc.: https://recroom.com/community\n<br><br>As always, we love to hear your feedback, so please don't hesitate to let us know what you think..."},{"version_id":"834487219","version_name":"20200124","version_date":"2020-01-27 15:04:12.000 +0800","version_description":"Rec Room PATCH - for the \"On Again/Off Again\" Edition\n<br><br>A nice addition to the Maker Pen this week!\n<br><br>* The Maker Pen can now *mirror shapes* using the Clone tool. This makes certain kinds of building tasks (such as making symmetrical structures) much easier!\n<br>* When using the Clone tool, you'll see a second set of handles that flip the shape on that axis as you clone it.\n<br>* Note that you can only mirror Maker Pen shapes, not props!\n<br><br>Some bug fixes/improvements:\n<br><br>* Precision when drawing on an Art Canvas is much improved\n<br>* Fixed a bug that was preventing hair ties from receiving your selected hair color\n<br>* Fixed an issue where the sight on the Sci Fi Pistol wasn't getting team color assigned\n<br>* Fixed an issue where some objects (e.g., donuts, plates) could flicker in the Rec Center\n<br>* Laser Tag: Hangar - the wall protruding from the red spawn area is back to normal, and no longer blocks the spawn doorway\n<br>* Laser Tag: Hangar - removed extra pillars in the red side spawn to match the blue side\n<br>* Laser Tag: Hangar - removed extra I beam right outside the red spawn that doesn't exist on blue side\n<br>* Extended render distance on Laser Tag/Jumbotron pistols!\n<br><br>Please see here for convenient links to controls, tutorials, comfort options, etc.: https://recroom.com/community\n<br><br>As always, we love to hear your feedback, so please don't hesitate to let us know what you think... =]"},{"version_id":"834557336","version_name":"20200131","version_date":"2020-02-03 04:25:51.000 +0800","version_description":"Rec Room UPDATE - the \"Pool Shark\" Edition\n<br>\n<br>Before we dive into what's new in this update, please be aware that we will likely be unable to update for a few weeks. We are doing some administrative stuff that means we can't submit builds until it's finished, so please expect an interruption in our weekly updates!\n<br>\n<br>OK! Here's what's new:\n<br>\n<br>* The Rec Room Facilities crew finally got around to fixing the Pool Table. *The Pool Table in ^bowling is now fully operational*. To play - grab a pool cue, slap one of the buttons to spawn the balls, and get to playing!\n<br>\n<br>[https://i.imgur.com/5ln28tZ.gif](https://i.imgur.com/5ln28tZ.gif)\n<br>\n<br>Here's how to play:\n<br>\n<br>* VR Controls - grab a cue and release the trigger (it will stay locked to your hand). Now grab and hold the aiming grip with your other hand. When you're aimed and ready to shoot, hold both triggers and power through!\n<br>\n<br>* Screen Controls - grab a cue and look for the \"Play Shot\" option at the center of the table Use your look controls to aim (get low to the table for more backspin). When you're aimed and ready to shoot, hold the Shoot button and bring the cue back to adjust your power. Release the button to complete the shot, stunning your opponent with your skill and guile!\n<br>\n<br>* As a bonus, the Pool Table and Pool Cues are also available in the Maker Pen palette, so you can add a Pool Table (or three) to your #hangout space =]\n<br>\n<br>* The Pool Table can be Recolored with the Maker Pen, so if you want a hot pink pool table, no-one can stop you!\n<br>\n<br>[https://i.imgur.com/JVlhzgx.gif](https://i.imgur.com/JVlhzgx.gif)\n<br>\n<br>* It's also kind of fun to drop pool tables off a cliff (this is a considerably more expensive hobby IRL):\n<br>\n<br>[https://i.imgur.com/XBVYboa.gif](https://i.imgur.com/XBVYboa.gif)\n<br>\n<br>New stuff for creators!\n<br>\n<br>* There's a new *Text Gadget* in the Maker Pen Palette.\n<br>\n<br>[https://i.imgur.com/sVUOqbj.gif](https://i.imgur.com/sVUOqbj.gif)\n<br>\n<br>* Text created using the Text Gadget is very low on ink cost\n<br>\n<br>* There are fun formatting options to play with: Thickness, character and line spacing, alignment\n<br>\n<br>* You can use the Recolor tool to change color AND material on text\n<br>\n<br>* You can drive the Text Gadget via circuits to update the display based on game events, etc.\n<br>\n<br>* In non-Text news, we added a \"Champions\" filter to all leaderboards so you can see how you stack up against the best in the world in your favorite rooms\n<br>\n<br>But wait, there's more!\n<br>\n<br>* Added a merch booth to the ^GoldenTrophy lobby. Here's an overly dramatic GIF:\n<br>\n<br>[https://i.imgur.com/J6oUnZS.gif](https://i.imgur.com/J6oUnZS.gif)\n<br>\n<br>* Added a merch booth to the ^CrimsonCauldron lobby\n<br>\n<br>[https://i.imgur.com/cnRpSCt.gif](https://i.imgur.com/cnRpSCt.gif)\n<br>\n<br>* We decided it was time that the Homestead paintball map had its own music, so we brought in a local bluegrass band to give us some Homestead flavor (the new track is also available in the Radio).\n<br><br>\n<br>OK I think that's it for this update. Don't forget: We probably won't be able to update for at least a few weeks, but we'll be back as soon as possible with some very exciting stuff =]\n<br>\n<br>Thanks for playing Rec Room!\n<br>\n<br>Please see here for convenient links to controls, tutorials, comfort options, etc.: https://recroom.com/community\n<br>\n<br>As always, we love to hear your feedback, so please don't hesitate to let us know what you think..."},{"version_id":"834597297","version_name":"20200204","version_date":"","version_description":""},{"version_id":"834917329","version_name":"20200302","version_date":"","version_description":""},{"version_id":"834999007","version_name":"20200306","version_date":"2020-03-09 22:46:45.000 +0800","version_description":"Rec Room PATCH- for the \"Sunset Cinema\" Edition\n<br><br>Hotfixes for a few issues:\n<br>* Fix for issue where moving objects (including other players, Laser Tag bots, etc.) could drift and otherwise move in weird ways.\n<br>* Fix for issue where being near an \"out\" player could prevent you from using held objects.\n<br>* Fixed the \"Trucker Jacket\" avatar item\n<br>* Paintball - fixed issue where flag could fail to respawn\n<br>* Paintball - tweaked spawn behavior\n<br><br>Thanks for playing Rec Room!\n<br><br>Please see here for convenient links to controls, tutorials, comfort options, etc.: https://recroom.com/community\n<br>As always, we love to hear your feedback, so please don't hesitate to let us know what you think..."},{"version_id":"835203233","version_name":"20200320","version_date":"","version_description":""},{"version_id":"835304772","version_name":"20200327","version_date":"","version_description":""},{"version_id":"835388859","version_name":"20200403","version_date":"","version_description":""},{"version_id":"835498818","version_name":"20200417","version_date":"2020-04-20 03:00:13.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"835625169","version_name":"20200424","version_date":"2020-04-30 03:00:58.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"835786308","version_name":"20200430","version_date":"","version_description":""},{"version_id":"835876387","version_name":"20200507","version_date":"","version_description":""},{"version_id":"835978920","version_name":"20200514","version_date":"","version_description":""},{"version_id":"836044914","version_name":"20200523","version_date":"2020-05-27 06:01:15.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"836298096","version_name":"20200604","version_date":"","version_description":""},{"version_id":"836395018","version_name":"20200611","version_date":"","version_description":""},{"version_id":"836501227","version_name":"20200618","version_date":"","version_description":""},{"version_id":"836602999","version_name":"20200626","version_date":"2020-07-01 03:18:06.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"836707800","version_name":"20200702","version_date":"","version_description":""},{"version_id":"836786350","version_name":"20200709","version_date":"2020-07-17 03:04:28.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"836886329","version_name":"20200717","version_date":"2020-07-22 03:37:28.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"837006346","version_name":"20200724","version_date":"2020-07-28 03:10:40.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"837185672","version_name":"20200731","version_date":"2020-08-04 04:02:39.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"837279882","version_name":"20200807","version_date":"2020-08-10 02:59:24.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"837466811","version_name":"20200820","version_date":"","version_description":""},{"version_id":"837564465","version_name":"20200828","version_date":"","version_description":""},{"version_id":"837658382","version_name":"20200904","version_date":"","version_description":""},{"version_id":"837722324","version_name":"20200910","version_date":"","version_description":""},{"version_id":"837821426","version_name":"20200917","version_date":"","version_description":""},{"version_id":"837907769","version_name":"20200925","version_date":"","version_description":""},{"version_id":"838059931","version_name":"20201006","version_date":"","version_description":""},{"version_id":"838149933","version_name":"20201009","version_date":"","version_description":""},{"version_id":"838235307","version_name":"20201015","version_date":"","version_description":""},{"version_id":"838355444","version_name":"20201022","version_date":"","version_description":""},{"version_id":"838392434","version_name":"20201026","version_date":"2020-10-27 03:06:39.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"838495152","version_name":"20201031","version_date":"","version_description":""},{"version_id":"838560893","version_name":"20201106","version_date":"","version_description":""},{"version_id":"838900085","version_name":"20201112","version_date":"","version_description":""},{"version_id":"839308961","version_name":"20201120","version_date":"","version_description":""},{"version_id":"839489748","version_name":"20201203","version_date":"","version_description":""},{"version_id":"839657096","version_name":"20201210","version_date":"","version_description":""},{"version_id":"839947818","version_name":"20210107","version_date":"2021-01-15 04:26:41.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"840130276","version_name":"20210121","version_date":"2021-01-28 04:10:35.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"840272216","version_name":"20210128","version_date":"","version_description":""},{"version_id":"840305272","version_name":"20210129","version_date":"2021-02-01 17:05:37.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"840379278","version_name":"20210203","version_date":"2021-02-11 04:17:08.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"840474300","version_name":"20210210","version_date":"2021-02-19 08:43:16.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"840561461","version_name":"20210217","version_date":"2021-02-24 04:15:40.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"840663435","version_name":"20210225","version_date":"2021-03-04 05:26:30.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"840801185","version_name":"20210305","version_date":"2021-03-12 04:21:40.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"840946165","version_name":"20210317","version_date":"2021-03-25 03:07:26.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"841073903","version_name":"20210325","version_date":"2021-04-01 03:03:24.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"841184401","version_name":"20210401","version_date":"2021-04-09 18:09:04.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"841298126","version_name":"20210408","version_date":"2021-04-15 03:07:00.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"841404363","version_name":"20210414","version_date":"2021-04-22 03:06:34.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"841800367","version_name":"20210422","version_date":"2021-05-04 03:08:46.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."},{"version_id":"842086983","version_name":"20210504","version_date":"2021-05-07 18:06:27.000 +0800","version_description":"We update the game routinely to improve user experience. This version includes minor improvements and bug fixes."}]