[{"version_id":"832962560","version_name":"1.1","version_date":"2019-09-30 03:30:49.000 +0800","version_description":"•&nbsp;Support for iPhone 11 and iPhone 11 Pro ultra-wide angle lens<br>•&nbsp;Bug fixes and performance improvements"},{"version_id":"833041435","version_name":"1.2","version_date":"2019-10-09 12:34:09.000 +0800","version_description":"• Improved Hipstamatic Classic Gear Import (see camera shelf)<br>• The latest Hipstamatic gear has been added to the Supply Catalog<br>• Dark Mode support in Photos and Camera Bag<br>• New direct link to Get Help from the camera shelf<br>• Other Bug fixes"},{"version_id":"833323485","version_name":"2.0","version_date":"2019-10-25 15:39:42.000 +0800","version_description":"Our first major camera update is here! The new Hipstamatic X-2 model includes:<br><br>New Features<br>•&nbsp;Camera Roll access - quickly process any photo in your library with a Hipstamatic preset<br>• New Sprocket Camera (for Makers Club Members) with panoramic edge-to-edge 35mm film simulation<br>•&nbsp;Filter lenses/films by Style (and more) when building a camera<br>• More photo share options with improved Instagram Share, 'Copy Hash Tags', and 'Match Camera Settings' actions<br><br>Other Enhancements<br>• Rename cameras you've created from the camera menu (long press / 3D Touch a camera in your camera bag)<br>• Dark Mode is now supported in Camera Builder<br>• Other bug fixes and performance improvements"},{"version_id":"833423225","version_name":"2.1","version_date":"2019-11-01 14:34:42.000 +0800","version_description":"New Gear in the Supply Catalog for Makers Club Members<br>• Claire 42, a Clean lens featuring a saturated and contrasty effect<br>• Melange CX film, with lovely subtle vignetting perfect for Still Life photos"},{"version_id":"833630638","version_name":"2.2","version_date":"2019-11-22 18:00:28.000 +0800","version_description":"Now available in Chinese (Simplified and Traditional)"},{"version_id":"833910184","version_name":"2.3","version_date":"2019-12-08 16:54:08.000 +0800","version_description":"Inspired by the Arakawa district of Tokyo, the new Yakana lens and Neko Chan films are now available in the Supply Catalog"},{"version_id":"834050026","version_name":"3.0","version_date":"2019-12-26 14:57:32.000 +0800","version_description":"Happy Holidays 2019!<br>• Camera Sharing is here! You can now share your custom built cameras so others can shoot with your look<br>• The Seven days of Kitch-Mas: We're sharing a throwback holiday camera each day. Follow us on Instagram @hipstamatic to collect them all!<br>• Stay tuned for Christmas Day: all the good Hipsta boys and girls will get a merry little gift from H. Claus himself"},{"version_id":"834320207","version_name":"3.1","version_date":"2020-01-17 02:44:01.000 +0800","version_description":"• New gear in the supply catalog for January: Peale lens and Type 10 Pack film<br>• More integrations with Hipstamatic Classic:<br>- 'Edit in Classic' action now available (from the Share menu) when viewing a photo*<br>- Support for reading .hipstamatic Preset files created in Hipstamatic Classic for advanced camera creation<br><br>To create a new camera using a Hipstamatic Classic Preset:<br>1. Tap and hold on a Preset from anywhere in Hipstamatic Classic<br>2. Choose 'Share' (you may need to tap the arrow button to find it)<br>3. Choose 'Copy to / Open in Hipstamatic X' (you may need to tap the 'More' button to find it)<br><br>You can also do this from presets from around the internet (such as those found on Hipstography.com) or presets saved in your Files app.<br><br>Happy camera building!<br><br>* Hipstamatic Classic 359 or later required for 'Edit in Classic'"},{"version_id":"834880399","version_name":"3.2","version_date":"2020-03-07 16:54:10.000 +0800","version_description":"• You can now share cameras to Instagram (Stories and Feed) using QR codes! Just screenshot a shared camera and open Hipstamatic X to use it<br>•&nbsp;New 'Adventure' signature camera (members only)<br>•&nbsp;Includes the latest Kuma lens and Hiragana 95 film from February<br>• Other bug fixes and improvements"},{"version_id":"835078618","version_name":"4.0","version_date":"2020-03-26 21:11:31.000 +0800","version_description":"THE MAGAZINE<br>• Get inspired and flip through a curated book of awesome Hipstamatic images (requires iOS 13 or later)<br>• See what camera was used to shoot the story, and try it yourself with one tap<br>• New photo stories daily<br>• Submit your best photos for a chance to get featured (open to both Classic and X users)<br><br>OTHER UPDATES<br>• Now localized in Japanese and Korean<br>• Bug fixes and performance improvements"},{"version_id":"835444368","version_name":"4.1","version_date":"2020-04-07 21:38:17.000 +0800","version_description":"•&nbsp;Includes the new Stay Home Survival gear in the camera catalog<br>• Some localization fixes for Japanese"},{"version_id":"835784684","version_name":"5.0","version_date":"2020-05-03 17:13:21.000 +0800","version_description":"• NEW: Passport — Collect stamps when you take photos and keep a log of your photographic adventures in HipstaLand. Get daily stamps, earn photo streaks, and take more photos! Doc Kaimal's studies show that the more photos you shoot the happier you are. Take Photos, Feel Better.<br>• You can now attach a Camera or Passport Stamp to your photo when sharing it<br>•&nbsp;Includes the new Glam-o-rama preset with authentic analog star filter simulation<br>•&nbsp;Fixed a bug causing slow capture of photos"},{"version_id":"836410375","version_name":"5.1","version_date":"2020-07-24 19:53:59.000 +0800","version_description":"• Includes new camera gear in the supply catalog (Raggiana lens, Brady lens, Port Moresby film, and Poncey 96 film)<br>• Fixes bug where 'match camera settings', 'copy hash tags', etc. were missing from Share sheet<br>• Graphical improvements to some Passport Stamps<br>• Fixes a bug preventing editing Passport profile photos"},{"version_id":"837399810","version_name":"6.0","version_date":"2020-08-18 18:25:51.000 +0800","version_description":"◘ All-New Editing Darkroom ◘<br>• Fine-tune your image with sliders for Gear, Light, Color, Focus, and Retro<br>• Automatically sync presets with Hipstamatic Classic (requires iCloud)<br>• Robust gear and preset search: search by style and characteristics (such as Landscape or Grain)<br>•&nbsp;New Grain tool with grain size control<br><br>◘ And More Retro Goodness ◘<br>•&nbsp;Includes new gear in the Supply Catalog (Frederick lens and Combo 2X film)<br>•&nbsp;Other bug fixes and performance improvements"},{"version_id":"838405034","version_name":"6.1","version_date":"2020-10-31 01:21:12.000 +0800","version_description":"• Latest Hipstamatic gear added to the supply catalog, including East Austin, Guam, and Surrealist lenses and films<br>• Tap-to-focus in the camera is now available<br>• Fixed some bugs with analog controls (such as hardware lens toggle)"}]