[{"version_id":"830976030","version_name":"0.6.0","version_date":"","version_description":""},{"version_id":"831083280","version_name":"0.7.0","version_date":"","version_description":""},{"version_id":"831354701","version_name":"0.8.0","version_date":"","version_description":""},{"version_id":"831556337","version_name":"0.8.1","version_date":"","version_description":""},{"version_id":"831599266","version_name":"2.0.0","version_date":"2019-06-16 01:22:17.000 +0800","version_description":"•Profession Grades added to track progress \n<br>•You can now add friends. Receive bonus Wizarding XP and Wizarding Challenges XP when you engage in Wizarding Challenges with friends\n<br>•Achievements and SOS Assignments: Reach milestones and complete tasks to receive bonus rewards\n<br>•Better handling of GPS permission prompts\n<br>•Potions can now be used on the Arena Map in Wizarding Challenges\n<br>•Placing an Image in the Registry now earns Family XP\n<br>•Chambers now have a recommended Profession Grade so players are aware of the level needed for the Challenge \n<br>•New loading sequence\n<br>•New oddity encounters\n<br>\n<br>Fixes:\n<br>•Improved loading times \n<br>•Resolved an issue that caused the “Download All Assets” feature to fail in certain cases\n<br>\n<br>Tuning:\n<br>•Updated the Potion brew times. For some Potions, the brew time is now longer.\n<br>•Adjusted the Foe difficulty when engaging in solo and group Wizarding Challenges"},{"version_id":"831700417","version_name":"2.0.1","version_date":"2019-06-18 16:32:24.000 +0800","version_description":"-General Bug Fixes"},{"version_id":"831829651","version_name":"2.6.0","version_date":"2019-11-05 20:26:59.000 +0800","version_description":"New Features/Updates: \n<br>\n<br>Get ready for the Brilliant Event: Stronger United! \n<br>\n<br>Potions: \n<br>Potions that last for more than 1 spellcast will now work across Encounters and Wizarding Challenges! This means that if you use an Exstimulo and return the Foundable on the first spell cast, the Exstimulo will work on the next Trace you tap!\n<br>\n<br>Ministry ID Portrait:\n<br>You will now default to your current portrait instead of the camera feed when editing your Portrait, so you do not have to take a new picture to view new stickers, frames, filters or lenses.\n<br>\n<br>Photo Mode: \n<br>The Pixie Oddity Encounter will now feature Photo Mode.\n<br>\n<br>Alert System: \n<br>You will now see a message pop up on your screen when you have completed a Daily Task, an Achievement, or a Quest."},{"version_id":"831829651","version_name":"2.5.0","version_date":"2019-10-15 20:49:44.000 +0800","version_description":"Get ready for October Community Day on 10/19! Also, there will be a special Halloween Event on 10/31! Stay tuned for more details! <br><br>Wizarding Challenges:<br>Added a new Chamber Lobby experience! If you join a Chamber with other players, you can now tap Ready to let your teammates know you are ready to join the fight! Likewise, you will now see when other players are ready to start the Challenge. As a solo player, you can now skip pass the start timer by tapping Start and being dropped straight into the Chamber! <br><br>Greenhouses: <br>Greenhouses now always provide Spell Energy along with Ingredients<br><br>Photo Mode: <br>Added photo mode for the Golden Snitch Foundable<br><br>Potions: <br>When using Dawdle Draught, you will now see a pop up when the Potion prevented an Encounter from fleeing<br><br>Ministry ID Portrait: <br>House-specific items will now be grouped together. Tap on the Gryffindor House items to see items for the other Hogwarts Houses.<br>Lenses and Frames rewarded from events will now be grouped together<br><br>General: <br>Added “Download Essential Assets” to the settings menu for users with limited device storage. Choosing this option will download some of the game assets ahead of time but will not download all the game assets.<br>Removed the badge (red dot) from Download All Assets in Settings"},{"version_id":"831829651","version_name":"2.2.0","version_date":"2019-08-05 22:45:21.000 +0800","version_description":"Ministry ID:<br>- You can now use photos from your device’s gallery and decorate them with stickers, frames, and filters.<br>- New sticker selection menu.<br><br>Portkeys:<br>- Unlock the Honeydukes shop experience with 10km Portkey Portmanteaus<br><br>Registry:<br>- Four new encounters and a new Registry Page in the Magical Games and Sports family.<br>- Capture AR photos with the Swooping Evil Foundable."},{"version_id":"831829651","version_name":"2.0.2","version_date":"2019-06-29 22:13:06.000 +0800","version_description":"General Bug Fixes"},{"version_id":"831997838","version_name":"2.1.0","version_date":"2019-07-16 14:12:56.000 +0800","version_description":"Updates:<br><br>Challenges: <br> - Warning for low Spell Energy<br> - Spell Energy on Chamber screen<br> - New Registry Page!<br> - XP rewards decreased in Chambers 1-8 and increased in Chambers 11+<br><br>Code Name: <br> - Change Code Name in Settings! You can only do this once<br><br>Registry:   <br> - New Encounters!<br><br>The Map: <br>-  Spell Energy on Map HUD<br><br>Potions: <br> - Exstimulo Potions more effective in combat<br><br>Ministry ID: <br> -  New Lens, Frame, &amp; Stickers!"},{"version_id":"832213842","version_name":"2.2.0","version_date":"2019-08-05 22:45:21.000 +0800","version_description":"Ministry ID:<br>- You can now use photos from your device’s gallery and decorate them with stickers, frames, and filters.<br>- New sticker selection menu.<br><br>Portkeys:<br>- Unlock the Honeydukes shop experience with 10km Portkey Portmanteaus<br><br>Registry:<br>- Four new encounters and a new Registry Page in the Magical Games and Sports family.<br>- Capture AR photos with the Swooping Evil Foundable."},{"version_id":"832472006","version_name":"2.3.0","version_date":"2019-08-23 16:04:06.000 +0800","version_description":"Updates:<br>Photo Mode:<br>- A Photo Mode filter has been added to the Registry<br>- Take AR Photos of a Foundable before starting the Encounter if you've collected at least 1 fragment<br><br>Encounters:<br>- Foundable fragment counter now appears in Encounters<br>- Confirmation pop up to flee an Encounter has been removed<br>- New Encounters and Oddities have been added to the game! <br><br>Ministry ID:<br>- Wizarding XP is now visible from the Ministry ID<br><br>General:<br>- Disable Screen Sleeping option added to the Settings"},{"version_id":"832593465","version_name":"2.3.2","version_date":"2019-09-03 17:56:55.000 +0800","version_description":"General BUG FIXES and improvements"},{"version_id":"832845514","version_name":"2.4.0","version_date":"2019-09-24 17:13:08.000 +0800","version_description":"Updates:<br><br>Encounters: <br>When you successfully return a Foundable, you will now be able to skip through the return animation by tapping the screen. <br> <br>Portkeys: <br>The Portkey Rewards screen will show even if you’re unable to tap 5 wrackspurts or you leave the Portkey unexpectedly.<br> <br>Ministry ID: <br>Tap and hold Achievement badges in your Ministry ID to get a reminder of which Achievement you completed to receive the badge"},{"version_id":"833136102","version_name":"2.5.0","version_date":"2019-10-15 20:49:44.000 +0800","version_description":"Get ready for October Community Day on 10/19! Also, there will be a special Halloween Event on 10/31! Stay tuned for more details! <br><br>Wizarding Challenges:<br>Added a new Chamber Lobby experience! If you join a Chamber with other players, you can now tap Ready to let your teammates know you are ready to join the fight! Likewise, you will now see when other players are ready to start the Challenge. As a solo player, you can now skip pass the start timer by tapping Start and being dropped straight into the Chamber! <br><br>Greenhouses: <br>Greenhouses now always provide Spell Energy along with Ingredients<br><br>Photo Mode: <br>Added photo mode for the Golden Snitch Foundable<br><br>Potions: <br>When using Dawdle Draught, you will now see a pop up when the Potion prevented an Encounter from fleeing<br><br>Ministry ID Portrait: <br>House-specific items will now be grouped together. Tap on the Gryffindor House items to see items for the other Hogwarts Houses.<br>Lenses and Frames rewarded from events will now be grouped together<br><br>General: <br>Added “Download Essential Assets” to the settings menu for users with limited device storage. Choosing this option will download some of the game assets ahead of time but will not download all the game assets.<br>Removed the badge (red dot) from Download All Assets in Settings"},{"version_id":"833423604","version_name":"2.6.0","version_date":"2019-11-05 20:26:59.000 +0800","version_description":"New Features/Updates: \n<br>\n<br>Get ready for the Brilliant Event: Stronger United! \n<br>\n<br>Potions: \n<br>Potions that last for more than 1 spellcast will now work across Encounters and Wizarding Challenges! This means that if you use an Exstimulo and return the Foundable on the first spell cast, the Exstimulo will work on the next Trace you tap!\n<br>\n<br>Ministry ID Portrait:\n<br>You will now default to your current portrait instead of the camera feed when editing your Portrait, so you do not have to take a new picture to view new stickers, frames, filters or lenses.\n<br>\n<br>Photo Mode: \n<br>The Pixie Oddity Encounter will now feature Photo Mode.\n<br>\n<br>Alert System: \n<br>You will now see a message pop up on your screen when you have completed a Daily Task, an Achievement, or a Quest."},{"version_id":"833632657","version_name":"2.7.0","version_date":"2019-11-18 22:32:58.000 +0800","version_description":"New Features/Updates: \n<br>\n<br>Gifting: \n<br>- Coming soon to Harry Potter: Wizards Unite! You will be able to send and receive Gifts that contain Spell Energy from Inns, Runestones from Wizarding Challenges, or Ingredients from Greenhouses. \n<br>\n<br>Photo Mode: \n<br>- The Self-Playing Harp Foundable will now have Photo Mode\n<br>\n<br>General: \n<br>- Coming soon: Players are able to connect to their Facebook account to add Facebook friends who are Harry Potter: Wizards Unite Players (and have also chosen to enable this feature) to their Friends List\n<br>- Added confirmation popups for the following Gold purchases:\n<br>- Rental Cauldrons \n<br>- Out of Spell Energy\n<br>- Out of Runestones (when at a Fortress)\n<br>- Vault Expansion\n<br>\n<br>Bug Fixes:\n<br>\n<br>General:\n<br>- Fixed an issue with Download All Assets in the Settings section not giving a notification (red badge) when there are new assets to download. This will only be available to users Level 4 and up"},{"version_id":"834007635","version_name":"2.8.0","version_date":"2019-12-18 16:01:15.000 +0800","version_description":"New Features/Updates<br><br>Get ready for an increase in Frosty Foundables on the map; coming in early January! <br><br>SOS Report: <br>- Coming soon! We will be adding an in-game Newsletter to keep everyone up-to-date on events, game tips, and more! <br><br>Portkeys: <br>- We have added a new Portkey option in the Settings menu that allows players to pan around Portkey environments without using their device’s gyroscope to move.<br><br>Potions: <br>- We have improved Dawdle Draught so that when used, it will always prevent a Foundable from fleeing!"},{"version_id":"834335774","version_name":"2.9.0","version_date":"2020-01-28 00:41:01.000 +0800","version_description":"New Features/Updates: <br><br>Late January brings you Part 1 of the Brilliant Event: Darkest of Times from 1/20 to 1/28!<br><br>Adventure Sync:<br>Coming soon, Adventure Sync in Harry Potter: Wizards Unite! When you choose to enable this feature, your distance walked will now be recorded for Portkey Portmanteaus, even if the app is not open. <br><br>Friends &amp; Gifting: <br>You can now sort your friends alphabetically in ascending/descending order or sort friends that have sent you an unopened Gift<br><br>Portkeys: <br>Updated Portkey rewards to include possible Spell Energy rewards when tapping Wrackspurts  <br>Refreshed Foundable Fragments which are available as possible rewards<br>New Portkey icons will help you sort through your unlocked Portkeys! 2km Portkeys are displayed as a Boot, 5km Portkeys as a Tea Kettle, and 10km Portkeys as a Deflated Ball<br><br>Portmanteaus: <br>Added 2 additional Portmanteau slots, bringing the total amount of Portmanteaus you can pick up to 10"},{"version_id":"834678912","version_name":"2.10.0","version_date":"2020-02-13 18:25:00.000 +0800","version_description":"Hi SOS Task Force Members! \n<br>\n<br>Here is the latest update from the fight against the Calamity! Check out these changes to Harry Potter: Wizards Unite:\n<br>\n<br>Wizarding Challenges: \n<br>New Chamber selection experience! Visit a nearby Fortress to see the updated display of your Player Grade potential rewards!\n<br>\n<br>Daily Login: \n<br>Refresh of mystery Daily Login reward. Make sure to log into the game daily to see the new rewards! \n<br>\n<br>General: \n<br>Bug fixes and performance improvements"},{"version_id":"835137137","version_name":"2.11.0","version_date":"2020-03-18 22:51:39.000 +0800","version_description":"Hi SOS Task Force Members! <br><br>Here is the latest update from the fight against the Calamity! Check out the following changes to Harry Potter: Wizards Unite.<br><br>New Features/Updates<br><br>Photo Mode: <br>- Players can now use Ministry ID Portrait Filters, Frames, and Stickers to customize your photos of Foundables in Encounter Photo Mode and Registry Photo Mode!  <br><br>General: <br>- Updated the rewards experience for various parts of the game: Tap the drop-down to see a listing of rewards and bonuses you earned from Encounters, Level Up, Wizarding Challenges, and more!<br>- Added notifications to remind players when a Portkey is ready to unlock and when a Friend has sent you a Gift. <br>- Support for upcoming events, Magical Mischief Days and March Community Day."},{"version_id":"835526259","version_name":"2.12.0","version_date":"2020-04-15 22:06:33.000 +0800","version_description":"Hi SOS Task Force Members! \n<br>\n<br>Check out the following changes to Harry Potter: Wizards Unite.\n<br>\n<br>New Features/Updates\n<br>\n<br>Portkeys: \n<br>- Increased Spell Energy and Wizarding XP in 5km and 10km Portkey rewards\n<br>- Portkeys acquired after the update will have their distance requirement decreased by half until further notice.\n<br>\n<br>General: \n<br>- Players with iOS devices will now be able to sign into Harry Potter: Wizards Unite with their Apple ID. Visit Settings to link your Apple ID to an existing account. \n<br>- Logging into Harry Potter: Wizards Unite will now display your login provider, along with your Code Name and email address. \n<br>- Improved the layout of the Settings menu to better display the email addresses that are linked to Harry Potter: Wizards Unite\n<br>- Improved the initial startup screen design: Players will now see a clock at the bottom left corner of their screen that indicates loading progress\n<br>- Players can now disable push notifications for Portkeys and Gifts received in the Settings menu\n<br>- Until further notice, we will be turning off Landmarks on the Map"},{"version_id":"835624728","version_name":"2.12.1","version_date":"2020-04-22 19:34:26.000 +0800","version_description":"Hi SOS Task Force Members! \n<br>\n<br>Check out the following changes to Harry Potter: Wizards Unite.\n<br>\n<br>New Features: \n<br>\n<br>Knight Bus: \n<br>Coming soon, get ready to play Wizarding Challenges without leaving home! Just tap on the Knight Bus button on the Map to travel to the Fortress at Hogwarts Castle, choose your Chamber, and start battling Foes."},{"version_id":"835829238","version_name":"2.13.0","version_date":"2020-05-07 19:17:27.000 +0800","version_description":"Hi SOS Task Force Members! \n<br>\n<br>Check out the following changes to Harry Potter: Wizards Unite.\n<br>\n<br>Registry: \n<br>- Introducing Repeat Image Collection! Players can now continue to collect Fragments of Foundables and repeatedly place their Images, even if their Registry Pages are not ready for Prestige. Every time an Image is placed, you’ll earn bonus Family XP rewards.\n<br>- Updated Foundable Fragment counts to standardized amounts based on threat level. Lower-threat Traces have increased Fragment counts and higher-threat Traces have decreased Fragment counts. \n<br>\n<br>Photo Mode: \n<br>Turning back on! Players can now use Ministry ID Portrait Filters, Frames, and Stickers to customize photos of Foundables in Encounter Photo Mode and Registry Photo Mode!"},{"version_id":"835961994","version_name":"2.13.1","version_date":"2020-05-18 21:58:19.000 +0800","version_description":"General: \n<br>Due to the Fragment Count issues experienced, enjoy a free store pack in Diagon Alley! \n<br>\n<br>Knight Bus: \n<br>Fixed an issue with players getting a “Connection Lost” pop up when loading the game and then having the Knight Bus button become unresponsive when tapping \n<br>\n<br>Repeat Image Collection: \n<br>Fixed an issue where if a player returned a Foundable with Fragments over the max count, the Fragment count would be reset to the max amount with the player losing any extra Fragments"},{"version_id":"836688332","version_name":"2.14.0","version_date":"2020-07-17 15:35:22.000 +0800","version_description":"Hi SOS Task Force Members! \n<br>\n<br>The 2.14.0 Update will introduce a significant addition to Harry Potter: Wizards Unite, SOS Training. The feature will be rolling out a later time and will be unavailable with the 2.14.0 release.\n<br>\n<br>Coming Soon: SOS Training\n<br>SOS Training allows players to advance their magical knowledge and skills by unlocking unique bonuses and abilities through a wide variety of SOS Training Lessons.\n<br>Added 3 Volumes of SOS Training Lessons: Each volume contains a new set of SOS Training Skill Trees that will be accessible to players regardless of their Profession.\n<br>Added 3 new SOS currencies: Field Guides, Ministry Manuals, and Defense Against the Dark Arts Books.\n<br>Updated Encounter and Potion screens to display SOS Training bonuses. \n<br> \n<br>Professions\n<br>New Profession Appraisal system: An aggregated Expertise score will replace Profession Rank.\n<br> \n<br>Wizarding Challenges\n<br>Updated the Chamber Selection screen to display Recommended Appraisal score instead of Recommended Grade.\n<br> \n<br>General\n<br>Made visual updates to the Suitcase menu and Professions interface in preparation for SOS Training.\n<br>Visual updates to the MACUSA Clock and Threat Meter for Trace Encounters"}]