[{"version_id":"830740082","version_name":"2.4.3","version_date":"2019-03-27 06:37:23.000 +0800","version_description":"New Features:<br>1. Lark is now also available in Japanese. You can go to Settings to choose the language.<br>2. Group announcement now supports realtime collaboration and rich-text content.<br>3. You can change calendar event organizers by transferring events.<br>4. You can change the first day of week to Monday, Saturday, or Sunday in Calendar.<br>5. Added a new document type MindNote in Docs, featuring \"outline notes\" and \"mindmap\".<br>6. Introduced toolbar in Sheet to support text formats, @ mentions, and document links in cells.<br>7. You can resolve comments in Docs.<br>8. You can sort the document list using various criteria in Docs.<br>9. On-call service can now hide the identity of on-duty person, and the process for ending the service is also optimized.<br>10. You can now easily access SOS service through your avatar card.<br>11. More reactions have been added, and we make it easy to find most recently used ones.<br>Improvements:<br>1. Fix a login bug in iOS 10.1"},{"version_id":"831102324","version_name":"2.6.4","version_date":"2019-04-27 02:27:25.000 +0800","version_description":"New In This Release:<br>1. In Sheet, “Sheet Details” has been added to display the number of page views and viewers.<br>2. In Doc, now you can add comments in table cells.<br>3. When creating a calendar event, you can easily view your participants schedules and set up an event based on their availability.<br>4. Group admins can limit the capability of sending messages to specific group members.<br>Improvements:<br>1. In Docs, highlighting is supported when user @ mention you.<br>2. Doc supports identifying QR code by long pressing in the image viewer.<br>3. Improved the usability of sending reactions."},{"version_id":"831140143","version_name":"2.6.5","version_date":"2019-05-10 11:55:08.000 +0800","version_description":"New In This Release:<br>1. In Sheet, “Sheet Details” has been added to display the number of page views and viewers.<br>2. In Doc, now you can add comments in table cells.<br>3. When creating a calendar event, you can easily view your participants schedules and set up an event based on their availability.<br>4. Group admins can limit the capability of sending messages to specific group members.<br>Improvements:<br>1. In Docs, highlighting is supported when user @ mention you.<br>2. Doc supports identifying QR code by long pressing in the image viewer.<br>3. Improved the usability of sending reactions."},{"version_id":"831577947","version_name":"2.9.6","version_date":"2019-06-10 10:15:29.000 +0800","version_description":"New In This Release:<br>1. You can search content in messages, Space, apps, and Help Desk.<br>2. You can filter message search results by sender, time sent and group names.<br>3. Apps show up in search results.<br><br>Improvements:<br>4. In Docs, linking to a heading or paragraph of the current document brings you to its position instead of opening a new page."},{"version_id":"832361083","version_name":"3.4.5","version_date":"2019-08-14 03:16:01.000 +0800","version_description":"New In This Release:<br><br>- You can now add multiple teammates into your organization without leaving the app to use the admin console, and we support importing from your phone contacts as well. <br>- You can now revoke your own invitation to a group chat and remove the invited person."},{"version_id":"833436129","version_name":"3.10.3","version_date":"2019-11-03 02:53:47.000 +0800","version_description":"New In This Release:<br>- When you’re switching between chats, you’ll now be brought back to where you left off."},{"version_id":"834109916","version_name":"3.14.3","version_date":"2019-12-23 04:29:58.000 +0800","version_description":"New In This Release:<br>- Our new Sticker Store is here! Add sticker packs to make your chats more fun and exciting.<br>- You can now add or view attachments."},{"version_id":"834416043","version_name":"3.15.5","version_date":"2020-01-20 03:27:29.000 +0800","version_description":"- Optimized layout for video meetings. When there are only two people left in a meeting, the video is displayed picture-in-picture. <br>- When signing up new users, administrators can now send a team code or a QR code. Anyone with the codes can use them and automatically join the team."},{"version_id":"834981907","version_name":"3.18.8","version_date":"2020-03-06 01:27:36.000 +0800","version_description":"New In This Release:<br>- You can now use third-party navigation tools when locating a calendar event location.<br>- You can now record calls and video meetings.<br>- This new release has improved user experience on iPads (Calls and meetings are coming soon in Version 3.19)."},{"version_id":"835485092","version_name":"3.21.9","version_date":"2020-04-11 02:28:08.000 +0800","version_description":"New In This Release:<br>- You can customize settings for Calls and Meetings.<br>- You'll be notified when your connection is unstable during calls and meetings.<br><br>Improvements:<br>- You can now start livestreaming in a one-on-one call.<br>- Bug fixes and performance improvements."},{"version_id":"835683168","version_name":"3.22.7","version_date":"2020-04-25 03:38:11.000 +0800","version_description":"New In This Release:<br>- You can now share your screen in a video meeting on your mobile phone and iPad. <br>- You can @mention team members outside of a current chat.<br><br>Improvements<br>- Bug fixes and performance improvements."},{"version_id":"836134138","version_name":"3.24.3","version_date":"2020-05-22 00:56:12.000 +0800","version_description":"What's New:<br>- You can now share a group link to invite friends to join Lark group chats.<br>- You can invite external users to join group chats via group card or QR code.     <br>- You can invite friends to join your team by sharing a Team Code.<br>- You can easily join teams via Team Code or Invite QR Code after clicking \"Join a Team\" on the signup page. <br>- You can invite Lark users to join your team by sharing a link from \"Invite\" on your profile page. <br><br>Improvements:<br>- You can add people from the \"External Contacts\" list when creating a new group chat.<br>- You can start or join teams from \"Create or join a team\" on your profile page. <br>- You can use your current Lark account to join a team via invitation link without verifying your phone number or email address. <br>- Bug fixes and performance improvements."},{"version_id":"836276804","version_name":"3.24.5","version_date":"2020-06-07 02:35:02.000 +0800","version_description":"What's New:<br>- You can now share a group link to invite friends to join Lark group chats.<br>- You can invite external users to join group chats via group card or QR code.     <br>- You can invite friends to join your team by sharing a Team Code.<br>- You can easily join teams via Team Code or Invite QR Code after clicking \"Join a Team\" on the signup page. <br>- You can invite Lark users to join your team by sharing a link from \"Invite\" on your profile page. <br><br>Improvements:<br>- You can add people from the \"External Contacts\" list when creating a new group chat.<br>- You can start or join teams from \"Create or join a team\" on your profile page. <br>- You can use your current Lark account to join a team via invitation link without verifying your phone number or email address. <br>- Bug fixes and performance improvements."},{"version_id":"836942826","version_name":"3.28.3","version_date":"2020-07-22 01:45:53.000 +0800","version_description":"What's New:<br> [Calls and Meetings]<br>- You can now choose different layouts for your livestream. Sidebar, gallery and full screen layouts are available.<br> [Docs]<br>- Watermarks are kept when exporting Docs as PDF or Word.<br><br>Improvements<br>- Bug fixes and performance improvements."},{"version_id":"837020134","version_name":"3.28.4","version_date":"2020-07-29 01:44:04.000 +0800","version_description":"What's New:<br> [Calls and Meetings]<br>- You can now choose different layouts for your livestream. Sidebar, gallery and full screen layouts are available.<br> [Docs]<br>- Watermarks are kept when exporting Docs as PDF or Word.<br><br>Improvements<br>- Bug fixes and performance improvements."},{"version_id":"837181307","version_name":"3.28.5","version_date":"2020-08-02 14:54:57.000 +0800","version_description":"What's New:<br> [Calls and Meetings]<br>- You can now choose different layouts for your livestream. Sidebar, gallery and full screen layouts are available.<br> [Docs]<br>- Watermarks are kept when exporting Docs as PDF or Word.<br><br>Improvements<br>- Bug fixes and performance improvements."},{"version_id":"837350871","version_name":"3.29.2","version_date":"2020-08-14 03:49:40.000 +0800","version_description":"What's New:<br>[Workplace] <br>- You can now use Workplace on iPad."},{"version_id":"837628705","version_name":"3.31.4","version_date":"2020-09-04 03:09:06.000 +0800","version_description":"What's New:<br> [More Languages]<br>- Lark is now available in 11 new languages: French, German, Hindi, Bahasa Indonesia, Italian, Korean, Portuguese, Russian, Spanish, Thai, and Vietnamese.<br> [Calls and Meetings]<br>- Lark livestream viewers are now able to send live messages and report inappropriate content.<br>- You can turn off message notifications during calls and meetings in Settings. <br> [Docs]<br>- Visitors can access Docs via public link and can edit without logging in to Lark.<br><br>Improvements: <br>- Pictures sent in chats using Mobile app are numbered in order of selection.<br>- The display of the \"...\" menu in Docs has been optimized.<br>- Bug fixes and performance improvements."},{"version_id":"838036741","version_name":"3.32.3","version_date":"2020-10-02 04:10:06.000 +0800","version_description":"What's New:<br> [Docs]<br>- New text colors and more highlighting colors are now available in Docs. <br>- Conditional formatting is launched! Use this feature to highlight cells that meet specific conditions.<br>- You can fold and hide content under headings when using Docs on your mobile app. <br>- You can add, delete, rename, copy and move a sheet on your mobile app.<br> [Account] <br>- You can recover your account after completing account verification and authentication when you can't obtain the verification code by phone.<br><br>Improvements: <br>- Docs editing toolbar on the mobile app is optimized with more functions.<br>- Bug fixes and performance improvements."},{"version_id":"838280922","version_name":"3.34.1","version_date":"2020-10-20 14:45:09.000 +0800","version_description":"What's New:<br>- Lark Help Center is now available in 11 new languages: French, German, Hindi, Bahasa Indonesia, Italian, Korean, Portuguese, Russian, Spanish, Thai and Vietnamese.<br>- The new co-host role is added to assist the host in managing calls and meetings.<br>- You can now anonymously join calls and meetings as a guest user.<br>- You can now set various cell border styles and colors in Sheets on the mobile app.<br>- You can now insert Jira Filters in Docs to keep track of your tasks.<br>- You can now draw and insert Flowcharts and UML diagrams in Docs to visually represent workflows.<br>- You can quickly verify your email address through the button in email when logging in or signing up for an account.<br><br>Improvements<br>- Bug fixes and performance improvements."},{"version_id":"841282222","version_name":"3.46.3","version_date":"2021-04-09 13:08:00.000 +0800","version_description":"What's New:<br>[Messenger]<br>- You can add all members of the departments or groups you manage to a chat.<br>- Send files in chats via local area network to save storage space.<br>- Easily search information on iPad via the Search button in the upper right corner of a chat.<br><br>[Meetings]<br>- Participants can customize touch-up effects and filters on mobile.<br><br>Improvements: <br>- You can insert a table, add rows and columns to it, and adjust their width using Docs on mobile.<br>- Quickly search and select information on iPad using new shortcuts.<br>- View, leave and hide comments on the right side of Docs on iPad for a better experience."},{"version_id":"842180547","version_name":"4.0.5","version_date":"2021-05-13 09:17:33.000 +0800","version_description":"What's New:<br>[Messenger] <br>- You can filter your feed by chat type! Select and rearrange filters to keep track of your most important messages.<br>[Docs] <br>- Bitable is available! Create your database and display it in Grid, Kanban, Gantt, and Gallery views. You can also configure views and use functions across tables to fulfill your projects' needs. <br>- You can now insert attachments into the cells in Sheets.<br>- Try out our drawing function in Docs to easily express your ideas on iPad.<br><br>Improvements:<br>- The host can set that only the presenter can annotate during a meeting.<br>- Join meetings easily by clicking the digital meeting ID on mobile. <br>- New emojis have arrived! Try out \"Yes\", \"No\", \"Get\" and other emojis to express yourself more efficiently. <br>- A new display for Contacts is here! Try out now for a better experience."}]