[{"version_id":"835573666","version_name":"1.0.3","version_date":"2020-04-17 04:15:14.000 +0800","version_description":"- Bugfix: Using drag and drop to add a value into the store would sometimes cause \"Add Value\" to be displayed instead of the inserted value.\n- Bugfix: Pasting values was disabled after interacting with a context menu.\n- Bugfix: Pasting JSON formatted dictionaries and lists would not insert values inside the dictionary or list."},{"version_id":"835608005","version_name":"1.0.5","version_date":"2020-04-20 05:26:24.000 +0800","version_description":"- Bugfix: A bug had snuck into the \"View Value\" action in the previous build, which caused it to open texts, booleans and numbers incorrectly.\n- Bugfix: The errors reported by the \"Get Value\" action have been improved."},{"version_id":"835695642","version_name":"1.0.6","version_date":"2020-04-26 18:29:01.000 +0800","version_description":"- Bugfix: After dragging a value into another app and dropping it, the value would not be corrected dropped. You can now properly drag and drop texts, files and JSON into other apps.\n- Bugfix: Indices in lists would be off by one when copying the key path to a value."},{"version_id":"835722044","version_name":"1.0.7","version_date":"2020-04-28 21:27:17.000 +0800","version_description":"- New: Added a new style of type icons.\n- Bugfix: Text copyed or dropped into other apps would sometimes be formatted incorrectly, for example the text would have \"\\n\" instead of line breaks."},{"version_id":"835774855","version_name":"1.0.8","version_date":"2020-05-01 17:30:03.000 +0800","version_description":"- Bugfix: Duplicating a list that was added from Shortcuts would make the items in the list be out of order. Please be aware that the fix only applies to new lists added from Shortcuts.\n- Bugfix: Fixed a few crashes that could occur when navigating the store."},{"version_id":"835897415","version_name":"1.0.9","version_date":"2020-05-11 20:24:46.000 +0800","version_description":"- New: The \"Set Value\" Shortcuts action has a new \"Filename\" parameter. When storing a file, you can use the parameter to specify the name of the file. The parameter has no effect when storing other values than files.\n- Bugfix: When using the \"Set Value\" Shortcuts action to store a file that is already inside Data Jar's folder in the Files app, the file will now be duplicated. "},{"version_id":"835907971","version_name":"1.0.10","version_date":"2020-05-12 07:58:30.000 +0800","version_description":"New: This update makes Siri less chatty. Siri will now use shorter sentences when running one of Data Jar's Shortcuts actions."},{"version_id":"836122722","version_name":"1.0.11","version_date":"2020-05-26 20:51:51.000 +0800","version_description":"- New: The Get Value action has a new \"If Value Does Not Exist\" parameter. The action will return the value passed to the new parameter if no value exists in the store at the specified key path.\n- Bugfix: The names of values returned by the Get Value action have been improved. This is useful when passing the output to Shortcuts' Choose from List action.\n- Bugfix: It's now possible to enter a negative number when adding or editing a value in the app.\n- Bugfix: Boolean values are now written with all lowercase in the app to align with the way they're outputted in Shortcuts."},{"version_id":"836145649","version_name":"1.0.12","version_date":"2020-05-29 06:28:09.000 +0800","version_description":"- Bugfix: The Get Value action was unable to find the value for keys that started with zeros, for example 001.\n- Bugfix: The Get Value action would cause the Shortcuts app to crash when outputting a file that was not downloaded from Shortcuts yet.\n- Bugfix: Files are now downloaded more aggressively from iCloud, both when the app is running in the background and when running in Shortcuts. This increases the likelihood of the file being downloaded when fetching it with the Get Value action.\n- Bugfix: Improved error handling when previewing a backup before restoring from it."},{"version_id":"836210773","version_name":"1.0.13","version_date":"2020-05-31 23:30:28.000 +0800","version_description":"- Bugfix: When deleting a list or a dictionary that contains files, the files would not be deleted from iCloud Drive."},{"version_id":"837435284","version_name":"1.0.14","version_date":"2020-08-20 23:28:21.000 +0800","version_description":"This build fixes an issue where Data Jar's actions would not run correctly in the Shortcuts app."},{"version_id":"837804803","version_name":"1.0.15","version_date":"2020-09-16 10:05:07.000 +0800","version_description":"This update ensures that Data Jar is compatible with the latest version of iOS and iPadOS.\n\n- New: Shows contextual menu when tapping the plus button.\n- New: Shows support e-mail in settings."}]