[{"version_id":"832350434","version_name":"1.0.1017","version_date":"","version_description":""},{"version_id":"832723918","version_name":"1.0.1018","version_date":"2019-09-16 01:27:55.000 +0800","version_description":"أهلا بكم بالاصدار الجديد من سيوف المجد:<br>- نظام المسابقات، تنافس مع بقية اللاعبين لتريهم من الاقوى واحصل على قادة حصريين<br>- تطوير التفاوض مع التجار، صارت كل زيارة للتاجر تعطي قطعة معدات، غير انه يجب أن ترسل قائدا يتناسب مع نوع التاجر، اي ارسل قائد فرسان لتاجر الخيول لتحصل على الخيول بنهاية الزيارة<br>- اصلاح العديد من الاخطاء التي قمتم بالابلاغ عنها والكثير من الاخطاء التي لم تبلغوا عنها :)<br>- طرح قادة جدد مع تكتيكات جديدة في رزم الشحن لتساعدكم على انهاء الحملات<br>- معايرة القادة وتكتيكاتهم"},{"version_id":"833078503","version_name":"1.0.1019","version_date":"2019-10-10 02:02:55.000 +0800","version_description":"أهلا بكم بالاصدار الجديد من سيوف المجد:<br>- نظام البحث عن الموارد والتجار وكمائن الجواهر في خريطة العالم، لقد كنا نستمع لملاحظاتكم وإليكم هذا النظام الذي سيسهل حياة الجميع :)<br>- زيادة وتحسين مردود صناديق الفي اي بي، حيث ستعطي مفاجآت جديدة بانتظاركم، كلما ارتفع مستوى الصندوق كلما زادت قيمة مفاجآته<br>- أضافة الحملة الرابعة. أهلا بكم في الحملة التي قادها ملوك المانيا وفرنسا وايطاليا لاحتلال الاناضول والدخول الى العالم العربي من البر، وكيف تصدى لهم قلج أرسلان واغلق عليهم هذا الطريق الى الابد<br>- إضافة بطاقات تسريع الارتال القادمة للانضمام للهجوم الجماعي، وبطاقات تسريع الهجمات الجماعية<br>- زيادة انتاج الدنانير من المدينة لترضي تعطشكم لتطوير القادة والمعدات، ولتزيد مردود نهبكم للمدن المعادية<br>- اصلاح العديد من الاخطاء التي قمتم بالابلاغ عنها والكثير من الاخطاء التي لم تبلغوا عنها :)"},{"version_id":"834399670","version_name":"1.0.1022","version_date":"2020-01-19 02:06:44.000 +0800","version_description":"مولاي، أهلاً بك في أحدث نسخة من سيوف المجد، بوابتك لتعيش أمجاد التاريخ!<br><br>في هذا التحديث سيدي قمنا بما يلي:<br>1- تحديث منطق المعارك، حيث أصبح تمركز الوحدات أكثر اهمية من قبل و دورهم أكثر فعالية، سنحتاج ألى حنكتك لننتصر<br>2- إضافة شروحات خاصة بالتقويات داخل اللعبة، هذه التقويات هي الفرق بين النصر و الهزيمة<br>3- إمكانية إستخدام الألماس لإنهاء المشاريع مباشرة، فلا وقت لدينا للإنتظار، علينا الإنتصار<br>4- إضافة حديد دمشق، الأصفاد الفولاذية و ميثاق التحالف لتقوية المملكة<br>5- جنودنا أصبحوا أقوى داخل العرش و في القلاع<br>6- موازنة بعض أنظمة اللعبة مثل البناء و التدريب لتكون اللعبة أكثر عدالة<br>7- حل العديد من المشاكل داخل اللعبة، لا شيء أمامنا سوى النصر الآن<br><br>سيدي العدو أمامنا، لا شيء يقف في طريقنا، كلنا معك، إلى النصر!<br>نتمنى أن يعجبكم التحديث، إن كان لديكم أي استفسار او تعليق فلا تترددوا بالتواصل معنا"},{"version_id":"835015049","version_name":"1.0.1023","version_date":"2020-04-13 04:20:54.000 +0800","version_description":"مولاي، أهلاً بك في الإصدار الرسمي لسيوف المجد!<br><br>ستجد في هذا التحديث:<br><br>•تطوير نظام القائد و إضافة العديد من الوسائل لتدريب القائد و تحسينه<br><br>•إضافة معسكر المغول الى اللعبة و تحديات جديدة مع مكافآت مميزة<br><br>•تحسين الحملات و اضافة معارك مختلفة<br><br>•تحسين نظام الرسائل الخاصة<br><br>•تحسين نظام المهام داخل اللعبة<br><br>•إعادة موازنة العديد من المباني داخل اللعبة<br><br>حان الان موعد الإنتصار، إلى القمة و النصر!<br>حمل اللعبة الآن و لا تنسى ان تشاركنا ملاحظاتك و اقتراحاتك عبر اي من قنواتنا المختلفة او على بريدنا الالكتروني sog@play3a.com<br><br>فريق اللعبة"},{"version_id":"836906021","version_name":"1.0.1026","version_date":"2020-07-19 11:26:31.000 +0800","version_description":"مولاي، ها نحن ذا، في تحديث مميز لكم!\n<br>\n<br>فكرنا كثيراً في كيفية تحسين اللعبة و ستجدون في هذا التحديث:\n<br>1-\tقادة جدد، عصمة الدين و أرطغرل ليساعدوك في بناء أسطورتك و توسع مملكتك.\n<br>2-\tتحديث نظام المفاوضات، نظام أكثر تفاعل و جوائز ذات قيمة عالية.\n<br>3-\tتحديث و تطوير نظام القادة، ليكون تحكمك في تطوير و تدريب قادتك أفضل.\n<br>4-\tتفعيل المصنع، عاد عمال المصنع للعمل، سيساعدوك في تطوير مملكتك.\n<br>5-\tتخفيض إستهلاك القمح من الجنود، و متطلبات الأبحاث بشكل عام.\n<br>6-\tإضافة عروض جديدة و تحسين العروض الحالية!\n<br>\n<br>مولاي، لقد فعلنا كل ما بإمكاننا لنساعدك على بسط نفوذك، الباقي الآن بين يديك، حدث اللعبة اليوم و إبدأ قصتك."},{"version_id":"837945129","version_name":"1.0.1027","version_date":"2020-09-26 05:08:59.000 +0800","version_description":"هل أنت جاهز إلى أكبر تحديث في سيوف المجد؟ لقد عملنا لفترة طويلة لنقدم لكم نظام الأعجوبة الجديد و الكثير من المميزات الجديدة<br>في هذا التحديث ستجد:<br>1-\tنظام الأعجوبة: يتعاون جميع اللاعبين معاً لبناء أعجوبة و صنع حضارة، سنحتاج إلى ملك قوي لقيادتنا إلى المستقبل.<br>2-\tمجلس العظماء: الرجال تعرف بأفعالها، ستبقى أسماء أبطالنا محفورة في الذاكرة مع إدخال مجلس العظماء.<br>3-\tتحديث نظام الـ VIP  حيث حسّنا المزايا و أضفنا متجر خاص و عروض مميزة.<br>4-\tمساعدة صديق، بإمكانك الآن شراء هدية لصديقك المفضل في اللعبة ليتطور معك بسرعة أيضاً.<br>5-\tمشاركة تقارير المعركة: هل هجم عليك حساب قوي جداً و تريد مشورة تحالفك في كيف تواجهه؟ شارك تقرير المعركة مع أصدقائك<br>6-\tالتحالف: تحديثات متعددة على التحالف منها التحكم بالهجوم الجماعي، إسم التحالف باللغة العربية و نقل قيادة التحالف تلقائياً<br>7-\tإضافة الحزمة الشهرية بحلتها الجديدة <br>هنالك المزيد في هذا التحديث، لا يمكننا الإنتظار أكثر حتى تكتشف تفاصيل التحديث و أسراره، هيا بنا يا قائدي!"}]