[{"version_id":"830795579","version_name":"1.1.0","version_date":"2019-04-02 01:04:52.000 +0800","version_description":"Giờ đây bạn đã có thể tạo Cover Letter, chỉnh sửa cũng như download ngay trên ứng dụng một cách dễ dàng và nhanh chóng.<br>Ngoài ra, một số tương tác lựa chọn được làm mượt mà hơn trước.<br><br>TopCV luôn mong muốn đem lại trải nghiệm tốt nhất cho mọi người."},{"version_id":"830998595","version_name":"1.1.1","version_date":"2019-04-22 23:32:00.000 +0800","version_description":"TopCV cập nhật ứng dụng thường xuyên để bạn có trải nghiệm tốt nhất. Phiên bản này có gì mới?<br>- Sửa lỗi không thể cập nhật màu của Mẫu CV hoặc Cover letter khi sửa<br>- Nâng cao một số trải nghiệm khi đăng nhập, đăng ký<br>- Cập nhật màn hình tính thuế thu nhập cá nhân, sửa lỗi bàn phím che ô nhập trên một số dòng máy có màn hình nhỏ<br>- Tăng tốc và cải thiện hiệu năng ở một số màn hình"},{"version_id":"831220283","version_name":"1.2.0","version_date":"2019-05-09 23:31:42.000 +0800","version_description":"Ra mắt TopCV Profile - Trang cá nhân online, giúp bạn xây dựng thương hiệu cá nhân chuyên nghiệp. Đây là cách tốt nhất để bạn có thể giới thiệu với mọi người mình là ai, đã làm gì và những thành tích nổi bật của bạn. Sử dụng Hồ sơ TopCV sẽ giúp bạn nổi bật hơn trong mắt nhà tuyển dụng và cộng đồng người dùng TopCV, điều mà các bản mẫu CV không thể làm tốt được."},{"version_id":"831285446","version_name":"1.2.1","version_date":"2019-05-14 22:11:37.000 +0800","version_description":"- Cập nhật thêm tính năng xem TopCV Profile đầy đủ của bạn trên một màn hình<br>- Nâng cao một số trải nghiệm giúp bạn sửa profile nhanh chóng hơn"},{"version_id":"831317652","version_name":"1.3.0","version_date":"2019-05-17 17:35:28.000 +0800","version_description":"- Thêm tính năng gợi ý việc làm thông minh theo CV / Profile của bạn<br>- Nổi bật mục Việc làm đang quan tâm"},{"version_id":"831366856","version_name":"1.3.1","version_date":"2019-05-24 14:58:36.000 +0800","version_description":"- Cải thiện tính năng tạo, chỉnh sửa CV/Cover letter trở nên dễ sử dụng và thân thiện với người dùng hơn trước<br>- Cải thiện hiệu năng và sửa một số lỗi nhỏ liên quan đến phần tạo và chỉnh sửa CV"},{"version_id":"831449247","version_name":"1.3.2","version_date":"2019-05-27 19:27:47.000 +0800","version_description":"- Cải thiện trải nghiệm chỉnh sửa profile, thêm đính kèm link và video dễ dàng hơn<br>- Thêm gợi ý vị trí công việc và chuyên ngành học giúp bạn nhập liệu nhanh chóng hơn"},{"version_id":"831462764","version_name":"1.4.0","version_date":"2019-05-30 15:52:03.000 +0800","version_description":"- Cập nhật giao diện Khám phá hoàn toàn mới với những tin tức hữu ích cùng những thông tin về học bổng đáng quan tâm<br>- Sao chép link CV, Cover letter để chia sẻ nhanh chóng hơn"},{"version_id":"831532603","version_name":"1.4.1","version_date":"2019-06-04 17:25:35.000 +0800","version_description":"- Cải thiện hiệu năng tải tin tức ở mục Khám phá, xem nhanh chóng và tải nội dung mượt mà hơn."},{"version_id":"831575238","version_name":"1.5.0","version_date":"2019-06-27 18:54:02.000 +0800","version_description":"- Cập nhật thêm tính năng nhận thông báo từ hệ thống về các thông tin liên quan đến: Việc làm, tin tức tuyển dụng,...<br>- Cải thiện hiệu năng ứng dụng"},{"version_id":"832350294","version_name":"1.6.0","version_date":"2019-08-13 21:40:24.000 +0800","version_description":"Bản cập nhật này bổ sung thêm tính năng:<br>- Trắc nghiệm đa trí thông minh MI<br>- Sửa lỗi và cải thiện hiệu năng ứng dụng"},{"version_id":"832580697","version_name":"1.7.0","version_date":"2019-08-31 14:37:37.000 +0800","version_description":"- Tùy chọn vuốt để bỏ quan tâm một tin tuyển dụng<br>- Cập nhật thêm danh mục Sách hay trong menu Khám phá<br>- Thay đổi một số giao diện, tối ưu hiệu năng và sửa một số lỗi"},{"version_id":"833487102","version_name":"1.8.0","version_date":"2019-11-12 15:43:25.000 +0800","version_description":"- Giờ đây bạn có thể nâng cấp tài khoản VIP dễ dàng ngay trên ứng dụng<br>- Giao diện trắc nghiệm tính cách MBTI hoàn toàn mới, thân thiện và dễ sử dụng hơn trước"},{"version_id":"833698004","version_name":"2.0.0","version_date":"2019-11-25 19:48:15.000 +0800","version_description":"Bản cập nhật này TopCV đưa đến cho người dùng một trải nghiệm xem tin tuyển dụng hoàn toàn mới:<br>- Giao diện trang chủ việc làm mới<br>- Cho phép người dùng tùy chỉnh loại công việc muốn hiển thị, ẩn hiện các danh mục việc làm<br>- Danh sách việc làm tập trung theo từng loại riêng biệt<br><br>Cám ơn bạn vì đã tin tưởng và sử dụng dịch vụ của TopCV."},{"version_id":"833848974","version_name":"2.1.0","version_date":"2019-12-11 04:52:27.000 +0800","version_description":"Bản cập nhật này TopCV đưa đến cho người dùng các tính năng sau:<br>- Xem thông tin chi tiết của một công ty<br>- Xem danh sách tất cả tin tuyển dụng của một công ty<br>- Sửa lại hiển thị phần công cụ hữu ích màn hình khám phá<br>- Sửa lỗi và cải thiện hiệu năng ứng dụng<br><br>Cám ơn bạn vì đã tin tưởng và sử dụng dịch vụ của TopCV."},{"version_id":"833981296","version_name":"2.2.0","version_date":"2019-12-14 04:52:54.000 +0800","version_description":"Bản cập nhật này TopCV đưa đến cho người dùng các tính năng sau:<br>- Cập nhật một số giao diện thân thiện hơn với người dùng<br>- Thêm tính năng bỏ quan tâm tất cả tin tuyển dụng<br>- Cập nhật trải nghiệm đọc tin tức ở mục Khám phá nhanh và mượt mà hơn trước<br><br>Cám ơn bạn vì đã tin tưởng và sử dụng dịch vụ của TopCV."},{"version_id":"834029995","version_name":"2.2.1","version_date":"2019-12-17 13:27:18.000 +0800","version_description":"Cùng chào đón không khí giáng sinh cùng TopCV"},{"version_id":"834258529","version_name":"2.2.2","version_date":"2020-01-08 15:24:04.000 +0800","version_description":"- Cập nhật tính năng ứng tuyển bằng upload file<br>- Sửa lỗi và cải thiện hiệu năng ứng dụng"},{"version_id":"834354876","version_name":"2.2.3","version_date":"2020-01-15 15:05:50.000 +0800","version_description":"Đón năm mới 2020 với hàng ngàn công việc hấp dẫn cùng TopCV"},{"version_id":"834572337","version_name":"2.2.4","version_date":"2020-02-04 13:43:24.000 +0800","version_description":"- Cải thiện hiệu năng, nâng cao trải nghiệm người dùng"},{"version_id":"834653660","version_name":"2.2.5","version_date":"2020-02-13 16:12:56.000 +0800","version_description":"- Khám phá thêm nhiều việc làm hấp dẫn ở trang chủ việc làm<br>- Sửa một số lỗi liên quan đến tìm kiếm việc làm<br>- Một số sửa đổi nhỏ liên quan đến giao diện"},{"version_id":"835141173","version_name":"2.3.0","version_date":"2020-03-26 19:55:54.000 +0800","version_description":"Bản cập nhật này có gì mới?<br>- Trải nghiệm mượt mà hơn, ứng dụng nhẹ hơn.<br>- Bổ sung thêm tính năng tìm kiếm công ty trong mục Khám phá, giúp bạn tiếp cận với nhà tuyển dụng dễ dàng hơn."},{"version_id":"835452851","version_name":"2.4.0","version_date":"2020-04-09 12:55:48.000 +0800","version_description":"- Cập nhật thêm tính năng Việc làm remote - ở nhà vẫn có việc<br>- Cập nhật lại tính năng tìm kiếm việc làm: giúp bạn dễ dàng xem các tiêu chí lọc và bỏ tiêu chí lọc nhanh chóng<br>- Tiếp cận các thương hiệu uy tín trong mục Khám phá"},{"version_id":"835479010","version_name":"2.4.1","version_date":"2020-04-09 19:04:20.000 +0800","version_description":"- Cập nhật thêm tính năng Việc làm remote - ở nhà vẫn có việc<br>- Cập nhật lại tính năng tìm kiếm việc làm: giúp bạn dễ dàng xem các tiêu chí lọc và bỏ tiêu chí lọc nhanh chóng<br>- Tiếp cận các thương hiệu uy tín trong mục Khám phá"},{"version_id":"835912456","version_name":"2.5.0","version_date":"2020-05-15 19:40:16.000 +0800","version_description":"Lần cập nhật này TopCV đưa đến người dùng những thay đổi sau:<br>- Cập nhật một số phần giao diện liên quan đến hiển thị chi tiết tin tuyển dụng, danh sách tin tuyển dụng<br>- Cập nhật thêm tính năng ứng tuyển lại<br>- Cập nhật thêm tính năng sử dụng CV ứng tuyển gần nhất để ứng tuyển mà không cần chọn lại CV hay điền thêm thông tin<br>- Download CV ngay bên trong ứng dụng<br>- Cập nhật thêm tính năng chia sẻ tin tuyển dụng"},{"version_id":"836209489","version_name":"2.5.1","version_date":"2020-05-31 14:41:56.000 +0800","version_description":"Bản cập nhật này có những thay đổi sau:<br>- Sửa lỗi không thể tải CV hoặc Cover Letter<br>- Cập nhật lại một số giao diện<br>- Xem chi tiết việc làm, chi tiết công ty trên website topcv.vn bằng ứng dụng"},{"version_id":"836231609","version_name":"2.5.2","version_date":"2020-06-05 15:29:47.000 +0800","version_description":"- Cập nhật hiển thị danh sách Việc làm đã ứng tuyển giúp bạn dễ dàng theo dõi hơn."},{"version_id":"836354317","version_name":"2.6.0","version_date":"2020-06-17 20:25:13.000 +0800","version_description":"TopCV ra mắt tính năng Việc làm gần bạn, giúp bạn tìm được những công việc gần nhà dễ dàng hơn"},{"version_id":"836739478","version_name":"2.7.0","version_date":"2020-07-14 17:19:00.000 +0800","version_description":"- Cập nhật công cụ tính lương Gross - Net theo quy định mới<br>- Thêm gợi ý từ khóa khi tìm kiếm ở màn hình Việc làm gần bạn<br>- Thêm danh sách Việc làm mới nhất và Việc làm cấp quản lý<br>- Thêm danh sách sách việc làm liên quan giúp bạn tiếp cận nhiều tin tuyển dụng phù hợp hơn"},{"version_id":"837168827","version_name":"2.8.0","version_date":"2020-08-12 13:48:27.000 +0800","version_description":"- Làm mới danh sách việc làm ở trang chủ nhanh chóng<br>- Xem đánh giá của các công ty bạn quan tâm<br>- Xem nhanh điểm đánh giá trung bình của các công ty khi tìm kiếm, xem chi tiết việc làm<br>- Sửa lỗi và cải thiện hiệu năng ứng dụng<br>- Thêm tính năng đăng nhập bằng Apple ID<br>- Thêm tính năng cài đặt bảo mật"},{"version_id":"837421140","version_name":"2.8.1","version_date":"2020-08-19 18:00:57.000 +0800","version_description":"- Lướt job siêu nhanh, ứng tuyển thả phanh."},{"version_id":"837497914","version_name":"2.9.0","version_date":"2020-09-01 15:41:28.000 +0800","version_description":"Có việc siêu tốc, không lo ví mốc"},{"version_id":"837788039","version_name":"2.9.1","version_date":"2020-09-15 20:09:42.000 +0800","version_description":"- Sửa lỗi và cải thiện hiệu năng<br>- Việc làm phù hợp trở nên nổi bật hơn<br>- Vuốt để bỏ qua việc làm ở mục Việc làm phù hợp"},{"version_id":"837894466","version_name":"2.9.2","version_date":"2020-09-22 22:33:39.000 +0800","version_description":"- Giao diện khám phá mới<br>- Sửa lỗi và cải thiện hiệu năng ứng dụng"},{"version_id":"838076047","version_name":"2.9.3","version_date":"2020-10-05 20:43:19.000 +0800","version_description":"- Thêm tính năng review các công ty bạn đã và đang làm<br>- Cải thiện hiệu năng ứng dụng"},{"version_id":"838164398","version_name":"2.9.4","version_date":"2020-10-12 23:13:17.000 +0800","version_description":"- Giờ đây bạn có thể đánh giá các công ty ngay tại trang xem chi tiết"},{"version_id":"839578233","version_name":"3.0.0","version_date":"2020-12-10 02:14:20.000 +0800","version_description":"Bản cập nhật lần này TopCV mang đến cho bạn những gì?<br>- Trải nghiệm tạo CV hoàn toàn mới, dễ dàng sử dụng và trực quan hơn<br>- Lựa chọn CV khi bật tìm việc"},{"version_id":"840097849","version_name":"3.1.0","version_date":"2021-01-20 03:21:16.000 +0800","version_description":"Đón năm mới 2021 cùng TopCV với các tính năng nổi bật sau:<br>- TopCV Connect cho phép bạn có thể nhắn tin với nhà tuyển dụng ngay trên ứng dụng<br>- TopCV QR cho phép bạn xem và download CV ở bất cứ trình duyệt nào chỉ với một lần đăng nhập trên ứng dụng"},{"version_id":"840313730","version_name":"3.2.0","version_date":"2021-03-06 01:38:18.000 +0800","version_description":"- Thêm nhiều việc làm hấp dẫn như: Việc làm IT, việc làm quản lý<br>- Nhắn tin với Nhà tuyển dụng bằng TopCV Connect nhanh chóng hơn khi tìm việc làm<br>- Thêm một số mẫu CV mới cho bạn tha hồ lựa chọn"},{"version_id":"841041780","version_name":"3.2.1","version_date":"2021-04-03 14:04:40.000 +0800","version_description":"- Sửa một số lỗi liên quan đến tính năng TopCV Connect"},{"version_id":"842237615","version_name":"3.3.0","version_date":"2021-05-18 01:19:12.000 +0800","version_description":"Phiên bản này đã thay đổi giao diện một số màn hình khi chọn template CV và cập nhật Facebook SDK."},{"version_id":"842615269","version_name":"3.3.1","version_date":"2021-06-22 02:07:03.000 +0800","version_description":"Lazy loading cho màn hình home và thay đổi một số tương tác với các box lựa chọn tiêu chí."},{"version_id":"843874542","version_name":"3.3.3","version_date":"2021-09-01 01:07:27.000 +0800","version_description":"Bug fixes and improvements"}]