[{"version_id":"831752753","version_name":"1.3","version_date":"2019-07-23 14:28:57.000 +0800","version_description":"What's new?<br><br>Fiat withdrawal<br>Now you can withdraw USD, UAH, RUB through a mobile application. Available methods: Visa / Mastercard, Qiwi, AdvCash, Payeer, Perfect Money<br><br>New design for the withdrawal process for crypto<br>Fully redesigned crypto withdrawal process. Now it has become even clearer, simpler and clearer.<br><br>Crete deposit in a new design<br>Now, with each deposit of the crypt, we display a reminder that deposits without a Memo / Destination tag will not be credited. And then very often lashes turn to us with the wording “I forgot to specify a memo ... how to be?” To prevent this from happening, we’ll remind you once again how to replenish the stock exchange balance correctly :) Well, in general, it has become more beautiful and more comfortable. The “Share” button also performs well.<br><br>USDT deposit and withdrawal via OMNI and ERC20 protocols<br>It doesn’t matter if you use the OMNI or ERC20 protocol, you can bring USDT to the exchange from any wallet and also withdraw to any USDT wallet.<br><br>Bugs, fixes, improvements<br>1. Deposits through Qiwi, the course is now correctly calculated.<br>2. Now the phrase “Unknown error” has become less frequent, if there is an error - we have come up with a human description for it.<br>3. Added a deposit method from any card (Visa / Mastercard Worldwide)<br>4. Introduce masks for wallets<br>5. Refinement of the UAH withdrawal process via Qiwi<br>6. Add info blog in VISA World<br>7. In withdrawal methods - if I choose Kuna, the code for some reason throws me at activation code. although due on creation. Even when I call back, I get to the page of my codes, but I must go to the page for choosing the output method.<br>8. Refinement of the process of replenishing FIAT currencies, namely setting up the sorting of replenishment methods<br>9. Fixed incorrect calculation of the commission when displaying the minimum amount.<br>10. Added validation for the field \"card number\" when saving VIsa cards<br>11. When creating a new card for Visa to display, display an alert that the “Card Name” field is mandatory<br>12. Finalize the output of FIAT currencies, add the ability to save cards for withdrawal using Visa for rubles<br>13. Bugs version 1.3 (86)<br>14. Changes in the layout of screens for the process of replenishing the crypt"},{"version_id":"837584821","version_name":"2.2","version_date":"2020-09-30 14:37:05.000 +0800","version_description":"Kuna is the best and most reliable place to buy and sell your cryptocurrency.<br>In this release, we introduced:<br>- new analytics"},{"version_id":"838095767","version_name":"2.3","version_date":"2020-10-07 13:54:29.000 +0800","version_description":"Kuna is the best and most reliable place to buy and sell your cryptocurrency.<br>In this release, we introduced:<br>- new market feature <br>- fixed bug on orders history page"},{"version_id":"838558954","version_name":"2.4","version_date":"2020-11-11 10:02:07.000 +0800","version_description":"Kuna  самое лучшее и надежное место для покупки и продажи вашей криптовалюты.<br>В этом релизе мы представили: <br>- возможность покупки и продажи новых токенов<br>- вывод на WOG Pride"},{"version_id":"839509297","version_name":"2.5","version_date":"2020-12-16 12:56:47.000 +0800","version_description":"Kuna  самое лучшее и надежное место для покупки и продажи вашей криптовалюты.<br>В этом релизе мы представили: <br>- обновили флоу вывода"},{"version_id":"839705160","version_name":"2.6","version_date":"2021-01-03 09:50:04.000 +0800","version_description":"Kuna  самое лучшее и надежное место для покупки и продажи вашей криптовалюты.<br>В этом релизе мы представили: <br>- добавили вход и регистрацию с помощью  Google и Apple ID"},{"version_id":"839921227","version_name":"2.7","version_date":"2021-01-08 12:16:01.000 +0800","version_description":"Kuna  самое лучшее и надежное место для покупки и продажи вашей криптовалюты.<br>В этом релизе мы представили: <br>- небольшие правки в флоу авторизации"},{"version_id":"840001290","version_name":"2.8","version_date":"2021-01-12 17:48:48.000 +0800","version_description":"Kuna  самое лучшее и надежное место для покупки и продажи вашей криптовалюты.<br>В этом релизе мы представили: <br>- небольшие правки для улучшения производительности"},{"version_id":"840469174","version_name":"2.9","version_date":"2021-03-05 13:11:51.000 +0800","version_description":"Kuna  самое лучшее и надежное место для покупки и продажи вашей криптовалюты.<br>В этом релизе мы представили: <br>- обновили флоу депозита с помощью рублевой карты"},{"version_id":"842114960","version_name":"3.2.2","version_date":"2021-05-08 10:16:15.000 +0800","version_description":"Kuna  самое лучшее и надежное место для покупки и продажи вашей криптовалюты.<br>В этом релизе мы представили: <br>- исправление ошибок и улучшение производительности"}]