[{"version_id":"839523421","version_name":"1.3","version_date":"2020-12-16 03:04:55.000 +0800","version_description":"bug fixed."},{"version_id":"839728280","version_name":"1.4","version_date":"2020-12-19 06:03:02.000 +0800","version_description":"感谢大家对人类跌落梦境的支持， 我们一直在努力优化大家提到的问题，今晚的更新我们主要优化了以下3个内容。<br><br>-修复了国际服操作模式的UI显示错误<br>我们发现有部分使用了国际服操作模式的玩家有反馈，按钮UI比例显示有误。<br>虽然大多数玩家会更喜欢操作模式I,II,我们已经在今晚的更新中修复了该问题，<br>对于曾经玩过国际版更熟悉国际版操作的玩家可以有更好的操作体验。<br><br>-修复了部分设备皮肤贴图显示模糊的问题<br>考虑手机设备相比PC性能压力，移动版的皮肤贴图质量势必要进行一些压缩。<br>我们为此做了很多尝试，有努力将贴图质量调整至相对能接受的范围，但仍有部分玩家反馈手机版画面过于模糊。<br>实际上我们发现这是部分设备显示错误导致的， 我们已经修复了这个问题，并对贴图质量进行了一定程度的升级。<br><br>-加入了在多人游戏中显示角色名的功能<br>这个功能原本在PC上才有，作用是为了方便大家认清一局游戏中的小伙伴都各自是谁。现在在游戏中点击右上角按钮【弹出队伍列表】就能在一定时间内在角色头上的姓名板上显示名字。<br><br>大家在游戏中遇到其他问题，可以加入官方问题反馈QQ群：811305227。<br>官方社区：TapTap《人类跌落梦境》社区开放了置顶的【问题收集】导航。"},{"version_id":"839735507","version_name":"1.5","version_date":"2020-12-21 02:18:40.000 +0800","version_description":"------更新公告12.20------<br><br>我们连夜紧急修复了【卡在空中】与【组队花屏】2个严重的问题，并升级了皮肤的素材质量。 现在大家已经可以自由切换编辑自己的皮肤，顺利联机游戏了。<br><br>非常抱歉之前遇到的这些影响联机的BUG，我们会继续优化排查其他潜在问题。<br><br>如果你在游戏过程中遇到任何其他困惑和问题，欢迎加入我们的BUG反馈群（811305227），也可以前往论坛置顶的【BUG反馈收集贴】进行反馈，我们将全力为您解决。"},{"version_id":"839748944","version_name":"1.6","version_date":"2020-12-31 02:15:56.000 +0800","version_description":"在游戏正式发售后，之前的版本出现了一些非常影响游戏体验的BUG和问题，我们对于受到影响的玩家深表歉意，并已经通过紧急更新，解决了其中一部分。<br>十分感谢大家在这样的情况下，依旧给予我们支持，你们的每个反馈都是对我们的帮助，我们会保持重视并及时回应。<br>在元旦期间，除了新活动以外，我们还将进行一次大版本更新，针对各种问题与BUG进行优化与修复。<br><br>此次更新版本的详细内容：<br><br>优化内容<br>1.优化网络较差时，游戏有概率卡死的问题；<br><br>2.优化组队联机模式，减少部分情况下非房主成员卡死的问题；<br>在游戏过程中，联机开黑，互相迫害向来是玩家们的一大乐趣。为了让大家更顺畅的享受其中，联机体验的优化一直是我们最重点的工作。在此次更新后，由于网络较差或房主网络断开导致的卡死问题将被解决，而联机卡顿是由于多种原因导致的，我们还在持续优化当中。<br><br>3.优化房间列表信号显示准确度；<br>房间列表中的信号展示，一直是大家选择开黑房间的重要参考，为了让大家有更好的联机体验，我们提升了房间列表信号的准确度，更新后不会再出现进入了信号满格的房间，依旧存在较严重延迟的情况。<br><br>4.优化房间列表排序，优先展示信号较好、有空位的房间；<br>房间列表的排序方式也进行了优化，更新后大家可以更容易的找到联机网络稳定的房间了<br><br>5.准备大厅新增【本机信号】显示；<br><br>6.优化网络环境不佳时的提示信息展示；<br><br>7.优化组队语音麦克风和听筒开关的逻辑；<br>之前的组队模式里，打开听筒开关的同时会自动打开语音麦克风，这让部分玩家遭遇了一些尴尬的情况。优化后这种情况不会再发生，大家可以单独开关自己的听筒与麦克风了。而在更换房间后默认保留语音开启状态的问题，我们会在之后的版本进行优化。<br><br>修复问题<br>1.修复发电厂运煤车.烟囱等“高危工作场景”附近的卡顿问题；<br><br>2.修复玩家被邀请进入房间时，操作摇杆，人物和物体有概率抽搐的问题；<br>如果你遇到过被邀请进入房间后，角色切换成“鬼畜抽搐”模式的BUG，更新后不会再遇到。<br><br>3.修复非首次登录时点击【TapTap登录】后黑屏的问题；<br><br>4.修复开始挑战地图时，出现异常队友（小白人）的问题；<br>虽然掉小白人会让独自游戏的玩家不再孤单，但这确实是个BUG，这次更新后可以与小白人说再见了。<br><br>5.修复发电厂地图卡车多人时候的同步问题；<br><br>6.修复创意工坊皮肤“自定义部件”后，在“个性装扮”界面的显示异常的问题；<br><br>7.修复开启直播时，开启组队语音直播后手机没有其他音频输出的问题；<br><br>8.修复iOS手机投屏直播时，开启组队语音，投屏设备没有音频输出的问题；<br><br>9.修复手机wifi切换移动网络时，组队消息无法发送的问题；<br><br>10.修复组队发送队伍消息，不展开显示不完整的问题；<br>打字聊天是大家在组队中的重要沟通方式，当前版本切换网络环境可能导致文字信息无法发出，发出的文字也可能显示不完整。在更新后这些问题将被解决，大家可以开黑时畅所欲言了（注意文明友好）。<br><br>11.修复水关卡读档后轮船和集装箱状态异常的问题；<br><br>12.修复“全速前进”成就完成异常的问题；<br><br>13.修复房间号出现负数的问题；<br><br>新增皮肤<br>1.新增4款玩家授权原创皮肤：【里逸】.【星空(男）】.【逗逼球】.【粉色逗逼球】；<br>游戏上线前，我们就承诺过会持续移植PC版创意工坊内的优质内容，供大家免费体验，除了这4款皮肤外，新地图也在努力移植当中，Bob会在元旦期间进行预告。<br><br>2.新增6款神秘联动活动皮肤，参加元旦联动活动可获得；<br>游戏内常见问题的解答，可以点击这里。如果在游戏过程中遇到其他BUG或问题，可以加入问题BUG反馈群（498366511）进行反馈，也可以在论坛内的【问题BUG收集贴】中进行反馈。我们会尽力帮助您解决。<br><br>再次向体验不佳的所有玩家致歉，未来我们将继续通过更新优化，让你们尽快获得满意的体验。<br><br>在元旦后，我们会针对联机卡顿再次进行优化，并在游戏内实装新的关卡地图，请持续关注Bob的新消息。"},{"version_id":"840041705","version_name":"1.7","version_date":"2021-01-19 02:28:28.000 +0800","version_description":"新增：<br>1、添加了【木头20】、【柔柔萌新系列8】和【飞行棋】三个新关卡；<br>2、新增八个皮肤<br><br>修复Bug：<br>1、修复皮肤管理界面，多次魔改和切换皮肤后，进游戏会卡死、UI丢失的问题；<br>2、修复主界面显示游戏内聊天信息的问题；<br>3、修复冰关卡和创意工坊地图过关后，再次开启关卡地图错误的问题；<br>4、修复网络波动时，游戏界面卡死无法点击的问题；<br><br>优化：<br>1、优化转计算者逻辑，计算者因断网而转计算者时，优先选择网络信号好的玩家做新计算者；"},{"version_id":"840321361","version_name":"1.8","version_date":"2021-02-10 01:29:13.000 +0800","version_description":"新增：<br>1、将有部分新关卡陆续开放；<br>2、新增了一批新的皮肤；<br>3、更新隐私协议内容和弹窗形式，并在涉及获取权限的功能前标明获取原因；<br><br>优化：<br>1、优化网络延迟信号显示的规则和算法，使之更加准确和稳定地显示玩家网络状态；<br>2、优化服务器连接方式；<br>3、对部分创意工坊关卡进行了小幅的性能优化"},{"version_id":"842297527","version_name":"1.10","version_date":"2021-05-31 03:10:25.000 +0800","version_description":"新增地图\n<br>1.楠橘~云上闯关——作者：楠橘\n<br>2.Journey to Valhalla, Part 2——作者：VodkaZombie\n<br>3.Journey to Valhalla, Part 3——作者：VodkaZombie\n<br>\n<br>新增皮肤\n<br>1.乃水手服fen——作者：小鹿包\n<br>2.乃的Orange糖——作者：小鹿包\n<br>3.垃圾分类——作者：吃瓜少女萌酱\n<br>4.霸气女孩——作者：藤原wowo\n<br>5.老绿头——速绿充电宝联动活动获得"}]