[{"version_id":"830915736","version_name":"2019.1","version_date":"2019-07-19 22:16:07.000 +0800","version_description":""},{"version_id":"832081001","version_name":"2019.2","version_date":"2019-07-25 07:48:43.000 +0800","version_description":"NEW<br>- New card style appearance for player view<br>- Player can now be dismissed by tapping an indicator<br>- Long press the download button on a collection to delete any downloaded books in that collection<br>- Books can now be sorted by “User Rating” (i.e. audible rating) and “My Rating”<br><br>IMPROVED<br>- Book view is automatically dismissed after play button is tapped<br>- Books within a collection are now sorted by release year by default<br><br>FIXED<br>- Fixed an issue where bluetooth pause gesture would not register when playback speed is above 1x<br>- Fixed an issue where swiping left on a book would show an option to download it, even when the book has already been downloaded<br>- Fixed an issue where initiating a download then returning to the book view wouldn’t show download progress<br><br>Thanks for all the amazing feedback so far! If you’re enjoying Prologue, please consider leaving a review."},{"version_id":"832140382","version_name":"2019.3","version_date":"2019-08-06 01:07:36.000 +0800","version_description":"NEW<br>- Voice boost: equalizes voices and boosts volume in loud environnments<br>- Progress bar is now displayed on collections<br>- Individual chapters of a book can now be downloaded by swiping<br><br>IMPROVED<br>- Books can now be downloaded on cellular:<br>    - When initialising a download while cellular is active, the download button will change to the wifi symbol<br>    - Tap the button again to start the download<br>    - If a download is initiated while WiFi is active, the download will automatically pause when switching to cellular.<br>- When a specific chapter is selected to play, an option is given to update progress of the book up to that point<br>- Chapter titles can now span 2 lines<br>- Playback indicator no longer animates if playback is paused<br>- Playback indicator is no longer displayed on bookmarked, recent, downloaded sections of suggested tab<br>- Show up to 20 search results (up from 10)<br>- You can now show all search results by tapping the “Show all results” button<br><br>FIXED<br>- Fixed issue where books within a collection were sorted newest first (my bad)<br>- Fixed Plex libraries not displaying in some situations<br>- Library status indicator on suggested tab now correctly turns red when unable to connect to Plex server<br>- Fixed search bar text colour on iOS beta versions<br>- Fixed a crash on launch when running the latest iOS beta version<br>- Fixed a crash when reordering chapters on the player view<br>- Fixed a crash when downloading<br>- Fixed an issue causing downloads to get “stuck”<br>- Fixed a few UI issues when “Show player automatically” setting is enabled"},{"version_id":"832882681","version_name":"2019.5","version_date":"2019-09-24 16:59:08.000 +0800","version_description":"- Dark mode fixes and adjustments"},{"version_id":"833063461","version_name":"2019.6","version_date":"2019-11-01 00:21:52.000 +0800","version_description":"NEW<br>- Filter book list by Downloaded, Read or Bookmarked status. TIP: Quickly add / remove filters by long pressing filter button<br>- Support for Plex home users. Existing users can switch home users under Libraries -&gt; Account -&gt; Home Users. If no user is selected, the home administrator account is used by default.<br>- Relayed (indirect) connections are now supported as a last resort<br>- Playlist support: Plex playlists are now imported and displayed under the “Collections” tab<br>- Finer grained playback speed control (0.1 increments). TIP: long press button to quickly access common playback speeds.<br>- Automatically rewind a few seconds after audio interruptions. Can be customised under Settings -&gt; Playback<br>- Remaining time &amp; book duration is now displayed on book detail view<br><br>IMPROVED<br>- The app will now automatically fall back to insecure (http) connections when no secure connection can be established<br>- Renamed “Suggested” tab to “Home”<br>- Skip forward / back buttons now support skipping into next / previous chapters<br>- Moved app icon settings menu to root settings level<br>- Book titles can now span 2 lines<br>- Increased touch target size of player seek handle<br><br>FIXED<br>- Fixed an issue where book list view could display duplicate books<br>- Various fixes and performance improvements<br><br>If you have the time, a review or rating makes my day!"},{"version_id":"834469775","version_name":"2019.7","version_date":"2020-01-26 10:08:09.000 +0800","version_description":"NEW<br>- Support for embedded m4b chapters<br>- Support for displaying book narrators (read from m4b composer tag)<br>- The app now uses a soft-delete system for missing files and libraries, similar to Plex. Items missing from the source library after a refresh will be hidden but not deleted. Clean up under Settings -&gt; Storage.<br>- Support for customising image cache size under Settings -&gt; Storage<br>- Playback rate can now be adjusted from CarPlay and Apple Watch now playing screens<br>- Option for displaying time remaining in book on CarPlay and Apple Watch now play playing screens<br><br>IMPROVED<br>- Improved chapter support on now playing view (skip to next / previous chapter)<br>- VoiceOver and accessibility improvements<br>- CarPlay performance and stability improvements<br><br>FIXED<br>- Various playback-related fixes. The app will no longer lose your place in a book after a playback error occurs.<br><br>NOTES <br>- The app now requires iOS 12.4+<br><br>Thank-you for the continued support. If you have the time, a review or rating makes my day!"}]