[{"version_id":"831287531","version_name":"1.1","version_date":"2019-06-04 21:33:49.000 +0800","version_description":"Sporty, how was your workout today?<br>In this update, we’ve added some brand new features. So be ready to step up your fitness goals!<br>– Weight Tracker &amp; Photo Diary: easily track your progress by taking selfies<br>– Water Tracker: record your water intake and stay hydrated<br>– Steps Tracker: be active and reach a daily goal<br><br>We would appreciate it if you can spare just a moment to review our app on the App Store!<br>Stay fit and healthy!"},{"version_id":"831660212","version_name":"1.2","version_date":"2019-06-14 06:37:25.000 +0800","version_description":"Hi! How are your workouts going? Are you ready to reach new heights? Then check out what we have for you in our new version:<br><br>– Audio guide for each workout – listen to Olesia’s helpful tips while training<br>– Minor bug fixes and overall stability improvements – for your smooth and fulfilling workout sessions<br><br>We would appreciate it if you can spare just a moment to review our app on the App Store!<br>Stay fit and healthy!"},{"version_id":"831858117","version_name":"1.3","version_date":"2019-07-11 06:26:36.000 +0800","version_description":"Sporty, how was your workout today?<br>In this update, we’ve added some new features. So be ready to step up your fitness goals!<br><br>Achievements: now you can track your challenge progress.<br>24/7 Coaching &amp; Support: now you can stay in touch with me via Instagram.<br>I would appreciate it if you could spare just a moment to review our app on the App Store!<br>Stay fit and healthy!<br>Yours,<br>Olesia"},{"version_id":"832238429","version_name":"1.4","version_date":"2019-08-05 08:29:38.000 +0800","version_description":"Hi! How are your workouts going? Are you ready to reach new heights? Then check out what we have for you in our new version:<br>– New cool challenges: HIIT and Bikini Body<br><br>We would appreciate it if you can spare just a moment to review our app on the App Store!<br>Stay fit and healthy!"},{"version_id":"832569872","version_name":"1.5","version_date":"2019-09-02 07:46:20.000 +0800","version_description":"Hi! How are your workouts going? Are you ready to take them to the next level? Check out what’s new in our latest version:<br><br>Improved parameter input - ensures the best personalized experience for you<br>Faster video downloading - now everything works much faster and without errors<br><br>We would appreciate it if you could spare just a moment to review our app on the App Store.<br>Stay fit and healthy!<br><br>Yours,<br>Olesya"},{"version_id":"833776175","version_name":"1.8","version_date":"2019-12-04 15:12:54.000 +0800","version_description":"Hi! Love your workout challenges? Now, we’ve prepared something really new and exciting for you! Meet our new 7-day Keto Challenge! <br><br>- Easy-to-cook meal plan! You can make all the meals on your own, minimum appliances required.<br>- A simple Shopping List! Just choose cooking days, and the list with all the ingredients will be created automatically.<br> <br>If you’ve always wanted to follow the Keto diet – now is your best chance to try it. Stay tuned for more diet challenges!<br> <br>Also, we have made small user experience improvements. We continue to develop our app to help you achieve results quickly.<br><br>Love HitFit? We would appreciate it if you leave your feedback on the app.<br><br>Stay fit and healthy!<br><br>Yours,<br>Olesia"},{"version_id":"833872256","version_name":"1.9","version_date":"2019-12-23 12:00:50.000 +0800","version_description":"Hi! Love your workout challenges? And what about something new? Now meet our 7-day Vegan Challenge!<br><br>- Easy-to-cook Vegan plan! You can make all the meals on your own, minimum appliances required.<br>- A simple Shopping List! Just choose cooking days, and the list with all the ingredients will be created automatically.<br><br>If you’ve always wanted to follow the Vegan diet – now is your best chance to try it. And we will add more diet challenges soon!<br><br>We try to do our best and quickly react to your feedback! Thus, we have made small user experience improvements, and we continue to develop our app to help you achieve results quickly.<br><br>Love HitFit? We would appreciate it if you leave your feedback on the app.<br><br>Stay fit and healthy!<br><br>Yours,<br>Olesia"},{"version_id":"834304708","version_name":"1.10","version_date":"2020-02-20 03:00:16.000 +0800","version_description":"Hi! How is your weight loss progress? Today we are introducing some cool changes:<br>• New Keto &amp; Vegan Challenges for 14 days!<br>• Brand-new design for Challenges menu! Stay tuned - soon we’ll start filling it with tons of new Training and Diet Challenges!<br><br>We try to do our best and we continue to develop our app to help you achieve results quickly!<br>Stay fit and healthy!"},{"version_id":"835259084","version_name":"1.11","version_date":"2020-03-26 06:22:00.000 +0800","version_description":"Forced to spend more time indoors this season? We’re introducing new immune-friendly diets for you to stay healthy and fit during disease outbreaks:<br>• Mediterranean diet for 7 and 14 days<br>• Paleo diet for 7 days<br>• Volumetrics diet for 7 days<br><br>The best of human nature can rise to the challenge! Keep moving, keep dreaming, keep taking care of your health!"},{"version_id":"835617784","version_name":"1.12","version_date":"2020-04-21 18:34:30.000 +0800","version_description":"Don’t quarantine your workout routines! We’re introducing a new set of challenges for you to stay in shape while staying at home:<br>Glutes, Arms, Legs, HIIT, and other workouts became available for 3, 7 or even 14 days.<br><br>Keep moving, keep dreaming, keep taking care of your health!"},{"version_id":"835922854","version_name":"1.13","version_date":"2020-06-01 09:33:05.000 +0800","version_description":"We've prepared for you a huge update!<br><br>We're happy to announce that our app goes worldwide and supports more languages now:<br>• Spanish!<br>• Italian!<br>• Portuguese!<br>• French!<br>• Chinese!<br><br>Keep moving, keep dreaming, keep taking care of your health!"},{"version_id":"836561135","version_name":"2.0","version_date":"2020-07-07 07:05:00.000 +0800","version_description":"Boys! Girls! Great news for you all!<br>Now everyone can get fit and strong with HitFit.<br>We’ve also packed our app with tons of new highly-efficient Single Workouts. More fresh ideas to keep you motivated for exercise! <br>Hustle to try them all and share your reviews in the App Store!"},{"version_id":"836964892","version_name":"2.1","version_date":"2020-07-28 12:24:17.000 +0800","version_description":"Hey, it’s getting hot here! Need a little extra kick in the summertime? <br>Update the app and go to the My Day tab!<br> - My Day: personalized daily workouts tailored to your fitness needs and physical level.<br><br>Make each new day a new horizon with HitFit! And if you like the app, take a moment to write a review!"},{"version_id":"837238474","version_name":"2.2","version_date":"2020-08-11 12:51:13.000 +0800","version_description":"Hey, how are your workouts going? Ready to reach new heights? Then check out what we’ve got for you with this update:<br><br>• Post-train screen that makes you proud of yourself! Now, after each workout session, you’ll get the stats on exercises, time, and calories. <br>• Make your training even more personal! The workout was too hard? Tell us – and we’ll tailor it to your fitness level.<br><br>Be strong and healthy! And if you like the app, take a moment to write a review."},{"version_id":"838056520","version_name":"2.3","version_date":"2020-10-05 14:04:11.000 +0800","version_description":"With the new release, we bring some nice improvements to make your experience with the app even more streamlined:<br><br>• All challenges have been smartly systematized. Now you can easily find and start the one that suits your level and fitness goal best.<br>• \"My challenges\" view with quick access to your ongoing challenges and progress.<br><br>We continue improving our app to help you achieve results quickly. If you feel like it, take a moment to leave a review!"},{"version_id":"838316489","version_name":"2.4","version_date":"2020-10-23 08:59:16.000 +0800","version_description":"With the new release, we bring some nice improvements to make your experience with the app even more streamlined."},{"version_id":"839824984","version_name":"2.8","version_date":"2021-02-02 07:36:14.000 +0800","version_description":"Hey guys! Want to build muscles, get toned, and stay fit? <br>Well, then you’ll love this update! <br>- Men Workouts: check out the new male-oriented fitness plans for different muscle groups.<br><br>More cool things to come! Never stop moving towards your goals and sharing your reviews in the App Store!"},{"version_id":"840407235","version_name":"2.9","version_date":"2021-02-12 07:04:27.000 +0800","version_description":"With the new release, we bring some nice improvements to make your experience with the app even more streamlined."},{"version_id":"841079640","version_name":"3.0","version_date":"2021-04-09 07:00:57.000 +0800","version_description":"HitFit is here, delivering a powerful update you are going to love!<br>Check out what’s new:<br>- Profile screen displays all your fitness stats now. Track your progress towards your goals easily! <br>- \"My favorites\" for quick access to the workouts you like most<br>- List with completed workouts—be proud of your achievements and move forward! <br> <br>We continue improving our app to help you get to your goal quickly. If you feel like it, take a moment to leave a review!"},{"version_id":"841650104","version_name":"3.1","version_date":"2021-04-21 06:45:53.000 +0800","version_description":"With the new release, we bring some nice improvements to make your experience with the app even more streamlined."},{"version_id":"842349863","version_name":"3.3","version_date":"2021-05-28 14:06:59.000 +0800","version_description":"With the new release, we bring some nice improvements to make your experience with the app even more streamlined."}]