[{"version_id":"832656562","version_name":"2.0.0","version_date":"2019-09-09 02:11:37.000 +0800","version_description":"Exciting update! LingoChamp joins in more scientific and systematic Premium Courses to<br>enable you to experience the exclusive English improvement plan made by your AI teacher!<br>New features update:<br>● Premium Courses: Your exclusive English courses which are more efficient, more<br>comprehensive, and faster<br>● More scientific dashboard:：Scientific data to track your performance<br>● Bug fixes: Our R&amp;D angels fixed many things to improve the performance.<br>Questions? Feedback? We’d love to hear from you.<br>Email us at support@lingochamp.com<br>Your lovely LingoChamp team"},{"version_id":"836000753","version_name":"2.5.10","version_date":"2020-05-26 01:46:01.000 +0800","version_description":"New update! <br>-Experience optimization: Better UI design and better learning experience!<br>-Bug fixes: Bugs are fixed by our R&amp;D angels."},{"version_id":"840954922","version_name":"3.0.1","version_date":"2021-03-23 05:23:52.000 +0800","version_description":"**Officially launch LingoChamp Business English Courses. Registered users please update to the newest version to access Business English content.<br>- This course is a systematic course designed for professionals to improve users' English communication skills in the workplace and help users enhance their comprehensive competence.<br>- The course is suitable for graduates who are about to enter the workplace and professionals that prepare for the promotion, and those who want to improve their interview skills and comprehensive English skills.<br>**Experience optimization: Better UI design and better learning experience!<br>**Bug fixes: Bugs are fixed by our R&amp;D angels."},{"version_id":"841352186","version_name":"3.2.0","version_date":"2021-04-15 06:43:39.000 +0800","version_description":"- Optimized the display of the Learn page, making it easier to access coach Alix courses and engage in dialogue exercises.<br>- Adjust the display of the Alix course list to filter the types of topics, which can help you quickly find interesting courses.<br>- Added Premium icon in Me page. You can click it to view your current rights."},{"version_id":"843106483","version_name":"3.7.1","version_date":"2021-07-19 06:07:04.000 +0800","version_description":"Optimize Alix Course study experience. Now you are able to preview the key point of the course and watch subtitles during the study."},{"version_id":"843350456","version_name":"3.8.0","version_date":"2021-08-03 05:39:11.000 +0800","version_description":"-  Release referral program within the app. Your friend could get a special discount by purchase through your promo code. Invite them now!<br>- New Daily English Quote Section. Beautiful English quote updates every day. You can record and publish your reading and interact with other learners in this section.<br>- The official website is live now. You can take a free proficiency test on our website without installing the app. Invite your friend to try."},{"version_id":"843901077","version_name":"4.0.0","version_date":"2021-09-02 02:48:53.000 +0800","version_description":"-The leaderboard of Everyday English is online. Publish your high score work and win likes!<br>-Can directly collect vocabulary on Lesson Preview and Report page, and then practice it in the vocabulary bank!<br>-Optimize core curriculum with a better learning experience."}]