[{"version_id":"831623851","version_name":"1.0.1","version_date":"2019-06-11 22:11:46.000 +0800","version_description":"1. Improved home page loading speed<br>2. fixed third party log in function"},{"version_id":"831813635","version_name":"1.0.4","version_date":"2019-06-29 09:25:33.000 +0800","version_description":"1. Optimised sentence division logic of texts<br>2. Improved accuracy of speech recognition <br>3. Result page now indicates accuracy of your answers <br>4. Optimised interactive experience"},{"version_id":"832008177","version_name":"1.0.5","version_date":"2019-07-17 03:12:15.000 +0800","version_description":"1. Added level 2 (24 new lessons!) <br>2. Updated the main page to display lesson content more clearly<br>3. Added the level 1 final test<br>4. Optimised launch page <br>5. Improved several other functions"},{"version_id":"832197795","version_name":"1.0.7","version_date":"2019-07-30 16:42:40.000 +0800","version_description":"We have been busy improving app performance and squashing bugs to make sure you have the best version of the Super Chinese APP."},{"version_id":"832238809","version_name":"1.0.8","version_date":"2019-08-07 02:22:54.000 +0800","version_description":"We’ve just rolled out some pretty cool new features. <br><br>1. You can now fully unlock your Chinese learning potential, freely review your previous lessons to practice Chinese vocabulary, character writing, listening, speaking and grammar. Easily skip levels by passing the test. <br>2. For total beginners, we now have comprehensive Pinyin learning functionality. Speak Chinese fluently from the onset. <br>3. We’ve also added a textbook function so you can see how far you’ve come in your Chinese learning journey. <br>4. The speech recognition function is even better. <br>5. All functions are now more optimized to ensure you have the best version of Super Chinese. <br><br>If you have any feedback or suggestions, we’d love to hear from you. <br><br>Contact us via email: hello@superchinese.com"},{"version_id":"832505986","version_name":"1.0.9","version_date":"2019-09-06 07:47:45.000 +0800","version_description":"1. Our VIP subscriptions are online! Enjoy unlimited access to all content. <br>2. We've added a message function so we can better answer your inquiries and keep you updated on cool improvements<br>3. We've improved our speech recognition software. Speak like a native!"},{"version_id":"832722684","version_name":"1.0.10","version_date":"2019-09-16 02:52:16.000 +0800","version_description":"1. We've added more example sentences to help you better understand new vocab. <br>2. You can now answer two new and fun types of questions: fill in the blanks and structure the sentences. <br>3. By popular demand: switch Pinyin on and off and change the speed of the recording! <br>4. Optimized interface display<br>5. Improved the speech recognition function"},{"version_id":"832878815","version_name":"1.0.11","version_date":"2019-09-23 23:37:33.000 +0800","version_description":"1. Optimised user experience, including pinyin and registration<br>2. Improved several features based on user feedback <br>3. The system is now more optimised"},{"version_id":"832971083","version_name":"2.0.0","version_date":"2019-10-02 00:12:52.000 +0800","version_description":"1. Optimised VIP purchase page and added a “get back your tuition” challenge! Work hard and get back full VIP tuition.&nbsp;<br>2. Optimised several functions based on user feedback"},{"version_id":"833157907","version_name":"2.0.1","version_date":"2019-10-26 18:13:52.000 +0800","version_description":"1. Updated the VIP page<br>2. We've optimised our interface and results screen<br>3. It's a lot easier to share your study and test results now!"},{"version_id":"833432636","version_name":"2.0.2","version_date":"2019-11-02 17:01:28.000 +0800","version_description":"1. We've made some improvements to the content and structure to make it even easier for you to learn Chinese!<br>2. We're continuing to optimizing all aspects of the app."},{"version_id":"833448632","version_name":"2.0.3","version_date":"2019-11-04 21:57:06.000 +0800","version_description":"1. We've made some improvements to the content and structure to make it even easier for you to learn Chinese!<br>2. We're continuing to optimizing all aspects of the app."},{"version_id":"833492978","version_name":"2.0.5","version_date":"2019-11-06 21:57:13.000 +0800","version_description":"1. We've made some improvements to the content and structure to make it even easier for you to learn Chinese!<br>2. We're continuing to optimizing all aspects of the app."},{"version_id":"834176588","version_name":"2.0.7","version_date":"2020-01-02 21:48:25.000 +0800","version_description":"We have a new update for you! Based on your useful feedback and suggestions, we've fixed some small bugs for an even better user experience."},{"version_id":"834234245","version_name":"2.0.8","version_date":"2020-01-06 17:07:49.000 +0800","version_description":"We have a new update for you! Based on your useful feedback and suggestions, we've fixed some small bugs for an even better user experience."},{"version_id":"834260576","version_name":"2.0.9","version_date":"2020-01-08 19:07:35.000 +0800","version_description":"We have a new update for you! Based on your useful feedback and suggestions, we've fixed some small bugs for an even better user experience."},{"version_id":"834390606","version_name":"2.1.0","version_date":"2020-01-21 23:31:13.000 +0800","version_description":"We have a new update for you! Based on your useful feedback and suggestions, we've fixed some small bugs for an even better user experience."},{"version_id":"834774476","version_name":"2.1.2","version_date":"2020-02-21 02:36:04.000 +0800","version_description":"This update includes a few useful new features:<br>1. We’ve added a daily check-in reward. Log in every day to earn MonkeyCoins.<br>2. Trade your MonkeyCoins for Study Time! You no longer have to worry about not having enough free minutes to study Chinese with us. <br>3. We’ve added a Knowledge Bank where you can easily find all the content you’ve studied so far. Use it as revision or a Chinese dictionary! <br>4. Optimised vocab cards and added more practice exercises. <br>5. We’ve listened to our users and optimized some functions based on your useful feedback.<br><br>Super Chinese is working hard to make learning Chinese easy and fun!"},{"version_id":"835396198","version_name":"2.1.7","version_date":"2020-04-04 17:08:07.000 +0800","version_description":"1. We've added an AI-based level test so you can find out your exact Chinese level in only 10 minutes. Come try it out.<br>2. You can now see your classmates' study reports. Follow your friends and learn Chinese faster together!"},{"version_id":"835970115","version_name":"2.3.1","version_date":"2020-05-16 23:33:13.000 +0800","version_description":"1. Look up words directly in the answer analysis or course texts now! Just click on the Chinese character you don't know to see its meaning. <br>2. Our interface looks even more beautiful now. <br>3. Fixed a few small bugs to make sure our users enjoy studying Chinese with Super Chinese!"},{"version_id":"836998550","version_name":"2.6.1","version_date":"2020-07-26 14:30:15.000 +0800","version_description":"1. Optimized the app's registration process <br>2. Fixed a couple of bugs"},{"version_id":"837282508","version_name":"2.7.0","version_date":"2020-08-10 02:03:43.000 +0800","version_description":"Hi Chinese learners! We've made some small changes this update: <br>1. Adjusted the font size<br>2. Optimised the user experience, download the update and try it for yourself!"},{"version_id":"837505781","version_name":"2.7.2","version_date":"2020-08-25 22:15:00.000 +0800","version_description":"We&nbsp;are&nbsp;working&nbsp;hard&nbsp;on&nbsp;improving&nbsp;Super&nbsp;Chinese,&nbsp;thank&nbsp;you&nbsp;for&nbsp;updating!<br>1.&nbsp;We've&nbsp;improved&nbsp;the&nbsp;speech&nbsp;recognition&nbsp;function&nbsp;to&nbsp;make&nbsp;it&nbsp;even&nbsp;clearer&nbsp;which&nbsp;words&nbsp;you&nbsp;need&nbsp;to&nbsp;improve&nbsp;and&nbsp;which&nbsp;words&nbsp;you&nbsp;can&nbsp;already&nbsp;pronounce&nbsp;like&nbsp;a&nbsp;native!<br>2.&nbsp;Optimised&nbsp;the&nbsp;user&nbsp;experience&nbsp;and&nbsp;fixed&nbsp;some&nbsp;tiny&nbsp;bugs"},{"version_id":"837790504","version_name":"3.0.0","version_date":"2020-09-21 08:38:55.000 +0800","version_description":"The Super Chinese 3.0 upgrade is here! <br>Our amazing content team has optimized your whole study process. It's now more fun, more complete and more effective! <br>1. We've improved the lesson structure, so every unit now has even more varied content for you to learn Chinese with! <br>2. Each lesson now has a cover page, so it's easier to see which content you're studying next. <br>3. We've completely revamped level 1, come check it out! Other levels in progress, so keep an eye out for those.<br>4. We've fixed a couple of tiny bugs and optimised your user experience.<br><br>p.s. We're letting you in on a secret: more epic study functions coming soon! We can't wait to share those with you."},{"version_id":"838010418","version_name":"3.1.0","version_date":"2020-10-02 14:11:48.000 +0800","version_description":"1. We've added a new ranking board. Come and compete with your friends and classmates! <br>2. Fixed a couple of tiny bugs and improved your user experience. Happy learning!"},{"version_id":"838066330","version_name":"3.1.1","version_date":"2020-10-04 13:32:51.000 +0800","version_description":"1. We've added a new ranking board. Come and compete with your friends and classmates! <br>2. Fixed a couple of tiny bugs and improved your user experience. Happy learning!"},{"version_id":"838345249","version_name":"3.1.3","version_date":"2020-10-24 00:38:40.000 +0800","version_description":"1. We've added a new ranking board. Come and compete with your friends and classmates! <br>2. Super Chinese level 2 vocab has been updated and we're working hard on the other levels, keep an eye out for those! <br>3. Fixed a couple of tiny bugs and improved your user experience. Happy learning!"},{"version_id":"838428933","version_name":"3.2.0","version_date":"2020-10-30 08:56:44.000 +0800","version_description":"1. Come and experience our new way of learning Chinese for level 1 and master Chinese faster!&nbsp;<br>2. Super Chinese level 3 vocab has been updated and we're working hard on the other levels, keep an eye out for those!&nbsp;<br>3. Fixed a couple of tiny bugs and improved your user experience. Happy learning!"},{"version_id":"839774313","version_name":"3.4.0","version_date":"2020-12-31 19:34:35.000 +0800","version_description":"1. We've added a function where you can save vocab and grammar points, so you can see your collections at any time.<br><br>2. Flashcards are here! Flashcards are great for quick review and solidifying your knowledge. Master Chinese quicker! <br><br>3. The study report has an all-new look. It will show you a detailed analysis of all the content you've mastered or still need to work on. <br><br>4. Improved the user experience, come and try it out!"},{"version_id":"839923532","version_name":"3.5.0","version_date":"2021-01-08 18:14:07.000 +0800","version_description":"1. We've improved the app's interface to give you a better learning experience. <br>2. Fixed some tiny bugs."},{"version_id":"840001494","version_name":"3.5.1","version_date":"2021-01-14 18:45:34.000 +0800","version_description":"1. We've improved the app's interface to give you a better learning experience. <br>2. Fixed some tiny bugs."},{"version_id":"840246400","version_name":"3.6.0","version_date":"2021-01-30 15:14:28.000 +0800","version_description":"1. Streak challenge is online! Mysterious treasure chests await!<br>2. Optimized study goal. You can now flexibly make the daily study plan that suits you the best.<br>3. We've created Introduction lessons for Chinese beginners.<br>4. More optimized details for you to discover!"},{"version_id":"840383601","version_name":"3.6.3","version_date":"2021-02-07 15:52:26.000 +0800","version_description":"1. Streak challenge is online! Mysterious treasure chests await!<br>2. Optimized study goal. You can now flexibly make the daily study plan that suits you the best.<br>3. We've created Introduction lessons for Chinese beginners.<br>4. More optimized details for you to discover!"},{"version_id":"841054737","version_name":"3.6.8","version_date":"2021-03-26 23:06:46.000 +0800","version_description":"Optimised the user experience and fixed some tiny bugs"},{"version_id":"842172548","version_name":"3.8.0","version_date":"2021-08-13 23:10:02.000 +0800","version_description":"1. New Smart Review: We've added an AI-powered review function in our Chinese course! Now you can review what you have learned based on knowledge points, and even on units!<br>2. Optimised the user experience and fixed some tiny bugs"},{"version_id":"843976141","version_name":"3.8.1","version_date":"2021-09-07 17:16:29.000 +0800","version_description":"1. Invite your friends to get a free VIP<br>2. Optimised the user experience and fixed some tiny bugs"}]