[{"version_id":"837366809","version_name":"1.1","version_date":"2020-08-16 06:00:51.000 +0800","version_description":"We enhanced the process of registration and verifying users include<br>1. instant email verification<br>2. add KYC form to customer's profile<br>And general enhancements.<br>We are committed in Hakbah to continuous development to serve you better for easier Saving Groups in 2 minutes"},{"version_id":"837808496","version_name":"1.2","version_date":"2020-09-25 05:15:43.000 +0800","version_description":"In our latest version, we have improved the usability and user experience of the app.<br>- Support iOS 14<br>- We replaced your user name with your mobile. Now you can login direct and easy into the app by using your mobile number only.<br>- Ability to login by Face ID / Touch ID<br>- Enjoy exploring Hakbah's features without need to verify your account<br>- General Improvements<br><br>Enjoy Hakbah and start Saving today!"},{"version_id":"838455676","version_name":"1.2.1","version_date":"2020-10-31 17:43:34.000 +0800","version_description":"Now you can pay using Apple Pay. More straightforward and more comfortable way than ever. <br>- General improvements."},{"version_id":"839645954","version_name":"1.3","version_date":"2020-12-18 05:10:19.000 +0800","version_description":"** Over 40,000 Downloads in 4 months! ** THANK YOU ALL<br><br>** Hakbah is permitted by the Saudi Central Bank “SAMA” to test its innovative products under the Regulatory Sandbox. **<br>People trusted Hakbah to create, join, manage, and participate in Jamiya (Saving Group)<br><br>WHAT’S NEW:<br>- Payment now is easier than ever with any Mada card via Apple Pay.<br>- Now you can edit the IBAN account direct from the Profile. <br>- You’ll never forget your payment date with our new Reminder. Now, you can add reminders to your calendar for all future payments. <br>- More comfortable to subscribe to our all-new Email list. You will read insights, advice, and the latest updates.  <br>- We care for our customers and always listen to you. Now, we will do that in an even more effective way. We enhanced our Care section for faster and better service. <br>- And last but not least, we fixed issues and improved your Hakbah App for faster and better performance. We’ve made some improvements behind the scenes too.<br><br>From Riyadh with respect. <br>Hakbah Team"},{"version_id":"839974603","version_name":"1.3.1","version_date":"2021-01-11 17:56:04.000 +0800","version_description":"** Over 40,000 Downloads in 4 months! ** THANK YOU ALL<br><br>** Hakbah is permitted by the Saudi Central Bank “SAMA” to test its innovative products under the Regulatory Sandbox. **<br>People trusted Hakbah to create, join, manage, and participate in Jamiya (Saving Group)<br><br>WHAT’S NEW:<br>- Payment now is easier than ever with any Mada card via Apple Pay.<br>- Now you can edit the IBAN account direct from the Profile. <br>- You’ll never forget your payment date with our new Reminder. Now, you can add reminders to your calendar for all future payments. <br>- More comfortable to subscribe to our all-new Email list. You will read insights, advice, and the latest updates.  <br>- We care for our customers and always listen to you. Now, we will do that in an even more effective way. We enhanced our Care section for faster and better service. <br>- And last but not least, we fixed issues and improved your Hakbah App for faster and better performance. We’ve made some improvements behind the scenes too.<br><br>From Riyadh with respect. <br>Hakbah Team"},{"version_id":"842811121","version_name":"1.4.4","version_date":"2021-06-25 07:17:47.000 +0800","version_description":"** With Hakbah App, all Jamiya’s benefits without its problem **  \n<br>\n<br>** Noon Hakbah Fintech is permitted by the Saudi Central Bank “SAMA” to test its innovative products under the Regulatory Sandbox. ** \n<br>\n<br>Join thousands of people trusted Hakbah to create, join, manage, and participate in Jamiya (Saving Group)\n<br>\n<br>\n<br>WHAT’S NEW: \n<br>• New user interface with new branding \n<br>• Now, you can add Promissory Note (Sanad) to the new Jamiya \n<br>• Payment now is easier than ever with Apple Pay. \n<br>• Now you can edit the IBAN account direct from the Profile.  \n<br>• You’ll never forget your payment date with our new Reminder. Now, you can add reminders to your calendar for all future payments. \n<br>• More comfortable to subscribe to our all-new Email list. You will read insights, advice, and the latest updates.  \n<br>• We care for our customers and always listen to you. Now, we will do that in an even more effective way. We enhanced our Care section for faster and better service. \n<br>• And last but not least, we fixed issues and improved your Hakbah App for faster and better performance. We’ve made some improvements behind the scenes too.\n<br>\n<br> From Riyadh with respect.\n<br> Hakbah Team"}]