[{"version_id":"835775196","version_name":"1.9.90","version_date":"2020-05-12 00:49:53.000 +0800","version_description":"What's New:\n\n- Creator Profiles\nAll creators now have their own profiles as a new tab where they can see all their AR content with the ability to delete them. You can also tap on a creator's name to visit their profile and see their content.\n\n- Design Improvement\nThe Login page has been redesigned with a more modern UI. We also improved the design in some other places like the Overview, Uploader etc.\n\nIf you have feedback or suggestions, please submit a support ticket from within the app. Follow us on Instagram where we share amazing AR videos and exclusive behind the scenes look to what we are doing with AR and LiDAR.\n\n#stayHome\n#experienceAR\n#stayAwayFromTheFridge\n\nBest,\nKrist from Particular AR"},{"version_id":"836825755","version_name":"1.10","version_date":"2020-07-14 10:19:09.000 +0800","version_description":"What's New:\n\nEarly Access Creator Profiles\nNow, you can create a Creator profile via Sign In With Apple and start to upload and showcase your AR creations and experiences. No need to get invited! This feature will be free in early access for a limited time and you’ll be able to create AR frames and share them Particular for free, so hurry up and don’t miss out on this offer.\n\nUI Improvements\nWe improved the design of the app in some places, improved some of the icons and updated the Add New button design.\n\nIf you have feedback or suggestions, please submit a support ticket from within the app. Follow us on Instagram where we share amazing AR videos and exclusive behind the scenes look to what we are doing with AR and LiDAR.\n\nBest,\nKrist from Particular AR"},{"version_id":"836975599","version_name":"1.11","version_date":"2020-07-24 04:03:44.000 +0800","version_description":"What's New:\n\nSign in with Apple\nWe added the ability to easily create a Creator profile. You can do this from the Profile & Settings screen and also while you are previewing/trying to upload an AR experience. It’s easy, it’s fast and it’s free. This is a limited time offer so hurry up and don’t miss out!\n\nChanges to Particular\n- Added a new Gaming category in the quick filter\n- Added supported file types as information for uploaders, currently, you can only share .usdz and .reality files as AR Experiences\n- Added file sizes limit up to 10 MB top\n- Added a link to join our exclusive Facebook group\n- Entering a Username is required now\n- Fixed a bug that caused the app to crash\n- Fixed Tutorials for AR Experience & AR Animation\n- Fixed some other minor bugs\n\nIf you have feedback or suggestions, please submit a support ticket from within the app. Follow us on Instagram where we share amazing AR videos and exclusive behind the scenes look to what we are doing with AR and LiDAR.\n\nBest,\nKrist from Particular AR"},{"version_id":"837177755","version_name":"1.12","version_date":"2020-08-02 22:09:56.000 +0800","version_description":"What's New:\n\nParticular Search\nSearch by name and get results for specific AR experiences, frames, face filters and more.\n\nView Counter\nYou can now check how many times an AR experience has been viewed. This is perfect if you are a Creator as you will see the community's engagement with your AR content.\n\nDesign Improvement\nWe improved the fonts, alignments and many other minor things that make for a better overall experience.\n\nBug Fixes\nWe fixed a couple of bugs that caused a crash for some users among other things.\n\nThat's about all. If you want to see a feature or have some feedback, please get in touch from within the app.\n\nThanks,\nKrist from Particular"},{"version_id":"837318549","version_name":"1.13","version_date":"2020-08-14 07:14:25.000 +0800","version_description":"What’s New:\n Design Changes\nWe tweaked and improved the design of the app and we also added some more information about what the app can do for you.\n\nBug Fixes\nWe fixed a couple of bugs that caused a crash for some users among other things.\n\nThat's about all. If you want to see a feature or have some feedback, please get in touch from within the app.\n\nThanks,\nKrist from Particular"}]