[{"version_id":"831281822","version_name":"1.0","version_date":"2019-07-15 21:02:55.000 +0800","version_description":""},{"version_id":"832686814","version_name":"1.1.1","version_date":"2019-09-07 15:24:40.000 +0800","version_description":"Fix a crash condition introduced in the last version."},{"version_id":"832989501","version_name":"1.2","version_date":"2019-10-17 12:25:50.000 +0800","version_description":"• Improved DNS latency — the app now always uses the closest server from our network.<br>• Improved censorship resistance — if NextDNS did not work before on some networks or in some countries, you should try again.<br>• Hardened Privacy Mode — only use DNS servers located in jurisdictions with strong privacy laws, outside of the 14 Eyes.<br>• Passcode lock — for parental control when NextDNS is installed on your kids' devices.<br>• Status information in the Settings — displays DNS latency and the server location you are currently using.<br>• Support for Dark Mode on iOS 13.<br><br>Please try as many of those as possible and report back any bugs or improvements. Enjoy!"},{"version_id":"833435366","version_name":"1.2.1","version_date":"2019-11-03 13:10:16.000 +0800","version_description":"• Fix device name not being sent after iOS reboot (when the option is turned on in Settings).<br>• Other small fixes."},{"version_id":"833845792","version_name":"1.2.2","version_date":"2019-12-11 22:12:45.000 +0800","version_description":"• Increased resistance to networks and countries specifically trying to block NextDNS.<br>• Improved privacy when sending Device name (Devices are now unique to a configuration and can't be uniquely identifiable between 2 configurations). This will result in a duplicate device in the Analytics section (this will only happen once).<br>• Other small fixes."},{"version_id":"836113766","version_name":"1.2.3","version_date":"2020-05-25 20:30:56.000 +0800","version_description":"• Greatly improve latency in some regions.<br>• Small bugfixes and improvements.<br><br>If you're having issues with the app, please reach out to us via the chat available on https://nextdns.io or by email at support@nextdns.io.<br><br>Stay safe everyone."},{"version_id":"837805955","version_name":"2.0","version_date":"2020-09-23 09:42:39.000 +0800","version_description":"On iOS 14, this version uses the new native Encrypted DNS setting and does not require running a \"fake\" VPN in the background anymore.<br><br>IMPORTANT: You must open the app and re-enable NextDNS once after this update or after upgrading to iOS 14 to migrate.<br><br>Deprecation (iOS 14 only):<br>• The Hardened Privacy feature has been deprecated.<br>• We have removed the Status section in the Settings as it was confusing less tech-savvy users and may lack accuracy on iOS 14. Both location and latency can still be checked manually using popular tools like dnsleaktest.com or by pinging dns.nextdns.io.<br><br>---<br>Please report any issues you encounter to us via the chat available on https://nextdns.io, on our subreddit /r/nextdns or at support@nextdns.io."},{"version_id":"840045949","version_name":"2.0.1","version_date":"2021-01-15 18:50:40.000 +0800","version_description":"This update includes latency improvements. We recommend that you open the app once the update is complete."}]