[{"version_id":"839716977","version_name":"0.2.11","version_date":"2020-12-20 02:30:18.000 +0800","version_description":"- Upgraded the quality of the Flagship Hercules from blue to purple. Added the exclusive fourth Skill for purple Flagships. Adjusted the order of the original 3 Flagship Passive Skills. Adjusted the value of the Flagship Passive Skill “Leadership Boost”.\n<br>- Upgraded the quality of the Flagship Nemesis from blue to purple. Added the exclusive fourth Skill for purple Flagships. \n<br>- Changed the fourth Skill of the Flagship Hades and Flagship Rhadamanthys from “Destroyer Range Boost” to “Destroyer Range and Attack Boost”.\n<br>- Due to our Spaceport having not completely grasped how to manufacture Tech, the Dock and Research Center won’t display Spaceships Rank XI and Rank XII temporarily.\n<br>- Adjusted the unlock requirements to manufacture Teck of Spaceship Rank IX and Spaceship Rank X. Now they need the Research Center to reach Lv.26 and Lv.30 respectively to be able to research. Adjusted the position and unlock requirements of some Military-type Tech."},{"version_id":"839768482","version_name":"1.0.0","version_date":"2020-12-02 09:15:50.000 +0800","version_description":""},{"version_id":"840106061","version_name":"1.0.1","version_date":"2021-01-20 12:56:50.000 +0800","version_description":"\"- Adjusted the number of Blueprints needed to fuse Flagships. Collect 50 Blueprints of the same Flagship to be able to fuse. We will return the balance of 50 Blueprints for every Flagship to Commanders who have already fused the Flagships. Please pay attention to the system mail.<br>- Increased the effect values of the second skill “Fortify Cruiser Suppression” for the Flagships Cyclops and Brontes. Increased the effect values of the second skill “Fortify Warship Suppression” for the Flagships Odysseus and Apollo.<br>- Supplemented some of the missing localized translations. Optimized the display effects of some localized languages UI.<br>\""},{"version_id":"840226548","version_name":"1.0.2","version_date":"2021-01-29 02:40:36.000 +0800","version_description":"- Supplemented some of the missing localized translations. Optimized the display effects of some localized languages UI."},{"version_id":"840280211","version_name":"1.1.0","version_date":"2021-02-01 13:36:26.000 +0800","version_description":"- Added the Defend Galaxy gameplay. With every Commander working hard, the opportunity to launch an Attack on the Empire and liberate the Galaxy is here. But the 4 Guard Cities defending the Imperial City still hinder our advance. In the Guard City Breach, Commanders need to eliminate every Stage and Fortress as well as occupy the Guard Cities to possibly weaken the Empire’s strength. In this Phase, the Top 4 Alliances in the Points Ranking are eligible to liberate the Imperial City. After the Imperial City Liberation is unlocked, Alliances will fight the Imperial City and Guard Cities. Fight for the symbol of the Empire’s mysterious power: Crown of Stars. Only by getting the Crown of Stars and defeating other Commanders to prove your strength can you become the new leader of the Galaxy."},{"version_id":"840316941","version_name":"1.1.1","version_date":"2021-02-03 11:22:30.000 +0800","version_description":"- Added the Defend Galaxy gameplay. With every Commander working hard, the opportunity to launch an Attack on the Empire and liberate the Galaxy is here. But the 4 Guard Cities defending the Imperial City still hinder our advance. In the Guard City Breach, Commanders need to eliminate every Stage and Fortress as well as occupy the Guard Cities to possibly weaken the Empire’s strength."},{"version_id":"840384539","version_name":"1.1.2","version_date":"2021-02-06 16:06:02.000 +0800","version_description":"\"- Fixed the problem of some Stats increased in certain situations not taking effect when upgrading the rank of the Flagship Modify.<br>- Changed the Archean Ghost Ship event to the Alliance reserve system. Alliance Leaders can select a time to unlock the event for their Alliance from the 3 time phases 1 day in advance.<br>- Fixed some problems in the Defend Galaxy event.<br>- Optimized the performance of large scale multi-Commander battles in Defend Galaxy.<br>- Fixed the problem of the confusing display of item icons for some UI on specific iOS devices.<br>\""},{"version_id":"840621414","version_name":"1.1.4","version_date":"2021-02-25 07:21:14.000 +0800","version_description":"\"- Adjusted the mechanics of Flagship Gear. Initially, 4 Gear Slots are available. More Gear Slots will gradually unlock along with modifying the Flagship. But some Flagship types won’t be affected by this mechanic in Nebulas unlocked before the update. Later, new Nebulas or possibly newly introduced Flagships will comply with this rule. <br>- Only Alliances that have reserved the Starfield Stages can launch attacks against the Imperial Fleet in the Stage’s buildings. <br>- Fixed the problem of sometimes being unable to delete or input content in the Alliance Group Chat.<br>- Fixed the problem of the Purity Protocol system notice display error.<br>- Optimized the intro for the Defend Galaxy event. Added the unlock time, event duration, and other info.<br>- Fixed the display problem of the Alliance Language being reset as “All Languages” after editing the Alliance Wall.<br>- Fixed the problem of the HP value display error after Flagships are reset.<br>\""},{"version_id":"840727853","version_name":"1.1.5","version_date":"2021-03-04 14:21:20.000 +0800","version_description":"- Reduced the Tech Center Level needed for the “Multiple Star System Probe” Tech from Lv.19 to Lv.15.<br>- Commanders won’t be able to get the enemy’s Fleet info when they use small Fleets.<br>- Reduced the number of Alliance Territories when the Alliance is at low-levels, but increased the number of Alliance Territories earned when the Alliance is upgraded.<br>- Adjusted the daily rewards for Federation Supplies. Added Flagship Gear Blueprint Chests for Basic Supplies. Added Spaceport Prestige Points for Rich Supplies. After being adjusted, we will give compensation to Commanders who have Federation Supplies currently in effect to make up the differences between the new and old rewards for already collected rewards.<br>- Adjusted the positions of Flagship Gear slots. Fixed at the top are Weapon Slots and the bottom is Shield Slots.<br>- Scout Fleets can’t scout when battles occur at resource mines, Alliance Buildings, Imperial City, and Guard Cities.<br>- Reduced the number of resources for Main Mission Rewards. Slightly increased the number of Alliance Honor.<br>- Optimized the display of some UI and icons.<br>- Optimized the description errors of some text."},{"version_id":"840812307","version_name":"1.1.7","version_date":"2021-03-10 05:43:48.000 +0800","version_description":"-Optimized the fluency of multiple Fleets fighting on the same screen at the same time."},{"version_id":"840846104","version_name":"1.2.0","version_date":"2021-03-12 13:28:32.000 +0800","version_description":"\"- Added the Captain system. Commanders can dispatch Captains to Flagships. Skills and Stats of the Captains will strengthen the Power of the Flagships. Crew Members can be promoted to Captain with the “Captain Commission” item. All Epic and Legend quality Crew Members can add Captain Skills.<br>- Adjusted the Alliance Help rules. Reduces 1% of the total duration for Spaceport Building or Tech Research with every additional Alliance Help Times. Slightly reduces the Alliance Help Times Limit. Adjusted the duration for Spaceport Building and Tech Research.<br>- Adjusted Crew Members Properties. Deleted the Crew Members restraints. Replaced with the Properties of using “Crew Member Upgrade” and “the standard for the number of deployed Crew Members”.<br>- Adjusted the positions of Flagship Gear Slots. Fixed at the top are Weapon Slots and the bottom is Shield Slots.<br>- Deployed Fleets can also join rallies.<br>- Adjusted the Crew Upgrade Limit from Lv.10 to Lv.15.<br>- Fixed the problem of burning not being displayed normally for disconnected Buildings.<br>- Fixed the problem of the Extinguish button display error when other Alliance Members tap the burning Alliance Building.<br>- Increased the number of Ships for Chapter Mission Rewards. Reduced the Resource Rewards for Chapter Missions, Events, and Develop Missions. Reduced the Speed Up item Rewards. <br>- Fixed the problem of unread mail still being present when Commanders clear mail.<br>- Fixed the problem of the background music being played briefly when relaunching the game after Music and SFX have been turned off in Settings.<br>- Adjusted the layout of the Settings.\""},{"version_id":"840872575","version_name":"1.2.1","version_date":"2021-03-12 20:08:07.000 +0800","version_description":"\"- Added the Captain system. Commanders can dispatch Captains to Flagships. Skills and Stats of the Captains will strengthen the Power of the Flagships. Crew Members can be promoted to Captain with the “Captain Commission” item. All Epic and Legend quality Crew Members can add Captain Skills.<br>- Adjusted the Alliance Help rules. Reduces 1% of the total duration for Spaceport Building or Tech Research with every additional Alliance Help Times. Slightly reduces the Alliance Help Times Limit. Adjusted the duration for Spaceport Building and Tech Research.<br>- Adjusted Crew Members Properties. Deleted the Crew Members restraints. Replaced with the Properties of using “Crew Member Upgrade” and “the standard for the number of deployed Crew Members”.<br>- Optimized&nbsp;the&nbsp;clear&nbsp;mail&nbsp;mechanism.&nbsp;Adjusted&nbsp;the&nbsp;limit&nbsp;to&nbsp;100&nbsp;for&nbsp;each&nbsp;type&nbsp;of&nbsp;mail:&nbsp;System,&nbsp;Alliance,&nbsp;Battle,&nbsp;Scout,&nbsp;and&nbsp;Explore.&nbsp;Old&nbsp;mail&nbsp;will&nbsp;automatically&nbsp;be&nbsp;deleted&nbsp;after&nbsp;exceeding&nbsp;the&nbsp;limit.&nbsp;Mail&nbsp;with&nbsp;uncollected&nbsp;rewards&nbsp;won’t&nbsp;be&nbsp;deleted.<br>- Adjusted the positions of Flagship Gear Slots. Fixed at the top are Weapon Slots and the bottom is Shield Slots.<br>- Deployed Fleets can also join rallies.<br>- Adjusted the Crew Upgrade Limit from Lv.10 to Lv.15.<br>- Fixed the problem of burning not being displayed normally for disconnected Buildings.<br>- Fixed the problem of the Extinguish button display error when other Alliance Members tap the burning Alliance Building.<br>- Increased the number of Ships for Chapter Mission Rewards. Reduced the Resource Rewards for Chapter Missions, Events, and Develop Missions. Reduced the Speed Up item Rewards. <br>- Fixed the problem of unread mail still being present when Commanders clear mail.<br>- Fixed the problem of the background music being played briefly when relaunching the game after Music and SFX have been turned off in Settings.<br>- Adjusted the layout of the Settings.\""},{"version_id":"840953476","version_name":"1.2.2","version_date":"2021-03-20 05:27:57.000 +0800","version_description":"- Added the Nebula Teleport Beacon (Newbie) item to shuttle through space. Commanders can use the Nebula Teleport Beacon (Newbie) item to shuttle to another Nebula if they have created their characters for less than 72 hours, Spaceport Lv.7 or lower, and the total resources in the Spaceport, Depot and Mail haven’t exceeded a certain amount.\n<br>- Added the Favorite Mail feature. Favorite Mail won’t expire and automatically be deleted by the system.\n<br>- Optimized the Mail UI. Scout-related Mail will be combined with Battle Mail.\n<br>- Reduced the requirements to unlock Shipbuilding Queues. Adjusted the 5 Shipbuilding Queues to originally unlock at Lv.1, Lv.7, Lv.13, Lv.19, Lv.25 to now unlock at Lv.1, Lv.5, Lv.10, Lv.15, Lv.20."},{"version_id":"841648845","version_name":"2.2.0","version_date":"2021-04-21 06:02:52.000 +0800","version_description":"- Redesigned Starfield Stages:\n<br>1. Starfield Stages from the Outer Rim to enter the Inner Starfield has been expanded from 12 to 24. Alliances will get passage for all Starfield Stages after occupying any Starfield Stage.\n<br>2. Starfield Stages from the Inner Starfield to enter the AGN Starfield have been changed to the AGN Gate. There is a total of 8 AGN Gates. Every AGN Gate can only be occupied by 1 Alliance. Alliances occupying the AGN Gate get passage to this Stargate. Alliances and their Members that don’t occupy AGN Gates can't pass through it. The initial status of the AGN Gate is set to unoccupied by default.\n<br>       (Note: Alliances occupying AGN Strongholds before this update will be canceled. Alliances need to connect the Alliance Territory with the AGN Gate and occupy it to pass between the Inner Starfield and the AGN Starfield normally.)\n<br>- Added the direct teleport feature in the Alliance Territory. If Alliance Fleets have to pass through multiple Alliance Territories on the flying route, the Stargate connecting 2 Alliance Territories will create a direct teleport passage to allow Fleets to pass through temporarily.\n<br>- Optimized the “Events” system. Reduced the number of Investigate Events and improved the corresponding rewards. Adjusted the daily Explore Energy to 30 Energy. Slightly reduced the rewards for Prospect Events.\n<br>- Added “Increases Damaged Ships automatically repaired by a ratio” effect to the “Emergency Repair” Skill of the Flagships Odysseus and Apollo. Reduced the values of the original “Increases Ships Need Repair by a ratio” effect.\n<br>- Adjusted the “Cross Protection” effect to “Increases Ships Need Repair by a ratio and increases Damaged Ships automatically repaired by a ratio” of the Flagships Athena and Nemesis.\n<br>- Added the difficulty selection feature in Secret Signal.\n<br>- Optimized the Bind Account Reward system. Commanders can get rich rewards after they bind accounts.\n<br>- Added new material chests in the Shop.\n<br>- Added the send anonymously feature in Alliance Gifts.\n<br>- Fixed the problem of the high-pitched SFX being too loud when opening UI.\n<br>- Optimized the logic of some UI and guides to make sense now.\n<br>- Fixed small display errors on some UI."},{"version_id":"841966869","version_name":"2.2.1","version_date":"","version_description":""},{"version_id":"842567813","version_name":"2.3.0","version_date":"","version_description":""},{"version_id":"842584709","version_name":"2.3.1","version_date":"","version_description":""},{"version_id":"842791177","version_name":"2.4.0","version_date":"","version_description":""},{"version_id":"842972693","version_name":"2.5.0","version_date":"","version_description":""},{"version_id":"842991388","version_name":"2.5.1","version_date":"","version_description":""}]