[{"version_id":"832993916","version_name":"2.4","version_date":"2019-10-01 21:31:32.000 +0800","version_description":"- Fixed an image leak in Caspian 1<br>- Updated terms"},{"version_id":"833657533","version_name":"2.5.2","version_date":"2019-11-19 13:39:58.000 +0800","version_description":"Update 2.5.2:<br>We love your DMs, keep sending us feedback on IG! We are coming up with some really incredible updates soon.<br><br>For this update, we are adding 6 free Astra frames that are designed to better fit landscape pictures. Enjoy!"},{"version_id":"834116783","version_name":"2.6","version_date":"2019-12-23 22:29:36.000 +0800","version_description":"v2.6: **Major Update**<br>- Text is finally here! Enjoy 7 beautiful fonts right away.<br>- Time-limited Christmas Series is also here in this update, use it while it's here!"},{"version_id":"834832029","version_name":"2.6.1","version_date":"2020-02-25 21:08:35.000 +0800","version_description":"*The Soleil Update*<br>Introducing the Soleil Film Series, 20 handcrafted frames inspired by studio darkrooms &amp; late nights out.<br><br>*Upgrades &amp; Improvements*<br>- 4 new beautiful fonts to design with [Marbella, Dresden, Manhattan &amp; Vancouver]<br>- Optimised our image export quality: 2020 Vision is here thanks to your feedback.<br>- Improved text positioning on certain frames.<br><br>Thank you for all your kind and lovely feedback, please keep the DMs coming @auroraavocado, we love to hear from you.<br><br>Love,<br>Two Fellow Humans from Aurora"},{"version_id":"835621176","version_name":"2.6.2","version_date":"2020-04-24 14:15:47.000 +0800","version_description":"* The Blanc Update *<br>Introducing the Blanc Post Series, 12 handcrafted frames that are designed to be clean and easy to use for permanent posts. <br><br>* Updates to Eden &amp; Caspian *<br>We have added 8 frames, 4 each to Eden &amp; Caspian for all Club Members, enjoy!<br><br>Thank you all for your kind and lovely feedback, please keep the DMs coming @theauroraclub, we love to hear from you.<br><br>Stay safe and healthy, we'll all be back in the sunlight soon!<br><br>Love,<br>Two Fellow Humans From Aurora"},{"version_id":"836269491","version_name":"2.7.1","version_date":"2020-06-04 16:08:07.000 +0800","version_description":"* The Sticker Update *<br>Finally introducing stickers into the world of Aurora, with over 200 handcrafted stickers that you can play with. <br><br>More than 100 stickers are free-to-use for the community! Thanks for all your love and support so far.<br><br>* Updates to Fonts *<br>We have added 8 fonts for all club members, enjoy!<br><br>Thank you all for your kind and lovely feedback, please keep the DMs coming @theauroraclub, we love to hear from you.<br><br>Stay safe and healthy, we'll all be back in the sunlight soon!<br><br>Love,<br>Two Fellow Humans From Aurora<br><br>P.S. We also fixed a bug where the last four series could not be accessed, thanks to the Apple Developer team for helping us out!"},{"version_id":"836528363","version_name":"2.7.4","version_date":"2020-06-23 12:53:43.000 +0800","version_description":"* Bug Fixes*<br><br>Thanks to everyone for your reports on app crashing and missing images.<br><br>We have quickly fixed the bugs and the crashes should not occur anymore.<br><br>Love,<br>Two Fellow Humans from Aurora"},{"version_id":"837347566","version_name":"2.7.6","version_date":"2020-08-16 00:52:54.000 +0800","version_description":"* The All-New Lassen*<br>Lassen was Aurora's very first film series, which we have now totally revamped into a beautiful series of modern, realistic film designs.<br><br>*Sticker Colors*<br>Color your favorite stickers into any color you like with the new sticker color tool. Available on most sticker design packs, simply double tap a sticker to change its color.<br><br>*Eyedropper Tool*<br>Pick colours directly from your pictures and create beautiful designs with consistent color tones. Now available on stickers, text and backgrounds for all club members to enjoy.<br><br>*General Bug Fixes*<br>We've continued to fix little bugs that pop up here and there to make sure everyone can use Aurora smoothly and easily.<br><br>Thanks for all your lovely support, beautiful things are coming to Aurora soon!<br><br>Love,<br>Two Fellow Humans from Aurora"},{"version_id":"838530584","version_name":"2.7.7","version_date":"2020-11-06 12:07:46.000 +0800","version_description":"* Introducing The Messina Series *<br>We took our butts down to the local art store, bought a bunch of thick art paper to tear up and scan.<br>Enjoy 16 unique designs that makes you feel just a little bit more grounded, made with all our love.<br><br>*General Bug Fixes*<br>We've continued to fix little bugs that pop up here and there to make sure everyone can use Aurora smoothly and easily.<br><br>Thanks for all your lovely support, beautiful things are coming to Aurora soon!<br><br>Love,<br>Two Fellow Humans from Aurora"},{"version_id":"841880002","version_name":"3.0.3","version_date":"2021-04-28 10:35:27.000 +0800","version_description":"*Introducing Canvas: Our Biggest Update So Far *<br>We've finally realised our dream of giving you total layout customisation in Aurora. <br>You can now create any layout and design that you can dream of in Canvas mode.<br><br>This new design flexibility comes with a whole world of design assets that give you near unlimited possibilities in what kind of designs you can create.<br><br>We're really excited to see what you can come up with, from simple designs to more complex designs that really show your personality through your stories and memories.<br><br>Some of the new key updates:<br>- Crop Modes<br>- Image Frames<br>- Realistic Overlays (Shadows, Light, Dust &amp; Grain)<br>- Versatile Blend Modes <br>- Customise Overlay Orientation<br>- Easy Layering Tool<br>- All New Background Textures<br>- New Fonts<br>- New Stickers<br>- Share Directly To Social Media<br>- Improved Export Resolution<br><br>*General Bug Fixes*<br>We've continued to fix little bugs that pop up here and there to make sure everyone can use Aurora smoothly and easily.<br><br>Thanks for all your lovely support, more beautiful things are coming to Aurora soon!<br><br>Love,<br>Two Fellow Humans from Aurora"}]