[{"version_id":"831632349","version_name":"1.1","version_date":"2019-06-12 14:34:48.000 +0800","version_description":"- Added VoiceOver support"},{"version_id":"831675973","version_name":"1.2","version_date":"2019-06-15 10:00:37.000 +0800","version_description":"- New interactive circle of fifths! More features coming soon<br>- VoiceOver improvements"},{"version_id":"831687032","version_name":"1.2.1","version_date":"2019-06-17 16:21:54.000 +0800","version_description":"Minor bug fixes:<br>- Enharmonic switcher in circle of fifths didn't always change the selected key: fixed<br>- Chord ID wouldn't work immediately after requesting access to mic: fixed<br>- \"Jump to key\" buttons were cut off in certain layouts: fixed<br><br>If you're enjoying Tonality, please support us by leaving a review! If not, feel free to send an email to tonality.app@gmail.com."},{"version_id":"831714185","version_name":"1.3.3","version_date":"2019-06-19 13:38:38.000 +0800","version_description":"Minor bug fix: the \"Help! Get rid of this pesky theoretical nonsense...\" button works again"},{"version_id":"831725985","version_name":"2.0","version_date":"2019-06-20 00:54:08.000 +0800","version_description":"MIDI and AUv3 support!<br>- You can now open Tonality as a MIDI Audio Unit within a host app like AUM. Route MIDI messages from a keyboard or another app and Tonality will display the names of the chords you send to it"},{"version_id":"831795475","version_name":"2.1","version_date":"2019-06-26 15:38:16.000 +0800","version_description":"Small expansions to the default libraries:<br>- Added minor major ninth chord<br>- Added modes of the jazz minor scale"},{"version_id":"831811570","version_name":"2.2","version_date":"2019-06-27 16:15:23.000 +0800","version_description":"You can now add your own soundfonts as follows:<br>1) Place a file with the extension .sf2 somewhere in the Files app on your device<br>2) Go to Settings -&gt; Change Soundfont and click \"Load custom soundfont...\"<br>3) Navigate to the file you loaded in step 1 and select it"},{"version_id":"831825894","version_name":"2.3","version_date":"2019-06-28 17:59:18.000 +0800","version_description":"More playback customizations:<br>- Change chord playback length<br>- Change scale playback speed"},{"version_id":"832035480","version_name":"3.0","version_date":"2019-07-17 17:21:12.000 +0800","version_description":"New AUv3! With the \"Tonality: Chord Pads\" plugin you can trigger MIDI chords from within a host app like Audiobus or AUM. Includes preset saving, voicing editing (down to the octave and velocity of each note), drag-and-drop reordering, and chord pad grid sizes from 2x2 to 9x9. See https://tonality-music-theory.webnode.com/audio-units/ for a video preview.<br><br>Other changes:<br>- The chord identification audio unit now allows you to lock the current results to avoid them disappearing when MIDI input stops<br>- The chord identification audio unit also now allows you to view information about each chord (like in the main app)<br><br>- Fixed a bug where editing a custom chord or scale would create a new item rather than changing the previously existing one<br>- The Chord ID page now properly displays chords in Solfège mode"},{"version_id":"832050895","version_name":"3.1","version_date":"2019-07-18 18:02:15.000 +0800","version_description":"- Fixed bugs (such as duplicate MIDI notes) caused by quitting and restarting the audio unit during the same host session"},{"version_id":"832166745","version_name":"3.2","version_date":"2019-07-29 14:06:58.000 +0800","version_description":"- New MIDI Audio Unit! Use the Tonality: Grand Staff AUv3 to view MIDI input as it would appear in sheet music (and see chord names in real time).<br>- Major iPad UI improvements (sorry about leaving iPad users behind a bit in the earlier versions)<br>- MIDI thru in chord identification AU<br>- Scrolling support in chord pads for smaller window sizes<br>- MIDI out in preview voicing page<br>- Expanded input keyboard in scales tab<br>- Fixed bug that caused multiple instances of the chord pad AU to communicate with each other when they shouldn’t<br>- Voiceover improvements in Chord ID tab"},{"version_id":"832234431","version_name":"4.0","version_date":"2019-08-18 12:33:42.000 +0800","version_description":"Lots of new features!<br><br>EAR TRAINING:<br>- New ear training tab! Practice recognizing notes, melodies, intervals, chords, and scales by ear. See app description for more details.<br><br>MUSICAL TERMS DICTIONARY:<br>- New dictionary! View common musical terms (and associated illustrations)<br><br>CIRCLE OF FIFTHS:<br>- View scale chords (I,ii,iii, etc.) in the selected key<br>- Better animations<br>- Circle of fifths is more playable (in that tapping the same chord after selection will play it again<br><br>CHORDS AND SCALES:<br>- Swipe up in the table to view the number of results found<br>- Added harmonic major, augmented, and Neapolitan scales<br>- When using the keyboard to search, scale results whose root matches the lowest note selected are given priority<br><br>GENERAL:<br>- Ability to rearrange tabs on smaller screens<br><br>As always, feel free to contact me with any problems or suggestions, and if you're enjoying Tonality please write a review!"},{"version_id":"832648316","version_name":"4.2.1","version_date":"2019-09-05 19:53:41.000 +0800","version_description":"GUITAR CHORD CHART SUPPORT:<br>- View chord charts for all chords (even custom ones)<br>- Fully interactive – swipe across the strings to play each voicing<br>- Supports multiple guitar tunings and other instruments such as ukulele, mandolin, banjo, and bass<br>- Includes generation by traits such as fret range and number of fingers used<br>- Left-handed option<br>- Barre/movable chords coming soon (they're mostly included now, but not distinguished from any others)<br><br>GENERAL:<br>- Searching by notes plays those notes (can be turned off in settings)<br>- You can now play a chord or scale by tapping on its sheet music representation in addition to the piano<br>- All three audio units are now easily distinguished in AUM –&nbsp; they display their names below their icons<br><br>If you encounter any bugs or have any suggestions, please contact me through the contact button on the settings page."},{"version_id":"832669141","version_name":"4.2.2","version_date":"2019-09-06 18:00:22.000 +0800","version_description":"Added baritone ukulele tuning<br><br>NEW IN 4.2.1 – GUITAR CHORD CHART SUPPORT:<br>- View chord charts for all chords (even custom ones)<br>- Fully interactive – swipe across the strings to play each voicing<br>- Supports multiple guitar tunings and other instruments such as ukulele, mandolin, banjo, and bass<br>- Includes generation by traits such as fret range and number of fingers used<br>- Left-handed option<br>- Barre/movable chords coming soon (they're mostly included now, but not distinguished from any others)<br>GENERAL:<br>- Searching by notes plays those notes (can be turned off in settings)<br>- You can now play a chord or scale by tapping on its sheet music representation in addition to the piano<br>- All three audio units are now easily distinguished in AUM –  they display their names below their icons<br><br>If you encounter any bugs or have any suggestions, please contact me through the contact button on the settings page."},{"version_id":"832692565","version_name":"4.3","version_date":"2019-09-07 20:43:03.000 +0800","version_description":"Fretboard reverse search! In addition to using the piano to search for chords, you can now enter notes using a fretboard and find chords that match.<br><br>NEW IN 4.2.1 – GUITAR CHORD CHART SUPPORT:<br>- View chord charts for all chords (even custom ones)<br>- Fully interactive – swipe across the strings to play each voicing<br>- Supports multiple guitar tunings and other instruments such as ukulele, mandolin, banjo, and bass<br>- Includes generation by traits such as fret range and number of fingers used<br>- Left-handed option<br>- Barre/movable chords coming soon (they're mostly included now, but not distinguished from any others)<br>GENERAL:<br>- Searching by notes plays those notes (can be turned off in settings)<br>- You can now play a chord or scale by tapping on its sheet music representation in addition to the piano<br>- All three audio units are now easily distinguished in AUM – they display their names below their icons<br><br>If you encounter any bugs or have any suggestions, please contact me through the contact button on the settings page."},{"version_id":"832698648","version_name":"4.4","version_date":"2019-09-10 10:12:23.000 +0800","version_description":"- 3D Touch quick actions! Use these shortcuts on the app icon to jump directly to certain tabs within the app or to recently viewed chords and scales<br>- Fixed squashed pianos in landscape orientation on iPad<br>- Sus chords are no longer inverted in the chord quizzes (as sus2 and sus4 would be indistinguishable from each other)"},{"version_id":"832778111","version_name":"4.5","version_date":"2019-09-16 16:01:01.000 +0800","version_description":"Added scale chords for heptatonic scales."},{"version_id":"832798851","version_name":"4.5.1","version_date":"2019-09-17 17:15:02.000 +0800","version_description":"iOS 13 support (dark mode included)"},{"version_id":"832943418","version_name":"4.5.2","version_date":"2019-09-27 16:52:04.000 +0800","version_description":"- New scales<br>- Made black keys slightly easier to select"},{"version_id":"833085551","version_name":"4.5.3","version_date":"2019-10-09 11:03:05.000 +0800","version_description":"- Fixed dictionary image displays in dark mode"},{"version_id":"833096918","version_name":"4.5.4","version_date":"2019-10-10 02:08:23.000 +0800","version_description":"- Sustain lock in chord pad AU: swipe right on the sustain button to lock, swipe left to unlock<br>- Added more images for musical terms in the dictionary tab<br><br>More improvements to chord pads coming soon!"},{"version_id":"833113875","version_name":"4.5.5","version_date":"2019-10-10 14:28:58.000 +0800","version_description":"New:<br>- Option to display seventh chords in all \"Scale Chords\" tables (Settings -&gt; Display -&gt; Show Sevenths for Scale Chords)<br>- New preset for chord pads: generate a grid with chords (either triads or sevenths) that come from a given major/minor key<br><br>Fixed:<br>- Accidental display for weirder keys in the grandstaff AU (previously, notes like E in the key of Cb major would display as E natural instead of F flat)"},{"version_id":"833164124","version_name":"4.5.6","version_date":"2019-10-15 08:20:50.000 +0800","version_description":"- Added drop C tuning for guitar charts<br>- Ability to change length of the Chord ID identification window<br>- New color schemes"},{"version_id":"833179659","version_name":"4.5.7","version_date":"2019-10-15 21:49:43.000 +0800","version_description":"New color scheme format! You can now choose for chords to be color-coded by their quality (major, minor, diminished, etc.) instead of their key. Turn on in settings by selecting the \"Color Chords by Quality\" option. You can then choose a scheme below that."},{"version_id":"833186230","version_name":"4.6","version_date":"2019-10-16 14:23:32.000 +0800","version_description":"New audio unit (kind of) for scale Identification!<br>- The audio unit formerly known as \"Chord Identification\" has been replaced with \"Chord &amp; Scale Identification\". You can play a collection of notes on a MIDI device and see which scales contain those pitches.<br>- Yet another round of new color schemes"},{"version_id":"833289884","version_name":"5.0","version_date":"2019-10-23 19:32:19.000 +0800","version_description":"Exciting new features!<br>CHORD PADS:<br>- MIDI trigger and MIDI learn for each individual chord pad<br>- Latch mode for pads<br>- Fixed scrolling in circle of fifths when creating a scale chords preset<br>- Fixed hard-to-use velocity slider in the voicing editor when running iOS 13<br>- Editing a voicing after saving properly displays individual note velocities<br>- Better touch handling (no more tapping an empty pad accidentally and not being able to cancel/not see the \"choose a chord\" screen)<br><br>FOR GUITARISTS:<br>- New voicing information page: click the \"i\" icon next to a chord chart on the chord chart generation page to view the chart in more detail and see it in the staff"},{"version_id":"833373232","version_name":"5.1","version_date":"2019-10-29 15:46:05.000 +0800","version_description":"Chord Pad Updates:<br>- MIDI triggered pads can be set to vary their velocity in accordance with the velocity of the received trigger<br>- It is now possible to create entirely custom pads (no chord association, just a custom label and notes)<br>- Added intervals to the options available on a non-custom chord pad, removed so-called \"theoretical\" chords like B# major<br>- The voicing editor is now a bit more well-behaved"},{"version_id":"833404193","version_name":"5.2","version_date":"2019-10-30 22:44:12.000 +0800","version_description":"Minor fixes/additions:<br>- Choosing the preferred accidental to display in ambiguous cases (like C#/Db in the key of C major) works properly again in the Grandstaff AU<br>- New color scheme<br>- Added Maj7(#5#9) chord to the default library<br>- Added some more images for the dictionary"},{"version_id":"833465266","version_name":"5.3","version_date":"2019-11-05 14:10:09.000 +0800","version_description":"Added new scales (Altered Dorian, Tritone, Two-Semitone Tritone, and Yo)"},{"version_id":"833593590","version_name":"5.3.1","version_date":"2019-11-13 20:20:32.000 +0800","version_description":"This version fixes a crash in the dictionary when attempting to view a term. This was a generic bug affecting many apps, not just Tonality."},{"version_id":"833617963","version_name":"5.4","version_date":"2019-11-15 11:21:39.000 +0800","version_description":"New \"Musical Typing\" keyboard extension! Load this special keyboard and use it anywhere to type chord symbols and special characters.<br>- Go to Settings -&gt; General -&gt; Keyboard -&gt; Keyboards -&gt; Add New Keyboard... -&gt; Tonality<br>- Note: You can drag downwards on a chord quality key (like Maj or min) to access different symbols. The changes will persist across usages of the keyboard.<br>More keyboard features coming soon!"},{"version_id":"833644932","version_name":"5.5","version_date":"2019-11-18 19:08:00.000 +0800","version_description":"Live previewing in the musical typing keyboard:<br>- Tap the piano key to the left of the spacebar to view a (piano) keyboard above the (typing) keyboard. It will display the notes in most chord symbols you type (e.g. things like DbMaj9(#11) or Em7(omit5)) in real time. Useful for learning chord symbols or writing out lead sheets.<br>- If it doesn't display or you want a new chord symbol/format to be supported, please contact me at tonality.app@gmail.com<br>New keys:<br>- The former \"alt\" key is now the \"alt/add/omit\" key"},{"version_id":"833660277","version_name":"5.6","version_date":"2019-11-19 18:07:34.000 +0800","version_description":"MAIN APP:<br>Chord pads are now accessible from the main app, not just inside a compatible AUv3 host! They can be played using whatever soundfont you have currently loaded.<br>CHORD PADS AUv3:<br>The current pad layout can now be resized (Settings button -&gt; \"Resize Current Layout\")<br>MUSICAL TYPING:<br>- The keyboard now parses and displays slash chords<br>- Dragging left and right on the spacebar moves the cursor<br>GRANDSTAFF &amp; CHORD IDENTIFICATION AUv3:<br>- (Potentially) better handling of continuous sustain pedals<br>NOTE:<br>This update may rearrange your tabs (Chords, Scales, Circle of Fifths, Settings, etc.) slightly to make room for the new \"Chord Pad\" tab (if you are on a smaller device and have set a custom ordering), but they can be put back and the preferred ordering will be stored once again."},{"version_id":"833694690","version_name":"6.0","version_date":"2019-11-21 17:09:25.000 +0800","version_description":"CHORD PADS:<br>- New tool button for clearing, copy/pasting, inverting, and transposing chord pads. Double tap the tool button to see all options or swipe up and down to quickly switch between tools. <br>- Randomize velocity option for a more natural sound (along with an intensity setting)<br>GRANDSTAFF:<br>- Stabler and more responsive graphics <br>GENERAL:<br>- Reduced app size"},{"version_id":"833712413","version_name":"6.1","version_date":"2019-11-22 12:45:53.000 +0800","version_description":"CHORD PADS:<br>- Fixed: changing a pad's chord no longer resets its MIDI mapping<br>- Fixed: some settings could be cut off when the AU window was very small"},{"version_id":"833728015","version_name":"6.2","version_date":"2019-11-23 13:52:03.000 +0800","version_description":"More chord pad features!<br>- New \"swap\" tool to swap the positions of any two chord pads<br>- The scale chords preset generator now has an option to include secondary dominants in the layout<br>CIRCLE OF FIFTHS/SCALES TABS:<br>- Scrolling is no longer required to view all the scale chords"},{"version_id":"833732949","version_name":"6.2.1","version_date":"2019-11-23 23:49:50.000 +0800","version_description":"Fixed issue using the scale chords preset creator when in the AUv3 version."},{"version_id":"833738861","version_name":"6.3","version_date":"2019-11-26 23:01:55.000 +0800","version_description":"More chord pad updates!<br>- Quickly add chords through MIDI: hold down any empty pad and send MIDI to the AUv3 instance to immediately assign those MIDI notes to the held pad. Relative velocities are preserved and Tonality will automatically detect the chord as well (this can be turned off in settings)!<br>- Rename tool for pads<br>- Better scrolling in AUv3: hold down on the far right side of the grid, then drag up and down<br>GRANDSTAFF:<br>- Display fixes in AUM (less jerky updates, nicer display)"},{"version_id":"834185773","version_name":"7.0","version_date":"2020-01-01 00:34:53.000 +0800","version_description":"Happy New Year! This update contains a lot of requested features (and some I just thought would be cool). Enjoy!<br>Feel free to contact me if you have any issues or questions. You can also see the new manual (in the settings page of the app or online at tonality-app.com). If you are enjoying Tonality and have time, reviews are always appreciated.<br><br>Chord pads:<br>+ State-saving for both chord pad layouts and preset-specific settings (in compatible hosts like AUM and Audiobus)<br>+ Presets saved to the AU instance (not using state-saving) are shared not only among different hosts but also with the main app (and vice versa)<br>+ Detailed control over what happens when pads which share notes are triggered<br>+ Performance mode (hides empty pads)<br>+ Layout sizes up to 12x12<br>+ New manual quickassign mode<br>+ Live preview of detected chords in quickassign mode<br>+ MonoPad mode for triggering chord sequences<br>+ Inspiration presets (more coming soon!)<br>+ Better custom pad editor<br>+ Recolor tool<br>+ Better latch/sustain pad (with locking)<br>+ Option to display triggered notes in a piano<br>+ Global transpose<br>- Instances are now completely independent<br>- Fixed bugs when using quickassign and MIDI learn mode at the same time<br>- Better prevention of stuck notes<br>Circle of Fifths:<br>+ Focus mode to visualize and hear the diatonic chords in a selected key (tap the magnifying glass)<br>Chord/scale AU:<br>+ Option to display incoming MIDI notes on a piano<br>+ Match exactly (target) option<br>- Instances are now completely independent<br>Grandstaff:<br>+ Better sustain pedal handling<br>+ Larger touch radius for the lock button<br>- Instances are now completely independent<br>Ear training:<br>- Fixed crashes/unexpected behavior when removing custom levels<br>General:<br>+ Added a manual<br>+ The clear button in the chord and scale tabs clears the piano first, then resets any selected options above<br>+ Option to show/hide intervals<br>+ Five string bass<br>+ Ability to control playback velocity in the chord and scale tables<br>+ Ability to change the octave number associated with middle C <br>+ Ability to view version history<br>+ Settings (color scheme, theoretical keys, middle C octave, etc.) are now shared between the main app and various extensions<br>- Better display of fret numbers in guitar chord charts"},{"version_id":"834215836","version_name":"7.0.1","version_date":"2020-03-03 16:13:52.000 +0800","version_description":"Custom chords and scales are now shared between the main app and audio unit extensions. Otherwise just bug fixes, but more features are coming soon! <br><br>General:<br>- Fixed handling of double accidentals for some rare “theoretical” key signatures and chords <br>Chord Pads:<br>- Fixed a bug in which using the octave tool in the voicing editor would behave unexpectedly, allowing notes to be “pushed off” the lower end of the acceptable MIDI range<br>Chord/scale AU:<br>- Fixed occasional crashes after long sessions or intensive MIDI input<br>Ear Training:<br>- Temporary fix for ambiguous voicings<br>- Fixed minor/major seventh intervals showing up as choices in quizzes involving seventh chords<br>- Better sorting of interval answer choices"},{"version_id":"837301517","version_name":"8.0","version_date":"2020-10-13 14:32:10.000 +0800","version_description":"One of the biggest updates yet! As always, if you have any questions, issues, or suggestions feel free to contact me at tonality.app@gmail.com. <br><br>General:<br>+ Split layout for iPad<br>+ Option to view piano, guitar charts, or piano &amp; guitar on the chord search page<br>+ Move chord charts to chord info page (one less click to get there)<br>+ Improved chord/scale recognition algorithms<br>+ Improved interaction with chord and scale results (piano views now act like chord pads in the results table and highlight the currently playing note)<br>+ MIDI input and output from the standalone app (in addition to previous support for AUv3)<br>+ Updated UI, better dark mode<br>+ Update for iOS 14<br><br>Guitar:<br>+ Guitar support for scales<br>+ Extremely fast guitar voicing generation, improved default results<br>+ Barre chord support<br>+ New fret range selector<br>+ View note names or intervals on chord charts if desired<br>+ Choose to view movable voicings only<br>+ Export chord charts as .png files<br>+ Chord chart palette – save your favorite voicings for easy access<br>+ Improved fretboard reverse search<br>+ Drag and drop support for chords and chord charts – even between main app and AUv3 extensions and vice versa! For example, you can drag chords from the ID audio unit directly onto a chord pad in the Chord Pads audio unit.<br><br>Chord Pads:<br>+ Strum bar: easily play or strum individual notes from a chord pad<br>+ Quickly alter/extend existing pads in edit mode (swipe down to alter, right to extend)<br>+ Ability to import/export pad sets<br>+ Quickly choose chords from suggestions, catalog, or fretboard<br>+ Ability to set the key for a pad set<br>+ Multiple velocity modes and curves<br>+ CC mapping in audio unit - assign a continuous controller to the X and Y axes of each pad<br>+ Patchstorage integration (download patches directly from the presets menu!)<br>+ Randomize note on/attack for a more natural sound<br>+ Drag and drop guitar voicings onto pads directly from palette<br>+ Use ^ in custom labels to add superscripts<br>+ Updated GUI<br>+ Easier scrolling in edit mode<br>- Fix bug where locked sustain would be deactivated when app is restarted from background<br>- Stability improvements, especially in AU<br><br>Chord/scale AU:<br>+ Ability to record detected chords and export as .txt/.mid<br>+ Guitar charts, scale info, and more from standalone accessible in AU<br>+ Improved lock mode<br>+ Fullscreen mode<br>- Stability improvements<br><br>Grandstaff:<br>+ Much faster response time<br>+ Improved lock mode<br>- Fix occasional display glitches on iPad<br><br>Circle of Fifths:<br>+ Better layout<br>- Fix lags"},{"version_id":"838197943","version_name":"8.0.1","version_date":"2020-10-15 12:20:34.000 +0800","version_description":"+ Move midi learn mode toggle to the main chord pad page<br>- Fix bugs when reordering pads with assigned triggers<br>- Fix compatibility with older iOS versions (such as iOS 12)<br><br>(8.0) One of the biggest updates yet! As always, if you have any questions, issues, or suggestions feel free to contact me at tonality.app@gmail.com. <br><br>General:<br>+ Split layout for iPad<br>+ Option to view piano, guitar charts, or piano &amp; guitar on the chord search page<br>+ Move chord charts to chord info page (one less click to get there)<br>+ Improved chord/scale recognition algorithms<br>+ Improved interaction with chord and scale results (piano views now act like chord pads in the results table and highlight the currently playing note)<br>+ MIDI input and output from the standalone app (in addition to previous support for AUv3)<br>+ Updated UI, better dark mode<br>+ Update for iOS 14<br><br>Guitar:<br>+ Guitar support for scales<br>+ Extremely fast guitar voicing generation, improved default results<br>+ Barre chord support<br>+ New fret range selector<br>+ View note names or intervals on chord charts if desired<br>+ Choose to view movable voicings only<br>+ Export chord charts as .png files<br>+ Chord chart palette – save your favorite voicings for easy access<br>+ Improved fretboard reverse search<br>+ Drag and drop support for chords and chord charts – even between main app and AUv3 extensions and vice versa! For example, you can drag chords from the ID audio unit directly onto a chord pad in the Chord Pads audio unit.<br><br>Chord Pads:<br>+ Strum bar: easily play or strum individual notes from a chord pad<br>+ Quickly alter/extend existing pads in edit mode (swipe down to alter, right to extend)<br>+ Ability to import/export pad sets<br>+ Quickly choose chords from suggestions, catalog, or fretboard<br>+ Ability to set the key for a pad set<br>+ Multiple velocity modes and curves<br>+ CC mapping in audio unit - assign a continuous controller to the X and Y axes of each pad<br>+ Patchstorage integration (download patches directly from the presets menu!)<br>+ Randomize note on/attack for a more natural sound<br>+ Drag and drop guitar voicings onto pads directly from palette<br>+ Use ^ in custom labels to add superscripts<br>+ Updated GUI<br>+ Easier scrolling in edit mode<br>- Fix bug where locked sustain would be deactivated when app is restarted from background<br>- Stability improvements, especially in AU<br><br>Chord/scale AU:<br>+ Ability to record detected chords and export as .txt/.mid<br>+ Guitar charts, scale info, and more from standalone accessible in AU<br>+ Improved lock mode<br>+ Fullscreen mode<br>- Stability improvements<br><br>Grandstaff:<br>+ Much faster response time<br>+ Improved lock mode<br>- Fix occasional display glitches on iPad<br><br>Circle of Fifths:<br>+ Better layout<br>- Fix lags"},{"version_id":"838368966","version_name":"8.1","version_date":"2020-10-26 00:44:15.000 +0800","version_description":"Guitar:<br>+ Add Celctic tuning (DADGAD)<br>Grandstaff:<br>+ Add the same record/export midi functionality as in the identification AU<br>Scales:<br>+ Scales in which the descending version differs now highlight the differing note(s)<br>Chord/scale AU:<br>+ Change exported file type from .midi to .mid<br>Chord pads:<br>- Fix bug with performance mode in the AU version<br>Dictionary:<br>+ Add new definitions to default library<br>- Fix temporary “ghost” terms when deleting a custom term while searching<br>General:<br>- Fix audio dropping out when running other audio apps simultaneously or entering background<br><br>As always feel free to contact me with any questions or suggestions! The contact button within the app (on the settings page) has been updated to include important information (iOS version, build number, etc) in the email so you don't have to."},{"version_id":"838621131","version_name":"8.2","version_date":"2020-11-13 20:33:42.000 +0800","version_description":"Chord Pads:<br>+ Add footpedal support with automation parameters for next pad, previous pad, etc.<br>+ Automation parameter for global velocity slider<br>+ Scrollable menu buttons in horizontally compact environments<br>- Fix rare bug when editing custom chords<br><br>Grandstaff:<br>+ Add ability to detect inversions of input chords<br><br>Guitar:<br>+ Add new standard tuning (CGDAEG)<br>+ Reduce the amount of loading indicators displayed when scrolling through guitar charts in the main table<br><br>Chord/scale AU:<br>+ Add ability to display results as piano, guitar, or both (like in standalone)<br>+ Scrollable menu buttons in horizontally compact environments<br>- Fix export view dismissal in iOS 12 and below<br><br>General:<br>+ New fifths-based color scheme (try it out on the circle of fifths!). This replaces the old default scheme, but it can be reverted in settings.<br>+ More flexible superscripting in custom chord names – multiple sections can be superscripted. Use ^{text} rather than ^text.<br>+ More lenient parsing when typing in scale degrees<br>+ Add 7(#9b13) to default library<br>+ Reduce battery usage<br>+ Add tip section in settings"},{"version_id":"839203557","version_name":"8.2.1","version_date":"2020-11-15 15:36:36.000 +0800","version_description":"Minor bug fixes and improvements (thank you to all beta testers!)<br>Grandstaff:<br>+ Improve chord recognition<br>Ear Training:<br>- Fix potential crash when arpeggiating prompts on some devices<br><br>––––––––– Previously in Version 8.2 (Nov 12, 2020) –––––––––<br>Chord Pads:<br>+ Add footpedal support with automation parameters for next pad, previous pad, etc.<br>+ Automation parameter for global velocity slider<br>+ Scrollable menu buttons in horizontally compact environments<br>- Fix rare bug when editing custom chords<br><br>Grandstaff:<br>+ Add ability to detect inversions of input chords<br><br>Guitar:<br>+ Add new standard tuning (CGDAEG)<br>+ Reduce the amount of loading indicators displayed when scrolling through guitar charts in the main table<br><br>Chord/scale AU:<br>+ Add ability to display results as piano, guitar, or both (like in standalone)<br>+ Scrollable menu buttons in horizontally compact environments<br>- Fix export view dismissal in iOS 12 and below<br><br>General:<br>+ New fifths-based color scheme (try it out on the circle of fifths!). This replaces the old default scheme, but it can be reverted in settings.<br>+ More flexible superscripting in custom chord names – multiple sections can be superscripted. Use ^{text} rather than ^text.<br>+ More lenient parsing when typing in scale degrees<br>+ Add 7(#9b13) to default library<br>+ Reduce battery usage<br>+ Add tip section in settings"},{"version_id":"839409324","version_name":"8.2.2","version_date":"2020-11-30 18:41:39.000 +0800","version_description":"Just a minor update with usability improvements. If you're enjoying Tonality, please consider writing a review or leaving a tip on the settings page!<br><br>General:<br>+ Categorize all audio units under “Tonality” for easier searching inside a host<br>+ Add new chords to default library<br>+ Improve ordering of related scales section<br>- Fix a bug in which the selected clef was not preserved when switching between chords in split view<br><br>Ear Training:<br>+ Make the UI more pleasant on iPad in landscape mode<br>- Fix display of melodies in dark mode <br>- Fix average score when less than the requested number of historical sessions have been completed"},{"version_id":"839652897","version_name":"8.3","version_date":"2020-12-15 18:07:37.000 +0800","version_description":"General:<br>+ Ability to change default chord symbols and other notation<br>+ Add GitHub issues link to settings (for tracking feature requests)<br><br>Chord Pads:<br>+ Persist locked/unlocked state of the latch bar"},{"version_id":"839787209","version_name":"8.4","version_date":"2020-12-24 00:49:13.000 +0800","version_description":"Happy holidays! This update adds a few popular requests:<br>- Individual strumming on chord pads. Hold down on the strum toggle button and press a pad to change it to strum mode (or turn it back to normal)<br>- Option to transpose when changing the key of a chord pad set<br>- Voiceover support for guitar chord charts"},{"version_id":"839859087","version_name":"8.5","version_date":"2021-01-02 18:27:48.000 +0800","version_description":"Happy new year! This is a big update to functionality involving scales and chord pads, with some other features thrown in. See below for details.<br><br>\"New look, same great taste!\" – this update also features a refreshed app icon.<br><br>General:<br>+ New icon<br>+ Add setting to prevent screen auto-lock<br><br>Scales:<br>+ Add new scales to the default library<br>+ Alternate scale names<br>+ Ability to show all modes of a given scale<br>+ Tap the ‘modes’ segment again to show all the modes rooted on the same note (parallel modes)<br>+ Filter scales by various tags<br>+ Improve scale layout when viewing piano only<br><br>Chord Pads:<br>+ Drastically improved edit mode: view all tools at once<br>+ Allow editing of pads while they are in strum mode<br>+ Visual indication of individual strum option (“jiggle mode”)<br>+ Preserve custom labels, triggers, color, and strum settings when using a new mode (e.g. fretboard) to edit an existing pad<br>+ Improve preview playback when transposing, inverting, or adding bass notes to a pad<br>+ Save last opened preset in standalone<br>+ Smoother drag to reorder which works even on strummed pads<br>- Remove delay when transposing or inverting pads multiple times in succession<br>- Allow independent fingers/voices to cross each other when the strum bar is in mono mode<br>- Fix a bug which scrambled the layout when reordering pads<br><br>Chords:<br>+ Improve related scales section<br><br>Guitar:<br>+ Show note names when using the fretboard for reverse searching<br>+ Improve ordering of results when reverse searching<br>+ Use notation preferences in chord palette"},{"version_id":"840045743","version_name":"8.6","version_date":"2021-01-15 15:30:38.000 +0800","version_description":"General:<br>+ German note naming<br><br>Guitar:<br>+ Option to show rootless voicings<br>+ Add new tunings/instruments: Charango, Timple Canario, Tres Cubano<br>- Fix sheet music display for ukulele in some instances<br><br>Chord Pads:<br>+ Voice leading tool<br>+ Save previously used tool when in collapsed edit view<br>+ Preserve MIDI trigger when copying onto an occupied pad<br>- Fix pad labelling when creating a non-custom chord from scratch"},{"version_id":"840162977","version_name":"8.6.1","version_date":"2021-01-22 23:34:20.000 +0800","version_description":"Chord Pads:<br>+ Ability to change the output MIDI channel<br><br>Guitar:<br>+ Added all fourths tuning<br>- Shorten display names for new instruments so they fit better on very small screens"},{"version_id":"842234162","version_name":"8.6.2","version_date":"2021-05-16 16:49:31.000 +0800","version_description":"Miscellaneous fixes and features:<br><br>General:<br>+ New color scheme<br><br>Chord/Scale AU:<br>+ Cumulative mode when identifying scales: replaces the old lock mode<br>+ Exposed automation parameter (toggle) for the lock button<br><br>Guitar:<br>+ Option to always show fret numbers<br>+ Better touch interaction<br>+ Faster chart generation when using extra-permissive search criteria<br>- Fix display of double neck marker on tres cubano<br>- Fix bug in which “hide equivalent voicings” could hide some desired voicings in rare circumstances<br><br>Chord Pads:<br>+ Pad labels can now show inversions (must be turned on in chord pad settings)<br>- Fix bug in which chord pads would become unresponsive on some devices"}]