[{"version_id":"831737915","version_name":"1.0","version_date":"2020-04-01 04:35:53.000 +0800","version_description":""},{"version_id":"835380379","version_name":"1.01","version_date":"2020-04-02 19:33:26.000 +0800","version_description":"- Fixed: overlapping labels in folder selection popovers<br>- Fixed: context menu was not visible in minimized AU window<br>- Fixed: rare crash while playing on locked piano-keyboard<br>- Added: MIDI chance module"},{"version_id":"835509457","version_name":"1.03","version_date":"2020-04-12 14:11:16.000 +0800","version_description":"- Fixed a rare application crash when removing steps."},{"version_id":"835621180","version_name":"1.04","version_date":"2020-05-01 06:33:26.000 +0800","version_description":"- Added MIDI Arpeggiator module.<br>- Added MIDI note generator module.<br>- Added Noise gate module.<br>- Preset and project files may be directly imported to Drambo (e.g. from Files app).<br>- CV sequencer and CV quantizer modules have additional gate inputs.<br>- Fixed: clicking envelopes with varying velocities.<br>- Bug fixes and stability improvements."},{"version_id":"836175180","version_name":"1.10","version_date":"2020-05-31 06:38:18.000 +0800","version_description":"- Added MIDI learn feature<br>- Added MIDI rack module<br>- Added project templates<br>- Section modules are foldable now<br>- Slew limiter knobs are modulatable now<br>- CV sequencer modules: added extended view editor<br>- Bug fixes and stability improvements"},{"version_id":"836257327","version_name":"1.11","version_date":"2020-06-10 18:05:54.000 +0800","version_description":"- Added Graphic modulator module<br>- Added Bernoulli gate module<br>- Oscillator modules have three different options for waveform anti-aliasing: Standard , Smooth and Off. (available in module menu)<br>- Supersaw module: width is modulatable now<br>- MIDI learn: added range editor and Try button for live monitoring<br>- Graphic modulator and Graphic shaper editor have configurable grid and snapping.<br>- Fixed: pattern MIDI mapping was not saved with projects.<br>- Fixed modulation in MIDI retrigger module.<br>- EDIT mode: tap on active pad to select all steps in a track (when Trig button is disabled)"},{"version_id":"836806821","version_name":"1.20","version_date":"2020-07-14 05:48:07.000 +0800","version_description":"- Multi output AudioUnit instrument (8 outputs)<br>- Routing buses removed. Tracks are routed directly to other tracks or audio outputs. Existing projects will be automatically converted.<br>- WebDAV access (available in Main menu in standalone mode) - allows you to access entire Drambo filesystem in Finder app on your Mac or Windows explorer on PC.<br>- Added Feedback send and Feedback receive modules to MISC/UTILS section. This pair allows delayed signal to be send in the opposite direction (right to left).<br>- Added Slider module to MISC/UI section.<br>- New presets"},{"version_id":"836906517","version_name":"1.21","version_date":"2020-07-19 09:03:13.000 +0800","version_description":"- Fixed: Song export resulted in a corrupted wav file.<br>- Exported wav's are 32bit now.<br>- WebDAV remains active, when Drambo goes to the background.<br>- Minor bugfixes."},{"version_id":"836980026","version_name":"1.22","version_date":"2020-07-25 16:20:44.000 +0800","version_description":"- Added: Plate reverb module<br>- Fixed: Muting and soloing tracks caused clicks<br>- CV sequencers: added snapping to grid<br>- MIDI mapped pads receive velocity now<br>- Delay module: delay time can be synchronized to beat<br>- Minor bug fixes and UI improvements"},{"version_id":"837138317","version_name":"1.23","version_date":"2020-08-05 06:11:02.000 +0800","version_description":"- Sampler module: \"instant sample to key\" feature added. <br>- Sampler and Flexi Sampler modules can sample from all available inputs (e.g. preceding tracks)<br>- Fixed: MIDI mute, track audio source<br>- Presets can be previewed, when you add a new module<br>- Minor bug fixes and stability improvements"},{"version_id":"837579951","version_name":"1.24","version_date":"2020-09-05 09:05:16.000 +0800","version_description":"- Sequencer poly editing in EDIT mode. Toggle keys to add or remove notes from selected step. <br>- Mixer module: all knobs are modulatable now.<br>- Unisono module added.<br>- CV glide module extended with Curve and Retrig parameters. <br>- Filter module: nonlinear resonance in 24db LPF, added diode ladder filter model. <br>- You can add modulators to knobs, when rack is in compact mode.<br>- Sequencer editor buttons are midi-mappable now.<br>- Hold CLR or CLR-P buttons during recording to clear notes or p-locks as they play.<br>- New presets.<br>- Minor bug fixes."},{"version_id":"837791757","version_name":"1.25","version_date":"2020-09-17 07:15:14.000 +0800","version_description":"- Added 1-N and N-1 Switch modules with optional crossfade between multiple inputs and outputs.<br>- Added Linear frequency modulation module<br>- Added Pitch ratio scaler module<br>- Added Swtich button module<br>- Added MIDI Bluetooth connection panel<br>- Fixed: unintended project overwriting, when saving a new template project<br>- Cycle conditional components are processed on muted tracks. <br>- Minor bug fixes"},{"version_id":"837993797","version_name":"1.26","version_date":"2020-10-01 06:38:28.000 +0800","version_description":"- Support for Ableton Link (standalone mode)<br>- MIDI processor AudioUnit type added<br>- MIDI strum module added<br>- MIDI latch module added<br>- Decimator module: 3 modes: rough, boxed and analog<br>- Env AD mod and Amp env ad mod: added loop mode<br>- Minor bug fixes"},{"version_id":"838351554","version_name":"1.27","version_date":"2020-11-08 02:08:57.000 +0800","version_description":"- Waves extension (IAP): an ultra clean wavetable oscillator, featuring: stereo unisono, modular wavetable manipulation, support for Serum wavetable format, 2 additional modules for wavetables processing: Wave effect and Wave filter. Includes 42 wavetables and \"Waves kite\" - a new Instrument rack bank. <br>- New shortcuts: UNDO+ pad - to clear track, UNDO+scene - to clear scene, UNDO + pattern - clear pattern.<br>- Chorus module mix param is modulatable now.<br>- Added: Gate counter modulator module.<br>- Added: Layers module with separate outputs.<br>- Graphic shaper: sustain and tempo sync added.<br>- You may change presets with arrow buttons, when rack view is in compact mode.<br>- Flexi sampler: added Transport and Pattern launch modes. Playback is not stopped during overdubbing.<br>- LFO: added progressive sync mode.<br>- Bug fixes and stability improvements."},{"version_id":"839535493","version_name":"1.30","version_date":"2020-12-11 14:19:09.000 +0800","version_description":"- Added Audio Units hosting (standalone app only).  Support for all AUv3 unit types and multi-output.  <br>- Added support for sustain pedal<br>- Added CPU meter<br>- Hold step + play to start playback from selected beat<br>- Added support for BT keyboard - play notes or use for MIDI mapping<br>- Flexi sampler module:  overlapping notes are declicked now, samples playback in Trigger mode ends at Loop end point."},{"version_id":"839875927","version_name":"1.31","version_date":"2021-01-03 15:35:27.000 +0800","version_description":"Added:<br>- MIDI mixer module with mute buttons.<br>- MIDI channel filter module<br>- MIDI pitchbend generator / modifier module<br>- Support for MIDI program change messages<br>- XY pad module: unipolar and spring back paramteters<br>- AD and ADSR envelope modules: added x10 switch (makes all time settings 10x longer)<br>- Pattern menu: added :2 x2 switches to double / half pattern length instantly<br>- Knob menu: remove p-locks in clip action<br>- Gesture: hold UNDO + tap on knob to remove p-locks<br>- Gesture: hold UNDO + tap on Play button to panic<br><br>Fixed:<br>- Audio Units sort in AU library view is case insensitive<br>- MIDI learn window didn't show \"keyboard\" type<br>- MIDI AudioUnit module mute didn't work. The module was receiving MIDI even when MIDI input was disconnected<br>- Flexi recording after removing sample caused a crash (rare)<br>- Folding rack in compact view caused unresponsive view<br>- Tapping on 2 module headers the same time caused crash (rare)<br>- Audio Unit modules, received events on channel 1 regardless of channel set in event<br>- AU modules main output is named after module now<br>- Minor bugfixes and stability improvements"},{"version_id":"840283512","version_name":"1.32","version_date":"2021-02-13 16:37:40.000 +0800","version_description":"• Modules browser window <br>   - Is non-modal now. You may pin it and keep adding and connecting modules while the window is open<br>   - Browsing by tags <br>   - You can select Audio Units and samples when adding modules (AU modules, Flexi sampler, Shot sampler - available as a presets category)<br><br>• New modules<br>   - Euclidean sequencer module (MIDI) - generate euclidean sequences and chain them<br>   - Flanger effect - with special interpolation algorithm, that preserves clarity in entire audible range<br>   - Crossover layers module - process 3 bands separately in layers<br>   - Knobs module - build a matrix of modulation knobs<br>   - Multi CC modulator module - build a matrix of knobs to generate multiple CC events<br><br>• MIDI<br>   - Support for multiple MIDI input/output ports<br>   - MIDI clock input and output synchronization<br>   <br>• Modifications<br>   - Full-screen sequence view (on iPads) <br>   - New metronome settings: Off, Always, Recording<br>   - Layer modules: you may connect modules between layers<br>   - Pattern length may be set down to 1 beat<br>   - Phaser module: feedback parameter is bidirectional now<br>   - Flexi sampler: fade in and out times extended to 15s <br>   - Sampler: folder loading improved with better key / velocity recognition<br>   - Recorded samples are auto-named according to key or date/time<br><br>• Fixes<br>   - Adding modulators on Macs M1<br>   - Problems with muted tracks<br>   - Sampler: wrong loop marker positions after recording to key<br>   - Problems with sending MIDI notes to Audio Units while using piano keyboards on pads<br>   - Different layout bugs in modules<br>   - Minor bugs and stability improvements"},{"version_id":"840482181","version_name":"1.33","version_date":"2021-03-10 12:31:20.000 +0800","version_description":"Fixed:<br>- Drambo Audio Unit:  projects saved with previous versions had MIDI source set to \"Unknown\" on each track. <br>- Standalone:  Audio Unit modules received MIDI events always on channel 1, regardless of event channel.<br>- Song exported to WAV was distorted when imported to Ableton Live<br>- Problems with keyboard on Mac M1<br>- Flexi sampler, issues with markers after trimming a sample, clicks when using Pattern launch mode<br>- Shot sampler: first slice was ignored<br>- Slow AU library initialisation for large number of Audio Units<br>- Master amp level was not turning red, when signal was clipped<br>- Minor UI fixes<br>- XY pad module has gate output now<br>- AU processor module supports multi-io processing now<br><br>Added:<br>- Buffer rescan module (Processor / effect) <br>- Buffer repeat module (Processor / effect)<br>- Buffer stop module (Processor / effect)"},{"version_id":"841186204","version_name":"1.40","version_date":"2021-04-07 14:51:04.000 +0800","version_description":"Added:<br>- Support for multi-channel audio interfaces<br>- Analog Filter module with 6 types of nonlinear filters (4x oversampled, high quality processing)<br>- External CV instrument module to control external modular synthesizers via DC-coupled audio interfaces  <br>- Audio out module<br>- Tap tempo<br>- MIDI to CV module: added voice allocation type setting<br><br>Bug fixes and stability improvements"}]