[{"version_id":"831896470","version_name":"0.5.22","version_date":"2020-03-28 09:00:37.000 +0800","version_description":""},{"version_id":"835419024","version_name":"0.6.27","version_date":"2020-04-08 14:52:46.000 +0800","version_description":""},{"version_id":"835521450","version_name":"0.6.50","version_date":"2020-04-15 10:35:39.000 +0800","version_description":""},{"version_id":"835628077","version_name":"0.6.62","version_date":"2020-04-23 06:44:32.000 +0800","version_description":""},{"version_id":"835717828","version_name":"0.6.71","version_date":"2020-04-29 15:11:47.000 +0800","version_description":""},{"version_id":"835831125","version_name":"0.6.81","version_date":"2020-05-08 07:27:57.000 +0800","version_description":""},{"version_id":"835884990","version_name":"0.6.91","version_date":"2020-05-14 11:21:26.000 +0800","version_description":""},{"version_id":"835982381","version_name":"0.6.110","version_date":"2020-05-22 03:35:25.000 +0800","version_description":""},{"version_id":"836132149","version_name":"0.6.122","version_date":"2020-05-28 11:11:24.000 +0800","version_description":""},{"version_id":"836174307","version_name":"0.7.12","version_date":"2020-06-01 10:06:06.000 +0800","version_description":"New Content <br>1. Added new equipment to the Investment Center.  <br>2. Added new sound and special effects. <br>Optimizations: <br>1. Interface optimization and update, description modifications.  <br>2. Street Bruisers: Optimized the Search function: After defeating a Street Bruiser of the current level, the search target is automatically moved to the next level.  <br>3. Workshop: Added categories for Equipment Material exchange coupons in Get Equipment Materials interface."},{"version_id":"836221344","version_name":"0.7.23","version_date":"2020-06-10 18:21:51.000 +0800","version_description":"[Optimization and Adjustments]  <br>1. Optimized and updated some interfaces and descriptions  <br><br>2. Enforcers:  <br>(1) Added a red dot reminder on the quick-wear button when your Enforcer has more than one gear to equip  <br>(2) Adjusted the effect of the button for Enhancement Reminders  <br><br>3. City News:  <br>(1) Added News for Lv.60 Underbosses   <br>(2) Added random rewards for news reactions (shares, likes, etc.)   <br><br>4. Jewels:  <br>(1) Added filters of Attributes at the bottom of the Jewel interface in the Workshop  <br>(2) Now you can Remove Plain, Simple and Rare Jewels without using the Jewel Extractor   <br><br>5. Faction:  <br>(1) Added description in the Faction Invitation interface when no one can be invited  <br>(2) Optimized the effect of the red dot reminder for Faction Investments  <br><br>6. Chat: City IDs will be displayed before Bosses’ names in Chat   <br><br>7. Defense: Detailed information of the associates will be displayed when you tap their icons in the Wall   <br><br>8. Underboss: Optimized the effect of the Attribute display in the Equipment-change interface; added animation for changing Equipment   <br><br>9. Bookmark: Adjusted the display of Bookmark classification  <br><br>[Fixed Contents]  <br>1. Fixed the problem with indicator lines direction while using Turbos  <br>2. Fixed the problem of target sign appearing in other Cities when Raid is initiated against a Traitor’s safehouse in the Map  <br>3. Fixed the problem regarding exiting the chat room under special circumstances, the red dot of unread messages still displayed in the upper left corner  <br>4. Fixed the abnormal display of some special characters in the game  <br>5. Fixed incorrect display of Enforcer nicknames in some item descriptions"},{"version_id":"836361081","version_name":"0.7.35","version_date":"2020-06-18 08:01:14.000 +0800","version_description":"Optimization and Adjustments <br>1. Optimized and updated some interfaces and descriptions  <br>2. Faction:  <br>1) Added Faction Vote: Don and R4 members can initiate Faction votes.  <br>2) Optimized the process of the Don position transferring: after the Don position is transferred, a message will be sent to the Faction Chat automatically.  <br>3) Optimized Red Dot Reminder in Faction  <br>3. Optimized the order of the rewards for Personal/Hell Events  <br>4. Training Center: added the display of cost reduce investment  <br>5. Inventory: when you buy/redeem items in bulk, you can see the total amount of the items bought/redeemed  <br>6. Tasks: added new tasks related to Commercial Street and some Investment  <br>7. Enforcers: the Skills will be shown when the Enforcer is shared to the Chat  <br>8. Boss who initiated a raid and successfully occupied the City Hall can view their Enforcers in battle now  <br>9. Crew Skin: optimized the default Crew Skin and Mad Dog Crew Skin  <br><br>Fixed Contents <br>1. Fixed the problem of sending the Underboss to the Crew when player reconnect after hiding them in the Safehouse. <br>2. Fixed the display problem of the activated ATK debuff of the enemy when defending in the City Hall. <br>3. Fixed the display problem of some players' names in the Rankings. <br>4. Canceled the daily usage limit of the Stamina Drink (Small)."},{"version_id":"836495534","version_name":"0.7.61","version_date":"2020-06-27 05:29:30.000 +0800","version_description":"Optimization and Adjustments<br>1. Daily Tasks:<br>3)\tAdded new tasks related to Street Bruisers and Campaign<br>4)\tIn description for task ‘Defeat Kingpins’, added notification that one multiple Takedown DMG attempt will only be counted as one attack.<br>2. Buildings:<br>4)\tHospital: added instruction about healing speed affected by training speed.<br>5)\tMansion: added statistics of total days of speedup items in Mansion’s detail interface.<br>6)\tResource Buildings: optimized resource collect area for tapping. Now you can collect resources by tapping on the buildings as well.<br>3. Faction Investments: now you can close Investment list more easily.<br>4. Chat: while using “@” in chat, faction member with permission is now able to see whether other faction members are online or not.<br>5. Underboss Specialty: when applying a Specialty set, if it’s the same as the current specialty, a notification will pop up. <br>6. Kingpin: added a notification saying Energy will not be returned when using a recall on the crew. <br>7. Event: added ‘Share’ button on the Hell Event interface to share it to City and Faction Channel.<br>8. Street Bruiser: when available attacks are full, a go to button will show up in the Idle on the top left of Turf Interface.<br>9. VIP: free VIP Points rewards are now merged into daily free rewards<br>10. City Hall: optimized City Hall battle related mails and notifications<br><br>[Fixed Contents]<br>1.\tFixed issue related to The Road of Enforcers event interface when description won’t show up after tapping on Crew ATK 50% Boost item<br>2.\tFixed user interface error related to city map and chat channel<br>3.\tFixed issue related to Underboss Enhancement interface<br>4.\tFixed issues related to Jewels number not shown correctly when viewing Jewels Redemption coupon shop"},{"version_id":"836638951","version_name":"0.7.71","version_date":"2020-07-03 08:15:10.000 +0800","version_description":"[Optimizations and Adjustments]<br>1. Faction:<br>(1) Faction Investments: New quick donation function, you can choose different schemes to auto- donate.<br>(2) Faction Vote: You can share the initiated voting records to the Faction Chat.<br><br>2. Correspondence: An Influence Analysis function has been added to the Battle Report for fighting Street Bruisers to help you easily select appropriate Associates. <br><br>3. Construction:<br>(1) Vault: The building details interface will display the total amount of each Resource currently stored and the amount that can be robbed.<br>(2) Added a jump button to obtain the source of some special Items, such as Shackles and Liquor in the building details interface.<br><br>4. Events: You can now preview the Rewards for opening the Password Box or quickly go to the event interface from the Battle Reports of Recons and Casino Raids.<br><br>5. World Map: The map will show the remaining time of Protected State of each City. After this period is over, you can use the City Relocation to move into the City.<br><br>6. City Map: Added Crew Movement Hide function."},{"version_id":"836744439","version_name":"0.7.96","version_date":"2020-07-14 08:20:24.000 +0800","version_description":"[Optimizations and Adjustments]<br>1. Skins<br>1) You can share your new Turf Skins to the City or Faction Channel.<br>2) Optimized the Turf Skin display in the Mansion.<br>3) Optimized the Crew Skin display.<br><br>2. Underboss<br>1) Now you can copy the name on other player's profile page.<br>2) Added reminder when your speech bubble is empty.<br>3) Added a notice when you want to Equip the Equipment that is still being Crafted.<br><br>3. Settings: Now you can turn the Jewel Display in your Equipment on/off for viewing by other players.<br><br>4. Construction<br>1) Now you can see your current number of Liquor/Handcuffs/Shackles when you obtain them.<br>2) Wall: Added reminders to the requirement of the number of Enforcers that you can send to your Wall.<br><br>5. Faction<br>1) Quick Donation in Faction Investment will now save the latest option you chose.<br>2) Now you can go to your Underboss page directly from Faction Members.<br><br>6. The expiry time for some time-limited Items will be displayed in your Inventory. You can exchange them for other Items after they have expired.<br><br>[Fixed Contents]<br>Fixed the problem of the name of Kingpin not displaying in the Battle Report.<br>Fixed the problem of the Red Dot Reminder of Quick Donation in Faction Investment."},{"version_id":"837035039","version_name":"0.8.18","version_date":"2020-07-30 13:51:44.000 +0800","version_description":"[New Content]<br>1. Upgrade: Now you can upgrade lower level Associates in the Training Center and Traps through the Wall.<br>2. Search: Now you can search different levels of Kingpins on the City map.<br>3. Mayor: After successful occupation of the City Hall and entering Protected State, the Mayor can change the name of the City.<br>4. Babes: New Investments related to Babes and corresponding Turf Tasks.<br>5. Added some sound effects and special effects.<br><br>[Optimizations and Adjustments]<br>1. Part of the interface is optimized, some descriptions modified.<br>2. Resources:<br>1) When the Resources exceed the upper limit of the Vault protection and are used in batches for the first time, a corresponding reminder will appear.<br>2) When there is a Resource bubble, tapping on the building will collect the Resources.<br>3) After supplementing the Resources required for Construction, Investment, Training and Healing, the action will begin automatically.<br>3. Skins: When the same limited-time Skin is used, a reminder to reset the Skin duration will appear.<br>4. Street Bruisers: When challenge times are maxed-out, the challenge time recovery countdown will not appear.<br>5. Set: Increase the word limit of Equipment Set’s Name.<br>6. Babes: Optimize the red dot reminder effect related to the Babes' function.<br><br>[Fixed Content]<br>1. Fix the problem that the custom avatar is not displayed in the damage ranking of Kingpin Hunt.<br>2. Fix the problem that there is no picture in the Street Bruiser Attack City News.<br>3. Fix the problem that the rewards for successful Godfather’s Estate exploration cannot be shared in Godfather’s Legacy Event.<br>4. Fix the problem of missing avatar of the Godfather’s Estate Finder.<br>5. Fix the problem with lack of relevant reminders regarding no remaining Crew to explore the Godfather’s Estate."},{"version_id":"837216865","version_name":"0.8.31","version_date":"2020-08-05 07:05:30.000 +0800","version_description":"[Updates]<br>1. Equipment: Added new \"Godfather's Set\", can significantly boost your Stats!<br>2. Combat: Now you can see the result of the battle directly on the map.<br><br>[Optimizations &amp; Adjustments]<br>1. Optimized the description of some interfaces.<br>2. Faction:<br>a) You can now copy and paste in the Faction Message Channel.<br>b) You can join a Faction directly from [Search] in the settings.<br>c) Added Discord to the Faction Social Media Info<br>3. Babe:<br>a) Optimized some animation in Babe's Game.<br>b) You get a chance to get Favors after the Date with the Babe.<br>c) Added red dot reminder when your Babe's Skill can be upgraded.<br>d) When you obtain new clothes for the Babe, you can change directly in the Change interface.<br>e) When you don't have enough Talent Points, you can directly use Talent Points Items from the pop-up window.<br>4. Turbos: Optimized the UI of using Turbos.<br>5. City News: Optimized City News.<br>6. Associates/Traps Upgrade: You can Upgrade your Associates in the Training Center and Traps in the Wall.<br>7. When you fast claim the rewards from mails, you can now see the number of rewards.<br><br>Fixed Content<br>1. Fixed the display problem of the Recall icon in Faction.<br>2. Fixed the animation when Influence is increased.<br>3. Fixed abnormal Reinforce and Raid in the Nightclub Takeover event."},{"version_id":"837280588","version_name":"0.8.52","version_date":"2020-08-13 10:23:36.000 +0800","version_description":"[Updates]<br>Mails: Added filters, now you can fast access different types of Battle Reports.<br>Added some Sound Effects and FX.<br> <br>[Adjustments and Optimizations]<br>Optimized and updated some interfaces and descriptions.<br>Mails: Battle Reports of Street Bruisers have been moved to [Street] Battle Reports.<br>Faction Investment: Now when you tap the unlocked Investments, required Investments will be displayed.<br>Speed-ups: After auto-using Speed-ups, remaining available speed-up items will be showing now.<br>Training: When you use Training Expanders, the default number will now be 1.<br>Inventory: Now you will get a notice when you obtain items that you don't have.<br>Plot: Tapping the conversation in the Plot Review will accelerate the display of the text.<br>Equipment: Accelerated the Animation of Equipping.<br> <br>[Fixed Content]<br>1. Fixed the problem of the inconsistency between the hospital capacity and the actual capacity displayed by the Underboss's enhanced statistics interface after the Investment of Hospital Capacity is upgraded.<br>2. Fixed some attribute bonus errors of Godfather's Watch accessories, adjusted the Hitmen HP bonus to the Hitmen’s ATK bonus. <br>3. Fixed the problem that the estimated amount of Faction honor received in the quick donation Faction Investment interface is less than the actual amount obtained.<br>4. Fixed the problem that the member strength ranking interface of other Faction cannot be previewed normally.<br>5. Fixed the problem that you can carry resources beyond the upper limit of the transfer capacity for server migration. <br>6. Fixed the problem that the time when the Enforcer Tokens get the reminder that they are about to overflow in the Wheel event is incorrect."},{"version_id":"837509075","version_name":"0.8.76","version_date":"2020-08-31 08:13:40.000 +0800","version_description":"[Updates]<br>1. Event Calendar: You can now view the schedule of events by tapping on the calendar icon at the top right of the Event Center page.<br>2. Added some sound effects and FX.<br> <br>[Adjustments and Optimizations]<br>1. Optimized and updated some interfaces and descriptions.<br>2. Faction:<br>(1) Faction Vote: Now you can check the vote participants' choices after voting.<br>(2) Faction Bookmarks: The Faction Bookmark Coordinates are now clickable.<br>3. Events:<br>(1) Nightclub Takeover: Faction members who occupy the nightclub will get the occupation details email of the nightclub takeover when they give it up.<br>(2) A new Display Period is added to the Wheel of Fortune (The Road of the Enforcers) event. During the Display Period, you cannot obtain any more Lucky Coins, but you can still exchange your existing Coins for Rewards.<br>4. Babes:<br>(1) The Investment to increase the number of Dates is now effective immediately.<br>(2) Optimized the Babes page.<br>5. Optimized the performance of the City Map.<br> <br>[Fixed Content]<br>1. Crew movement Speed-Up issues while in other Cities.<br>2. Red dot remaining after a Leader's Task (Faction) is completed.<br>3. Repeated display of unread Group Messages.<br>4. Issues related to Faction Group."},{"version_id":"837675152","version_name":"0.8.93","version_date":"2020-09-09 07:39:47.000 +0800","version_description":"[Optimizations and Adjustments]<br>1. Parts of the interface have been optimized, some descriptions have been modified.<br>2. Mail:<br>1) The level of the captured Underboss will now be displayed in the Battle Report.<br>2) More accurate results will be displayed in the Reports on carrying out Recon on Street Bruisers and Event Bosses.<br>3. Campaign: <br>1) When STA is close to reaching the limit, there will now be a corresponding reminder that Stamina Drink can no longer be used.<br>2) When you have reached the daily limit of Stamina Drinks, you cannot purchase it any more by tapping the 'buy' button.<br>4. Battle for City Hall: <br>1) You can now preview the Urban Improvement feature in the Event interface.<br>2) During Battle State, the Mayor cannot change the City Flag.<br>3) After successful occupation of the City Hall and entering Protected State, the Mayor will receive a notification Mail.  <br>5. Babes:<br>1) Babes can now wear different outfits to go on Dates<br>2) When using Talent Point Items in bulk, the Item numbers will be automatically configured to max.<br>6. Underboss: You can now translate other Bosses' Declarations.<br>7. Faction: Faction Announcement can now be reported, copied and pasted.<br><br>[Fixed]<br>1. Issue of going to locked Campaign stages through 'Get' Gear button.<br>2. Bingo Avatar display error.<br>3. Smuggler interface display error.<br>4. Issue related to Expelling the Faction Leader."},{"version_id":"837884504","version_name":"0.9.22","version_date":"2020-09-22 09:46:12.000 +0800","version_description":"[Updates]<br>1) New Babe, Julia, has arrived! Boss, come and say hello!<br>2) Added new sound effects and special effects.<br><br>[Adjustments and Optimizations]<br>1) Optimized some interfaces and descriptions.<br>2) Now you can share your Hell Event results to your Contacts.<br>3) When switching between different Chats, contents you have typed in before will now be saved.<br>4) When the Intimacy of your current Babe has reached its max., you can go to the Gift interface to see the Gifts you own.<br>5) Now you can disable the confirmation window for Resource Replenishment.<br>6) Added more detailed descriptions to the Battle Report.<br>7) Customized avatars of players will now be displayed on the Blacklist interface.<br>8) Optimized the Enforcer Level-up Button.<br>9) Simplified some game notifications.<br><br>[Fixed]<br>1) Display issues of some Babe-related notifications.<br>2) Display issues of texts on some Turf Battle interfaces.<br>3) Display issues of City News.<br>4) Reminder problems when using some items."},{"version_id":"838135666","version_name":"0.9.39","version_date":"2020-10-15 09:19:10.000 +0800","version_description":"[Adjustments &amp; Optimizations]<br>1) Optimized some interfaces and descriptions.<br>2) Optimized the Battle Analysis for Street Bruisers.<br>3) Optimized the Red Dot Reminder in the Event Center.<br>4) Optimized the Reminder for Faction Invite emails.<br>5) Optimized some Turf Skin displays inside the Mansion.<br>6) Added Reminder if there are available fire extinguisher props in the inventory when the Wall is on fire.<br>7) Optimized Turf Battles and added new plots.<br> <br>[Fixed]<br>1) Display issues of the Workshop.<br>2) The problem of unable to change to Olivia's Summer Breeze when unlocking it on the event page.<br>3) The issue of contacts being deleted when there's too much chat history.<br>4) The problem of unable to invite players to Chat Rooms."},{"version_id":"838359673","version_name":"0.9.70","version_date":"2020-10-28 06:26:00.000 +0800","version_description":"[New Content]<br>1. Unlock the new Investment — 'Formation' at Lv.19 in the Investment Center, the unlocked Formation can be changed on the Underboss interface.<br>2. Added some sound effects and special effects.<br>[Optimizations and Adjustments]<br>1. Some interfaces optimized, some descriptions modified.<br>2. Chat:<br>1) The personal Chat interface will automatically record the private message subject.<br>2) Added a 'back to bottom' button to the bottom right corner of the Chat interface.<br>3. Mail: Optimized the scroll feature of Rewards emails with attached Items.<br>4. Babes:<br>1) When the number of 'Help' available in the current Construction Queue is full, there will be a corresponding reminder when using the Construction Quick Help Skill.<br>2) Optimized the timing of the red dot reminder for the supplementary Skills.<br>3) The Babe 'Rename' function will now be unlocked when the Favorability reaches Level 2, and the name display effect will be optimized.<br>5. Nightclub Raid: Recon and Attack of Nightclubs that have been occupied but are not defended, will no longer have reminders to lift the Protection Program.<br>6. Skins: Removed reminders to 'Use' when getting time-limited Mansion items.<br>7. City Map: Optimized the function of Map movement.<br> <br>[Fixed content]<br>1. 'Share' button - was displayed in the Stats interface of another players' details.<br>2. Button in the upper right corner of the Equipment Material Exchange with incorrect reminder.<br>3. Changed Mansion Skin displayed abnormality when using the 'Compare' items on other players' Mansions.<br>4. Abnormal display of some text warp."},{"version_id":"838512819","version_name":"0.9.90","version_date":"2020-11-05 10:56:13.000 +0800","version_description":"[New Content]<br>1. Faction Confirmation Message: R4 Members and Faction Leaders can send messages to the Faction Members through the General Faction Chat, the receivers can view and confirm the message within a time limit, and the sender will receive the corresponding replies.<br>2. Faction Position: The new Faction Position display on the Faction Member interface shows that different Positions can be used for different bonus effects, and the Leader can directly appoint or remove Member Positions.<br>3. Added some sound effects and special effects.<br> <br>[Optimizations and Adjustments]<br>1. Part of the interface has been optimized and updated, and some descriptions have been modified and edited.<br>2. Enforcer: A jump button has been added, from the source of Enforcer Tokens to go to the Inventory and use.<br>3. Mail: After some events enter the Display Period, the system will automatically send a mail to remind you to use the remaining event Items that are about to expire.<br>4. The Training Center and the Battle interface will display the Tier of different Associates.<br>5. Optimized the text content of some push notification messages.<br> <br>[Fixed Content]<br>1. Mansion Tasks related to attacking Street Bruisers has been completed and previously not disappear after receiving the Rewards.<br>2. VIP Points abnormality when logging in and off continuously."},{"version_id":"839215308","version_name":"0.9.106","version_date":"2020-11-17 08:38:46.000 +0800","version_description":"【Optimizations and Adjustments】<br>1. Optimized and updated parts of the interface, modified and improved some descriptions.<br>2. Underboss Equipment: You can now directly tap a button on the Equipment Replacement interface to go to the Advanced Equipment.<br>3. Chat:<br>(1) In the chat message with GM, the content of the message can now be copied.<br>(2) Web links sent by GM now have the function of jumping directly to the web page.<br>4. Faction: When the corresponding Rank Members with editing rights go to modify the Rules, the button to translate the text will also be displayed.<br>5. Babe: Optimized the display effect of the active Skill Cooldown.<br><br>[Fixed Content]<br>1. Incorrect Background color display of Red Thorn's Skills preview.<br>2. City News interface incorrect display for newly unlocked Tier 4 Associates."},{"version_id":"839448088","version_name":"0.9.137","version_date":"2020-12-07 07:03:01.000 +0800","version_description":"[New Content]<br>1) Added New Babe's Game [Roulette]. Now you can choose which Game to play.<br>2) Added some sound effects and special effects.<br> <br>[Adjustments &amp; Optimizations]<br>1) Optimized some interfaces and descriptions.<br>2) Optimized the display of some Crew Skins.<br>3) Governor's War:<br>a) Added special areas that cannot be attacked around the State Government Building.<br>b) Added numbers for different areas on the Governor's War Map.<br>c) Associates will not be killed if you have enough Hospital Capacity when defending Faction Towers and Strongholds that have been occupied by your Faction.<br> <br>[Fixed]<br>1) Display issues of buffs when in Faction Territory.<br>2) Display issues when sharing Battle Reports.<br>3) Display issues of Faction Emblem in Faction Ranking in the Governor's War."},{"version_id":"839638996","version_name":"0.9.173","version_date":"2020-12-18 05:49:59.000 +0800","version_description":"[New Content] <br>1. New free building movement function: you can press and hold a building to reposition them within your Turf, but some special buildings cannot be moved. <br><br>2. Added some sound effects and special effects.<br><br>[Optimizations and Adjustments]<br>1. Part of the interface has been optimized and updated; some descriptions modified and optimized.<br><br>2. Governor's War:<br>(1) After a Faction successfully occupies some Neutral Buildings, the system will automatically send a message on the State Chat to announce the occupation of the building.<br>(2) The Reinforcement and Stationing buttons displayed when viewing a Faction building in normal state are merged with the building state button.<br>(3) When a Faction building is in the process of being destroyed, it cannot be Demolished.<br>(4) Added a display of the Rankings of the Governor's War that can be viewed from the Underboss interface.<br>(5) If a player leaves a Faction after sending out a Robbery Crew, the Faction Resources that were robbed will not be obtained, except for the Resource Gift Box.<br>(6) When about to Reinforce a Faction building while under a Protection Program, there will be a reminder about the termination of the Protection Program.<br><br>3. Babes:<br>(1) Added the 'odds' display button corresponding to the betting position in the Roulette game interface.<br>(2) The aims of the Babe's Game in Daily Tasks has been adjusted to consume a certain amount of Chips.<br>(3) You cannot exit the Babe's Game interface while the Roulette is spinning.<br><br>4. Street Bruisers: After successfully defeating any level of Street Bruisers for the first time, the difficulty of subsequent challenges to that level of Street Bruisers will be permanently reduced.<br><br>5. Faction: Factions that are undergoing Investment can cancel it at any time.<br><br>6. Underboss: Optimized the statistics interface to enlarge the pop-up bubbles, and the detailed source and value of Buffs are displayed in the bubble.<br><br>7. Equipment: Optimized Crafting, now have a reminder of successful Equipment upgrades, as well as a new Equipment 'sharing' function.<br><br>8. Skins: Optimized the display effect of some Crew Skins.<br><br>[Fixed Content] <br>1. Real-time Battle Report reminder in the options not taking effect in the Governor's War Map.<br><br>2. Missing corresponding reminder when there is no available Queue to explore a Godfather's Estate. <br><br>3. Issue of two identical Enforcers displayed in the Battle Report of the Governor's War.<br><br>4. Empty information spaces displayed in the Battle Analysis interface of the Battle Report related to Governor's War."},{"version_id":"839722119","version_name":"0.9.202","version_date":"2020-12-29 08:51:07.000 +0800","version_description":"[Optimizations and Adjustments]<br>1. Optimized some interfaces and descriptions.<br>2. Governor's War:<br>(1) A new interface for Personal Points Record has been added; now you can tap on the details button from the Rankings to enter and browse the sources of earned Personal Points.<br>(2) When there is no Mayor in the current City, the Avatar of the City's Point Ranking interface is displayed as a City Hall picture by default.<br>(3) A button to view the world Map has been added to the overview interface of the Governor's War<br>3. Faction Group:<br>(1) Display for the number of newly added Group Members has been added to the Contacts interface.<br>(2) From the Group Chat, you can now tap the button in the upper right corner to directly enter the Group Members preview interface.<br>(3) Opened Rewards, Battle Report mail, etc., can now be shared to Faction Groups.<br>4. Enforcers: If the currently selected Enforcer Level is insufficient, there will be a prompt to Upgrade the Enforcer Level when equipping looted Gear.<br>5. Crew Skins: You can now view the details of the Crew Skin on the Map.<br>6. When you are in a gray tile area, you cannot transfer to the Governor's Map. You will be reminded when you tap the Relocate button.<br>7. Added some sound effects and special effects.<br><br>[Fixed Content]<br>1. Problem of Prison Guards disappearing from the Governor's War Map.<br>2. Adjusted building positions in Turfs sometimes being restored after reentering the game.<br>3. Missing text content in the interface."},{"version_id":"839903041","version_name":"0.9.216","version_date":"2021-01-08 05:53:33.000 +0800","version_description":"[New Content]<br>1. Added a new Governor’s War Investment type in the Investment Center. Can be unlocked with Crypto Coins once the Investment Center reaches level 17.<br>2. Added new Investment type for active Babe Skills. The completion of Investment can greatly shorten the cool-down time of Babe’s Skills.<br>3. Added some sound effects and special effects.<br><br>[Optimizations and Adjustments]<br>1. Part of the interface has been optimized and updated, and some descriptions modified and improved.<br>2. The Governor's War:<br>(1) Optimized the settings of Faction Construction interface in different States.<br>(2) After the Upstate Central Building has been occupied, the option of changing the color of the territory is provided, which can only be executed by the Leader. If this option is not used, it can be changed by the following occupying Faction. After the update, the color change permission will be owned by the current occupying Faction. <br>(3) The interface of enemy Buildings being Destroyed will now display the speed Buff.<br>(4) A ‘jump’ button for Governor’s War events has been added to the State Government Building interface.<br>3. Babes:<br>(1) There will be a corresponding red dot reminder after unlocking a new outfit.<br>(2) Added a display interface for the source of Babe’s Favor, where you can quickly use Favor-increasing Items.<br>4. Faction: When viewing the Faction Member Rankings of other Factions, the Member Help Rankings and Resource collection Rankings will no longer be displayed.<br>5. Snowball Fight: Now you can tap the Snowman number icon on the player’s information window to directly use a Snowball.<br>6. Street Bruisers: Reward display rules are now shown in the Street Bruiser information interface.<br>7. Campaign: Choosing to quickly Sweep the State will now directly display all of the obtained Items.<br><br>[Fixed Content]<br>1. The issue of sending Crews to Reinforce the Construction of Faction Buildings sometimes increasing the Construction time required.<br>2. Incorrect display of some event mail.<br>3. The issue of interface displayed incorrectly when viewing Faction information from the Governor’s War event.<br>4. The problem of abnormal display of colors when selecting Faction Emblems."},{"version_id":"839951759","version_name":"0.9.228","version_date":"2021-01-12 05:13:59.000 +0800","version_description":"[New Content]<br>1. A new Rank Name change function has been added in the Edit interface, under the Faction Settings. Available for the Leader only.<br>2. Added Mansion target Tasks related to the Governor's War Investments.<br>3. Added some sound effects and special effects.<br> <br>[Optimizations and Adjustments]<br>1. Optimized and updated parts of the interface; some descriptions have been modified and improved.<br>2. Queue: Optimizes the Queue sorting rules in the upper left corner of the interface; the latest Crew to depart will be shown at the bottom of the Queue list.<br>3. Mail: The Attribute Buffs relating to the Governor's War Investments will now be displayed in the 'two side comparison' of the Battle Report.<br>4. When attacking an enemy Faction Building, the interface of the selected Associates will display the current building Demolition speed.<br> <br>[Fixed content]<br>1. Opposing names of the Godfather's Pistol and Godfather's Silenced Pistol.<br>2. 'Nil' being displayed in the Recon Report after spying on another Turf while in the Governor's War Map."},{"version_id":"840082162","version_name":"0.9.258","version_date":"2021-01-21 13:02:53.000 +0800","version_description":"[New Content]<br>1. Added the time selection function of the State Government Building battle. The R5 and R4 Members whose Faction occupies State Checkpoints can modify the start time by voting.<br>2. Added some sound effects and special effects.<br><br>[Optimization and Adjustment]<br>1. Optimized and updated parts of the interface; some descriptions have been modified and improved.<br>2. Obtaining Governor's War Points:<br>(1) When your City is in the Governor's War and you relocate to a different city in another Governor's War Map, there will be a corresponding reminder of clearing Points.<br>(2) When your City is in the Governor's War and you join a Faction of a different City in another Governor's War Map, you will not obtain Personal Points by occupying Neutral Buildings.<br>(3) When your current City is different from the City of your Faction, you cannot obtain Personal Points.<br>3. Campaign: Removed pop up window displaying obtained Items after choosing to quickly Sweep the Campaign.<br>4. Attack: When there is currently no assignable Crew, player can directly tap the button at the bottom of the Attack Interface to jump to the Hospital or Training Center.<br>5. Optimized the display effect of the self-selected color of the Faction Territory.<br><br>[Fixed Content]<br>1. Animation problem with the curtains in the Babe Change.<br>2. Enemy Avatar not displaying in the Battle Report after Battle Replay.<br>3. Problem occurring when sharing message to the Chat Channel after quickly receiving multiple Faction Gifts.<br>4. After logging in again, the Wounded Capacity in the Hospital being different from the actual capacity."},{"version_id":"840145867","version_name":"0.9.270","version_date":"2021-01-22 08:18:30.000 +0800","version_description":"[New Content]<br>1. The new exclusive Set for fighting Kingpins [Takedown Set] : Improves the efficiency of Takedowns and results in more Rewards.<br>2. Added the function to automatically use Energy Drinks to replenish Energy.<br>3. Added some sound effects and special effects.<br><br>[Optimizations and Adjustments]<br>1. Optimized and updated parts of the interface; some descriptions have been modified and improved.<br>2. The Governor's War:<br>(1) The damage caused by the Police Station in a single time increased slightly.<br>(2) The challenge of Checkpoints has been eased.<br>(3) Added some descriptions related to the Governor's War.<br>3. Optimized the display of the Translation function.<br><br>[Fixed content]<br>1. Accumulated remaining times appearing as a negative number when using [Training Expander].<br>2. When the network is poor, the Territory information not loading, Resource Tiles in the enemy Territory not showing the Crew selection interface properly."},{"version_id":"840184276","version_name":"0.9.277","version_date":"2021-01-27 09:01:23.000 +0800","version_description":"[New Content]<br>1. The new exclusive Set for fighting Kingpins [Takedown Set] : Improves the efficiency of Takedowns and results in more Rewards.<br>2. Added the function to automatically use Energy Drinks to replenish Energy.<br><br> [Optimizations and Adjustments]<br>1. The Governor's War:<br>(1) The damage caused by the Police Station in a single time increased slightly.<br>(2) The challenge of Checkpoints has been eased.<br>2. Optimized the display of the Translation function."},{"version_id":"840325572","version_name":"0.9.295","version_date":"2021-02-05 05:48:15.000 +0800","version_description":"[Optimizations and Adjustments]<br>1. Optimized and updated parts of the interface. Some descriptions have been modified and improved.<br>2. Underboss:<br>1) Adjusted the style of the Underboss's corner mark in the battle interface.<br>2) Optimized the process of equipping and removing Equipment to avoid some problems when changing Equipment Attributes.<br>3. Cancelled the position of Acting Faction Leader and optimized the process of Expelling.<br>4. The location of Family Buildings such as Investment Center and Workshop can be switched between each other.<br>5. Optimized the attack performance of the Crew.<br>6. Adjusted and optimized some story Plots.<br>7. Added and adjusted some sound effects and special effects.<br><br>[Fixed Content]<br>1. When the Babe's Favor level was increased, clicking the unlocked new content would jump to another Babe's interface.<br>2. The pop-up reminder error when clicking an unlocked Babe Skill from the Active Skills interface."},{"version_id":"840365114","version_name":"0.9.306","version_date":"2021-02-08 03:10:12.000 +0800","version_description":"[New Content]<br>1. New Babe's Album: you can browse unlocked Babe photos from the detail interface of each Babe.<br>2. Added some sound effects and special effects.<br><br>[Optimizations and Adjustments]<br>1. Optimized and updated parts of the interface; some descriptions have been modified and improved.<br>2. Governor's War: Added a reminder for when the Uptown Checkpoint enters the 'half-open' state and cannot be occupied by Factions from other Districts.<br>3. Babes' Date: when entering and exiting the Date interface, the displayed Babes will now remain the same.<br>4. Faction: When consuming Faction Favors to redeem Items, a corresponding confirmation reminder has been added.<br>5. Optimized the display effect of the Formation feature.<br>6. Optimized the code input method in the Mafia Family Secret Safe event.<br><br>[Fixed Content]<br>1. Issue with Tasks not completed normally in the Scavenger Hunt.<br>2. Incorrect display of the number of Rare Big Gifts available for the Faction.<br>3. Buffs of some Neutral Buildings not clearing normally after the Governor's War ends."},{"version_id":"840432833","version_name":"0.9.326","version_date":"2021-02-27 05:46:05.000 +0800","version_description":"[Optimizations and Adjustments]<br>1. Optimized and updated parts of the interface; some descriptions have been modified and improved.<br>2. Updated some sound effects and special effects.<br><br>[Fixed Content]<br>1. Incorrect displayed of Skill Points in Babes' Date Rewards.<br>2. Freezing issue of Elite Campaign display.<br>3. Button not disappearing after participating in the Cop Raid.<br>4. Incorrect display of Damaged Traps under Hospitalized Associates in Recon Reports."},{"version_id":"840708550","version_name":"0.9.360","version_date":"2021-03-04 12:02:37.000 +0800","version_description":"[New Content]<br>1. Added some sound effects and special effects.<br><br>[Optimization and Adjustment]<br>1. Optimized and updated parts of the interface; some descriptions have been modified and improved;<br>2. Mail: The decimal part of the buff value in Combat Report is omitted;<br>3. Mafia Family Secret Safe: The password-input method is adjusted to the original version;<br>4. Expired Firecrackers from the previous Event can be exchanged for Resources after the update;<br>5. You can use FX Items on players' Turfs under Protection Programs.<br><br>[Fixed Content]<br>1. Fix the 'nil' display issue in the Governor's War List."},{"version_id":"840802855","version_name":"0.9.372","version_date":"2021-03-11 06:17:26.000 +0800","version_description":"[New Content]<br>1. Added Character-Deleting function: you can delete your Character at 'Manage Characters' Interface, if your Mansion level is under 15;<br>2. Added filter feature for Jewels' Attribute;<br>3. Added some sound effects and special effects.<br><br>[Optimization and Adjustment]<br>1. Optimized and updated parts of the interface: some descriptions have been modified and improved;<br>2. Optimized the display effect of the City Map and the Governor's Map when zooming in;<br>3. Optimized the display effect of various types of coordinates shared in the Chat;<br>4. Optimized the display of the Event Calendar;<br>5. Optimized the sliding experience of some Mails containing Rewards.<br><br>[Fixed Content]<br>1. Fixed the problem of incorrect configuration of icons in some Investments;<br>2. Fixed the problem regarding the abnormal display of Appoint Ally(Buffs) button when opening the Player Information at City Map;<br>3. Fixed the problem that the Points Record cannot be opened when viewing the Rankings of other Governor's War from the World Map List."},{"version_id":"840941494","version_name":"0.9.382","version_date":"2021-03-23 03:07:53.000 +0800","version_description":"[Optimizations and Adjustments]<br>1. Optimized and updated parts of the interface; some descriptions have been modified and improved.<br>2. Manage Characters: Added the restriction that Players must exit the Faction before deleting the Character.<br>3. Added game descriptions, including explanation about Factions being automatically disbanded. <br>4. Improved the Records of Personal Ranking Points in Governor's War.<br>5. Players can view the Influence Ranking of the City by tapping on their own influence bar.<br>6. Optimized the Mail content of Underbosses being Released.<br>7. Optimized notifications related to Chats.<br>8. Added some sound effects and special effects.<br><br>[Fixed Content]<br>1. Fixed the problem about notification of Underboss-releasing not triggering when using the Protection Program from Inventory.<br>2. Fixed the problem that Players may spend extra Gold to reset Donations times from Faction Investment in some special situations.<br>3. Fixed the problem that it may display abnormally when tapping the button quickly in Double Down Event.<br>4. Fixed the problem that Redeem Points showing the Redeemable Items before they can be redeemed in Season 2 of the Governors' War."},{"version_id":"841016646","version_name":"0.9.397","version_date":"2021-03-25 09:16:33.000 +0800","version_description":"[Optimization and Adjustment]<br>1. Optimized and updated parts of the interface: some descriptions have been modified and improved;<br>2. Notifications: now you can choose to switch off notices of Giftboxes in Faction Chat by tapping on Settings-Notifications-Social Interaction Reminders;<br>3. Jewel Engrave Function will be unlocked when your mansion reaches Lv. 22. The already-engraved Jewels will not be affected;<br>4. To avoid Item conflicts in Inventory, the expired Lucky Coins used in the Road of Enforcers Event will be automatically cleared by the system when next Road of Enforcers Event starts. Please redeem the expired Lucky Coins in time;<br>5. Added a button to view the City Map on the Casino Scramble Event interface;<br>6. Deleted 'Hide UI' button on the City Map interface;<br>7. Optimized the text input function when editing Faction Rules.<br><br>[Fixed Content]<br>1. Fixed the problem of the report button when pressing and holding the chat message;<br>2. Fixed the claiming problem of State Archives after occupying the Upstate Casino and the Upstate Shooting Range;<br>3. Fixed the displayed number of reinforcement Crews in the Recon Report."},{"version_id":"841108203","version_name":"0.9.507","version_date":"2021-04-02 07:40:25.000 +0800","version_description":"[Optimization and Adjustment]<br>1. Optimized and updated parts of the interface: some descriptions have been modified and improved;<br>2. Faction Mobilization: Added gold consumption when pressing [Abandon];<br>3. Optimized the display effect of the [Classic Crew Skin];<br>4. Optimized the position of the [Crew Info], and added an option to hide the button in [Settings];<br>5. Optimized the display effect of [Event Center], and increased the Event Classification;<br>6. The word [Deployment] is replaced with [Movement].<br><br>[Fixed content]<br>1. Fixed the issue of the [Invitation]/[Application list], which wasn’t immediately updated after receiving the [Faction’s Invitation Letter];<br>2. Fixed the issue that was causing the Game to get stuck during the tutorial of the [Surprise Flip];<br>3. Fixed the issue that the [Faction Investment] may not display the [Faction Skills] after the Governor’s War started."},{"version_id":"841256282","version_name":"0.9.520","version_date":"2021-04-09 12:42:43.000 +0800","version_description":"[Optimizations and Adjustments]<br>1. Optimized and updated parts of the interface: some descriptions have been modified and improved.<br>2. Optimized the size of the Enforcers in the Crew movement animation.<br>3. Added a reminder to confirm when recalling the Robbery Crews.<br>4. Adjusted the pointer function when entering the Event Center to automatically disappear after 3 seconds.<br><br>[Fixed Content]<br>1. Fixed the issue that doesn’t show the Faction Information when clicking the Faction Emblem in the Faction Influence Ranking.<br>2. Fixed the possibility of abnormal display of the Enforcers when Takedown Kingpins."},{"version_id":"841400662","version_name":"0.9.530","version_date":"2021-04-19 02:37:59.000 +0800","version_description":"[Optimization and Adjustment]<br>1. Added a Reminder: Players cannot move back to their original City if it is currently under Protection State;<br>2. After you select 'Enables the automatic display of all your current Queues on your Turf's interface' in the Options, it will take effect immediately;<br>3. If your restored Energy is over the max limit of the Energy Bar in the 'Obtain Energy' Interface, you will be automatically directed to the Kingpin Takedown Interface;<br>4. Increased the number of characters that can be entered in the City Announcement text box;<br>5. Optimized and updated parts of the interface: some descriptions have been modified and improved.<br><br>[Fixed Content]<br>1. Fixed the problem that Players cannot normally relocate to some Coordinates in the Map;<br>2. Fixed the abnormal display of Enforcers' attack animation when the Hidden Crew function is active;<br>3. Fixed the abnormal display of the Name Tag of some Neutral Buildings;<br>4. Fixed the abnormal display of the Name Tag of some Neutral Buildings when it overlaps with the Crew Movement."},{"version_id":"841682124","version_name":"0.9.559","version_date":"2021-04-25 05:34:47.000 +0800","version_description":"[Optimization and Adjustment]<br>1. Governor's War: Click on the open space in the [Faction Territory] to view the current Territory Attributes.<br>2. Optimized the style and color of the [Faction Emblem].<br>3. Adjusted the vocabulary and UI related to [Street Bruisers] and [Kingpins].<br>4. Adjusted the description and UI of the [Faction Honors].<br>5. Optimized and updated parts of the interface: some descriptions have been modified and improved.<br><br>[Fixed content]<br>1. Fixed the absent translation when browsing the coordinate shared by other players.<br>2. Fixed the abnormal display when swiping down, switching to Joanna in the [Babe Album].<br>3. Fixed the issue of abnormal display of animation effects for [Daily Tasks].<br>4. Fixed that the [Classic Turf Skin] does not show the star rating in the [Player Info]."},{"version_id":"841931109","version_name":"0.9.575","version_date":"2021-04-29 09:57:09.000 +0800","version_description":"[Optimization and Adjustment]<br>1. Faction Group: Added a button in the current Faction Group interface to quickly jump to the Group Chat.<br>2. Underboss: You can view the Full-Star Turf Skin by clicking the Turf icon in the Underboss interface.<br>3. Godfather's Legacy: Added the display of Daily Exploration Times in the Godfather's Estate page.<br>4. Optimized and updated parts of the interface: Some descriptions have been modified and improved.<br><br>[Fixed Content] <br>1. Fixed the problem that the buttons in Campaign at the bottom of the screen may be blocked by the Chat Bar.<br>2. Fixed the abnormal animation after destroying the Street Hideout.<br>3. Fixed the abnormal display of some texts related to Faction Mobilization Event and Shared Battle Reports."},{"version_id":"842383610","version_name":"1.0.22","version_date":"2021-05-27 13:02:36.000 +0800","version_description":"[Optimization and Adjustment]<br>1. Faction:<br>(1) Faction Emblem will show on the Neutral Buildings after a Faction successfully occupied them;<br>(2) Optimized the initial Internal Announcement when a new Faction is created;<br>2. Daily Tasks: added Tasks about hiding Associates in Safehouse;<br>3. Underboss: updated a Filter to the Equipment changing interface to screen the Buffs;<br>4. Optimized the sliding experience of the sub-interface in Turf Buffs;<br>5. Optimized the Battle Effects on the City Map;<br>6. Optimized and updated parts of the interface: some descriptions have been modified and improved;<br>7. Updated and adjusted some sound effects;<br>[Fixed content]<br>1. Fixed the title of Personal and Hell Event in the Event Center;<br>2. Fixed the display error in the City Milestones."},{"version_id":"842413787","version_name":"1.0.30","version_date":"2021-06-02 05:49:01.000 +0800","version_description":"[Optimization and Adjustment]<br>1. Faction Gift: the anonymous setting of Kingpin Challenge Gift and Faction Purchase Gift will be separated;<br>2. Equipment Attributes: added filter for Underboss EXP and Robbery Speed;<br>3. Workshop: Challenger's Set will be renamed as New Blood's Set. Kingpin Set will be renamed as Challenger's Set;<br>4. Babe: adjusted the entrances of Event Center and Babes in the Turf;<br>5. Construction: Training Center cannot be demolished when a training session is ongoing;<br>6. Optimized and updated parts of the interface: some descriptions have been modified and improved;<br>7. Updated and adjusted some sound effects;<br><br>[Fixed content]<br>1. Fixed the incorrect display of Notice at Event Center after the Rewards of Mansion Upgrade Event have been claimed;<br>2. Fixed the incorrect display of Notice when entering the City News;<br>3. Fixed the issue that Faction Buildings cannot be placed at certain Coordinates in the Governor's War Map."},{"version_id":"842569107","version_name":"1.0.53","version_date":"2021-06-11 06:59:21.000 +0800","version_description":"[Optimization and Adjustment]<br>1. The Governor's War:<br>(1) The color of Faction Sub-Stronghold will be different from Faction Stronghold on the Governor's War Map;<br>(2) The price of the Governor's War Admission Ticket will be adjusted to 500 Gold or 20,000 Faction Contribution;<br>2. Mail: Added coordinates in the Kingpin Report;<br>3. Hospital: The total time to heal T1 Associates has been adjusted from 0 second to 3 seconds;<br>4. Added a new Icon for Crew Load Capacity buff;<br>5. Optimized the effect when clicking the Mansion-view button on the City Map;<br>6. Optimized the effect when upgrading Babe Talents continuously;<br>7. Optimized the effect of Turf on the City Map when under Protection Program;<br>8. Optimized and updated parts of the interface: some descriptions have been modified and improved;<br>9. Updated and adjusted some sound effects;<br><br>[Fixed Content]<br>1. Fixed the display error of Faction Territory when placing Faction Buildings;<br>2. Fixed the display error of Rewards of Casino Scramble in the Event Calendar;<br>3. Fixed the wrong notification when Crews return from Royal Clubs."},{"version_id":"842883291","version_name":"1.0.88","version_date":"2021-07-02 05:51:27.000 +0800","version_description":"[Optimization and Adjustment]<br>1. The Governor's War:<br>(1) When the Faction Leader is on the Governor's War Map and fails to set the Faction Coordinates on the Governor's War Map, a notification message will pop up.<br>(2) Added a wall surrounding the Upstate Arsenal Government Area (gray area). Resources Tiles, Kingpins, and etc. will not appear within the Upstate Arsenal Government Area.<br>(3) Decreased the Battle State of Arsenal Clash from 4 hours to 3 hours.<br>(4) Faction Members can reinforce the occupied Arsenal from anywhere on the Governor's War Map.<br>(5) When Turfs in the Government Area are defeated and entering the Burning State, the forced relocation countdown will be extended from 0 second to 10 minutes.<br>2. Tasks:<br>(1) Added the progress indicator of each task on the Turf Tasks page.<br>(2) When Interrogation Room, Faction Club, and Hostage Cell have reached the maximum level, Task Shop will have Equipment Crate Redemption Coupon for exchange.<br>3. Optimized and updated parts of the interface. Modified and improved some descriptions.<br>4. Optimized the effect of Cross-Map Turfs under the Protection Program.<br>5. Optimized the saving and loading of chat history.<br>6. Updated and adjusted some display and sound effects.<br><br>[Fixed content]<br>1. Fixed the display error of Share Battle Report as Coordinates in the chat.<br>2. Fixed the display error of terrains on the Governor's War Map."}]