[{"version_id":"832139668","version_name":"1.0.2","version_date":"2019-07-25 21:08:51.000 +0800","version_description":"Thank you for downloading the Brex app and providing us your feedback! In this release we have:<br><br>- Added a done button to confirm finishing editing a memo<br>- Added haptic feedback when the card is locked/unlocked<br>- Fixed an issue displaying the limit for certain user configurations<br><br>We are looking forward to improve even further your experience with the Brex app. If you experience any issue, feel free to reach out to us at support@brex.com."},{"version_id":"832332690","version_name":"1.0.3","version_date":"2019-08-14 07:15:34.000 +0800","version_description":"This version is an incremental update that address a few issues:<br><br>- A few users were receiving both push notifications and SMS. We fixed this by making the push notification registration more robust.<br>- In unstable network conditions receipts could be submitted more than once for the same transaction. We improved the receipt upload handling to ensure they are never duplicated.<br>- In unstable network conditions setting a memo could fail, causing the memo to be lost. We improved this by making setting memos available when the app is offline.<br>- A few users were being logged out randomly. We improved the handling of credentials to make it more robust. If you are still having this issue, reach out to us through support@brex.com.<br><br>Keep tuned for future updates. If there's something you miss in the app feel free to reach out to us through support@brex.com!"},{"version_id":"832732737","version_name":"1.0.4","version_date":"2019-09-12 01:58:17.000 +0800","version_description":"This incremental release brings performance and stability improvements and also tweaks a few areas of the app:<br><br>- Tapping on a transaction approved notification now opens the camera directly instead of opening the transaction details. Force touch the notification if you only want to see the transaction details.<br>- The search should be more responsive now and bring results matching the merchant name faster. We are working to improve search even more in future releases.<br>- The onboarding flow is now optimized for small screen devices like iPhone 5, iPhone 5s and iPhone SE. Users of such devices should not see text being cut anymore.<br><br>We are always open to hear your thoughts about the Brex app. If you do have feedback, feel free to e-mail us on support@brex.com :)"},{"version_id":"832894430","version_name":"1.0.5","version_date":"2019-09-24 19:39:31.000 +0800","version_description":"This incremental release brings fixes for minor bugs and also a few performance improvements.<br><br>- Clearing the search should be much faster now<br>- Capturing a receipt when the app isn't open should be much faster now<br>- Fixes and issue where declined transactions weren't appearing for locked cards<br>- Fixes a rare crash happening on iOS 13 and 13.1<br><br>We want to hear your thoughts about our app! Feel free to message us at support@brex.com if you have any feedback!"}]