[{"version_id":"834070798","version_name":"1.4","version_date":"2019-12-19 16:52:55.000 +0800","version_description":"The most-requested feature is finally here: user-selectable bonus categories for a plethora of cards including the Cash+ and Cash Rewards cards. Just tap on the card, select the category, and all of the category recommendations will update within a few seconds.<br><br>If you have a card with user-selectable categories that isn't updated, please use the \"Report a problem with this card\" at the bottom of the card details screen and I'll get that fixed quicker than a new Mac Pro can boot from scratch (well, maybe not *that* fast, but pretty quick!)<br><br>Besides that, there are also a few bug fixes and improvements for the card view on the watch and with the Siri shortcuts output as it relates to foreign fees.<br><br>Thank you for using CardPointers, and I'd love to hear about how the app has helped earn you more points during your holiday shopping this year; happy holidays!"},{"version_id":"834477666","version_name":"1.5","version_date":"2020-01-25 22:46:53.000 +0800","version_description":"A new year means a big new version... and some new opportunities to get the most out of your credit cards thanks to offer tracking and reminders!<br><br>The big new feature of this release is the My Offers section, which helps you keep track of every bonus opportunity that your credit cards offer -- monthly Uber discounts, yearly airline credits, and lots more.<br><br>The work didn't stop there, though, as you can now customize your point values down to the nearest 5 hundredth to account for special bonus multipliers that you might want to add, and of course a heavy dosage of bug squashing and general improvements to make CardPointers the best credit card rewards app around."},{"version_id":"834529921","version_name":"1.6","version_date":"2020-02-20 07:13:50.000 +0800","version_description":"Looking for a new credit card but don't know where to start? This new version solves that very problem! An entirely new section of the app to help you find the best new credit card when you're looking for one. Just tap on Add Card from the home screen and then you're one tap away from viewing the very best credit cards available, customized for you based on the cards you already have:<br><br>* Highest-value welcome bonuses<br>* Cards with no annual fees<br>* Cards focused on travel rewards<br>* Cash back cards<br><br><br>Inside of each page you can further filter the list of cards to exclude ones with foreign fees, non-cash back cards, and those with annual fees.<br><br>If you are actively using the Offers feature released in the last version, this next change will be right up your alley -- when an offer is set to expire in the next week, you'll now be notified through a provisional local notification so that you can make sure to take full advantage of all of the features of your cards.<br><br>A large part of the user interface was also tightened up across all of the new areas of the app.<br><br>And as always, there are a few miscellaneous bug fixes thrown in, including improved shortcuts support and several tweaks to the Offers section."},{"version_id":"834885225","version_name":"1.6.1","version_date":"2020-03-03 17:40:42.000 +0800","version_description":"The March update brings a large set of new features, focusing on customization and making the app fit even better into your life to help you get the most out of your credit cards every day.<br><br>* You can now change a card's name, add notes about the card, customize the welcome bonus, and update the annual fee (great for those grandfathered cards!)<br><br>* The hugely-popular My Offers section has been added to the Watch app and completely re-thought to make it feel right at home on your wrist.<br><br>* Improved filters when you're looking for a new card.<br><br>* Bank names are now shown in the Add Card screen to help you find the specific card you're looking for.<br><br>* If an added card is in any other state besides Approved, that is now shown in the My Cards section with a distinct opacity.<br><br>* New context menu when you tap and hold on a card's point value to reset it to the default value (only if it differs).<br><br>* Cash back cards will now show % rather than x for the multipliers.<br><br>* Fixed a rare crash when opening a card.<br><br>* Show the name of the rewards program and bank at the bottom of the Card Details screen.<br><br>* Improvements when moving cards or pointers.<br><br>* General UI cleanup, slicing and dicing padding where it's no longer needed.<br><br>Thank you so much for using CardPointers, and see you in the next update -- there's lots more planned for the rest of 2020!"},{"version_id":"834980836","version_name":"1.6.2","version_date":"2020-03-11 00:12:18.000 +0800","version_description":"\"The one with lots of small updates\", including:<br><br>* Show a user's notes below each card title in My Cards.<br><br>* Change toggle to a checkbox in the Offers section.<br><br>* Add a Value column when searching for new cards.<br><br>* Add a one-tap \"clear\" button to all text fields.<br><br>* Speed improvements throughout the Customize Card screen.<br><br>* Watch app is much more responsive now when adding new cards.<br><br>* Added small haptic touches throughout the Watch and iOS apps.<br><br>* Show more details about the point valuations in each category.<br><br>* Miscellaneous bug fixes, including the one with the overlapped buttons"},{"version_id":"835464742","version_name":"1.6.3","version_date":"2020-04-13 22:24:32.000 +0800","version_description":"Since the little things matter, this update packs in a few of those, including:<br><br>* Card colors can now be customized using any valid hex code via the Customize Card screen.<br><br>* Home screen quick actions have been revamped and now offer direct shortcuts to My Offers (along with how many you still have available, and total value), and the menu shows the best card for each of your top 3 categories, rather than showing the last viewed categories. You can easily get that information using the default CardPointers Recently Viewed widget, so at a glance you can now see which card to use across 7 different categories.<br><br>* Add notes to a card via the Watch app using FlickType, dictation, or scribble mode.<br><br>* On iPadOS, users can now drag a card from anywhere in the app into any other app, or directly into split-screen, to open a web page with the card’s details.<br><br>* If you are denied for a card, new information will be presented in the card details screen to help you get an approval.<br><br>* Use in-app Mail Composer and Safari View Controller for all links and email buttons.<br><br>* Voiceover and voice control support has been improved throughout the app allowing for even easier navigation.<br><br>* Miscellaneous bug fixes and improvements.<br><br>Thank you for using the app and your feedback is always welcome + appreciated! There's lots more coming in the next update that I can't wait to share with you all."},{"version_id":"835576681","version_name":"1.6.4","version_date":"2020-04-17 20:01:23.000 +0800","version_description":"This update adds 2 new features and 1 little improvement to help you get the most out of your credit cards every day:<br><br>* App-wide hover support just in time for the arrival of the game-changing Magic Keyboard for iPad Pro (hat tip to Mike who makes the Strong app, my favorite workout tracker for the last 3+ years, for his help).<br>* Use FlickType to append more text to any of your card's notes with the Watch app.<br>* Improved card details layout on iPad."},{"version_id":"835621882","version_name":"1.6.5","version_date":"2020-04-20 19:11:42.000 +0800","version_description":"* No longer show denied/closed cards in each category (though the cards remain in the My Cards section to help you track all of them).<br><br>* Business cards can now be filtered out when searching for a new card.<br><br>* Streamlined view for recommended cards in each category.<br><br>* Show your notes below each card title in each category.<br><br>* Improve Handoff from iPhone and iPad so that you can easily start a credit card application from within the app and continue on your laptop or other iOS device using the native browser.<br><br>* Context menu for quickly marking a card as approved or denied when it is in pending status (Applied).<br><br>* Show the card's network at the bottom of the Card Details screen.<br><br>* Add notes, card network, and a string version of the card's status to the output of the Get All Cards shortcut.<br><br>* Further improvements to Voiceover and Voice Control in the Find Cards page."},{"version_id":"835658505","version_name":"1.6.6","version_date":"2020-04-23 16:35:07.000 +0800","version_description":"* Add hover effects to more parts of the app for iPadOS 13.4+ users.<br><br>* Improved widget -- each button is now actually a button and takes you directly to that category in the app.<br><br>* Launching directly to a specific category on iPad is now possible from the widget, shortcuts actions, and callback URLs.<br><br>* A few more miscellaneous bug fixes and improvements."},{"version_id":"835793078","version_name":"1.7","version_date":"2020-05-02 23:34:43.000 +0800","version_description":"* New notifications to remind you of any expiring offers, such as sign up offers and monthly statement credits, configurable up to 4 weeks before expiration; delivered quietly automatically and prominently upon enabling them in the Settings screen.<br><br>* Speaking of which, a new Settings screen, accessible via the gear icon at the bottom left of the main screen, and using the keyboard shortcut CMD-,<br><br>* And on *that* note, full keyboard support is finally here to make the most of the amazing new Magic Keyboard for iPad Pro or any other keyboard that you might have connected to your device. Shortcuts include CMD-C to jump to My Cards, CMD-O to jump to My Offers (if offered by your cards), and CMD-1 through CMD-9 to jump to your top 9 category pointers; you can view the full list throughout the app by holding down the CMD key for one second.<br><br>* Wouldn’t it be great if that keyboard had an escape key like the pretty-perfect new MacBook Pro and MacBook Air? If your muscle memory is anything like mine, you’ll be relieved to see that the backtick key (`) has been mapped to close all of the modals throughout the app. (Pro tip: you can also map any of the modifier keys to escape now through the Settings app). You can also use the standard escape key if you're lucky enough to have one, CMD-W, or CMD-. (John Gruber's favorite).<br><br>* The bottom half of that Magic Keyboard will be even handier now, too, thanks to some big improvements in the styling and effects from the hover states throughout the app while using a trackpad or mouse for iPadOS 13.4+ users.<br><br>* And finally, many database updates detailing the generous offers from American Express, Chase, and Citibank, featuring new statement credits and spend bonuses across the categories that matter most right now to help us get through the pandemic. To help you make the most of these new offers you can also choose to badge the app icon now through the Settings app to show you how many offers are currently available to you.<br><br>I hope that all of these changes will help make life at least a little bit better and easier in these hard times, and thank you again for using CardPointers."},{"version_id":"835799569","version_name":"1.7.1","version_date":"2020-05-03 20:56:54.000 +0800","version_description":"* New notifications to remind you of any expiring offers, such as sign up offers and monthly statement credits, configurable up to 4 weeks before expiration; delivered quietly automatically and prominently upon enabling them in the Settings screen.<br><br>* Speaking of which, a new Settings screen, accessible via the gear icon at the bottom left of the main screen, and using the keyboard shortcut CMD-,<br><br>* And on *that* note, full keyboard support is finally here to make the most of the amazing new Magic Keyboard for iPad Pro or any other keyboard that you might have connected to your device. Shortcuts include CMD-C to jump to My Cards, CMD-O to jump to My Offers (if offered by your cards), and CMD-1 through CMD-9 to jump to your top 9 category pointers; you can view the full list throughout the app by holding down the CMD key for one second.<br><br>* Wouldn’t it be great if that keyboard had an escape key like the pretty-perfect new MacBook Pro and MacBook Air? If your muscle memory is anything like mine, you’ll be relieved to see that the backtick key (`) has been mapped to close all of the modals throughout the app. (Pro tip: you can also map any of the modifier keys to escape now through the Settings app). You can also use the standard escape key if you're lucky enough to have one, CMD-W, or CMD-. (John Gruber's favorite).<br><br>* The bottom half of that Magic Keyboard will be even handier now, too, thanks to some big improvements in the styling and effects from the hover states throughout the app while using a trackpad or mouse for iPadOS 13.4+ users.<br><br>* And finally, many database updates detailing the generous offers from American Express, Chase, and Citibank, featuring new statement credits and spend bonuses across the categories that matter most right now to help us get through the pandemic. To help you make the most of these new offers you can also choose to badge the app icon now through the Settings app to show you how many offers are currently available to you.<br><br>I hope that all of these changes will help make life at least a little bit better and easier in these hard times, and thank you again for using CardPointers."},{"version_id":"836515044","version_name":"1.7.2","version_date":"2020-06-22 16:10:29.000 +0800","version_description":"* Card colors can now be customized using Drag and Drop on iPadOS using great apps like Pastel and Aurora - open the app in split screen, load a card's details screen, and drag and drop the color onto the card preview at the top. Tada!<br><br>* Further improved keyboard and mouse support for iPadOS users.<br><br>* Miscellaneous bug fixes and improvements with lots of big new features coming soon. Thank you for using the app and all of the great feedback!"}]