[{"version_id":"833027501","version_name":"1.1","version_date":"","version_description":""},{"version_id":"833644661","version_name":"2.0","version_date":"2019-11-21 14:22:54.000 +0800","version_description":"PLEASE READ IF YOU ARE UPDATING.<br><br>We have been hard at work making the app better, fixing bugs and crashes, improving the overall experience etc and this version contains some very important changes you need to be aware of:<br><br>- The most important change is that you will require a subscription to use the 8D effect and have access to all Premium features now. To make the transition easy, we are offering One Week Free Trial for you to enjoy all the features - totally on us.<br>If you are already subscribed to the Yearly plan, your subscription is still very valid. However, subscribers to the Monthly plan may not be able to renew their subscriptions at the end of the current subscription period in which case you would have to subscribe to the new Yearly plan (that's the only supported plan going forward).<br><br>- The previous limit on song imports for free users has been lifted. Now, you can import as many songs as you want into the app even when you are not subscribed.<br><br>That said, the app is faster, smoother, and much better now. We can't wait for you to try it!"},{"version_id":"834301435","version_name":"2.1.1","version_date":"2020-01-10 16:38:02.000 +0800","version_description":"We found and fixed some nasty bugs.<br><br>Also, the 8D sound effect has been greatly improved."},{"version_id":"834476640","version_name":"2.2.0","version_date":"2020-01-24 19:57:05.000 +0800","version_description":"We heard you: the process of importing songs into the app has been significantly improved. You can now import songs from other apps and via AirDrop, in addition to the existing browser import.<br><br>Easily import songs from other apps such as Drive, Photos, Files, Xender etc. into the app. Simply 'share' the files from the app and choose 'Copy to 8DMusic' in the list of actions.<br><br>You can also import songs via AirDrop now. Send songs from a Mac, iPhone or iPad to your iPhone and choose '8DMusic' in the list of apps that appears.<br><br>Your library will be automatically updated in either case.<br><br>Refer to the FAQ section on the Settings page of the app for more info.<br><br>Suggestions and criticisms are very welcome: contactus.8dmusic@gmail.com<br><br>Please don't forget to rate if you enjoy the app."},{"version_id":"835674131","version_name":"2.3","version_date":"2020-04-24 17:59:06.000 +0800","version_description":"Import songs via AirDrop, from other apps (such as Files) or over WiFi. <br><br>We also improved the sound quality in the app.<br><br>Ratings and reviews are very welcome: contactus.8dmusic@gmail.com"},{"version_id":"838000495","version_name":"2.3.1","version_date":"2020-09-29 18:49:09.000 +0800","version_description":"Fixed crash experienced by iOS 14 users.<br>Added AirPods support.<br>Various bug fixes and performance improvements."},{"version_id":"838370404","version_name":"3.0","version_date":"2020-10-29 00:08:26.000 +0800","version_description":"We rebuilt the sound effect from the ground up and now it's 10X better. Here's what's new in the revamped version of 8DMusic:<br><br>- Revamped 8D. Fuller, higher quality sound effect for your music.<br>- You can now simulate different places for your sound. Choose between a Room, Hall, Medium Chamber, Large Chamber or even a Cathedral.<br>- You can now import music from the Files App right from the app. Import your downloads etc. with ease.<br>- And many, many, more various performance improvements and bug fixes.<br><br>If you enjoy 8DMusic, don't forget to give us a rating."}]