[{"version_id":"835431716","version_name":"0.23.1","version_date":"2020-04-07 20:39:32.000 +0800","version_description":""},{"version_id":"835587912","version_name":"1.0.3","version_date":"2020-04-17 18:29:13.000 +0800","version_description":"Nessa versão apenas correções de erros"},{"version_id":"835804059","version_name":"1.1.0","version_date":"2020-05-04 12:10:11.000 +0800","version_description":"Nesta versão da Carteira bB, estamos disponibilizando o Benefício Emergencial de Preservação do Emprego e Renda (BEm) para o público-alvo do programa! Megalegal, né?<br><br>Em breve, teremos mais novidades para você, fique ligado!<br><br>Valeu :)"},{"version_id":"835956471","version_name":"1.1.1","version_date":"2020-05-14 16:31:08.000 +0800","version_description":"Nesta versão da Carteira bB, estamos disponibilizando o Benefício Emergencial de Preservação do Emprego e Renda (BEm) para o público-alvo do programa! Megalegal, né?<br><br>Em breve, teremos mais novidades para você, fique ligado!<br><br>Valeu :)"},{"version_id":"836011613","version_name":"1.2.0","version_date":"2020-05-19 16:34:34.000 +0800","version_description":"Nesta versão da Carteira bB, além de algumas correções, estamos disponibilizando a possibilidade de envio de imagens no chat. Assim, fica mais fácil e prático trocar informações com o nosso atendimento. Legal, né?<br><br>Em breve, teremos mais novidades para você, fique ligado!<br><br>Valeu :)"},{"version_id":"836059059","version_name":"1.3.0","version_date":"2020-06-04 17:28:18.000 +0800","version_description":"Nesta versão, além de algumas correções, você também poderá buscar os estabelecimentos que aceitam a Carteira bB. Também adicionamos novos parceiros para que você possa ter cada vez mais vantagens! E para quem está recebendo auxílios emergenciais, melhoramos a forma de visualizar a situação de seu benefício. Legal, né? Queremos deixar a sua Carteira bB cada dia melhor. Logo logo teremos mais novidades, fique ligado! Valeu :)"},{"version_id":"836571230","version_name":"1.4.0","version_date":"2020-06-25 12:55:34.000 +0800","version_description":"Agora com a Carteira bB você também pode fazer suas compras nas lojas que recebem pagamento com o Código QR da Cielo. É só pedir que o valor da sua compra seja lançado na maquininha da Cielo, apontar o seu celular para leitura do código QR na maquininha e, prontinho!<br><br>Além disso, você também já pode fazer suas compras online, no conforto do seu sofá, usando o seu cartão virtual da Carteira bB. Basta ter saldo na sua Carteira bB, escolher a opção crédito e informar os dados do seu cartão virtual.  Assim que a compra for aprovada, o valor será debitado do seu saldo da Carteira bB. Incrivelmente simples e superseguro"},{"version_id":"836665401","version_name":"1.5.0","version_date":"2020-07-01 14:50:05.000 +0800","version_description":"Agora com a Carteira bB, você também pode fazer suas compras nas lojas que recebem com o Código QR da Cielo. É só pedir que o valor da sua compra seja lançado na maquininha da Cielo, apontar o seu celular para leitura do Código QR na maquininha e, prontinho!<br><br>Outra novidade é que você pode fazer as suas compras online, no conforto do seu sofá, usando o seu cartão virtual. Basta ter saldo na sua Carteira bB, escolher a opção crédito e informar os dados do seu cartão virtual.  Assim que a compra for aprovada, o valor será debitado do seu saldo da Carteira bB. Incrivelmente simples e superseguro.<br><br>Espera, que tem mais: nesta versão, você pode enviar convites para os seus amigos criarem uma Carteira bB. E sabe por que isso é megalegal? Porque vocês vão poder mandar e receber dinheiro sem pagar nenhuma taxa! Não é demais? Aproveite ;)"},{"version_id":"836690570","version_name":"1.5.1","version_date":"2020-07-04 13:54:56.000 +0800","version_description":"Agora com a Carteira bB, você também pode fazer suas compras nas lojas que recebem com o Código QR da Cielo. É só pedir que o valor da sua compra seja lançado na maquininha da Cielo, apontar o seu celular para leitura do Código QR na maquininha e, prontinho!<br><br>Outra novidade é que você pode fazer as suas compras online, no conforto do seu sofá, usando o seu cartão virtual. Basta ter saldo na sua Carteira bB, escolher a opção crédito e informar os dados do seu cartão virtual.  Assim que a compra for aprovada, o valor será debitado do seu saldo da Carteira bB. Incrivelmente simples e superseguro.<br><br>Espera, que tem mais: nesta versão, você pode enviar convites para os seus amigos criarem uma Carteira bB. E sabe por que isso é megalegal? Porque vocês vão poder mandar e receber dinheiro sem pagar nenhuma taxa! Não é demais? Aproveite ;)"},{"version_id":"836924307","version_name":"1.6.1","version_date":"2020-07-20 22:54:11.000 +0800","version_description":"Novidades<br><br>Quer saber onde aceita a Carteira bB? Agora, com apenas um toque, você fica sabendo os locais que já estão recebendo pelo nosso App.<br>Mas não é só isso, veja o que mais essa versão traz de facilidades para você:<br><br>Pagamentos<br><br>Você já pode pagar o seu boleto lendo o documento em PDF diretamente no App. Mega prático!<br><br>Saldo e Extrato<br><br>Agora você também já pode gerar os seus comprovantes de pagamento e transferência, superfácil, lá na opção Extrato.<br>Gostou? Tem mais: para quem recebe algum benefício social pela Carteira bB, vai ficar sabendo o dia certinho que vai poder fazer o resgate. Bom demais, né? <br>E olha essa novidade quentinha: nessa versão, tem um cartão virtual exclusivo para usar em outros meios de pagamento como WhatsApp Pay. Assim, você pode fazer os seus pagamentos com toda tranquilidade e segurança.<br>Além de tudo isso, a nossa FAQ  ficou mais amigável e funcional e fizemos alguns ajustes técnicos para melhorar ainda mais sua experiência com a Carteira bB!  <br><br>App Preview and Screenshots"},{"version_id":"837400338","version_name":"1.7.0","version_date":"2020-08-18 21:15:16.000 +0800","version_description":"Olha os ajustes que fizemos pra tornar sua experiência na Carteira bB ainda mais prática e agradável!<br> <br>Nesta atualização, seu extrato fica ainda melhor, com apenas uma consulta, você vai poder ver as suas movimentações de período maior que 30 dias. A Carteira bB sempre trazendo mais facilidade e praticidade pra você!<br><br>Você também vai poder personalizar o seu nome no perfil, afinal, a gente sempre tem um jeitinho que prefere que nos chamem, né?<br><br>Ah, e quando se cadastrar, você vai poder informar o seu e-mail pra ficar por dentro de todas as novidades e vantagens da Carteira bB em primeira mão. Você não vai querer ficar de fora!"},{"version_id":"837759624","version_name":"1.8.0","version_date":"2020-09-14 12:25:58.000 +0800","version_description":"Praticidade? A Carteira bB tem!<br><br>Nesta versão você pode: incluir seu cartão do Banco do Brasil como meio de pagamento; pode informar o valor a receber antes de compartilhar seu código QR, facilitando a sua vida e a de quem vai pagar e quando fizer uma TED, a opção de crédito em conta já vem selecionada. <br><br>O App também traz melhorias nas telas e na navegação. Você vai perceber logo!<br><br>Ah, convida seus amigos para usar a Carteira bB! Nesta versão você já pode convidar muitos mais do que 5 amigos, tá?"},{"version_id":"837868193","version_name":"1.8.1","version_date":"2020-09-20 17:52:56.000 +0800","version_description":"Pequenas melhorias :)"},{"version_id":"838018706","version_name":"1.9.0","version_date":"2020-10-01 07:17:14.000 +0800","version_description":"Estamos sempre atualizando a Carteira bB pra deixar ela ainda melhor pra você ;)"},{"version_id":"838073607","version_name":"1.10.0","version_date":"2020-10-06 11:19:53.000 +0800","version_description":"O PIX chegou na Carteira bB. Cadastre sua chave PIX e prepare-se para em breve fazer pagamentos e transferências instantaneamente, sem taxas, a qualquer hora, em qualquer dia do ano."},{"version_id":"838402581","version_name":"1.12.0","version_date":"2020-10-27 20:01:00.000 +0800","version_description":"O que temos nesta versão? Melhorias, melhorias e muitas melhorias. E elas estão nas funcionalidades de cadastramento das chaves PIX, transferências, recebimentos de dinheiro e também na tela inicial do nosso aplicativo. Tudo isso porque além de te oferecer um app super prático, simples e seguro, nós queremos que você sempre tenha a melhor experiência com a sua Carteira bB!"},{"version_id":"841292036","version_name":"1.16.1","version_date":"2021-04-10 11:41:39.000 +0800","version_description":"Melhoramos a experiência ao solicitar o encerramento da Carteira bB e corrigimos erros."},{"version_id":"841945374","version_name":"1.17.0","version_date":"2021-04-28 13:51:02.000 +0800","version_description":"Melhoramos o gerenciamento de cartões na sua Carteira bB e corrigimos erros."}]