[{"version_id":"832471994","version_name":"1.0.0","version_date":"2020-03-17 22:03:38.000 +0800","version_description":""},{"version_id":"835168401","version_name":"1.0.1","version_date":"2020-03-21 03:58:11.000 +0800","version_description":"We heard your feedback and squashed some bugs in this release! Be sure to send us your feedback on how you're using GitHub for iOS.\n\n• FIXED Navigating to a pull request or issue from within the context of another pull request or issue now renders correctly\n• FIXED The bottom half of the triage sheet now renders correctly when dragging up quickly\n• FIXED Caches from the previously logged in account are now cleared when logging out\n• FIXED User profiles now have the correct number of repositories owned by that user\n• FIXED Lists of user-/organization-owned repositories now render correctly\n• FIXED Issue/Pull Request navigation headers now have an appropriate accessibility title\n• NEW Improved accessibility of issue and pull request timeline events"},{"version_id":"835688456","version_name":"1.1.1","version_date":"2020-04-28 23:18:25.000 +0800","version_description":"We are listening to all of your wonderful feedback, and this update includes some new features and workflow improvements. Here's just the highlights of this update:\n\n• New preference to open links in external browsers\n• Text rendering now supports any formatting that works on web\n• Pull Requests got some UI polish. Merge status is now moved to the feed.\n• Edit Issue & Pull Requests titles\n• Pull Requests now show if they are a draft\n• Improved keyboard shortcuts\n• Autocomplete user names now lets you search for any GitHub user\n• Files changed now shows more concice line numbers\n• Renamed files now appear as renamed\n• Other bug fixes and performance improvements\n\nPlease let us know how you are enjoying the app by leaving us a review or submitting feedback in app settings. Thank you!"},{"version_id":"835773553","version_name":"1.1.2","version_date":"2020-05-13 05:06:39.000 +0800","version_description":"We are listening to all of your wonderful feedback, and this update includes some new features and workflow improvements. Here's just the highlights of this update:\n\n• Improved code review flow on iPad\n• Improved comment scrolling performance\n• Fixed quoting issues\n• Fixed opening external links from comments\n• Other bug fixes and performance improvements\n\nPlease let us know how you are enjoying the app by leaving us a review or submitting feedback in app settings. Thank you!"},{"version_id":"836181564","version_name":"1.2.0","version_date":"2020-06-09 17:51:37.000 +0800","version_description":"• Improved pull request review experience — support for marking files as viewed, collapsing files, deleted files, and more. \n• Markdown, image, and PDF files now render when clicked on while browsing code\n• Organization badges on user profiles link to the mentioned organization.\n• View multiple author avatars for commits on pull request timelines.\n• New \"Metaphorical Technology\" custom app icon!\n• New fork badge on repository profile that links to the parent repository. \n• Fixed an iPad bug where keyboard dismisses while typing a review.\n• Typing new comments are now smoother than ever, rather than jumpy or flickering.\n• Labels, user statuses, and commit messages that render emoji shortcodes now properly render emojis.\n• New support for iPad pointer effects.\n• Fixed voice-over bugs in the inbox filter view"},{"version_id":"838100237","version_name":"1.3.0","version_date":"2020-10-14 18:55:52.000 +0800","version_description":"What's New\n\n• Introducing horizontal scrolling for code within pull requests, commits, and browsing code! Don't want to see your code line wrapped? Set your preferred line wrapping setting in Profile > Settings > Code Settings.\n• Introducing multiline comments! Long-press on a line of code within a pull request, and begin selecting multiple lines of code to leave a comment on. Use a two-finger swipe to select multiple lines of code without a long press. Leave suggestions for multiple lines, or comment on a whole function at once.\n• Introducing a redesigned comment experience for pull request comments! See the line context that a comment relates to, and view comments in a more readable UI on Files Changed.\n• Introducing merge options! Pick the right merge method for your pull requests, change the email associated with a merge commit, or write a custom commit message before merging your work on the main branch.\n• Introducing jump-to-file within pull requests! Jump directly to a changed file within a pull request from list of all files, with a split-view on iPad to make your pull requests even easier to walk through.\n\nBug Fixes\n\n• Paginating files within the jump-to list renders files in the appropriate collapsed state.\n• Midnight Matte custom app icon is able to be configured for iPad devices.\n• Fixed several leaks and retain cycles so the app uses less memory.\n• Setting a custom browser on iOS 14 opens URLs without an error.\n• Lines of code collapsed in a new comment view render with a dark mode compatible background\n• Pull requests show the exact number of reviews needed before the pull request is mergeable.\n• Localized code settings no longer overlap over their switches\n• Blank lines in pull requests and commits render their contents appropriately\n• Navigating notifications with keyboard shortcuts opens notifications automatically if the content can be viewed in app\n• Collapsing or marking files as viewed no longer resets the state of the collapsed section when scrolling the file offscreen\n• Fixed a crash when attempting to edit Markdown autolinks within comments\n• \"Merge\" call-to-action on pull requests prevents compression when text may cause it to overflow\n• Update Branch button on out-of-date pull requests always presents at a reasonable size\n• Deleting a comment on a pending pull request review no longer causes the review to error on submission"},{"version_id":"838308170","version_name":"1.3.1","version_date":"2020-10-26 21:24:44.000 +0800","version_description":"## What's New\n\n• Introducing suggested changes within comments! Create suggestions on pull requests after selecting lines, and apply them with the tap of a button.\n• Introducing ability to edit commit message for the merge commits.\n• Trigger haptic feedback to the user on Multiline selection.\n• Introducing ability to copy file path in the Jump to files into pasteboard by long press on the cell.\n• Swiping triage sheet will save the new selected options instead of discarding them.\n• Merge options maintains collapsed/expanded state across pull requests.\n• Viewing text documents will now always line wrap.\n\n## Bug Fixes\n\n• Keyboard shortcuts fixes and improvements. Now escape key will dismiss the New issue view.\n• Preventing creating new issues for archived repositories.\n• The launch screen now properly respects light and dark modes.\n• Tapping on a file link in-app will no longer push all parts of the file path onto the navigation stack.\n• Fixed Random error on attempting to switch into other branch.\n• Expanding and collapsing checks no longer collapses merge options."},{"version_id":"838505455","version_name":"1.3.2","version_date":"2020-11-10 18:15:21.000 +0800","version_description":"What's new\n\n• Cross-referenced issues and commits have an updated design in pull requests and issues.\n• Copy file paths and browse specific files within pull requests by tapping the ••• button when browsing diffs.\n• Check-run badges now show whether or not they are required before merging.\n• Navigate to authors and contributors from the commit details page.\n\nBug fixes\n\n• Empty list items no longer appear when holding down Back buttons in navigation stacks.\n• Fixed a bug in multi-select that can cause portions of a range to become deselected."},{"version_id":"839259000","version_name":"1.3.3","version_date":"2020-11-24 20:11:56.000 +0800","version_description":"What's new\n\n- Search has moved from the Explore tab to the Home tab, allowing you to quickly search for issues, pull requests, repositories and more.\n- A new Profile tab makes it easier to get to your profile from anywhere in the app.\n- Long-press on notifications to save, unsubscribe, mark as read, or mark as done.\n- Labels got a quick redesign to give them a bit more visual clarity.\n- Easily blockquote text by tapping on the blockquote button in the Markdown bar when composing a comment or issue.\n\nBug fixes\n\n- Fixed a crash that occurred when the device was rotated in certain places.\n- Fixed a crash that occurred when navigating files and long-pressing the back button.\n- Fixed the UI becoming unresponsive on rare occasions after performing actions on comments.\n\nWe release a lot of new changes to the GitHub app every couple weeks. These updates happen automatically and in the background, so it's easy to miss out on new features.\nWe love nerding out over release notes for new and exciting features. It's like candy! Especially for software that ships often.\n\nWe're experimenting with in-app release notes that appear occasionally when new features ship in GitHub for iOS. We hope that this will be a fun way for developers everywhere to keep up with what's new and be the first to try out new features."},{"version_id":"839448190","version_name":"1.3.4","version_date":"2020-12-08 23:22:39.000 +0800","version_description":"What's new\n\n- Introducing bulk actions for your Notifications! Select multiple notifications to mark them as done or save them for later with just a few taps. \n- Get through your notifications faster with the right swipe actions for your workflow. Haven't customized your swipe actions for Notifications yet? Configure swipe actions for Notifications right from the Notifications tab, or learn more in Settings > Swipe Actions. \n- Quickly determine if filters are active for your Notifications view with new iconography and messaging in the navigation bar.\n- Introducing a shiny new set of app icons to celebrate GitHub Universe 2020! Customize your app icon and be sure to tune in on December 8-10 on https://githubuniverse.com !\n- Send us feedback, bug reports or get support for your GitHub account with the improved support workflow. Get routed to the best place to help solve your problems from Settings > Share Feedback.\n- Long press on a notification to view all actions available to take, like mark as read, mark as done, save for later, or unsubscribe.\n- Quickly create list items from the Markdown bar while writing comments or issues.\n- See what percentage of your status checks have passed, failed or are pending with the new donut graph when merging pull requests.\n\nBug fixes\n\n- Key commands for modally presented views override their contents underneath.\n- Emoji autocomplete for emojis composed of multiple characters place the cursor at the correct position.\n- User profile READMEs with expandable content render correctly in light and dark mode.\n- Usernames displayed in issue timelines display the correct username for the current user.\n- Tap targets for marking files as viewed and other file actions in pull requests render at consistently tappable sizes.\n- Fixed a bug when editing issue comments that would leave the app in an unresponsive state.\n- Navigating back while browsing code using the iOS 14 back button long press no longer crashes the app.\n"},{"version_id":"839560462","version_name":"1.4","version_date":"2021-01-12 22:03:50.000 +0800","version_description":"What's new\n\n- Introducing Discussions, a new way to connect with your community, team, and collaborators on GitHub! Share new ideas, ask questions, and find inspiration within your repository.\n- Have a new feature request for GitHub for mobile? Use the Feedback button in Settings to start a new Discussion for your feature request!\n- Updated the interface for mentioning people and writing emoji shortcodes to display inline, with a more minimal footprint.\n- Viewing a list of repositories on iPad shows the list and repository details in a split view.\n\nBug fixes\n\n- Fixed a crash on app launch for some users.\n- mailto: links within in Markdown open with your default email app.\n- Placeholder for new comments, issues, discussions, etc. render without truncation.\n- Star buttons for repos in Explore are reliably tappable.\n- Autocomplete menu within comments is no longer visible if there are no results.\n- Fixed a bug with cursor placement after autocompleting an emoji.\n- Periods are correctly recognized in repository search.\n- Increased the tap area for the ··· overflow button in comments.\n- Submitting a bug report from Settings no longer errors out for some users\n- Selecting a user from autocomplete search appends the at-symbol ahead of the username.\n- Hunk context lines cannot be selected as part of pull request review comments.\n- Improved logic around push notification registration to reduce push notification failure rate.\n- Navigating to a universal link containing a username ending with a file type or other path no longer routes to the user profile.\n- Networking errors report more actionable information.\n- Deleting a commit body from a merge commit prevents the default commit message from being used on the merge commit.\n- Toasts and error messages use the correct border colors when transitioning from light to dark mode and vice versa.\n- Cell separators on repository profiles render at content width on iPad.\n- Star button for repositories on Explore appear without squashing title, contents.\n- Creating a new issue from a template respects the template's labels.\n- Allow all text to be selected in Code View.\n- Nested task list indent properly within issues, comments.\n"},{"version_id":"840235470","version_name":"1.4.2","version_date":"2021-02-02 19:05:50.000 +0800","version_description":"What's New \n• Introducing the first GitHub widget: contribution graphs!\n• Uploading an image ensures a complete upload before publishing an issue or comment.\n• Support for more emojis!\n• Use two-finger pan gestures in inbox to select multiple notifications.\n• View pinned discussions in discussions lists.\n• Support for auto merging pull requests.\n• View discussions directly from the home tab.\n\nBug Fixes\n• Spanish Localization fixes.\n• Fixes some animation jank when toggling multi-line comments in code reviews.\n• Polished the category-selection UI when creating a new discussion.\n• Improved dark mode colors when suggesting answers in discussions.\n• Merge options are now hidden when the user does not have permission to merge the pull request.\n• Starring a repository on the Explore tab animates a proper transition.\n• Pinned repository descriptions are no longer truncated in user profiles.\n• Usernames and avatar in inline replies within discussions no longer prevent navigation when tapped. \n• The … button is no longer available on deleted discussion comments. \n• Timestamps now correctly update themselves as time passes by. \n• Starring repositories in the explore page no longer triggers reload animations. "},{"version_id":"840421556","version_name":"1.4.3","version_date":"2021-02-16 17:36:37.000 +0800","version_description":"Bug Fixes and Improvements:\n• Creating a discussion from the Home screen transitions to the category selection view correctly\n• Emojis for discussion categories render at the correct size\n• Switching branches within a repository profile consistently switches to the selected branch\n• Marking a discussion comment as answer will animate the indicator nicely\n• Pinned repositories in the Explore screen render correctly"},{"version_id":"840550495","version_name":"1.4.4","version_date":"2021-02-23 18:41:41.000 +0800","version_description":"Bug Fixes:\n• The cursor when writing or editing a comment is no longer obscured by the Markdown bar\n• Tapping on an image in Markdown text opens the image properly"},{"version_id":"840608394","version_name":"1.4.5","version_date":"2021-03-02 06:59:30.000 +0800","version_description":"Bug Fixes:\n• Comments in pull request reviews now render as expected.\n• Dates are now render as expected.\n"},{"version_id":"840697022","version_name":"1.4.6","version_date":"2021-03-04 00:57:21.000 +0800","version_description":"Bug Fixes\n• Text fields no longer appear blank when creating or editing a comment on a line of code within a pull request review.\n"},{"version_id":"840768056","version_name":"1.5","version_date":"2021-03-11 18:38:21.000 +0800","version_description":"This is an iterative release of the app with some improvements and bug fixes. \nAmongst several improvements, the following are worth calling out:\n\n- Adding a border around the white badges so that they are visible against a white background!\n- Restoring cell selection states in the Repository Profile."},{"version_id":"840868251","version_name":"1.6.0","version_date":"2021-03-17 00:16:46.000 +0800","version_description":"What's new:\n\n• Introducing releases! Navigate through all releases in a repository, browse the release notes, and download release assets\n• Introducing deployment review notifications! Review and approve deployments from your iPhone or iPad to unblock your team and keep the deployment pipeline moving\n• You can easily check if the user is a GitHub Star or not through the newly added GitHub Star badge"},{"version_id":"840976817","version_name":"1.7.0","version_date":"2021-03-23 15:13:21.000 +0800","version_description":"# Bug Fixes:\n\n- Viewing the details page for issues, pull requests, and files changed, should render correctly on GitHub Enterprise.\n- Fixed errors that would occur when creating or editing comments on GitHub Enterprise."},{"version_id":"841067662","version_name":"1.8.0","version_date":"2021-03-30 22:16:07.000 +0800","version_description":"What's new:\n\n• Keep your work moving forward with new real-time push notifications for assignments, pull request reviews, and deployment approval requests.\n• Customize the types of notifications you receive when watching an individual repository with the new Watch button.\n• Working hours gives you control of the days and times when you want to receive push notifications from GitHub.\n• Profiles have GitHub Star badge.\n\nBug fixes:\n\n• Number of commits in a branch should render correctly.\n• Fixed visual errors in user profile README.\n"},{"version_id":"841180305","version_name":"1.9.0","version_date":"2021-04-07 02:59:02.000 +0800","version_description":"Bug fixes\n\n• Improved VoiceOver and accessibility for releases.\n• Releases no longer show an empty section for assets when no release assets exist.\n• Expanding user profile READMEs or release descriptions no longer result in incorrectly collapsed states.\n• Searching via the search bar on Home deselects the selected row when returning from a search.\n• Using a two-finger gesture to select many notifications selects a closed range of rows rather than all rows touched by the gesture."},{"version_id":"841296468","version_name":"1.10.0","version_date":"2021-04-13 02:16:55.000 +0800","version_description":"What's New\n• Gather feedback and build a community around your project by enabling Discussions on a release.\n\nBug Fixes\n• Releases no longer crashes under some localizations.\n• Tapping inline replies in discussions now correctly navigates users to discussion threads."},{"version_id":"841342731","version_name":"1.11.0","version_date":"2021-04-19 17:30:48.000 +0800","version_description":"Bug Fixes\n\n• Pull requests blocked from merging indicate when a review is missing.\n• Improved pull request widget layout with varying font and widget sizes."},{"version_id":"841821529","version_name":"1.12.0","version_date":"2021-04-26 15:33:33.000 +0800","version_description":"Bug Fixes\n\n• Fixed a crash that occurred when typing certain emoji shortcuts\n• The contribution graph widget no longer uses a pure-black background\n• Tapping on the back button from the notification schedule stores the selected schedule correctly"},{"version_id":"842007263","version_name":"1.13.0","version_date":"2021-05-03 19:46:40.000 +0800","version_description":"Bug Fixes\n\n• Tapping on a discussion reply preview will always navigate to the reply list"},{"version_id":"842109701","version_name":"1.14.0","version_date":"2021-05-10 19:51:42.000 +0800","version_description":"Introducing new pull request experiences on mobile. Reviewing and merging pull requests are now much easier on the go!\n\n• The pull request description has moved up on the pull request detail view, providing quick context about the changes without having to scroll to the timeline. Expand longer inline descriptions with a tap.\n• The new merge box mirrors the experience you're familiar with from GitHub.com. With clear colors and iconography, scanning through the overall status of a pull request to understand the current state of reviews, checks, and overall mergeability has never been easier.\n• The Files Changed cell now has a contextual call to action that will tell you when a pull request requires your review, or when a pull request has changes since your last review.\n• With passing reviews and checks, a pull request can be directly merged from the view without having to enter a modal.\n• New merge animations!\n• Introducing video uploads on issues and pull requests to share reproduction steps, design ideas, and experience details with your team.\n\nBug fixes\n\n• Tapping on a discussion reply preview will always navigate to the reply list."},{"version_id":"842148911","version_name":"1.14.1","version_date":"2021-05-13 07:24:19.000 +0800","version_description":"Bug fixes\n\n• Fixes a crash when merging a pull request on iPad"},{"version_id":"842205692","version_name":"1.15.0","version_date":"2021-05-18 02:13:47.000 +0800","version_description":"What's new\n\n• See upvotes and comment counts for discussions right from the discussion list\n• Mark draft pull requests as ready for review to get pull request reviews where ever you are\n\nBug fixes\n\n• Reduced the chance of seeing \"merge status unknown\" when viewing pull requests\n• Pull request review text fields render within safe area bounds\n• Fixed a crash when merging a pull request on iPad\n• Mirroring the display to an external display correctly updates the display\n• Expected checks for pull requests appear consistently\n• Dismiss the list of users who reacted to a comment with a button, rather than only swiping"},{"version_id":"842297390","version_name":"1.16.0","version_date":"2021-05-25 21:01:04.000 +0800","version_description":"What's new\n• Introducing an all new filtering experience. No matter what issue, pull request, or discussion you're looking for, finding it just got a whole lot easier!\n• We've added new metadata to issues and pull request list items so that it's easier to see assignees, checks status, review states, and comment counts.\n\nBug Fixes\n • Check runs are no longer duplicated within a pull request."},{"version_id":"842382881","version_name":"1.17.0","version_date":"2021-06-02 04:16:08.000 +0800","version_description":"What's new\n• See what pull requests are pending reviews at a glance when viewing lists of pull requests.\n• For open-source maintainers, approve workflow runs from first-time contributors with tap. Prevent abusive actors from running untrusted Actions on your pull requests.\n• See required pull request reviews from code owners separate from other teams or users with the new code owners badge.\n\nBug Fixes\n• Improved accessibility of dismissing the release notes banner on the Home screen.\n• Improved accessibility on the repository and user profile.\n• Fixed an issue where the settings button for auto-merge was unresponsive."},{"version_id":"842480113","version_name":"1.18.0","version_date":"2021-06-07 18:03:49.000 +0800","version_description":"Bug fixes\n\n• Improved accessibility of pinned discussions\n• Editing commit emails now only correctly appears when merging a pull request via merge commit."},{"version_id":"842548634","version_name":"1.19.0","version_date":"2021-06-14 17:49:33.000 +0800","version_description":"What's new\n• Enjoy the new app icon \"Early Bird,\" designed to fit right in while previewing new features!\n• Introducing two new types of notifications for your inbox: Security Advisory alerts and Dependabot alerts\n\nBug fixes\n• Toggling auto-merge no longer fails to enable auto-merge on a pull request\n• On iPad, dismissing the login modal no longer prevents a login from being attempted again"},{"version_id":"842648436","version_name":"1.20.0","version_date":"2021-06-21 15:54:03.000 +0800","version_description":"· Get a fast overview of the state of your task lists with a new progress indicator on Issues.\n· Introducing reactions for Releases. Now it's possible to add your reaction to any release from your favorite repository."},{"version_id":"842777648","version_name":"1.21.0","version_date":"2021-06-28 22:05:52.000 +0800","version_description":"Bug fixes\n\n• Pull request reviews from bots appear within the pull request reviews list.\n• When filtering a repository's discussions, the emoji for the currently selected discussion category renders correctly.\n• Fixed an occasional crash due to invalid states in table views across the app.\n• Removed extra spacing from task list indicators where less than 10 total tasks are present.\n• When an onboarding banner is visible in Notifications, selecting notifications from the list view will now open the notification before dismissing the banner.\n• Suggestions to deleted lines of code in pull request reviews are no longer possible."},{"version_id":"842931895","version_name":"1.22.0","version_date":"2021-07-13 16:18:45.000 +0800","version_description":"What's New:\n• Improved deep linking and navigation from notifications inbox.\n\nBug Fixes:\n• Improved accessibility of pinned repository cells in user profiles.\n• Fixed highlight state of pinned repository cells in user profiles.\n• Discussion comment previews now correctly expand when tapped."},{"version_id":"843076230","version_name":"1.23.0","version_date":"2021-07-19 18:49:49.000 +0800","version_description":"# What's new:\n - When you navigate to a comment using a deep link, the app will highlight it and scroll directly to it.\n - Adding quick access to Code Options from every Code view in the app."},{"version_id":"843202210","version_name":"1.24.0","version_date":"2021-07-26 16:50:46.000 +0800","version_description":"What's new:\n\n• Individual character changes are now highlighted more clearly within a single line diff.\n• Starting a Quote Reply while text is selected in a comment will pre-fill the comment form with a block quote.\n• Resolve pull request conversations by tapping the \"Resolve\" button on pull request comment threads.\n\nBug fixes:\n\n• Tapping on the back button in a release detail screen opened via a deep link will bring you to its parent repository profile.\n• Added a button to easily open unsupported files in a web browser.\n• The pull request and issue detail view is correctly updated after editing labels."},{"version_id":"843293337","version_name":"1.25.0","version_date":"2021-08-02 15:43:54.000 +0800","version_description":"What's new:\n\n• Enjoy the new app icon \"Hyperspace\"!\n\nBug fixes:\n\n• Improving the scrolling experience after loading more items.\n• Fixing tapping on a discussion comment from the notifications screen."},{"version_id":"843419285","version_name":"1.26.0","version_date":"2021-08-09 23:01:51.000 +0800","version_description":"What's new\n\n• See when no items matched your query while searching for an assignee, label, or other metadata.\n\nBug fixes\n\n• Scrolling to a specific item in an issue or pull request timeline loads the correct scroll position.\n• The notification list on GitHub Enterprise loads without an error."},{"version_id":"843558376","version_name":"1.27.0","version_date":"2021-08-16 19:54:54.000 +0800","version_description":"Bug Fixes:\n• Links in repository descriptions properly appear as links.\n• Addressed a crash in issues when paginating timeline content.\n• Improved the text styling of intra-line diffs in pull request diffs.\n• Improved accessibility of filter bars."},{"version_id":"843642232","version_name":"1.28.0","version_date":"2021-08-23 21:44:14.000 +0800","version_description":"What's New:\n- You can now manage who can interact with your repositories through blocking controls on a user's profile.\n- The Release details view now shows a header indicating the owner and the parent repository for faster navigation.\n- The settings screen now shows the selected appearance and App Icon in the main screen.\n\nBug Fixes:\n- Improved accessibility for Repository and User Profile screens.\n- Fixed an issue where the swipe settings were not updated in the notifications settings screen.\n"},{"version_id":"843744917","version_name":"1.29.0","version_date":"2021-08-30 16:25:25.000 +0800","version_description":"What's new\n• Get to your most important work faster by customizing the shortcuts in the My Work and Favorites section on the Home tab.\n• Quickly reset search queries and filters when no results are found.\n\nBug fixes\n• Warnings are displayed when starring a blocked user's repositories."},{"version_id":"843874028","version_name":"1.30.0","version_date":"2021-09-06 17:43:57.000 +0800","version_description":"Bug fixes\n\n· Patch code blocks within comments or READMEs use legible colors when in dark mode.\n· Tapping on a link or detail element within a truncated comment takes action without expanding the comment.\n· Pull request diffs render without errors for GitHub Enterprise users.\n"},{"version_id":"844013933","version_name":"1.31.0","version_date":"2021-09-14 00:10:20.000 +0800","version_description":"Bug Fixes:\n\n- File browser header announces correct accessibility role for VoiceOver users.\n- Empty states for filtered views no longer show a button to clear all filters when no filters are applied."},{"version_id":"844096636","version_name":"1.32.0","version_date":"2021-09-17 22:10:37.000 +0800","version_description":"What's New\n\n• It's now easier to discover the people making your favorite projects. After starring a repository, the top contributors of that project will appear so that you can follow and learn more about them. You can also view a list of all contributors to a repository at any time by tapping on the Contributors navigation item on a repository profile.\n• Tapping Back after opening a deep link to a commit view will navigate to the repository profile.\n\nBug Fixes\n\n• Improved accessibility of code and branch section header on repository profile.\n• Lists of assignees and reviewers no longer shows scope bar when there is only one scope to search for.\n• Reduced number of network requests when customizing items on the Home tab.\n• Modifying items on the Home tab no longer clears existing values when editing."},{"version_id":"844173853","version_name":"1.32.1","version_date":"2021-09-21 20:27:07.000 +0800","version_description":"What's new\n\n• It's now easier to discover the people making your favorite projects. After starring a repository, the top contributors of that project will appear so that you can follow and learn more about them. You can also view a list of all contributors to a repository at any time by tapping on the Contributors navigation item on a repository profile.\n• Tapping Back after opening a deep link to a commit view will navigate to the repository profile.\n\nBug fixes\n\n• All files load in Files Changed, rather than only the first 50 files.\n• Improved accessibility of code and branch section header on repository profile.\n• Lists of assignees and reviewers no longer shows scope bar when there is only one scope to search for.\n• Reduced number of network requests when customizing items on the Home tab.\n• Modifying items on the Home tab no longer clears existing values when editing."},{"version_id":"844232060","version_name":"1.33.0","version_date":"2021-09-24 03:43:32.000 +0800","version_description":"What's New:\n • View the number of contributors on repositories by tapping the \"More\" button on repository profiles.\n\n Bug Fixes:\n • Fixed a crash when viewing repository profiles whose top contributors included a Bot.\n • Reduced number of network requests being executed when navigating between multiple tabs.\n • Sections of Home tab load independently, preventing network errors from leaving the entire tab inaccessible."},{"version_id":"844433108","version_name":"1.34.0","version_date":"2021-10-05 23:09:26.000 +0800","version_description":"What's new:\n• Introducing a brand new Explore experience! Find personalized repository recommendations based on your past contributions and starred repositories. View trending projects in the last day, week, or month, and get even more specific with filters for specific programming or spoken languages.\n• New filled icons for the selected Explore and Profile tabs to make all the pixel-perfectionists out there happy.\n\nBug fixes:\n• Improved accessibility for the filter bar.\n"},{"version_id":"844495072","version_name":"1.35.0","version_date":"2021-10-11 16:47:49.000 +0800","version_description":"What's new:\n• Introducing a new app icon \"Holo.\" Brighten up your home screen with this shiny new iridescent look! \n\nBugfixes:\n• Prevent settings for push notifications from displaying incorrect states when returning to the app from the background.\n"},{"version_id":"844611889","version_name":"1.36.0","version_date":"2021-10-18 15:20:49.000 +0800","version_description":"What's new\n\n• Block disruptive users from participating in your organizations issues, pull requests, and discussions.\n• See when a review has been dismissed by significant code changes.\n• Navigate to linked Twitter profiles from user and organization GitHub profiles.\n\nBug fixes\n\n• The tab bar no longer appears over other content in issue or pull request views.\n• When selecting many notifications, the last item in the notifications list is no longer truncated by the actions toolbar.\n• Submit comments on issues and pull requests on GHES instances without errors.\n• Reduced number of unnecessary network requests being executed when using the app.\n• Improved accessibility of the filter bars."},{"version_id":"844824854","version_name":"1.37.0","version_date":"2021-10-25 22:40:47.000 +0800","version_description":"Bug fixes\n\n• Links to websites in repository profiles correctly open in the browser, with or without a protocol prefix.\n• Labels on issues and pull requests no longer clip when wrapping in a timeline event.\n• Dynamic text size preference are respected in more places throughout the application.\n• Repositories with no licenses will show \"None\" for the License field on repository profiles. \n• Suggestions containing newlines within HTML elements render all HTML content.\n• The \"Top contributors\" section won't appear on repository profiles when there are no contributors. \n• Notification setting toggles maintain the correct value when backgrounding the app.\n• Signing out of an enterprise account will no longer trigger an error."},{"version_id":"844923639","version_name":"1.38.0","version_date":"2021-11-01 22:37:30.000 +0800","version_description":"What's new\n\n• Introducing Home Screen quick actions! Create new issues, search GitHub or jump to your favorite repositories right from your device's Home Screen.\n\nBug fixes\n\n• Navigation bar titles on the comment and issue composer correctly indicate the action you're taking.\n• Avatars in the tab bar and account switcher appear in full-resolution.\n• Filters set when viewing `github/feedback` aren't applied when viewing or reporting feedback for GitHub Mobile via Settings."},{"version_id":"845141809","version_name":"1.39.0","version_date":"2021-11-09 17:50:48.000 +0800","version_description":"\nWhat's new:\n• Introducing a new way to filter notifications in your inbox. See notifications from specific repositories or inboxes, and filter down to only unread notifications to find just the notifications you need.\n• Improved accessibility of closed issue icons, changing the color closed issues from red to purple.\n\nBug fixes:\n• Treat URLs without an explicit scheme as HTTPS URLs.\n• Initial loads of the Explore view no longer flicker."},{"version_id":"845231070","version_name":"1.40.0","version_date":"2021-11-15 17:41:55.000 +0800","version_description":"What's new:\n\n• Introducing Lists, a new way to organize and rediscover your favorite repositories on GitHub. Get started with Lists by starring a repository and tapping the new \"Add to List\" button that appears. It's also easy to create and revisit your lists by tapping on the Starred shortcut in the My Work section of the Home tab. We'd love to hear your feedback.\n\nBug fixes:\n\n• Issue or pull request timeline items load without error on GitHub Enterprise Server."},{"version_id":"845345570","version_name":"1.41.0","version_date":"2021-11-22 15:43:07.000 +0800","version_description":"What's new:\n\n• Introducing a new push notification type for pull request reviews. Get notified when someone approves, requests changes or leaves a comment on your pull requests.\n• Reclaim storage on your device by clearing the local cache in Settings.\n\nBug fixes:\n\n• Searching issues and pull requests on GitHub Enterprise servers no longer causes errors.\n• Better handling of list URLs with Unicode characters.\n• Editing some Markdown text no longer causes the app to crash.\n"},{"version_id":"845540855","version_name":"1.42.0","version_date":"2021-11-29 19:39:09.000 +0800","version_description":"What's new:\n\n• Filter discussions by label to find what you need.\n• View media files in full screen to get a closer look.\n• Locked Issue or Pull request shows \"Locked\" badge in the header.\n• Support theme context for images in Markdown.\n\nBug fixes:\n\n• Hide commit button in the code suggestion when the user doesn't have permission to commit.\n• Closed issues now appear purple, just as merged pull requests do.\n"},{"version_id":"845629555","version_name":"1.43.0","version_date":"2021-12-06 16:09:23.000 +0800","version_description":"What's new:\n\n• Improved user, organization, and repository profile UI for iPad.\n\nBug fixes:\n\n• Commits with no message are no longer hidden from the commit list.\n• Reviewing pull requests on GitHub Enterprise servers no longer causes errors."},{"version_id":"845802969","version_name":"1.44.0","version_date":"2021-12-13 22:17:05.000 +0800","version_description":"What's new\n\n• Actions on issues and pull requests have moved! Close or reopen issues, or change your notification settings for a pull request from the overflow menu at the top of the issue.\n\nBug fixes\n\n• Issue forms are no longer omitted from the New Issue composer, if the repository has issue forms configured.\n"}]