[{"version_id":"832545263","version_name":"1.0","version_date":"2020-01-28 08:00:51.000 +0800","version_description":""},{"version_id":"834532288","version_name":"1.0.1","version_date":"2020-01-30 19:34:00.000 +0800","version_description":"Thank you all for such amazing feedback on our brand new app DoubleTake! The response has been overwhelming and we have been blown away by the unique stories being told with it.<br><br>v1.0.1 of DoubleTake includes the following important fixes:<br>– Selfie recordings captured in Discrete mode will now correctly playback in your editor of choice.<br>– When you select your shooting mode from the lens picker, this will be correctly applied when returning to the main recording UI.<br><br>If you enjoy using DoubleTake remember to leave a review. And if you have any questions or bugs to report please write to us at support@filmicpro.com"},{"version_id":"834664271","version_name":"1.0.2","version_date":"2020-02-11 15:55:01.000 +0800","version_description":"v1.0.2 of DoubleTake includes the following performance optimizations:<br>- Improved closing of recordings when backgrounding the app.<br>- Further performance enhancements to the DoubleTake library.<br><br>If you have any questions, suggestions or findings please contact us at support@filmicpro.com"},{"version_id":"837279440","version_name":"2.0.0","version_date":"2020-08-15 01:31:57.000 +0800","version_description":"v2.0 of DoubleTake brings a unique multicam capture experience with advanced audio functionality to the iPad Pro*. It has been redesigned to take full advantage of larger screen sizes and includes the following iPad Pro only features:<br><br>- Ability to manually adjust audio input gain. Use the volume slider that is integrated into the VU meter to adjust your mic levels.<br>- Support for 3 polar pickup patterns (OMNI, selfie biased, and di-pole).<br><br>For all DoubleTake users:  <br>- We have sped up your Multicam experience by defaulting the app to using the most popular lens combination for your device. Simply verify your frame rate and shooting mode and press record.<br><br>In addition this version includes numerous stability improvements, bug fixes, and better iPhone SE 2 support. It is recommended for all DoubleTake shooters on both iPhone and iPad.<br><br>*Note: Multicam support is only available on the 2018 and 2020 series iPad Pro.*<br><br>If you have any questions, suggestions or findings please contact us at support@filmicpro.com"},{"version_id":"837806395","version_name":"2.0.1","version_date":"2020-09-17 04:38:59.000 +0800","version_description":"DoubleТаке v.2.0.1 is our first update for iOS14.  <br><br>Previous v2.0 banner updates remain including:<br><br>iPad Support. A unique multicam capture experience with advanced audio functionality for the iPad Pro*. It has been redesigned to take full advantage of larger screen sizes and includes the following iPad Pro only features:<br>- Ability to manually adjust audio input gain. Use the volume slider that is integrated into the VU meter to adjust your mic levels.<br>- Support for 3 polar pickup patterns (OMNI, selfie biased, and di-pole).<br><br>For all DoubleTake users:<br>- We have sped up your Multicam experience by defaulting the app to using the most popular lens combination for your device. Simply verify your frame rate and shooting mode and press record.<br><br>In addition this version includes numerous stability improvements, bug fixes, and better iPhone SE 2 support. It is recommended for all DoubleTake shooters on both iPhone and iPad.<br><br>*Note: Multicam support is only available on the 2018 and 2020 series iPad Pro.*<br><br>If you have any questions, suggestions or findings please contact us at support@filmicpro.com"},{"version_id":"837911404","version_name":"2.0.2","version_date":"2020-09-23 21:00:27.000 +0800","version_description":"v2.0.2 of DoubleTake further optimizes the library for iOS 14 and is recommended for all creators.<br><br>If you have any questions, suggestions or findings please contact us at support@filmicpro.com"}]