[{"version_id":"833618388","version_name":"1.15.0","version_date":"2019-11-15 09:56:12.000 +0800","version_description":"[New Function]\n<br>1.Added Angel inheritance system that the former angel's training and promotion level can be inherited to the new angel without loss;<br>2.Added lineup drag editing function that player can drag angels blow to the lineup. And this function can be used to inherit quickly;<br>3.Added Fortune Angel function. Players can set an angel as fortune angel and if you get the angel by summoning you can claim double rewards;<br>4.Added sapphire store and point store will be deleted. The remaining points will be converted to sapphires in a ratio of 1:0.75;<br>5.Added a function to close tips in idle time in setting;<br>[Optimized Contents]\n<br>1.Optimize the angel classification: the 5 star angels belong to the SSR level, the 4 star angels are SR+ and SR level, the 3 star angels are R+ and R level, and the 2 star angels are N level;<br>2.Adjust some angels’ classifications. Now Siren, Nike and idun are 4 star SR angels. Shennong, Sif and Raphael are 3 star R angels;<br>3.Optimize advanced summon. Odin shards will be added to it. The number of a 5-star angel shards obtained is changed from 5 to 2, but the probability of occurrence is increased from 3% to 7.5%\n;<br>4.Optimize the skill value of some angels;<br>5.Optimize the combat power calculation formula. The angel combat power value may change but the actual combat effect remains unchanged."},{"version_id":"833706267","version_name":"1.16.0","version_date":"2019-11-22 05:18:31.000 +0800","version_description":"[New Function]\n<br>1.Added new angel Hera.\n<br>2.Added new function to change language in game. Players can click language button to choose language on personal info interface.\n<br>3.Added Thanksgiving event which will be opened next Tuesday (UTC+8).\n<br>[Optimized Contents]\n<br>1.Optimize the bleeding effect that in addition to prohibiting treatment, it will also prohibit life recovery and Leech. \n<br>2.Optimize the EVA effect that skills will also be dodged.\n<br>3.Optimize honor arena that now top 100 players in each server can participate in it.\n<br>4.Optimize the difficulty of some dungeons in star trial.\n<br>5.Optimize equipment smelt system that only orange equipment will appear whose level is the same as the level of the equipment dropped in dungeons.\n<br>6.Optimize the attribute bonus value of angel fashion.\n<br>7.Optimize the rating calculation of Get Stronger system. \n<br>8.Optimize the display of some panels and special effects.\n<br>[Bug Fix]\n<br>1.Fix the bug of incorrect guild name in friend request system.\n<br>2.Fix the bug that players cannot re-challenge passed storeys to refresh record in Sky Tower.\n<br>3.Fix the bug that attribute and CR refresh is not timely when upgrading gems."},{"version_id":"834182250","version_name":"1.19.4","version_date":"2020-01-01 00:02:27.000 +0800","version_description":"[New Function]<br>1. Add New Year event, during Jan 1st to 3rd in 2020. The event includes login award and value package.<br>[Optimized Contents]<br>1. Adjust come lags and display views."},{"version_id":"834350268","version_name":"1.20.1","version_date":"2020-02-11 22:19:46.000 +0800","version_description":"[New Function]\n<br>1、Add Spring Festival event. The Spring Festival include login rewards, value package, item redeem, summon point redeem, festival limit summon, limit angels skin of Spring Festival;<br>2、Add 50 floors of Sky-tower;<br>3、When viewing other players, increase the viewing of gem information;\n<br>\n<br>[Optimized Contents]\n<br>1、Optimize interface display;\n<br>2、Optimize lag and game crash;\n<br>3、In achievement quest: change “Main character own a set of X-level enhanced equipments ”to “Own a set of X-level enhanced equipment)"},{"version_id":"834879970","version_name":"2.1.0","version_date":"2020-02-27 19:08:48.000 +0800","version_description":"[New Function]<br>1. Add 2 new chapters on the battle;<br>2. Add a new language chat channel, which will be assigned to the corresponding chat channel according to the game language you selected;<br>3. Double rewards for receiving prizes in adventures and adventures, with probability trigger when completing 3-5 stars adventures or adventures;<br>4. The goddess illustrated book has a new function to view the skin;<br>[Optimized Contents]<br>1. Optimize network lag problem;<br>2. Optimized the problem that video cannot pop up in adventure and another gameplay;<br>3. The gems will support the use of advanced gems for upgrading;<br>4. Optimize some interface display."},{"version_id":"834925697","version_name":"2.1.1","version_date":"2020-03-03 22:33:43.000 +0800","version_description":"[Optimized Contents]\n<br>1.Optimize some language display;\n<br>[Bug Fix]\n<br>1. Fix the problem that other channel information will appear in the chat language channel;\n<br>2. Fix the problem that the \"Go\" button is invalid in limited points activities\n<br>3. Fixed the issue of occasional insufficient VIP level limited during chat;"},{"version_id":"835296624","version_name":"2.2.0","version_date":"2020-03-31 01:22:09.000 +0800","version_description":"[New Function]\n<br>1. Add 3 game languages: Spanish, German, and Russian. Corresponding in language chat channels;\n<br>2. The game server will be divided into three regions: Europe, America, and Asia. Only the Americas region will be opened. Europe and Asia will be opened in the future.\n<br>3. Added the function of viewing the history server, which can be viewed in the switching server\n<br>[Optimized Contents]\n<br>1. Optimize client performance and greatly improve the smoothness of operation and reduce the probability of flashback;\n<br>2. Optimize the server performance and greatly improve the network lag problem of the game;\n<br>3. Optimize language translation in all languages;\n<br>4. Optimize the problem that video ads cannot pop up;\n<br>5. Optimize the pop-up rules and rewards of some time-limited gift packages.\n<br>【Bug Fix】\n<br>1. Fix the problem about blocking players in channel: Players can still see the messages sent by the blocked players in the public chat channel (Only the players in the same server can be blocked)."},{"version_id":"835514780","version_name":"2.3.0","version_date":"2020-04-23 05:53:10.000 +0800","version_description":"[New Function]\n<br>1. Add new Magic Circle function. In each battle, the team will get an additional attribute bonus according to the number of surviving angels on both sides;\n<br>2. Added one-click sweep function on Star Trial ;\n<br>3. Unlock Hell-mode in Star Trial;\n<br>4. Add gift code function. The gift code will be send through various communities.\n<br>[Optimized Contents]\n<br>1. In order to adapt to the Magic Circle function, adjust the intensity of dungeon Boss.\n<br>2. Optimization Guild BOSS:\n<br>a) After you quit the guild, you can not challenge the guild Boss in 24 hours;\n<br>b) The guild BOSS consumption honor no longer changes with the BOSS level, consistent be at 2000 honor points;\n<br>c) The strength of the guild boss of the same level has increased slightly;\n<br>d) Optimization guild boss level changes:\n<br>i. The time to defeat the boss is less than or equal to 10 minutes, then the next boss will level up 5 grades;\n<br>ii. The time to defeat the boss is greater than 10 minutes, the boss level remains same;\n<br>iii. If the boss is not defeated, the boss level is reduced by 10 grades, and the minimum level of guild Boss cannot be lower than Lv40;\n<br>3. The angels HP-leech property will be slightly attenuated according to the increase in the number of target skills used;\n<br>4. The using of Boss sweeping scrolls no longer increases the number of Boss sweep times. It will be sweeping Boss directly;\n<br>5. Adjust chat function, players who are not in the same server can also be blocked;\n<br>6. Sapphire store adds bulk purchase function;\n<br>7. In the mailbox, after one-click collection, emails without attachments will also become read;\n<br>8. During use of the gem pouch, adjust opening 10 times instead of opening 100 times;\n<br>9. In battles in the arena, battle reports will save for 10 days.\n<br>10. Adjust the maximum rounds of PVP battle is shortened from 50 to 30 rounds. At the end of the round, the defending side (the side with second-attack) wins;\n<br>11. Optimize some interface and language display;\n<br>[Bug Fix]\n<br>1. Fix the problem that damage reflection and real damage will not be calculated by damage reduction;\n<br>2. Fix the problem of incorrect prompt when opening the treasure box but the key is insufficient;\n<br>3. Fix the problem that the guild board cannot slide when there are too many guild BOSS participants;\n<br>4. Fix the problem that the guild chat will be cleared every time when you re-login."},{"version_id":"835950597","version_name":"2.5.2","version_date":"2020-05-18 08:41:05.000 +0800","version_description":"[Optimized Contents]\n<br>1. optimized some UI displays\n<br>2. Optimized the stability of game client\n<br>[Bug Fixes]\n<br>1. Fixed the bug where the guild chat get deleted after restarting the game\n<br>2. Fixed the bug where the Sky-tower ranking did not refresh in time\n<br>3. Fixed the incorrect guild contribution point displayed in guild member list."},{"version_id":"836191342","version_name":"2.5.4","version_date":"2020-06-01 13:21:49.000 +0800","version_description":"［New Function］\n<br>1. Newly-added event “ocean gift” will be available from June 4th to June 10th (UTC+8), including login rewards, over-value limited time gift package, item exchange and limited summoning points. So stay tuned! \n<br>2. The limited summoning event of Hera and Cupid will be available from June 4th to June 10th.\n<br>[Optimized Contents] \n<br>1. optimized the text display of some interface\n<br>[Bug Fix]\n<br>1. Fixed the incorrect CR displayed in the ranking list\n<br>2. Fixed the problem that sometimes the surprise limited package couldn’t be purchased."},{"version_id":"836399170","version_name":"3.0.0","version_date":"2020-06-16 17:35:37.000 +0800","version_description":"[New Function］\n<br>1.Added new grade in angels—SSR+. The original SSR Ra, Hera and Cupid upgraded to SSR+;\n<br>2.Added new angels in SSR+: Icarus and Chaos.\n<br>3.Added the Angel Guard function, you can use the extra angels to guard, and provide attribute bonus to the angels that have been in the line-up.\n<br>[Optimized Contents] \n<br>1.Optimize large part of display in interfaces and texts;\n<br>2.Adjustment of summon function;"},{"version_id":"836541917","version_name":"3.0.1","version_date":"2020-06-24 02:34:57.000 +0800","version_description":"[Optimized Contents] <br>1. Optimize some interfaces, text and sound effects;<br>2. Adjust the training mechanism. After the adjustment, the difficulty of training when the stage is about to be completed is greatly reduced, but it is not so easy to train when you just enter the new stage;<br>3. Adjust the summon probability of elite summon;<br>4. The adventure system moves from competition to daily;<br>5. Optimize the guard angel, when all guardian positions are full, click the one-key guardian to automatically change to a higher angels selection;<br>6. Decrease the difficulty of the 301-350 level of the sky tower, and optimize the combat strength display of other levels to make it more reasonable, and the actual intensity has not changed;<br>7. Optimize the calculation formula of the angels' power, the actual attributes will not be changed;<br>8. Adjust the special effects of Chaos' skills;<br>9. Players who have registered before version 3.0.0 will refresh the number of monthly limited package purchases after this update;<br>10. Adjust the Arena open level to 20, and the rank board’s open level to 15;<br>11. Sapphire store added some commodities;<br>[Bug Fix]<br>1. Fix the problem that the additional damage in Chaos' 2 skill is not real damage;<br>2. Fix the problem that some Main Story and Achieved tasks have reached incorrect conditions;<br>3. Fix the problem that more than 6 angels can be in line-up. After the update, all players with more than 6 angels in line-up will be reset to 1 (main character);<br>4. Fix the problem of incorrect calculation of Princess Bari's power, the actual attributes will not change;<br>5. Fix the problem that the angels’ attribute is too high for players who are not online after version 3.0.0;<br>6. Fix some other known problems;<br>【Update Notice】<br>We will add the Training Vials synthetic function in the next version, so stay tuned."},{"version_id":"836824018","version_name":"3.1.0","version_date":"2020-07-14 20:15:43.000 +0800","version_description":"1. Add Angel upgrade function:\n<br>① The level of the angels will no longer follow the player's level, and can be inherited;\n<br>② Upgrade requires the using of Angels Exp and Holy core to upgrade;\n<br>③ There is an upper limit to the angels’ level, which is related to the quality and awakening level of the angels;\n<br>④Angels’ level of registered players will be equal to current players’ level;\n<br>2. Added Ocean Day Reprint will be launched from July 17 to 23, including login awards, value-for-money packages, item exchange and point exchange, so stay tuned!\n<br>3. Added the Training Vials synthesis function;\n<br>4. Add Grow-up Task, and some main story and achievement tasks are adjusted;"},{"version_id":"836856791","version_name":"3.1.1","version_date":"2020-07-15 23:22:36.000 +0800","version_description":"1.Fixed the abnormal display of newbie tutorial of some players;\n<br>2.Fixed the issue that the guild boss automatic opening time could not be  set manually;<br>3.Fixed the abnormal display when you checking other players’ information;"},{"version_id":"836919692","version_name":"3.1.2","version_date":"2020-07-22 02:42:55.000 +0800","version_description":"[Optimized Contents] \n<br>1. Optimize part of the interface display;\n<br>2. The daily ranking rewards of the arena need to be collected manually on the arena leaderboard in next day. The rewards are not collected after the deadline will be issued by email;\n<br>[Bug Fix]\n<br>1. Fix the problem of too frequent pushes when the adventure is completed in notification center;\n<br>2. Fix the problem of incorrect red dot reminders;\n<br>3. Fix the issue that the number of summon times must be reached is incorrectly displayed in some players' advanced/elite/epic summons;"},{"version_id":"836961020","version_name":"3.1.3","version_date":"2020-07-24 02:01:55.000 +0800","version_description":"1. Optimized part of the interface display;\n<br>2. Fixed the problem that the ranking in the Glory Arena is not displayed during qualifying stage."},{"version_id":"837177715","version_name":"3.2.0","version_date":"2020-08-04 06:01:35.000 +0800","version_description":"[New Contents]\n<br>1. Add the new event Lost Sanctuary, including Daily discount, Treasury house, Super gift, Bounty task, so stay tuned!\n<br>2. Added battle statistics function;\n<br>[Optimized Contents] \n<br>1. Optimize part of the interface and text display;\n<br>2. Reforming and upgrade the Sky Tower’s interface;"},{"version_id":"837342913","version_name":"3.3.0","version_date":"2020-08-18 05:56:41.000 +0800","version_description":"[New Contents]\n<br>1. Add function: Clash of Titans. Players who reach level 35 can sign up. Each competition will be continued for 3 days. Groups setting will be competed based on the highest combat power of players in history. After the competition end, players can get diamonds, holy cores, gold coins and rare avatar frame as rewards based on rankings and points;\n<br>2. Added new SSR+ Angel—Heimdall;\n<br>[Optimized Contents] \n<br>1. Optimize part of the interface and text display;\n<br>2. Optimize the language translation of Portuguese, Spanish, Vietnamese and German;\n<br>3. Add a new welfare center module. Nut’s gifts, Ludo and Roulette will be put into this module;\n<br>4. Add angels experience and holy core in the Ludo;\n<br>5. Main Character adjustment:\n<br>①The main character can be awakened by collecting angels to improve the quality or star level. Each time of awaken, main character will unlock or upgrade a skill;\n<br>②The main character will be greatly strengthened through awakening;\n<br>③Players who registered before the update, the quality of main character will be retained. The awakening condition can be continued after being fulfilled;"},{"version_id":"837446752","version_name":"3.3.1","version_date":"2020-08-21 02:25:12.000 +0800","version_description":"[New Contents]\n<br>1. Add function: Clash of Titans. Players who reach level 35 can sign up. Each competition will be continued for 3 days. Groups setting will be competed based on the highest combat power of players in history. After the competition end, players can get diamonds, holy cores, gold coins and rare avatar frame as rewards based on rankings and points;\n<br>2. Added new SSR+ Angel—Heimdall;\n<br>[Optimized Contents] \n<br>1. Optimize part of the interface and text display;\n<br>2. Optimize the language translation of Portuguese, Spanish, Vietnamese and German;\n<br>3. Add a new welfare center module. Nut’s gifts, Ludo and Roulette will be put into this module;\n<br>4. Add angels experience and holy core in the Ludo;\n<br>5. Main Character adjustment:\n<br>①The main character can be awakened by collecting angels to improve the quality or star level. Each time of awaken, main character will unlock or upgrade a skill;\n<br>②The main character will be greatly strengthened through awakening;\n<br>③Players who registered before the update, the quality of main character will be retained. The awakening condition can be continued after being fulfilled;"},{"version_id":"837614509","version_name":"3.4.2","version_date":"2020-09-06 02:19:23.000 +0800","version_description":"[New Contents]\n<br>1. Added red quality equipment, which can be obtained through the mystery store and defeating world bosses;\n<br>2. The number of floors of the sky tower is expanded to 400;\n<br>3. Added 4 chapters in battle;\n<br>[Optimized Contents] \n<br>1. Optimize part of the interface and text display;\n<br>2. Adjust the combat mechanism;\n<br>3. Rebuild the Guild BOSS:\n<br>4. Rebuild the World BOSS;"},{"version_id":"837855193","version_name":"3.5.1","version_date":"2020-09-21 02:03:02.000 +0800","version_description":"1. Added new SSR angel —Michael. Michael can be obtained through Angel’s Journey. Players who unlocked epic summon pool will have Angel’s Journey for 7 days;<br>2. Added the main character’s swimsuit skin;<br>3. Added emoticon package function. In the chat system, players can send the angels exclusive emoticon. There will be an interval of 3 seconds for continuous emoticon sending;"},{"version_id":"838951328","version_name":"3.7.2","version_date":"2020-11-13 06:25:22.000 +0800","version_description":"1. Optimize the display of some interfaces and text;\n<br>2. Increase rewards for Sky Tower and Star Trial;\n<br>3. Increasing attribute for angels' Passive Skill who's quality is R or above"},{"version_id":"839725120","version_name":"3.9.0","version_date":"2020-12-22 08:58:57.000 +0800","version_description":"1. Added New event——Apple of Discord\n<br>2. Added new SSR+ angel——— Frost Dragon, Ember Dragon, Storm Dragon.<br>3. Added translation function in World, Server, Guild chat."},{"version_id":"839864692","version_name":"3.10.0","version_date":"2021-01-04 08:23:20.000 +0800","version_description":"1. Added some dungeon mission in main story;<br>2. Added guild name change function;<br>3. Added the background replacement function of the main interface;"},{"version_id":"840266092","version_name":"3.12.1","version_date":"2021-02-04 07:49:33.000 +0800","version_description":"1.Added exclusive limited relic for Storm Dragon and Ember Dragon; <br>2.Added new SSR angel - Zodiac Ox; <br>3.Added new Cupid fashion - Arrow of Love·Cupid;"},{"version_id":"841359096","version_name":"3.15.4","version_date":"2021-04-16 02:22:37.000 +0800","version_description":"1. Added new function - Advanced Trial\n<br>2. Added new SSR angel [Nekomata]\n<br>3. Added new SSR+ angel [Freyja]\n<br>4. Added divine awaken of UR Cupid"},{"version_id":"842115078","version_name":"3.17.0","version_date":"2021-05-17 02:12:55.000 +0800","version_description":"1. Added friends battle system;\n<br>2. Added divine awaken of UR Ra;"},{"version_id":"842419436","version_name":"3.18.1","version_date":"2021-05-31 07:13:48.000 +0800","version_description":"1. Added divine awaken of UR Himiko;"},{"version_id":"842825819","version_name":"3.20.0","version_date":"2021-06-28 08:26:57.000 +0800","version_description":"1. Added a new SSR+ angel [Sim Cheong], and added divine awaken of UR [Sim Cheong].\n<br>2. Added multiple craft of gears and artifacts;"},{"version_id":"843029416","version_name":"3.21.0","version_date":"2021-07-14 06:49:25.000 +0800","version_description":"1. Added new system- career talent;\n<br>\n<br>2. Added new gameplay- Glaive/Arrow/Magic Tower;"},{"version_id":"843476148","version_name":"3.23.0","version_date":"2021-08-10 05:54:26.000 +0800","version_description":"1. Removed the fashion list and added a new system-Fashion Collection\n<br>\n<br>2. Added a new system-Fashion Upgrade\n<br>\n<br>3. Added fashion pack\n<br>\n<br>4. Added some angel’s fashion"},{"version_id":"843547063","version_name":"3.23.2","version_date":"2021-08-12 03:02:32.000 +0800","version_description":"1. Removed the fashion list and added a new system-Fashion Collection\n<br>\n<br>2. Added a new system-Fashion Upgrade\n<br>\n<br>3. Added fashion pack\n<br>\n<br>4. Added some angel’s fashion"},{"version_id":"843569617","version_name":"3.23.4","version_date":"2021-08-14 04:34:38.000 +0800","version_description":"1. Removed the fashion list and added a new system-Fashion Collection\n<br>\n<br>2. Added a new system-Fashion Upgrade\n<br>\n<br>3. Added fashion pack\n<br>\n<br>4. Added some angel’s fashion"},{"version_id":"843688050","version_name":"3.24.0","version_date":"2021-08-25 09:11:03.000 +0800","version_description":"1. Added divine awaken of UR Heimdall"},{"version_id":"843943665","version_name":"4.0.0","version_date":"2021-09-06 06:02:46.000 +0800","version_description":"1.\tNew system Chaotic Realm Added.\n<br>2.\tLevel 225, 230 World Boss added."},{"version_id":"844055737","version_name":"4.1.0","version_date":"2021-09-13 08:33:37.000 +0800","version_description":"Added divine awakened of SSR+ and UR Chang’e"}]