[{"version_id":"835440163","version_name":"1.0.1","version_date":"2020-04-07 21:15:44.000 +0800","version_description":"- Quick fix to address a situation where some subscription purchases wouldn't correctly apply"},{"version_id":"835481267","version_name":"1.0.2","version_date":"2020-04-10 16:27:35.000 +0800","version_description":"Thank you for all the great feedback.  This update includes:<br>- New rounded hourglass type<br>- New \"Pixel Weather\" large rectangle weather forecast<br>- Fix refresh of large rectangle hourly graphs<br>- Fix the sizing of the heart rate graphs of 44mm Apple Watches<br>- Add option to adjust background of Battery Dial type<br>- Fix long event names overflowing the large rectangle display<br>- Fix crashes related to loading calendar events"},{"version_id":"835523779","version_name":"1.0.3","version_date":"2020-04-14 16:15:44.000 +0800","version_description":"This is another update with a bunch of fixes and a few more complication types:<br>- Add Week Number (ISO 8601)<br>- Add UV Index<br>- Add Wind Speed<br>- Add Precipitation % <br>- Add Calories layout for walking/running workouts<br>- Avoid a situation where updates could get stuck at midnight<br>- Fix month-date ordering for certain locales<br>- Fix which location is chosen by default on watch app<br>- Fix Battery Dial always showing 0%"},{"version_id":"835542296","version_name":"1.0.4","version_date":"2020-04-15 15:38:07.000 +0800","version_description":"- Fix for situation where purchasing your membership doesn't correctly apple to your watch<br>- Adds Conway's Game of Life as a complication option (Whimsy section)<br>- Adds Conway's Game of Life as an option in the Games area"},{"version_id":"835590068","version_name":"1.0.5","version_date":"2020-04-17 20:54:37.000 +0800","version_description":"- A bunch of improvements focused on making the refresh of the Time complications more reliable<br>- Fixes for 24 hour time rendering in some locales<br>- Ability to choose to display only a subset of calendars in the calendar complications<br>- Ability to choose to display only a subset of locations in the World Timer complication<br>- Better battery readings<br>- Fix display of Modular Small preview when in \"Tinted preview\" mode"},{"version_id":"835636454","version_name":"1.1","version_date":"2020-04-22 14:13:20.000 +0800","version_description":"It has been a real delight to hear feedback about Watchsmith, both the good and bad.  This update is focused around addressing the shortcomings in the initial release based on all the reactions I’ve received.<br>- Dramatically updated UI, with clearer descriptions of the individual complications<br>- Clearer labeling for the Default Complication’s button<br>- Overall performance improvements<br>- Add Location via GPS<br>- Fix Tint Color for Time type<br>- Fix unit display for Dew Point<br>- Fix distance units shown during workouts and in Workout History<br>- Add Calendar selection on the Watch App<br>- Added a link to view a walkthrough video to help explain the usage of the app"},{"version_id":"835668815","version_name":"1.1.1","version_date":"2020-04-24 12:00:04.000 +0800","version_description":"Quick bugfix update:<br>- Fix issue with Battery % display during workings<br>- Only show color options for Infograph types (Modular small &amp; X-Large don't support it)<br>- Add Conditions+Temperature Weather option<br>- Add Pointed Hand Type"},{"version_id":"835905330","version_name":"1.2","version_date":"2020-05-11 20:48:07.000 +0800","version_description":"Watchsmith v1.2<br><br>This update is focused around expanding the support for the Series 1, 2 &amp; 3 Apple Watches.  It adds several new complication types to broaden their support.  Additionally, these new types also enhance newer watches by introducing support for the text around the bezels on Infograph and California watches. I’m also very happy to now fully support VoiceOver for all complication types.  <br><br>Also:<br>- Add a Tide Clock complication<br>- Add a GMT/UTC timezone location<br>- Add Blank type to rectangular<br>- Add 24 hour dial <br>- Fix Weather Gauge with Celsius <br>- Fix display of declined events<br>- Fix distance display in KM regions<br>- Improved rendering for time types (falling back to every 5 minutes now when refreshes aren’t being provided by the system)<br>- Display version string in watch app to help diagnose certain syncing issues."},{"version_id":"836262439","version_name":"1.3","version_date":"2020-06-08 12:49:09.000 +0800","version_description":"This update is all about mapping.  Most maps shown on watchOS are static and non-interactive.  For Watchsmith I wanted to do more, so I've built out a custom system of dynamic, interactive maps.  These allow me to introduce features not previously possible on the Apple Watch.  <br>- Fully interactive, zoomable, animated radar maps (requires a Premium subscription)<br>- Live outdoor workout tracking maps<br>- Workout route maps showing your workout path"},{"version_id":"836439747","version_name":"1.3.2","version_date":"2020-06-16 22:34:32.000 +0800","version_description":"Minor bug fix."},{"version_id":"836463210","version_name":"1.3.3","version_date":"2020-06-18 15:45:36.000 +0800","version_description":"- Add a new Puzzle game, in homage to the classic System 1.0 version.<br>- Fix background color issue with time based complications."},{"version_id":"836533520","version_name":"1.3.4","version_date":"2020-06-23 17:41:26.000 +0800","version_description":"- Retain puzzles between sessions<br>- Compatibility improvements."},{"version_id":"836651691","version_name":"1.3.5","version_date":"2020-07-01 14:20:18.000 +0800","version_description":"- Fixes a bug that could cause the Moon to appear behind the Sun, a circumstance impossible for terrestrial observation<br>- Fixes a typo in the privacy policy<br>- Fixes a bug related to invalid calendar data"}]