[{"version_id":"834020709","version_name":"1.0.0","version_date":"2020-12-08 11:53:41.000 +0800","version_description":""},{"version_id":"842061160","version_name":"1.0.1","version_date":"2021-06-01 11:11:18.000 +0800","version_description":"Compatibility and Installation\n\n・ Updated to be compatible with DSM 7.0.\n\nWhat's New\n\n・ Supports customizing backup destinations.\n・ Supports viewing photos in slideshow mode."},{"version_id":"843589628","version_name":"1.0.2","version_date":"2021-08-24 09:25:48.000 +0800","version_description":"Fixed Issues\n1. Fixed an issue where the application might wrongly show that there is no Internet connection and pause the backup task.\n2. Fixed an issue where users might not be able to merge unnamed people into a named person's album.\n3. Fixed an issue where auto-created albums (e.g., People, Tags, and Places) might not be responsive to gesture controls.\n4. Fixed an issue where users might not be able to download contents from shared albums."},{"version_id":"844468263","version_name":"1.0.3","version_date":"2021-10-06 09:52:44.000 +0800","version_description":"Fixed Issues\n1. Fixed an issue where videos uploaded on iOS 15 devices might not be played properly."},{"version_id":"845057257","version_name":"1.1.0","version_date":"2021-11-09 10:37:19.000 +0800","version_description":"Compatibility & Installation\n\n1. For the complete features, please install Synology Photos 1.1 or above on your Synology NAS. The update is expected to be available in all regions within the next few weeks. The actual time of release may vary slightly depending on the region.\n2. This update is only available on iOS 13.0 and above.\n\nWhat's New\n\n1. Supports displaying photos in map view in the Places album.\n2. Supports passcode lock.\n3. Enhanced the background backup stability.\n4. Supports rating photos.\n5. Supports sorting albums.\n6. Supports applying privacy-related settings to subfolders.\n\nBug Fixed\n\n1. Fixed an issue where the time of certain videos might not be correct.\n2. Fixed an issue where photos uploaded from iOS 15 devices might not be displayed properly.\n3. Fixed an issue where the map locations might be slightly offset.\n4. Enhanced the display performance of People albums.\n5. Minor bug fixes."},{"version_id":"847346502","version_name":"1.2.0","version_date":"2022-03-01 09:58:21.000 +0800","version_description":"What's New\n\n1. Supports Sleep Time Backup to quickly back up a large number of photos on your device.\n2. Supports browsing in Dark Mode (enabled by device settings).\n3. Supports downloading Live Photos with the original motion effects.\n4. Supports selecting the destination folder when uploading photos from other apps.\n5. Supports automatically renaming photos by the time taken when uploading.\n\nBug Fixed\n\n1. Fixed an issue where Map View might not function properly.\n2. Fixed an issue where users might not be able to share photos to other apps.\n3. Fixed an issue where the app might show incorrect upload error hints.\n4. Fixed an issue where switching networks might cause connection errors when users sign in via QuickConnect.\n5. Fixed an issue where the app interface might not display normally on iPhone 13 Pro Max models.\n6. Minor bug fixes."}]