[{"version_id":"834061088","version_name":"2.2","version_date":"2019-12-20 01:26:32.000 +0800","version_description":"Bạn thân mến,  <br>MochiMochi vừa cập nhật thêm một số tính năng giúp trải nghiệm ôn tập của các bạn hiệu quả hơn: <br>* Tối ưu thuật toán nhận diện 1 câu hỏi nhiều đáp án <br>* Tối ưu thuật toán đánh giá năng lực ghi nhớ <br>Tải ngay MochiMochi để học hơn 6000 từ vựng tiếng Anh và cùng MochiMochi tìm ra các \"thời điểm vàng\" học hiệu quả của riêng bạn nào. <br>Để cập nhật thêm thông tin bạn có thể theo dõi website và facebook của mochimochi."},{"version_id":"834839854","version_name":"2.3.1","version_date":"2020-02-25 00:55:10.000 +0800","version_description":"Tải ngay MochiMochi để học hơn 6000 từ vựng tiếng Anh và cùng MochiMochi tìm ra các \"thời điểm vàng\" học hiệu quả của riêng bạn nào. <br>Để cập nhật thêm thông tin bạn có thể theo dõi website và facebook của MochiMochi."},{"version_id":"835051516","version_name":"2.4","version_date":"2020-04-09 01:15:29.000 +0800","version_description":"1. Cải thiện thuật toán “Thời điểm vàng\":<br>Dựa trên phân tích lịch sử và hành vi học tập của hơn 100.000+ người học trên toàn Thế giới trong suốt 1 năm qua, Mochi tiếp tục cải thiện thuật toán gốc để tăng hiệu quả học tập lên cao hơn.<br><br>2. Cho phép chọn từ để Ôn tập:<br>- Tính năng này sẽ giúp các bạn có thể bỏ những từ đã thuộc hoặc những từ ko muốn ôn tập :D<br>- Bạn có thể tìm kiếm (search) từ trong danh sách Ôn tập, hoặc chọn từ theo cấp độ.<br>- Giao diện của phần “Danh sách từ vựng\" cũng sẽ được cập nhật theo.<br><br>3. Lưu Kết quả học &amp; ôn tập:<br>- Trong các trường hợp đang học hoặc ôn tập mà mạng chậm, crash hoặc thoát app giữa chừng… kết quả vẫn sẽ được lưu trên thiết bị và được đồng bộ với hệ thống khi các bạn mở lại App và có kết nối Internet.<br><br>4. Cập nhật tính năng notice:<br>- Mochi sẽ notice cho các bạn mỗi khi có thêm từ cần ôn, giúp các bạn ko bị quên mất “Thời điểm vàng” cần học. Hứa hẹn sẽ có nhiều notice dễ thương và xúc động hơn nữa từ MochiMochi &lt;3 <br><br>5. Cải thiện trải nghiệm load bài học và tải dữ liệu:<br>- Không cần phải load bài học mỗi lần vào chọn khoá học hay bài học.<br>- Không cần đợi loading phần biểu đồ &amp; kết qủa học từng bài mỗi khi vào app/vào màn hình học.<br><br>6. Tính năng download toàn bộ data:<br>- Bạn sẽ có thể lựa chọn tải lại toàn bộ data app khi cần để update mới <br><br>7. Tính năng báo lỗi content:<br>- Bạn sẽ có thể báo lỗi nội dung (hình ảnh, audio, text…) cho đội ngũ của MochiMochi tại mỗi game học.<br><br>8. Tính năng nghe được audio ở chế độ silent <br>- Bạn có thể chuyển về chế độ im lặng (slient) để học cùng MochiMochi, nghe được đầy đủ audio bài học và hạn chế tất cả những âm thanh distract khác. <br><br>9. Một số cải thiện khác:<br>- Tài khoản mới có thể sign up bằng Facebook hoặc G+<br>- Game ghép chữ: Có thể sắp xếp lại nếu nhỡ ghép sai (hiện tại sai 1 là phải bỏ đi tất cả các kí tự sau đó và ghép lại) - Hệ thống sẽ hiển thị thông báo khi có quá nhiều từ chưa ôn mà vẫn nạp thêm từ mới.<br><br>Tải ngay MochiMochi để cập nhật những tính năng toẹt vời này và học hơn 6000 từ vựng tiếng Anh để tìm ra các \"thời điểm vàng\" học hiệu quả của riêng bạn nào. <br>Để cập nhật thêm thông tin bạn có thể theo dõi website và facebook của MochiMochi."},{"version_id":"836592603","version_name":"3.0","version_date":"2020-07-02 15:11:23.000 +0800","version_description":"1. BUILD HỆ THỐNG DỮ LIỆU RIÊNG CHO MOCHIMOCHI<br>Từ v2.4 trở về trước, bạn phải chờ rất lâu để các lỗi về nội dung được cập nhật sau khi feedback vì app bắt buộc phải cập nhật lại và gửi Apple duyệt để có thể update mới. Sang v3.0, MochiMochi nâng cấp toàn bộ cơ sở dữ liệu và build 1 hệ thống data độc lập để có thể chỉnh sửa các lỗi dữ liệu trực tiếp và bạn KHÔNG CẦN TẢI LẠI APP cũng có thể update các cập nhật chỉnh sửa về nội dung của app.<br><br>2. CẬP NHẬT HỆ THỐNG NOTICE<br>Mỗi khi có từ mới cần ôn tập hệ thống sẽ nhắc nhở tổng số từ cần ôn cho đến thời điểm đó để bạn không bị quên ôn tập và biết chính xác số từ mình còn cần ôn ở thời điểm đó. Nhớ ôn tập khi app nhắc nhở (“thời điểm vàng” để ôn tập của riêng bạn) để đạt hiệu quả ghi nhớ tốt nhất nhé. Nhớ kiểm tra lại xem mình đã kích hoạt quyền gửi thông báo của app chưa nhé. Rất rất quan trọng trong việc học tập hiệu quả cùng Mochi đó.<br><br>3. CẬP NHẬT TÍNH NĂNG THỜI ĐIỂM VÀNG<br>MochiMochi tiếp tục tối ưu thuật toán dựa trên các cơ sở dữ liệu học tập của chính bạn để đảm bảo các từ đã đi vào vùng ghi nhớ sâu của não bộ được đưa ra ôn tập hợp lý nhất.<br><br>4. CẬP NHẬT DỮ LIỆU<br>Fix toàn bộ bugs content học viên MochiMochi đã phản hồi"},{"version_id":"837797008","version_name":"3.0.2","version_date":"2020-09-16 14:23:01.000 +0800","version_description":"Mochi đã béo lên và vừa có thêm người bạn mới Michi. Hãy tải ngay app và đồng hành cùng Mochi và Michi, chinh phục mục tiêu nhớ trọn vẹn 1000 từ vựng trong vòng 1 tháng nhé. <br><br>Mọi thắc mắc, góp ý hãy liên hệ với Mochi qua các kênh sau để được phản hồi nhanh nhất nhé: <br>Inbox fanpage: m.me/mochidemy <br>Website: mochidemy.com<br>Email: Mochidemy@gmail.com"},{"version_id":"840616557","version_name":"4.0","version_date":"2021-02-25 01:38:36.000 +0800","version_description":"You now can save new words from websites to MochiMochi app. Download Mochi extension and MochiMochi app v4.0 to discover this brand new feature."},{"version_id":"842143830","version_name":"4.1","version_date":"2021-05-12 12:07:00.000 +0800","version_description":"Mochi brings joy in your learning journey and helps you learn 1000 English words in just 1 month. <br><br><br>For more information and product releases, follow Mochi on Facebook page, and Facebook group @MochiMochi."}]