[{"version_id":"833985285","version_name":"1.0.5","version_date":"2019-12-15 18:09:55.000 +0800","version_description":"Bug fixes and performance improvement"},{"version_id":"837622795","version_name":"1.4.1","version_date":"2020-09-03 12:11:46.000 +0800","version_description":"Bug fixes and performance improvement"},{"version_id":"837781412","version_name":"1.4.2","version_date":"2020-09-15 13:19:28.000 +0800","version_description":"* Now you can edit or remove genres, songs, and artists that are shown in your profile! <br>* We have increased the quality of uploaded photos so your matches can see your photos better and more clear. <br>* With the improvements we made, Freezing problems in \"Discover\" was fixed. <br>* We increased the character limit of sending a message to make you feel more comfortable while texting. Now you can send longer messages!"},{"version_id":"839352303","version_name":"1.4.9","version_date":"2021-01-09 08:21:40.000 +0800","version_description":"* You can now register just by typing a name and change your name whenever you want<br>* Discover section is redesigned for you<br>* You can see the number of people who listen to songs live in Discover<br>* If the conversation is dying while texting you can get help from suggestion sentences<br>* You can easily edit your favorite songs and artists on your profile and share on Instagram Stories<br>* You can share the song you listen to instantly on Instagram or Twitter"},{"version_id":"842390685","version_name":"1.5.5","version_date":"2021-05-28 13:20:11.000 +0800","version_description":"* We made it easy for you to send opening profile requests!<br>* We made some performance improvements for you to use the application better.<br><br>You can reach us at any time from Meet The Music account in the \"Chat\" section in the app, and from our @meetthemusicapp Instagram or Twitter accounts :)"},{"version_id":"842708980","version_name":"1.5.7","version_date":"2021-06-20 08:59:56.000 +0800","version_description":"* You can set an alarm for any song you want to be notified immediately when someone is listening!<br>* We made improvements to the interface for you to use the application comfortably<br>* We made some performance improvements and fixed bugs.<br><br>You can reach us at any time from Meet The Music account in the \"Chat\" section in the app, and from our @meetthemusicapp Instagram or Twitter accounts :)"},{"version_id":"842742408","version_name":"1.6.0","version_date":"2021-07-17 19:24:44.000 +0800","version_description":"We are making some improvements to feel you have a more fun time with Meet The Music. Your happiness and safety is more important than anything else!<br><br>Your ideas and advices are very important. You can reach us at any time from Meet The Music account in the \"Chat\" section in the app, and from our @meetthemusicapp Instagram or Twitter accounts :)"}]