[{"version_id":"838397292","version_name":"0.8.7","version_date":"2020-10-28 18:38:52.000 +0800","version_description":"New 0.8.7 update is ready:<br>- Improved graphics and added new structures for some locations. <br>- New names for the islands to avoid having the same names.<br>- Some other visual improvements that you can notice in the game.<br>- Fixed map fragments on the quest locations. <br>- Fixed boss names in the sailor rescuing quests.  <br>- Fixed the bug when you can't buy event sailors.  <br>- Added the Halloween event tutorial.<br>- Added new languages. <br>- Added a wiki button. <br>- And some other fixes in the game."},{"version_id":"839562018","version_name":"0.10.0","version_date":"2020-12-10 13:54:57.000 +0800","version_description":"This update brings really long-awaited content! Get ready for new adventures:<br>So much desired fourth tier content: <br>- Lenses for the lighthouse are finally in the game! You can buy them for corals at the Trader and complete the lighthouse. <br>- With the lighthouse you open new South and South-West four islands for farming t-4 resources (linen, fine hide, basalt, mahogany and iron ore). Hurry up to explore far lands!<br>- There are some economic changes for balanced in-game progress. You need more resources for crafting but the amount of them is increased on the locations. This point affects all tiers in order not to give any benefits for players of different progress levels.<br>- New smooth increase of damage according to the weapon tier. <br>Polishing of locations:<br>- Fixed impassable mountains on some locations. <br>- Fixed the preview screens for all islands. Now the list of resources on the location preview matches the location content. <br>- Polished the behavior of wild bulls and boars.<br>- Improved farming of hides. Now you can get all kinds of hides on the locations according to its tier.<br>Polishing of the sailor’s rescuing quests:<br>- Now you can start a new quest for a sailor's rescue if you already have an incomplete one but pay attention that the first quest is going to be failed. So, you can’t compete two at once but you can start a new one if you don’t want to finish the current task.<br>- Sailor’s rescue quest lasts 23 hours now instead of 3 days but after completing the quest the rescued sailor stays in the participants list for 7 days! Nice chance to choose the right errand for him)<br>- The reward for the quests has been changed. Because of the reduced quest  lifetime the rewards are also reduced (coins and experience) and a player again saves  only one sailor now.<br>- If you didn’t complete the quest on the correspondent location the quest sailor comes to you on the home location to finish the given task.<br>- Fixed the incorrect behavior of the rescued sailor on the quest locations.<br>- Fixed some other issues of sailor’s rescue quests.<br>Fixes and additions:<br>- Added a notification of purchasing at the Trader.<br>- According to the results of the community contest Captain Gutt was added as a new pirate leader for the quest. Don't forget to check out the discord news to take part in new contests and Mutiny creation ;) <br>- Added more verbena on t4 islands.<br>- Now deadman caches do not appear on the locations without map fragments. <br>- Now you can see bags on the mini map of the Damned Island.<br>- Tamed animals can’t attack the neutral ones in the Temple of Trials.<br>- Now you can destroy broken buildings. <br>- Fixed the lack of bones in the bags on the Damned Island.<br>- Fixed the issue when the enemy attacks you but you can’t respond.<br>- Fixed impassibility through the stones on the Shallow Water location.<br>- Fixed cursed captain animation.<br>- And some other fixes and improvements in the game."},{"version_id":"839617360","version_name":"0.10.4","version_date":"2020-12-12 22:07:13.000 +0800","version_description":"This update brings really long-awaited content! Get ready for new adventures:<br>So much desired fourth tier content: <br>- Lenses for the lighthouse are finally in the game! You can buy them for corals at the Trader and complete the lighthouse. <br>- With the lighthouse you open new South and South-West four islands for farming t-4 resources (linen, fine hide, basalt, mahogany and iron ore). Hurry up to explore far lands!<br>- There are some economic changes for balanced in-game progress. You need more resources for crafting but the amount of them is increased on the locations. This point affects all tiers in order not to give any benefits for players of different progress levels.<br>- New smooth increase of damage according to the weapon tier. <br>Polishing of locations:<br>- Fixed impassable mountains on some locations. <br>- Fixed the preview screens for all islands. Now the list of resources on the location preview matches the location content. <br>- Polished the behavior of wild bulls and boars.<br>- Improved farming of hides. Now you can get all kinds of hides on the locations according to its tier.<br>Polishing of the sailor’s rescuing quests:<br>- Now you can start a new quest for a sailor's rescue if you already have an incomplete one but pay attention that the first quest is going to be failed. So, you can’t compete two at once but you can start a new one if you don’t want to finish the current task.<br>- Sailor’s rescue quest lasts 23 hours now instead of 3 days but after completing the quest the rescued sailor stays in the participants list for 7 days! Nice chance to choose the right errand for him)<br>- The reward for the quests has been changed. Because of the reduced quest  lifetime the rewards are also reduced (coins and experience) and a player again saves  only one sailor now.<br>- If you didn’t complete the quest on the correspondent location the quest sailor comes to you on the home location to finish the given task.<br>- Fixed the incorrect behavior of the rescued sailor on the quest locations.<br>- Fixed some other issues of sailor’s rescue quests.<br>Fixes and additions:<br>- Added a notification of purchasing at the Trader.<br>- According to the results of the community contest Captain Gutt was added as a new pirate leader for the quest. Don't forget to check out the discord news to take part in new contests and Mutiny creation ;) <br>- Added more verbena on t4 islands.<br>- Now deadman caches do not appear on the locations without map fragments. <br>- Now you can see bags on the mini map of the Damned Island.<br>- Tamed animals can’t attack the neutral ones in the Temple of Trials.<br>- Now you can destroy broken buildings. <br>- Fixed the lack of bones in the bags on the Damned Island.<br>- Fixed the issue when the enemy attacks you but you can’t respond.<br>- Fixed impassibility through the stones on the Shallow Water location.<br>- Fixed cursed captain animation.<br>- And some other fixes and improvements in the game."},{"version_id":"839640446","version_name":"0.10.5","version_date":"2020-12-16 09:05:51.000 +0800","version_description":"Ho-ho-ho, wanna get presents for Holiday Season? It is high time to start a new event! <br>Let’s look what pirates will be doing in the event:<br>- Collect candy canes. You can get them from Krampuses or gift boxes;<br>- Exchange candy canes for elves sailors or new event armor and weapons at Capitan Klaus. He is always found on the island with Trader now; <br>- There are two armor sets - Elven armor and Holiday armor and brand new four event weapons. Collect all of them!<br>- Errand elves sailors to get event armor and weapons.<br>This time for your convenience an event timer is added on the global map. So, you always know how much time you have to finish errands and collect event armor &amp; weapons.<br>And one more thing! Good news is that this time the event starts only after 15th character level. So, young pirates won’t suffer from extra mobs."}]