[{"version_id":"833956597","version_name":"10.0.4","version_date":"2019-12-14 08:09:21.000 +0800","version_description":""},{"version_id":"834024628","version_name":"10.0.5","version_date":"2019-12-18 11:48:13.000 +0800","version_description":"1. Fix bug: App crashed when clear records.\n2. Fix bug: App crashed when use 'Audio File' tool"},{"version_id":"834813369","version_name":"10.6.0","version_date":"2020-02-26 05:01:04.000 +0800","version_description":"Fix some bugs."},{"version_id":"835262875","version_name":"10.6.1","version_date":"2020-03-31 09:29:07.000 +0800","version_description":"Supports Sign in with Apple"},{"version_id":"835696776","version_name":"10.7.0","version_date":"2020-04-28 10:33:25.000 +0800","version_description":"[Supports saving to WPS Cloud]\n[iPhone adaptation to iOS 13 Dark Mode]\nClick to view details\n\n[Supports saving to WPS Cloud]\nDocuments can be saved to WPS Cloud. Just log in to the same account to sync documents across computers and phones, making cross-platform working more efficient.\n\n[iPhone adaptation to iOS 13 Dark Mode]\nWPS Office for iPhone supports full adaptation of iOS 13’s Dark Mode. Turn on Dark Mode in System Settings to enable Dark Mode in WPS Office.\n\n【Other Optimizations】\n· Supports inserting blank pages in Writer component.\n· Recently opened documents records on the Home page. Supports batch deletion.\n· Multiple-shooting mode for photo and scan. Supports cropping and rotating a single picture.\n· Optimized the interaction of screen capture in Spreadsheet component.\n· Adjusted the position of Eye Protection Mode in PDF component for easier access.\n· Optimized the PDF forward page flipping effect on iPad with improved fluency.\n· Fixed the issue of crash when reading system text documents on iOS 11.\n\nThank you for using and supporting WPS for iOS. We wish everyone luck and success!"},{"version_id":"836302393","version_name":"10.7.1","version_date":"2020-06-09 11:33:01.000 +0800","version_description":"Fix some bugs."},{"version_id":"836518931","version_name":"10.10.0","version_date":"2020-06-23 11:45:35.000 +0800","version_description":"[Tremendous amount of free Premium templates released] \n[iPad document interface upgraded]\n[iPad dark mode released]\n[Support various editing operations in PDF files]\n[Support page layout settings in a document] \n[Support batch insert of multiple images] \n[Optimized iPad cursor adaptation]\n[Support exporting image-only PowerPoint]\n[Support inserting image as a page in PDF files]\n[WPS Spreadsheet supports copying sum/count items]\n[Support creating new document in iPad split screen]\n[Support worksheet merging] -- Click for details --\n\n [Tremendous amount of free Premium templates released]\nOver 10,000 free Premium templates to make document creation easier.\n\n [iPad document interface upgraded]\nThe interface for iPad has been completely revised and upgraded, with clearer function classification, making it more convenient to use.\n\n [iPad dark mode released]\nWPS Office for iPad is fully adapted to the dark mode of iOS 13. When dark mode is enabled, WPS will automatically switch to dark mode as well.\n\n [Support various editing operations in PDF files]\nSupport various editing operations in PDF files: Editing text, editing image, inserting text, inserting image, and extracting image.\n\n [Support page layout settings in a document]\nSupport setting page margin, paper size and paper orientation in a document\n\n [Support batch insert of multiple images]\nSupport batch insert of multiple images. You can insert up to 9 images at a time.\n\n [Optimized iPad cursor adaptation]\nOptimized iPad cursor: dragging objects and scrolling pages, and supports right-clicking on document lists (only supported by iOS 13.4 and later systems)\n\n [Support exporting image-only PowerPoint]\nSupport exporting PowerPoint to image-only documents.\n \n [Support inserting image as a page in PDF files]\nInserting image as a page is added to Add New Page in the PDF page management functions\n\n [WPS Spreadsheet supports copying sum/count items]\nWPS Spreadsheet supports copying sum/count items, making it faster to get calculation results\n \n [Support creating new document in iPad split screen]\nYou can now create new documents and view starred documents in split screen mode\n \n [Merge worksheet tool newly added to the app]\nSupport merging multiple worksheets from different workbooks into one. Also support filtering header row\n \n [More optimizations]\n· Support deleting documents in the home page’s Recent Document list\n· WPS Spreadsheet supports copying sheets\n· WPS Spreadsheet for iPhone full screen reading supports switching sheets, making data comparison faster\n· When the iPad is connected to an external Bluetooth keyboard, long press the Command key to display a list of shortcut keys for quicker understanding of available shortcut keys.\n· Optimized audio-visual inconsistencies caused by pauses when recording video\n· Fixed occasional crashes that occur when drawing ink\n\nThank you for using and supporting WPS for iOS. We wish everyone luck and success!"},{"version_id":"836741645","version_name":"10.10.1","version_date":"2020-07-09 09:44:35.000 +0800","version_description":"Fix some bugs."},{"version_id":"838152744","version_name":"10.16.0","version_date":"2020-10-12 09:33:33.000 +0800","version_description":"This update is applicable to iOS14, which supports the Scribble, and optimizes the user experience of the mouse, significantly increasing office productivity.\n[Supports Scribble on iOS14]\n[New iPhone homepage] [Optimized iPad mouse and keyboard compatibility]\n[Optimized Presentation component] [Supports Spreadsheet input by code scanning and card view]\n[Customizable PDF Watermark]\n-- Click for details --\n \n[Supports Scribble on iOS14]\nBy enabling Scribble of the Apple Pencil, hand-written texts can be converted into printed texts\n \n[New iPhone homepage]\nThe newly revised iPhone homepage supports displaying document thumbnails\n \n[Optimized iPad mouse and keyboard compatibility]\nOptimized mouse-clicking for iPad and page switching by keyboard arrow keys (supported on systems of iOS13.4 or above only)\n \n[Optimized Presentation component]\nAbility to hide slides while playing slide show and configure page-switching effects. The logic for auto-backup is optimized to reduce delay during PPT editing and ink erasing.\n \n[Supports Spreadsheet input by code scanning and card view]\nAbility to input information automatically by bar code or QR code scanning inside the table. Each row of data is viewable in the card view mode by selecting \"View - Card View\"\n \n[Customizable PDF Watermark]\nAbility to add and delete watermarks, and configure watermark pattern, text, color etc.\n\n\nThank you for using and supporting WPS for iOS. We wish everyone luck and success!"}]