[{"version_id":"834217916","version_name":"1.0.1","version_date":"2020-01-31 19:54:45.000 +0800","version_description":"•&nbsp;Added DE and JA localizations for launch.<br><br>Welcome to SongOwl!<br>Willkommen bei SongOwl!<br>SongOwlへようこそ"},{"version_id":"834634710","version_name":"1.0.2","version_date":"2020-02-07 22:26:37.000 +0800","version_description":"Some love for Love!<br>• Grouping and sorting preferences in the \"Loved Songs\" section of the Favorites tab are now saved. These views can now be added to Favorites as well :)<br>• NEW convenience action: easily love/dislike the currently playing song by double tapping the artwork in the player, miniplayer and widget!<br>• NEW option to disable the \"swipe to skip\" gesture in the player pane.<br>• Rounded up some minor Crashlytics exceptions and stability issues. So far SongOwl has been very stable. I am monitoring one mysterious issue that has cropped up exclusively on iOS 13.4 which I believe is specific to the beta and has been reported.<br><br>And speaking of love, have you reviewed SongOwl yet? User reviews help the app gain traction and show up higher in App Store results. If you've enjoyed the first week of SongOwl, please consider leaving a review and letting me know. Thanks!"},{"version_id":"834739037","version_name":"1.0.3","version_date":"2020-02-25 11:56:35.000 +0800","version_description":"• NEW manual dark mode. Set dark mode for SongOwl independently from the iOS system setting.<br>• SongOwl supports tagged lyrics. When not present, the lyrics pane now provides an option to switch over to Apple Music.<br>• Fixed bug causing some users to not see their playlists in the \"Add to Playlist\" contextual menu.<br>• Fixed some threading issues causing the odd crash.<br>• Misc. other little bug fixes and visual glitches."},{"version_id":"834921929","version_name":"1.0.4","version_date":"2020-03-02 23:39:40.000 +0800","version_description":"• NEW&nbsp;Action Menu: press the view summary (track count and duration under the 5 action buttons) to access Add to Library, Add to Playlist and New Path actions.<br>• NEW Shortcuts: Play or shuffle only your loved songs with new Siri shortcuts and URL scheme options.<br>• Fixed the Now Playing dismissal gesture in iOS 13.4!<br>• Crashlytics roundup."},{"version_id":"834963221","version_name":"1.0.5","version_date":"2020-03-04 16:19:02.000 +0800","version_description":"Removed some substring parsing from search. Substring parsing breaks apart your query, so you could search \"friends ballad\", and get \"The Ballad of Me and My Friends.\" I applied this to all evaluated fields which, in retrospect, was foolish. It could add a ton of \"false positives\" that maybe included a common term like \"the\" in an unrelated field. Stupid, right? Good thing I don't code medical equipment. Anyway, substring parsing now applies (much more sensibly) ONLY to song names; so those confusing false positives should no longer appear."},{"version_id":"835010608","version_name":"1.0.6","version_date":"2020-03-07 00:01:03.000 +0800","version_description":"What are y'all searching for? This update covers off a few errors caused by people apparently searching for nil.<br><br>Also want to say a big hi to all the Chinese users who have tried SongOwl in the last 48hrs or so. Stay tuned – translation is coming next week!"},{"version_id":"835044592","version_name":"1.0.7","version_date":"2020-03-10 17:36:33.000 +0800","version_description":"• NEW localization: Simplified Chinese<br><br>欢迎来到SongOwl！"},{"version_id":"835215112","version_name":"1.0.8","version_date":"2020-03-25 11:23:15.000 +0800","version_description":"Nothing major, just some minor bug fixes. Stay safe, everybody."},{"version_id":"835442398","version_name":"1.1","version_date":"2020-04-07 18:36:49.000 +0800","version_description":"It’s our first minor update. That means new features! #noice<br><br>Probably the number one comment I get is regarding the playback queue. Where is it??? Unfortunately, iOS API limitations do not provide a method for accessing the system player queue and current workarounds are severely limited.<br><br>SongOwl 1.1 now includes the Next Best Thing™.<br><br>Queue Builder is a new tool for creating and manipulating a collection of tracks. Simply swipe on a song or group of songs to add them to your Queue Builder list. Tap the QB Touch Bar to access your list. In the Queue Builder pane you can:<br><br>• Play your queue. Once you begin playback, your queue will no longer be available in Queue Builder, but you can still add tracks using the Play Next and Play Later controls.<br><br>• Randomize your songs (as many times as you want)<br><br>• Apply any of the standard sort options.<br><br>• Drag and drop to create your own custom order.<br><br>• “Lock” songs to the top of the list. Locked songs will not be re-sorted or randomized.<br><br>• Swipe to delete songs.<br><br>• Made something perfect? Turn it into a playlist.<br><br>• Clear your Queue Builder list and start over.<br><br>I recognize that real-time access to the playback queue is still the gold standard and will continue efforts to realize it. In the mean time, I hope Queue Builder helps restore and expand on that functionality.<br><br>Please stay safe!"},{"version_id":"835505340","version_name":"1.1.1","version_date":"2020-04-13 12:24:25.000 +0800","version_description":"• Stability and animation improvements.<br>•&nbsp;Stay tuned, though! There are plans for further enhancements to Paths.<br><br>Please consider supporting future SongOwl development by leaving an App Store review, in-app tip, or by spreading the word! Thank you."},{"version_id":"835602779","version_name":"1.1.2","version_date":"2020-04-19 16:51:16.000 +0800","version_description":"SongOwl development is like a west coast party, as Coolio taught us, because SongOwl development don't stop.<br><br>This update introduces a subtle but powerful addition to paths. You can now set path-specific settings:<br>• Show/Hide cloud items<br>• Show/Hide explicit items<br>• Long awaited, limit paths to compilations-only!<br><br>I've also made some ASO improvements, so hopefully more people will find about SongOwl. You can help with that! Please consider leaving an App Store review, and/or spreading the word on social media. Thanks in advance :)"},{"version_id":"836408100","version_name":"1.1.3","version_date":"2020-06-16 11:59:56.000 +0800","version_description":"A long overdue update including a couple little tweaks:<br><br>• The \"Year\" sort option has been replaced with a smarter \"Release Date\" option. This will take full release dates into account (when available), and default to \"year\" when release dates aren't tagged.<br><br>• Some miscellaneous bug fixes, including one that apparently allowed the odd podcast to sneak in.<br><br>• I'm aware of the issues some users have reported regarding unusual behavior with the \"repeat\" playback setting. I believe the root of this issue is small changes to the functionality at the iOS level itself. I'm collecting info to determine what might have changed and how to address it. If you notice a repeatable pattern, please let me know!"}]