[{"version_id":"835434265","version_name":"1.8.1","version_date":"2020-04-09 21:26:07.000 +0800","version_description":"- Added ability to sort episode numbers in reverse for VOD series\n- Fixed issue with EPG not working for some portals"},{"version_id":"835558466","version_name":"1.9.0","version_date":"2020-04-16 05:27:46.000 +0800","version_description":"- Added ability to search and display subtitles for VOD"},{"version_id":"836809136","version_name":"1.16.2","version_date":"2020-07-14 12:36:06.000 +0800","version_description":"- Added rating in VOD detail view"},{"version_id":"837244385","version_name":"1.16.3","version_date":"2020-08-07 08:06:12.000 +0800","version_description":"- Added option to cast to TV (May not work with all providers. Requires VLC app to be installed and a Chromecast.)\n- Fixed an issue when connecting to some portals"},{"version_id":"839127638","version_name":"1.19.1","version_date":"2020-11-15 05:51:07.000 +0800","version_description":"- Added combined lists for favorites and channels from all profiles in a profile group. Select the Live TV option in the first page of a profile group to access the lists.\n- Added ability to search and play channels in multiple profiles from the same list\n- Fixed bug with sorting of newly created profiles\n- Fixed bug where some VOD content won't display the episodes in the series"},{"version_id":"839439338","version_name":"1.19.2","version_date":"2020-12-02 14:25:14.000 +0800","version_description":"- Added ability to see video and audio details from player controls. Tap more button -> Media Details.\n- Added ability to set an EPG offset for a profile. Tap more button next to a profile -> Preferences.\n- Added an indicator in the player when video is loading\n- Updated player V1 library. Please report any issues via the app.\n- Fixed an issue with connecting to some portals\n- Fixed an issue with some streams not working"},{"version_id":"840253256","version_name":"1.20.1","version_date":"2021-01-29 21:17:06.000 +0800","version_description":"- Added Xtream Codes support with Live TV and VOD\n- Fixed issue with TV Series not working for some portals"},{"version_id":"840778741","version_name":"1.20.6","version_date":"2021-03-08 08:31:25.000 +0800","version_description":"- Added TV series categories for Xtream Codes\n- Added ability to choose preferred stream format for Xtream Codes"},{"version_id":"840877383","version_name":"1.20.8","version_date":"2021-03-16 07:01:33.000 +0800","version_description":"- Added catch up for Xtream Codes (dependent on provider)\n- Added filtering of channels with catch up\n- Added sorting and hiding of TV series categories"},{"version_id":"841071280","version_name":"1.20.10","version_date":"2021-03-28 01:18:51.000 +0800","version_description":"- Added ability to favorite TV Series for Xtream Codes and some Stalker portals"},{"version_id":"841696903","version_name":"1.21.2","version_date":"2021-04-22 07:13:46.000 +0800","version_description":"- Added remote M3U playlist support with Live TV &amp; EPG (dependent on playlist)\n- Added All genre in Live TV for Xtream Codes\n- Added All category in VOD for Xtream Codes\n- Added grouping of TV Series by season for Xtream Codes\n- Fixed an issue with connecting to some Stalker portals\n- Fixed an issue with EPG/catch up not working for some Xtream Codes portals"},{"version_id":"842406574","version_name":"1.21.6","version_date":"2021-05-29 06:45:51.000 +0800","version_description":"- Fixed an issue with connecting to some Stalker portals\n- Fixed an issue with Radio not working for some Stalker portals\n- Fixed an issue with audio not playing in background for player 3\n- Fixed an issue with seeking not working for some videos on player 2\n- Fixed an occasional crash in player 1"},{"version_id":"844444607","version_name":"1.21.16","version_date":"2021-10-03 23:05:28.000 +0800","version_description":"- Added VOD & catch up title in player controls\n- Added volume control in player - pan vertically on the right edge\n- Added displaying of number of items in VOD & TV series categories\n- Added ability to use subtitles from provider for Stalker portals\n- Added ability to clear cached data for all profiles - access from app preferences\n- Fixed an issue with connecting to some Xtream Codes portals\n- Fixed an issue with subtitles screen opening behind video when in fullscreen\n- Potentially fixed an issue with stream stopping after some time when opening in VLC"}]