[{"version_id":"835037177","version_name":"4.2","version_date":"2020-03-09 17:43:36.000 +0800","version_description":"- Fixbug some bugs UI on iPad <br>- Continue optimize effect for main character"},{"version_id":"835212280","version_name":"4.5","version_date":"2020-03-27 18:58:00.000 +0800","version_description":"- Add new backgrounds in game play screen<br>- The game has been localized in 2 languages: English, Vietnamese<br>- Fix bug \"Can't login google account to save or restore data\"<br>- Fix bug \"Can't purchased some characters\"<br>- Optimize game performance<br>- Fix some minor bugs<br>Our development team is continually improving the game to deliver the best mobile entertainment. Thank you for playing and we hope you continue to support future updates of Stickman Warriors - Super Dragon Shadow Fight."},{"version_id":"835644312","version_name":"4.8","version_date":"2020-04-22 09:06:49.000 +0800","version_description":"- Add new 4 maps: \"Saya Planet\", \"The Moon\", \"Deadly Stage\" and \"God-Like\" in the Story mode<br>- Add 12 new characters<br>- Optimize game performance<br>- Fix some minor bugs<br>Our development team is continually improving the game to deliver the best mobile entertainment. Thank you for playing and we hope you continue to support future updates of Stickman Warriors - Super Dragon Shadow Fight."},{"version_id":"835659134","version_name":"5.2","version_date":"2020-04-24 17:45:42.000 +0800","version_description":"- Fix bug can't buy characters by golds or diamonds.<br>- Fix Culler Golden's unability to use his first skill.<br>- Fix the game crash after completed the tutorial.<br>- Add more characters's gift codes.<br>- Fix some minor bugs.<br>- Optimize game performance.<br>Our development team is continually improving the game to deliver the best mobile entertainment. Thank you for playing and we hope you continue to support future updates of Stickman Warriors - Super Dragon Shadow Fight."},{"version_id":"836139904","version_name":"5.5","version_date":"","version_description":""},{"version_id":"836773004","version_name":"5.6","version_date":"2020-07-09 20:56:02.000 +0800","version_description":"New in Version 5.6!<br>- Add 3 new maps: \"Fioros Plain\", \"Red Volcano\" and \"Alantia\" in the Story mode<br>- Add 3 new characters: \"Torro\", \"Baby Geta\" and \"Migra\"<br>- Optimize game performance<br>- Fix some minor bugs<br>Our development team is continually improving the game to deliver the best mobile entertainment. Thank you for playing and we hope you continue to support future updates of Stickman Warriors - Super Dragon Shadow Fight"},{"version_id":"836839541","version_name":"5.7","version_date":"2020-07-14 13:29:36.000 +0800","version_description":"New in Version 5.7!<br>- Add 3 new maps: \"Fioros Plain\", \"Red Volcano\" and \"Alantia\" in the Story mode<br>- Add 3 new characters: \"Torro\", \"Baby Geta\" and \"Migra\"<br>- Optimize game performance<br>- Fix some minor bugs<br>Our development team is continually improving the game to deliver the best mobile entertainment. Thank you for playing and we hope you continue to support future updates of Stickman Warriors - Super Dragon Shadow Fight"},{"version_id":"836996430","version_name":"5.8","version_date":"2020-07-24 22:25:25.000 +0800","version_description":"New in Version 5.8!<br>- Fix some minor bugs<br>- Optimize game performance<br>Our development team is continually improving the game to deliver the best mobile entertainment. Thank you for playing and we hope you continue to support future updates of Stickman Warriors - Super Dragon Shadow Fight"},{"version_id":"837058332","version_name":"6.0","version_date":"2020-08-13 17:00:00.000 +0800","version_description":"- Added function save and restore data<br>- Fix some minor bugs<br>- Optimize game performance<br>Our development team is continually improving the game to deliver the best mobile entertainment. Thank you for playing and we hope you continue to support future updates of Stickman Warriors - Super Dragon Shadow Fight"},{"version_id":"837636016","version_name":"6.1","version_date":"2020-09-03 23:04:32.000 +0800","version_description":"- Fix not showing dialogue in Story \"Caligo Town\" bug<br>- Fix some minor bugs<br>- Optimize game performance<br>Our development team is continually improving the game to deliver the best mobile entertainment. Thank you for playing and we hope you continue to support future updates of Stickman Warriors Fight - Super Dragon Shadow Fight"},{"version_id":"839291825","version_name":"6.2","version_date":"2020-11-21 02:47:03.000 +0800","version_description":"- Add PvP mode. Let's fight and win the 1st place on the worldwide rankings<br>- Fix some minor bugs<br>- Optimize game performance<br>Our development team is continually improving the game to deliver the best mobile entertainment. Thank you for playing and we hope you continue to support future updates of Stickman Warriors Fight - Super Dragon Shadow Fight"},{"version_id":"839500931","version_name":"6.5","version_date":"2020-12-04 22:25:30.000 +0800","version_description":"- Fix some minor bugs<br>- Optimize game performance<br>Our development team is continually improving the game to deliver the best mobile entertainment. Thank you for playing and we hope you continue to support future updates of Stickman Warriors Fight - Super Dragon Shadow Fight."},{"version_id":"839566166","version_name":"6.7","version_date":"2020-12-09 18:35:09.000 +0800","version_description":"- Fix the unability to play training mode<br>- Optimize game performance<br>Our development team is continually improving the game to deliver the best mobile entertainment. Thank you for playing and we hope you continue to support future updates of Stickman Warriors Fight - Super Dragon Shadow Fight"},{"version_id":"839703823","version_name":"6.9","version_date":"2020-12-17 19:33:28.000 +0800","version_description":"- Add skin Christmas for characters : GOKI Christmas and GOKAN Christmas <br>- Optimize game performance<br>Our development team is continually improving the game to deliver the best mobile entertainment. Thank you for playing and we hope you continue to support future updates of Stickman Warriors Fight - Super Dragon Shadow Fight"},{"version_id":"840741125","version_name":"7.5","version_date":"","version_description":""},{"version_id":"842163143","version_name":"8.0","version_date":"","version_description":""},{"version_id":"842644628","version_name":"8.2","version_date":"2021-06-14 06:04:07.000 +0800","version_description":"- Fix minor bugs<br>- Optimize game performance<br>Our development team is continually improving the game to deliver the best mobile entertainment. Thank you for playing and we hope you continue to support future updates of Stickman Warriors Fight - Super Dragon Shadow Fight."},{"version_id":"843057306","version_name":"8.4","version_date":"2021-07-12 16:18:10.000 +0800","version_description":"- Fix minor bugs<br>- Optimize game performance<br>Our development team is continually improving the game to deliver the best mobile entertainment. Thank you for playing and we hope you continue to support future updates of Stickman Warriors Fight - Super Dragon Shadow Fight."}]