[{"version_id":"835906627","version_name":"1.3.0","version_date":"2020-05-12 12:58:13.000 +0800","version_description":"iPad support and smoother upgrade experience you said? Done and Done.<br><br>We wanted to put out a full iPad specific design but our customers wanted iPad support now so we listened.  This version now includes basic support for the iPad.  Later this year you can expect a more polished design update for the iPad, but feel free to study on your iPad now!<br><br>We improved the restore purchase functionality to provide a better experience for users that made purchases on our legacy apps. Previously this only looked for purchases for THIS app in the App Store. Sorry for the confusion, and thanks for letting us know you were having an issue. We will ALWAYS honor your purchases. As always, if you have issues, please visit the Help Center in Settings and we will definitely make it right.<br><br>Keep studying hard and we’ll keep the app working hard for you.<br>#itsyourturn"},{"version_id":"836147560","version_name":"1.4.0","version_date":"2020-06-01 20:58:43.000 +0800","version_description":"Quizzes can now be resumed!<br><br>Life is busy, especially when you juggle work and studying. Sometimes you can't get through a quiz before an interruption. This update keeps the state of your quiz, even if the app is closed. The next time you start the app and select a new quiz it will prompt you to resume your prior quiz.<br><br>We fixed a couple issues as well, including the bug where Question of the Day notification prompts were using the LAST day's text. Sorry about that!<br><br>Keep studying hard and we’ll keep the app working hard for you.<br>#itsyourturn"},{"version_id":"836295022","version_name":"1.4.1","version_date":"2020-06-08 14:26:35.000 +0800","version_description":"We squashed some bugs!<br><br>We added quiz resume capabilities to the last update, but it included a few bugs.  If you were in the midst of a Question of the Day and the app closed, when you reopened it and tried to start a new quiz, the app would crash!  Really sorry we missed that in our testing, but this version fixes that.<br><br>We also noticed that in rare cases when people were using the Timed Quiz feature, letting the time run out and then closing and reopening the app would result in a crash.  We fixed that as well.<br><br>Thanks for your patience!  Keep studying hard and we’ll keep the app working hard for you.<br>#itsyourturnnow"},{"version_id":"836439505","version_name":"1.5.0","version_date":"2020-06-29 15:30:12.000 +0800","version_description":"Voice control in 3...2...1!<br><br>We added Siri Shortcut support for Quick 10 and Question of the Day activities.  You can now setup voice cues in the Settings tab and enable them using Siri anytime.  Trigger the shortcut with a simple command like 'Take a quick 10' and Siri will automatically open the application and start the Quick 10 quiz activity.<br><br>We updated our results view for quizzes giving it a fresh new color scheme that matches your success. It also provides more detail on the time you spent on the quiz and how that could relate<br><br>Keep studying hard and we’ll keep the app working hard for you.<br>#itsyourturnnow"},{"version_id":"836673009","version_name":"1.6.0","version_date":"2020-07-06 15:28:01.000 +0800","version_description":"Accessibility Improvements<br><br>We heard from some of our sightless users that we could do a better job of making the application accessible to them.  This update includes an improved use of the iOS Voiceover technology to ensure it is far more accessible.  We will continue to improve this functionality in the months ahead.<br><br>Your feedback is essential to our success.  Please continue to make use of the in app chat feature to let us know what you love about the app and what we can improve.<br><br>Keep studying hard and we’ll keep the app working hard for you.<br>#itsyourturnnow"},{"version_id":"836844048","version_name":"1.6.1","version_date":"2020-08-06 16:56:37.000 +0800","version_description":"General Touch Ups<br><br>We refined the application this month to resolve several rare crash bugs, along with a couple of polish points. We also tracked down a few issues related to exam content/references being cut off in some instances. Lastly, we fixed the notifications setup screen, ensuring that it was properly hidden/visible when appropriate and that random HTML characters didn’t make it into the notification text body.<br><br>We further enhanced our accessibility for sightless users, combining several voice prompts for related data where appropriate. We also expanded some of the screen level prompts to ensure users know the goals and options available on a particular screen.<br><br>Keep studying hard, and we’ll keep the app working hard for you.<br>#itsyourturnnow"},{"version_id":"837419429","version_name":"1.6.2","version_date":"2020-08-24 12:35:03.000 +0800","version_description":"Landscape for iPad<br><br>Let's be honest, videos shouldn't be taken in portrait mode and neither should tests on iPads.  Although we didn't realize this at first, our great users let us know what was up.  As a result, we now support landscape mode for iPad users.<br><br>Keep studying hard and we’ll keep the app working hard for you.<br>#itsyourturnnow"},{"version_id":"837494264","version_name":"1.7.0","version_date":"2020-09-14 13:34:26.000 +0800","version_description":"Enhance!<br><br>We provide high quality content for you to study on the go, but sometimes that content is a little small in the mobile environment.  This update adds the ability to tap on an image and zoom in for a closer look.  This can be an image in any part of the question.  Go ahead and give it a try.<br><br>We also heard some of you really like to get in quickly and get going.  We try to synchronize your data with our servers on startup and we blocked your ability to use the app until that was done.  This update removes the block and allows you to start taking another quiz or just review before we are done with our housekeeping.<br><br>Keep studying hard and we’ll keep the app working hard for you.<br>#itsyourturnnow"},{"version_id":"838085486","version_name":"1.7.2","version_date":"2020-10-07 14:32:05.000 +0800","version_description":"QotD notification fixed and more.<br><br>Some users' Question of the Day notifications were including text from a different day.  This update ensures that the question shown in the notification is that day's Question of the Day.<br><br>We also resolved an issue with purchases that were failing but the spinner was not hiding.  Those situations will now show you why the purchase failed and the app will not be stuck with the spinner up.<br><br>Keep studying hard and we’ll keep the app working hard for you.<br>#itsyourturnnow"},{"version_id":"838435282","version_name":"1.8.0","version_date":"2020-11-02 15:55:29.000 +0800","version_description":"More Responsive.<br><br>Some users with slower internet connections had trouble when the question included large images.  This update now downloades those images in the background and allows the user to start reading the quiz question prior to the image being ready.<br><br>This update also includes some other minor bug fixes, but those are boring... so feel free to continue studying.<br><br>Keep studying hard and we’ll keep the app working hard for you.<br>#itsyourturnnow"},{"version_id":"838522391","version_name":"1.8.1","version_date":"2020-11-05 17:27:50.000 +0800","version_description":"More Responsive pt2.<br><br>Some users with slower internet connections had trouble when the question included large images.  This update now downloades those images in the background and allows the user to start reading the quiz question prior to the image being ready.<br><br>This update also includes some other minor bug fixes, but those are boring... so feel free to continue studying.<br><br>Keep studying hard and we’ll keep the app working hard for you.<br>#itsyourturnnow"},{"version_id":"839230608","version_name":"1.8.2","version_date":"2020-11-18 12:27:37.000 +0800","version_description":"Share The Question of the Day!<br><br>Studying for a big exam is a journey and taking a few quizzes each day helps you stay sharp.  Our Question of the Day is a bite sized way to maintain that habit and now you can share it with friends.  Just tap the share button in the lower right of the Question View on your QotD and send / post it for friends to review.  Your friends don't need an account or the app!<br><br>We also addressed an issue that some users were experiencing regarding viewing of the answer explanations.  Thanks for everyone who let us know about this and please reach out if you are still having trouble.<br><br>Keep studying hard and we’ll keep the app working hard for you.<br>#itsyourturnnow"},{"version_id":"839562815","version_name":"2.0.1","version_date":"2020-12-09 19:08:42.000 +0800","version_description":"Second chances and who's on first??<br><br>Our prior update wasn't filling out exam version information correctly, instead showing placeholder data we use in testing.  This meant it was hard for people to choose the correct content for their specific exam needs.  We resolved that bug and it is now very clear which version is which when choosing exam versions.<br><br>We also fixed a bug in our 'show at the end' style of exam prep.  We were accidentally keeping track of all of your choices and not selecting just your 'final answer' to the question.  This made it impossible to answer a question correctly if you changed your mind before finishing the quiz.<br><br>Our most recent update was pretty large and introduced a few issues as a result.  Apologies for missing those during our testing.  Thanks for your patience and keep the feedback coming!<br><br>Keep studying hard and we’ll keep the app working hard for you.<br>#itsyourturnnow"},{"version_id":"839631954","version_name":"2.0.2","version_date":"2020-12-14 01:37:34.000 +0800","version_description":"100% Club bug fix<br><br>For those of our members that have completed the entire bank of questions in a particular exam, the Quick 10 and Timed quiz modes were generating new quizzes with repeated questions.  This update fixes that issue and ensures that a quiz prioritizes questions in chronological order.<br><br>Keep studying hard and we’ll keep the app working hard for you.<br>#itsyourturnnow"},{"version_id":"840009920","version_name":"2.0.3","version_date":"2021-01-27 22:02:15.000 +0800","version_description":"Minor bug fixes<br><br>2020 was a big year for the iOS application with a ton of new functionality and a great new design being rolled out.  We rested over the holidays and are now hard at work on future improvements and polish.  In the mean time, this update brings a batch of minor bug fixes and layout tweaks.<br><br>Keep studying hard and we’ll keep the app working hard for you.<br>#itsyourturnnow"},{"version_id":"840445113","version_name":"2.1.1","version_date":"2021-02-17 17:43:35.000 +0800","version_description":"How is the community doing?<br><br>2020 was a tough year for group studying.&nbsp;Our goal in 2021 is to add features to our platform that help members study more effectively together, regardless of their location.&nbsp;We don’t want to say too much more, but in the short term, this update provides the ‘community score’ for each question when you are reviewing it.&nbsp;This means you can see on a per question basis just how hard questions are and how other people are answering.&nbsp;To view a breakdown of how the community answered and the percentage of people who answered correctly just press the community icon, 2 people, next to the flag icon in the lower tray area. This functionality will stay on as you review questions until you press the icon again.<br><br>Keep studying hard and we’ll keep the app working hard for you.<br>#itsyourturnnow"}]