[{"version_id":"836723159","version_name":"1.0.1","version_date":"2020-07-09 18:16:55.000 +0800","version_description":"Thank you for enjoying Phantom Rose. 1.0.1 is a minor patch addressing a rare but critical bug<br><br>◆ Fixes<br>- Rare game freeze issue that may occur during battle fixed"},{"version_id":"836808132","version_name":"1.0.2","version_date":"2020-07-12 22:08:33.000 +0800","version_description":"Thank you for enjoying Phantom Rose. 1.0.2 is a minor patch addressing several bugs found after release. There's still much to improve and things I'd like to add but I'd like to address these bugs first.<br><br>◆ Fixes<br>- Bug where you can't initiate battle after setting cards on field, turn game off, and resume<br>- Bug where player rose level is stuck due to NaN EXP<br>- Bug where player can't scroll when reading Diary in iOS11, 12<br><br>◆ Updates<br>- Crysalis duration for Titan and Menacing Orb reduce to 3<br>- Berserk skill's attack up amount reduce to 8"},{"version_id":"836847230","version_name":"1.0.3","version_date":"2020-07-15 19:59:12.000 +0800","version_description":"Thank you for enjoying Phantom Rose. 1.0.3 is a minor patch addressing several bugs found after release. It's a small patch, it'll download and install quickly so I highly recommend installing it!<br><br>◆ Updates<br>- Game will play sound when headphone is connected even when device is under silent mode. This seems like preferred behavior for many players as the previous behavior was often reported as a bug. This can be changed in settings<br><br>◆ Fixes<br>- Bug where game freezes when you reach to phase 6 during battle with Reaper<br>- Rare bug where card deck might appear in camp and prevent progress<br>- UI bug with risky mode's diamond level selector<br>- Rare bug where player may get stuck when trying to receive card reward"},{"version_id":"836971416","version_name":"1.1.0","version_date":"2020-07-23 21:32:30.000 +0800","version_description":"Thank you for enjoying Phantom Rose. 1.1.0 is a content update with several bug fixes. Thank you!<br><br>◆ Updates<br>- Diamond 4 &amp; 5 adventure levels have been added. Diamond 3 needs to be cleared again to access Diamond 4<br>- Trial options for Diamond 3 have been adjusted<br>- 2 new diary documents have been added<br>- 2 new Diamond skins have been added<br>- 2 new character upgrades have been added<br>- Upgrade for resetting card cooldown after upgrade changed to reducing cooldown by 2<br>- Injury debuff damage increased to 3<br><br>◆ Fixes<br>- Assassinate card not triggering Bleed when player has Vampiric Fangs, Chase, Recovery, Hardened buff status<br>- Blood Spark's incorrect description when upgraded (does not inflict 2 Bleed)<br>- Unable to activate camp items at camp after defeating crown phantom<br>- Bug where cutscene video cannot be muted in iPads<br>- Rare bug where player may get stuck in an infinite loop of phantom battles<br>- Bug where ambush upgrade was not working<br>- Few text bugs on the UI"},{"version_id":"836989083","version_name":"1.1.1","version_date":"2020-07-24 15:01:26.000 +0800","version_description":"Thank you for enjoying Phantom Rose. 1.1.1 is a minor patch to fix a critical issue found after release of 1.1.0. Thank you for playing!<br><br>◆ Fixes<br>- Risky mode not working for diamond level"},{"version_id":"837052248","version_name":"1.1.2","version_date":"2020-08-03 21:50:35.000 +0800","version_description":"Thank you for enjoying Phantom Rose. 1.1.2 is an update with several adjustment and bug fixes. Thank you!<br><br>Updates:<br>- Design for list of upgrades has been changed<br>- Execution's fear status increased to 3<br>- Focus Pierce's damage increased to 8 when opponent has Fear status<br>- Clutch Barrier and Coil skills have been modified<br>- Bloody Fangs will inflict 2 Bleeding only when card user has no Bloodlust Status<br>- When upgrade is skipped in Shrine of Blade, upgrade cannot be accessed again<br>- Opening mini treasure box at camp can also clear \"Treasure Chest\" quick mission<br>- Barrier now has 99999 limit<br><br>Fixes:<br>- Unable to zoom into skin illustration<br>- Sharpened triggering bleed on magic cards<br>- Guard Assault and Deep Slash not working against Clutch Barrier and Coil status<br>- heat sword increasing buff status by 4 when vampiric fangs status is active<br>- scramble skill overwriting effect of overdrive card<br>- non-magic card sometimes being added for three magic card cooldown reduction upgrade<br>- Pierce removing opponent buff when opponent has Injury or Coil<br>- Feast not being able to inflict Paralysis to opponent<br>- Player receiving full heal when opponent phantom escapes from battle<br>- several translation issues"},{"version_id":"837403711","version_name":"1.2.0","version_date":"2020-09-23 18:50:49.000 +0800","version_description":"Thank you for enjoying Phantom Rose. 1.2.0 adds new cards, new skins, new game mode and more!<br><br>### Updates<br>- New Luxury skin, Neon Reina has been added<br>- New Premium skin Summer Reina has been added<br>- New Ice Card Pack with 8 new cards has been added<br>- New game mode, Arcade has been added. Clearing Gold adventure &amp; achieving level 7 will unlock the mode<br>- New collectible Weapon skins have been added<br>- New Banner skins have been added for daily rewards<br>- New 2 diaries added<br><br>### Fixes<br>- game music not playing in iOS14<br>- issue of character upgrades being applied in tutorial<br>- issue of older version of the game being able to cloud sync newer version data"},{"version_id":"837949537","version_name":"1.2.1","version_date":"2020-09-27 20:26:42.000 +0800","version_description":"Thank you for enjoying Phantom Rose. 1.2.1 is a small patch that fixes bugs found after release of 1.2<br><br>### Fixes<br>- Bug with reducing max HP in arcade reducing player's HP down to 0 and also affecting healing at camp or shrines. The option has been changed.<br>- Phantom gallery not properly displaying phantoms.<br>- Cost of heal being abnormally high at end of stage in arcade<br>- Bug with sound being muted after ambushing a crown phantom in arcade<br>- Typography issues"},{"version_id":"838105167","version_name":"1.2.2","version_date":"2020-10-08 22:58:08.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.2.2 is a small content and bug fix update.<br><br>### Updates<br>- New Diamond Level 6, 7 adventure<br>- New challenge and rewards for clearing Diamond 4, 5, 6, 7<br>- New Gold and Diamond upgrades<br>- Card type now visible in card descriptions<br>- Extra 20HP recovered when retrying battle<br><br>### Fixes<br>- Visual bug with weapon skin on items view<br>- Crown Phantom daily quick mission not working in arcade<br>- Rare issue where skin selector may not work after setting skin in Arcade<br>- Rare issue where unlocked Diamond level may get locked again"},{"version_id":"838158992","version_name":"1.2.3","version_date":"2020-10-14 20:24:12.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.2.3 is a small but major optimization update.<br><br>### Updates<br>- App's download size has been significantly reduced <br>- Visual optimization for smaller devices"},{"version_id":"838461794","version_name":"1.2.4","version_date":"2020-11-21 21:58:22.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.2.4 is a small bug fix update.<br><br>### Fixes<br>- Bug where card description sometimes pop up when placing card on field<br>- Rare bug where game may freeze after card upgrade<br>- Bug where characters sometimes appear too small in iPhone 12 Mini"},{"version_id":"839457037","version_name":"1.2.5","version_date":"2020-12-04 21:02:31.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.2.5 is a small bug fix update.<br><br>### Fixes<br>- Bug game may freeze after clearing arcade<br>- Bug where audio sometimes won't play when resuming game"},{"version_id":"839748559","version_name":"1.2.7","version_date":"2020-12-30 19:16:09.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.2.7 is a small patch to address bug found after release.<br><br>### Fixes<br>- Bug where tapping another card while dissolving card will dissolve the wrong card<br>- Bug where there was no sound when tapping on cards in Ariel's shop<br>- Minor translation fixes"},{"version_id":"839972011","version_name":"1.2.8","version_date":"2021-01-11 03:41:01.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.2.8 is a small patch to improve app optimization<br><br>### Fixes<br>- Optimized battle system to reduce likelihood of optimization bugs from arising on older devices<br>- Fix translation issues for character upgrades<br>- Fix several art assets"},{"version_id":"840049067","version_name":"1.2.9","version_date":"2021-01-18 09:08:18.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.2.9 is a small patch to improve the app <br><br>### Fixes<br>- Fixed a bug where using Perfume too early in battle will lock the game<br>- Fixed a bug where ad setting was not being saved after restarting app"},{"version_id":"840150525","version_name":"1.2.10","version_date":"2021-01-22 19:22:24.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.2.10 is a small patch to improve the app <br><br>### Fixes<br>- Fixed a bug where game may lock when deck has less than 8 cards in stage 1<br>- Fixed a bug where sometimes enemy cards are not clickable<br>- Translation edits"},{"version_id":"840180680","version_name":"1.2.11","version_date":"2021-01-25 08:57:47.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.2.11 is a hot fix to improve the app <br><br>### Fixes<br>- Fixed a bug where game may lock when all cards are on cooldown<br>- Fixed a bug where item can be activated multiple times when tapped quickly<br>- Translation edits"},{"version_id":"840528285","version_name":"1.3.0","version_date":"2021-02-24 21:30:42.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.3.0 is a third major content update.<br><br>### NEW<br>- New Luxury skin, Cat Reinya has been added<br>- New Premium skin Student Reina has been added<br>- New Booster Card Pack with 8 new cards has been added<br>- New game mode, Custom game has been added. Clearing Diamond 1 adventure &amp; achieving player level 9 will unlock the mode<br>- New collectible Weapon skins, \"Solar series\" have been added<br>- New 2 diaries added<br>- New Diamond level 8, 9 have been added<br>- New achievements for Diamond level 8, 9 have been added<br>- New upgrades for Diamond shards and Ruby shards have been added<br><br>### Changes<br>- Arcade's reward expanded to 5th stage<br>- Breaker card's attack power increased to 4. Heal amount is now equal to it's attack power<br>- Assassinate will no longer inflict Bleed<br>- Fury will reset cooldown of a random card in deck<br>- Clutch Barrier and Coil's duration increased to 5<br>- Spark Blade's attack power will increase by 6<br>- Blood Spark will not overwrite existing debuff<br>- Icy will now inflict damage on both HP and Barrier<br>- Ice Armor will now inflict 3 counter damage but inflict only 1 Icy status<br>- When battle is retried, any modifiers on card's strength will be reset<br>- Crystal Pierce will increase existing Icy status by 1<br>- Flame Pierce's condtion to activate removed<br>- Solo Strike will now inflict 9 damage if it's the only attack card<br><br>### Fixes<br>- Bug where Shield Strike's damage ignores Buddy Shield fixed<br>- Upgrade button not being toggleable fixed"},{"version_id":"840665203","version_name":"1.3.1","version_date":"2021-02-28 17:46:09.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.3.1 is a small patch fixing bugs found after 1.3 update<br><br>### Changes<br>- able to view max hp at camps or shrines<br><br>### Fixes<br>- Skin carousel's visual bug on iPads fixed<br>- Wrong trial option being turned off in custom mode fixed<br>- Cursed Fang and Cleanse upgrade bug fixed<br>- Energy Shield increasing Icy status by 2 fixed<br>- Star Blade and Star Pierce reducing Buddy Shield by 2 fixed"},{"version_id":"840777889","version_name":"1.3.2","version_date":"2021-03-16 00:58:24.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.3.2 is a small patch fixing bugs found after 1.3 update<br><br>### Changes<br>- Minium 10 heal is guaranteed at camp or shrines in adventure even if max hp is too low<br>- Breaker's attack power reverted to 3<br><br>### Fixes<br>- promise shield not correctly working fixed<br>- aura slash and aura pierce not correctly working when used after chain strike fixed<br>- card price increase modifier not working fixed<br>- ui bug that occurs when hp becomes too great fixed"},{"version_id":"841277632","version_name":"1.3.3","version_date":"2021-04-11 04:55:38.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.3.3 is a small patch fixing bugs found<br><br>### Changes<br>- player can tap to dismiss card description if it blocks the UI during gameplay<br><br>### Fixes<br>- Risky mode not working in custom game fixed<br>- visual bug with breaker card when hp is full fixed<br>- visual bug with Lucia's hp bar fixed<br>- crystal pierce's sound effect bug fixed<br>- bug that may push player beyond last level of adventure fixed<br>- rare music bug that may occur at the intro cutscene fixed<br>- bug where video is not muted even when volume is 0 fixed<br>- rare visual bug during tutorial fixed"},{"version_id":"842392425","version_name":"1.3.4","version_date":"2021-05-31 23:43:29.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.3.4 is a small patch with bug fixes and updates.<br><br>### Changes<br>- Landscape mode optimized for iPads has been added<br><br>### Fixes<br>- Diaries order bug fixed<br>- Healing item activating Mana Link in Risky fixed<br>- Feast's double attack activating even when Vampiric Fang is removed fixed<br>- Bug when Fairy coin is used twice in camp, 2nd shop's refresh count not being reset, fixed<br>- Character skin bug with quick started game fixed<br>- Mana link not working in custom game fixed"},{"version_id":"842534811","version_name":"1.3.5","version_date":"2021-06-06 11:12:15.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.3.5 is a small patch with a bug fix<br><br>### Fix<br>- Character visual bug fix caused by the previous 1.3.4 update"},{"version_id":"842644555","version_name":"1.3.6","version_date":"2021-06-17 01:37:18.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.3.6 is a mini update.<br><br>### Changes<br>- Card upgrade system has been improved to offer two types of upgrades for appropriate cards<br>- Following cards have been modified:<br>-- Ignite<br>-- Flame Pierce<br>-- Hardened<br>-- Rush<br>-- Recovery<br>-- Venom<br>-- Close Combat"},{"version_id":"842760043","version_name":"1.3.7","version_date":"2021-06-22 01:46:07.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.3.7 is a small bug fix patch.<br><br>### Fixes<br>- Bug where several cards had Type B upgrades despite having no effect fixed<br>- Bug where flame pierce will sometimes reduce its own cooldown fixed<br>- These fixes will be automatically applied on a newly started Adventure or Arcade game"},{"version_id":"842764531","version_name":"1.3.8","version_date":"2021-06-23 21:08:27.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.3.8 is a small hot fix patch.<br><br>### Fixes<br>- Supplementary hotfix for a bug where magic card's duration will sometimes be reduced after an upgrade"},{"version_id":"842859959","version_name":"1.3.9","version_date":"2021-07-03 00:43:22.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.3.9 is a small bug fix patch.<br><br>### Fixes<br>- execution card's meaningless type B upgrade has been removed from UI<br>- vampiric fang's meaningless type B upgrade has been removed from UI<br>- bug where attacking an enemy with Zero Evade with a Sharpened status will always inflict Bleed has been fixed<br>- fixed small translation error in one of the upgrades"},{"version_id":"843147451","version_name":"1.3.10","version_date":"2021-07-19 21:53:48.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.3.10 is a small bug fix patch.<br><br>### Fixes<br>- bugs with item activation inbetween battle prevented<br>- bug with ariel's shop reroll fixed"},{"version_id":"843191568","version_name":"1.3.11","version_date":"2021-07-24 18:40:21.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.3.11 is a small bug fix patch.<br><br>### Fixes<br>- Promise Shield bug where sometimes it wasn't activating fixed<br>- Rare icon disappearing UI bug fixed<br>- bug with an arcade modifier fixed<br>- bug with Shield Strike not halving the card user's barrier when the attack is missed fixed"},{"version_id":"843341464","version_name":"1.3.12","version_date":"2021-07-30 18:18:22.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.3.12 is a small bug fix patch.<br><br>### Fixes<br>- Venom bug where debuff duration was not absorbed when Bless or Purification was used fixed<br>- Translation issue with certain skins fixed<br>- Rare tap bug on card dissolve menu fixed"},{"version_id":"843642304","version_name":"1.3.13","version_date":"2021-08-19 19:17:19.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.3.13 is a small bug fix patch.<br><br>### Fixes<br>- Fever not working on sensitive debuff fixed<br>- Default skin's preview screen bug fixed<br>- Translation bug fixed"},{"version_id":"843972320","version_name":"1.3.14","version_date":"2021-09-10 22:53:58.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.3.14 is a small patch.<br><br>### Changes<br>- Illustrations from the gallery can be shared or downloaded<br>- Purchased Card packs can be enabled or disabled via Cards menu in My Room<br><br>### Fixes<br>- Deepslash card's translation fixed<br>- Optimizations to prevent card tap bugs<br>- Rare bug of Sharpened card freezing the game fixed"},{"version_id":"844117639","version_name":"1.3.15","version_date":"2021-09-15 20:07:46.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.3.15 is a small patch.<br><br>### Fixes<br>- Visual glitch in gallery fixed<br>- Arcade mode tutorial visual glitch fixed<br>- Bug where playing adventure after an arcade may initiate the wrong adventure level fixed"},{"version_id":"844280328","version_name":"1.3.16","version_date":"2021-09-26 19:21:39.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.3.16 is a small but important patch.<br><br>### New<br>- drag gesture has been added for placing cards from deck to the field<br><br>### Fixes<br>- Minor bugs with iOS 15 fixed<br>- Bug with Breaker card where the card's skill wouldn't activate when HP is greater than max HP fixed<br>- Bug where Ariel's shop wouldn't initially load fixed"},{"version_id":"844435406","version_name":"1.3.17","version_date":"2021-10-02 21:49:33.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.3.17 is a small but important patch.<br><br>### Fixes<br>- Bug where Clutch Barrier and Coil didn't activate when attacked by Deep Slash fixed<br>- Audio glitch fixed<br>- Visual bugs fixed"},{"version_id":"844462539","version_name":"1.3.18","version_date":"2021-10-04 17:24:32.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.3.18 is a hotfix patch to address a bug uncaught in 1.3.17<br><br>### Fixes<br>- Coil card bug incorrectly activating when unattacked fixed"},{"version_id":"844609243","version_name":"1.3.19","version_date":"2021-10-11 23:28:56.000 +0800","version_description":"Thank you for enjoying Phantom Rose! 1.3.19 is a patch to address bugs<br><br>### Fixes<br>- Clutch Barrier card bug incorrectly activating when unattacked fixed<br>- Audio bug fixes"}]