[{"version_id":"836023765","version_name":"1.5","version_date":"2020-05-29 16:01:42.000 +0800","version_description":"Big update!<br>In this update we have added more free brushes! And new brushes will appear more often.<br>We also added new cool Premium brushes and the ability to subscribe. Subscription gives access to all Premium brushes and also disables ads!<br><br>And another nice bonus is the “What to draw” function, which will give you a hint to use your imagination if you don’t have any inspiration right now!<br><br>And also we fixed small errors :)<br><br>Enjoy!<br><br>And if suddenly you find any errors - write to us at hello@happymary.ru or use Contact Support button in the app settings."},{"version_id":"837972993","version_name":"1.6.1","version_date":"2020-10-01 17:41:34.000 +0800","version_description":"In this update we fixed some bugs, make the app a little bit later and prepared for the sale!"},{"version_id":"840242900","version_name":"2.0.1","version_date":"2021-01-28 17:16:05.000 +0800","version_description":"The big update is here!<br>We listened to the feedback from our favorite users and subscribers and added so many cool features.<br><br>1. Collections of brushes<br>Curated collections of themed brushes that are perfect for specific purposes.<br>Now it will be easier for you to choose interesting brushes from our huge catalog! And we will do our best to make a selection of interesting brushes for you as often as possible!<br><br>2. Home page<br>The new start page will show recommendations from our catalog, the last added brushes, quick access to the catalog, the latest collections.<br><br>3. Improved directory search.<br>4. Ads will be shown less often!<br>5. Faster loading of brushes.<br>6. Quick check of subscription status.<br>7. Light theme of the application and its automatic change.<br>8. Section Resources for our subscribers with palettes, textures and templates.<br>9. Prepare for the sale!<br>10. Redesign and a huge number of minor improvements."},{"version_id":"840519641","version_name":"2.0.2","version_date":"2021-02-17 21:59:22.000 +0800","version_description":"Minor improvements and fixes."},{"version_id":"840874427","version_name":"2.1.0","version_date":"2021-03-13 19:26:04.000 +0800","version_description":"New feature! Now you can switch between paid and free brushes. And also some bug fixes and minor UI fixes."},{"version_id":"841128176","version_name":"2.1.1","version_date":"2021-03-30 19:28:04.000 +0800","version_description":"Some bug fixes and ads reduction!"},{"version_id":"841274701","version_name":"2.2.0","version_date":"2021-04-10 05:34:05.000 +0800","version_description":"Meet the font catalog! Now in our application you can find fonts to add to Procreate. We improved the speed of downloading files, added a couple of new functions, made edits and fixed bugs.<br>Did you see a bug or have a suggestion? Write to us at hello@happymary.ru or through the app!"}]