[{"version_id":"837835497","version_name":"2.0.3","version_date":"2020-09-18 14:20:21.000 +0800","version_description":"NEW: Beautifully designed Dawn Widgets, now available on iOS 14.<br>- Select from 7 unique widgets of different sizes and functionalities for your homepage.<br>- Month widgets: Displays greeting with current and/or upcoming months<br>- Today widgets: Display greeting with a list of your tasks for today<br>- List widget: Compact widget to display your tasks for today<br>- Time widget: A large widget displaying tasks for today with current and next month<br><br>Bug fixes:<br>- Potential fix for duplicated events and sync issues (recommended to sync and re-sync affected calendars)<br>- Fixed duplicated daily tasks (recommended to delete and re-add affected daily tasks)<br>- Fixed current date sometimes not refreshing<br>- General performance and UI improvements<br><br>Visit our website and join us on social media for the latest updates:<br>- Website: www.enulus.com<br>- Twitter: twitter.com/minimaldawn<br>- Reddit: www.reddit.com/r/dawnapp/"},{"version_id":"838053485","version_name":"2.1.2","version_date":"2020-10-08 14:40:53.000 +0800","version_description":"- Fix: Potential startup crashes<br>- Fix: Past events not marked as completed<br>- Fix: Missing notification permissions prompt"},{"version_id":"838127343","version_name":"2.1.3","version_date":"2020-10-18 00:22:37.000 +0800","version_description":"- NEW: Add and edit complex repetition rules<br>- Fix complex repetition rules not syncing (May require unsync and resync of affected calendars/reminder lists)"},{"version_id":"838261761","version_name":"2.1.4","version_date":"2020-10-21 13:48:36.000 +0800","version_description":"- Fix widget heatmap appearing lighter on weekends<br>- Fix instances where notifications aren't scheduled<br>- Fix duplicating events/reminders when syncing calendars or tasks with default Space set"},{"version_id":"838316279","version_name":"2.2.0","version_date":"2020-11-12 10:51:09.000 +0800","version_description":"Huge update! Thanks so much for all your feedback.<br>This update includes many highly anticipated and requested features, be sure to check them all out!<br><br>- NEW: Beautifully designed alternate app icons. Head over to Settings &gt; Appearance &gt; App Icon to select an alternate icon for Dawn.<br>- NEW: Display tomorrow and upcoming tasks on Dawn's today page. Head over to Settings &gt; Behavior &gt; Time &gt; Show Upcoming to enable this feature.<br>- NEW: Medium Time widget to display today's date, upcoming tasks, and month heatmap.<br>- NEW: Small Time widget to display today's date and upcoming tasks.<br>- NEW: Change Tint color for Dawn widgets. Tap and hold a widget then select Edit Widget to select a color.<br>- Fix: Startup and various crashes"}]