[{"version_id":"839217093","version_name":"1.5.0","version_date":"2020-11-16 14:26:38.000 +0800","version_description":"O time do Nação BRB FLA trouxe reforços. Confira as novidades que estão entrando em campo.<br><br>- O PIX está no ar e você já pode fazer transferências e pagamentos instantâneos 24 horas por dia e sete dias por semana. <br><br>- Faça seu dinheiro crescer como o Mengão. Agora, oferecemos uma plataforma de investimentos que foi desenvolvida em parceria com a Genial."},{"version_id":"841884814","version_name":"1.9.0","version_date":"2021-05-04 14:44:09.000 +0800","version_description":"SRN! Atualize o APP e confira as novas funcionalidades:<br><br>Cartão adicional: compartilhe todos os benefícios e o limite do seu cartão com quem quiser. É só pedir um cartão de crédito adicional pelo APP!<br>Novo layout do extrato: reformulamos o extrato da sua conta, com um design mais moderno e de fácil compreensão.<br>Fatura digital: acompanhe o detalhamento das suas compras, lançamentos e o fechamento da sua fatura pelo APP.<br>Melhorias no processo de abertura de conta para novos clientes."},{"version_id":"842757391","version_name":"2.0.1","version_date":"2021-07-05 13:11:24.000 +0800","version_description":"SRN!<br><br>Nosso App está com novo layout para melhorar ainda mais a sua experiência no Nação BRB FLA. Além de mais moderno e intuitivo, aprimoramos também o nosso processo de abertura de conta e incluímos o serviço de poupança vinculada a sua conta-corrente, com a mesma numeração.<br><br>É muito mais comodidade para você, controlar sua vida financeira."},{"version_id":"843040779","version_name":"2.0.2","version_date":"2021-07-13 01:32:58.000 +0800","version_description":"SRN!<br><br>Nosso App está com novo layout para melhorar ainda mais a sua experiência no Nação BRB FLA. Além de mais moderno e intuitivo, aprimoramos também o nosso processo de abertura de conta e incluímos o serviço de poupança vinculada a sua conta-corrente, com a mesma numeração.<br><br>É muito mais comodidade para você, controlar sua vida financeira."}]