[{"version_id":"837866911","version_name":"1.0.2","version_date":"2020-09-20 03:19:08.000 +0800","version_description":"Thank you so much for the incredible response to Widgetsmith.  I'm working hard on responding to our feedback.  I have a number of larger updates in the works but in the meantime here is a quick update to include:\n- Add Single Photo Widget\n- Add a Custom Text Widget\n- Add some fun new Fonts (Noteworthy, Marker Felt, Chalkduster, Typewriter, & Futura)\n- Add a new palette of Pastel background colors\n- Lots of bug fixes and improvements"},{"version_id":"837870988","version_name":"1.0.3","version_date":"2020-09-20 21:25:36.000 +0800","version_description":"Thank you so much for the incredible response to Widgetsmith.  I'm working hard on responding to our feedback.  I have a number of larger updates in the works but in the \nmeantime here is a quick update to:\n- Fix for text wrapping in the Custom Text widget\n\nThe previous v1.0.2 update included:\n- Add Single Photo Widget\n- Add a Custom Text Widget\n- Add some fun new Fonts (Noteworthy, Marker Felt, Chalkduster, Typewriter, & Futura)\n- Add a new palette of Pastel background colors\n- Lots of bug fixes and improvements"},{"version_id":"839847263","version_name":"2.2.3","version_date":"2020-12-31 08:47:30.000 +0800","version_description":"Fix an issue where the date could be displayed incorrectly."},{"version_id":"839925186","version_name":"2.3","version_date":"2021-01-11 17:30:05.000 +0800","version_description":"Start of 2021 right with a new collection of health focused widgets.  I've added step counting widgets that let you specify your daily step goal, along with a number of new visualizations for your Apple Watch's activity data. \n\nI also added a new photo widget that displays the weather with your selected photograph.\n\nNote: Activity widgets require a paired Apple Watch"},{"version_id":"840122760","version_name":"2.3.1","version_date":"2021-01-22 18:20:32.000 +0800","version_description":"This update includes a handful of new date/time widgets including:\n- a collection of Solar Path widgets\n- a collection of Sundial widgets\n- an hourglass widget\nIt also fixes an issue where activity bars would render strangely at the start of the day and fixes some performance bottlenecks."},{"version_id":"840369296","version_name":"2.4.1","version_date":"2021-02-08 17:42:03.000 +0800","version_description":"Quick fix to prevent the Activity Text widget from not showing in certain situations."},{"version_id":"841177817","version_name":"2.5","version_date":"2021-04-05 20:25:59.000 +0800","version_description":"- New Balloons theme\n- Fix a bug with the photo chooser\n- Fixes a bug where the photo widgets wouldn't display borders\n- Improves the visual appearance of the widget configurator"},{"version_id":"841521058","version_name":"2.5.1","version_date":"2021-04-18 17:25:56.000 +0800","version_description":"New Blossoms theme, perfect for Spring!\n\nAlso, fixes an issue where the Photos tool would show empty albums."},{"version_id":"842889377","version_name":"2.6","version_date":"2021-07-22 16:33:13.000 +0800","version_description":"This update is focused around making dramatic improvements to the Photos widgets.  You now have FULL control over the layout and framing of your photos.  You can pan and zoom each, to get it looking exactly how you prefer.  You can even automatically crop to the faces in the photo.  \n\nNote: this only works on newly added photographs as any previously added photographs are unfortunately not compatible with this new advanced system.  Simply re-add any photographs you want to adjust, your old widgets will remain unaffected. \n\nAlso, \n- Fix for duplicate colors bug in Gradient Wallpaper generator.\n- Fix for iPad widget editor layout."},{"version_id":"843456064","version_name":"2.6.2","version_date":"2021-08-06 17:05:00.000 +0800","version_description":"This is a small bug fix update addressing a possible crash that was introduced in the last update.  \n\nNew in 2.6:\n• Major upgrade to the Photos tool. It how lets you easily browse your photo library and when you find that perfect photograph add it add a widget with a single tap.\n• I also changed the default widget type to Photo\n• Fixes a bug relating to the default location getting stuck on an old value.\n• Lots of low level fixes that should make the app more stable.\n• New Beach Artwork"},{"version_id":"844178025","version_name":"2.7","version_date":"2021-09-20 20:44:36.000 +0800","version_description":"This update marks one year since Widgetsmith's release.  I am incredibly grateful for all the support and encouragement I've received this past year.  It has helped spur me forward to keep making Widgetsmith better and better.  This update is the next step in that process with two big aims:\n- iPad support has been dramatically improved, supporting the new Extra Large widget size and the adding of widgets directly on your home screen (on compatible devices)\n - The Album widget has also been overhauled and is now much easier to find the photos you want to display\n - It also adds a lot of general compatibility and performance improvements.\n\nThank you!"},{"version_id":"844495793","version_name":"2.7.1","version_date":"2021-10-07 22:36:50.000 +0800","version_description":"This is just a quick update to fix a crashing bug that could occur on iOS 15. \n\n-- New in 2.7 --\nThis update marks one year since Widgetsmith's release.  I am incredibly grateful for all the support and encouragement I've received this past year.  It has helped spur me forward to keep making Widgetsmith better and better.  This update is the next step in that process with two big aims:\n- iPad support has been dramatically improved, supporting the new Extra Large widget size and the adding of widgets directly on your home screen (on compatible devices)\n - The Album widget has also been overhauled and is now much easier to find the photos you want to display\n - It also adds a lot of general compatibility and performance improvements.\n\nThank you!"},{"version_id":"845624208","version_name":"2.8","version_date":"2021-12-02 18:36:20.000 +0800","version_description":"v2.8's marquee feature is the addition of Photo Filters to all photo based widgets. These allow you to style your photos as shown within your widgets, without having to filter/style the original images.  So you can make the widget fit your aesthetic with just a few taps.  \n\nThe update also adds a handful of new analog clock styles and improves their rendering on latest updates."},{"version_id":"846009252","version_name":"2.8.3","version_date":"2021-12-18 13:34:59.000 +0800","version_description":"This update adds the ability for you to see photos recently displayed in \"Photos in Album\" widgets.  So if you see a photo you want to favorite or share just tap into the app, open the Tools area and then browse."},{"version_id":"847200044","version_name":"3.0","version_date":"2022-03-01 15:02:14.000 +0800","version_description":"This update is featured around two major updates:\n- The introduction of seasonal collections.  The Spring 2022 Collection is here!  I'll be rolling out theme packs at the start of each season, designed to give your phone a new fresh look.\n- The weather tool has been completely overhauled to supercharge your weather widgets.  Now whenever you tap on a weather widget you'll be presented with a rich, graphical forecast of the selected location.  This includes hourly, daily and radar weather data.   \n\nAdditionally a new set of fonts has been added to give your a variety of new styling options."}]