[{"version_id":"840062349","version_name":"1.0.13","version_date":"2021-01-18 07:43:42.000 +0800","version_description":"◆讲谈社正版授权，原班声优倾情加盟<br>◆全员无双，R→SSR随心养成无废卡<br>◆轻松减负，离线挂机领海量收益<br><br>【游戏介绍】<br>腾讯首款休闲放置卡牌手游《妖精的尾巴 力量觉醒》重磅来袭！游戏改编自超人气日漫《妖精的尾巴》，经典动画剧情深度还原、人气魔导士超燃集结，更有原班声优团队倾情加盟，带你重回魔法世界！ 游戏在延续原著世界观设定的基础上，大胆融入了轻松减负的新鲜元素，打破了传统漫改卡牌游戏带来的束缚感，如在回合制战斗模式的基础上融入“放置”，轻松畅快的游戏体验，玩家无需在线也可领取海量收益；此外，打扫公会、遗迹探秘、术式解锁、百科问答……等众多休闲有趣小玩法的融入，也为游戏增添了更多的趣味性和挑战性，<br>为玩家带来更为新颖别致的游戏体验！<br><br>【游戏特色】<br>—— 新手狂欢 海量福利<br>开服狂欢祭，福利送不停！登录即送200连抽，累计登录2日领人气伙伴-妖精女王艾露莎！完成新手任务，超多游戏道具、海量钻石金币，等你收入囊中！<br><br>—— 正版授权 经典重现<br>原著动画剧情深度还原！纳兹与露西在哈鲁吉翁港口的初次相遇，就此拉开冒险的序幕。拯救迦尔纳岛、击溃幽鬼支配者、激战乐园之塔……经典剧情逐一重温，超燃之旅就此开启！<br><br>—— 原班声优 倾情助阵 <br>纳兹（柿原彻也）、露西（平野绫）、哈比（钉宫理惠）、格雷（中村悠一）、艾露莎（大原沙耶香）……等多位知名人气声优倾情献声，实力派声优团队的原音重现，呈现一场完美的听觉盛宴，带领玩家重燃热血感动！<br><br>—— 六人升级 全家共享<br>新增“共鸣水晶”系统，只需培养6个伙伴，其他伙伴都能共享升级，伙伴等级、魔法源、装备、宝物属性、意志力属性……均可进行传承，一人吃饱，全家不饿！<br><br><br>—— 伙伴集结 策略养成<br>纳兹、露西、格雷、艾露莎……等熟悉的伙伴在此集结！数十位人气魔导士可供培养，玩家可通过升级、培养、进阶、分解、装备等多种形式培养伙伴，深度养成，策略搭配，打造专属“最强小队”！<br><br>—— 离线挂机 轻松收益<br>轻松护肝，魔性放置随时畅玩！全天挂机离线收益，无需在线也能升级，海量金币、超强装备挂机轻松拿！<br><br>—— 海量玩法 趣味体验<br>加入公会，体验最热闹欢乐的公会生活，接受五花八门的任务委托；遗迹探秘，与同伴一起外出探险，寻找未知宝藏；探险奇遇、消灭小鱼、绘制术式、百科问答大作战……众多休闲有趣小玩法，体验不一样的闯关乐趣！<br><br>超燃之旅即刻开启，马上召集同伴，一起回到魔法世界，感受不可思议的奇妙冒险吧！<br><br>Based on the manga“Fairy Tail”by Hiro Mashima originally serialized in the weekly Shonen Magazine published by KODANSHA LTD.<br>©Hiro Mashima・KODANSHA/Fairy Tail project・TV TOKYO. All Rights Reserved."},{"version_id":"840634806","version_name":"1.0.16","version_date":"2021-03-02 03:47:21.000 +0800","version_description":"1、新增全新SSR伙伴<br>【杰拉尔】<br>乐园之塔支配者，圣十大魔导士水准，可灵活运用多种魔法，甚至驾驭威力强大的天体魔法！<br>【妖刀红缨·艾露莎】<br>妖尾红缨——艾露莎强力铠甲之一，舍弃一切护具，释放被铠甲禁锢的内心，将全部魔法集中于“妖刀红缨”，赌上信念进行战斗！<br>【星灵王加护·露西】<br>星灵魔法掌控者，冥府之门战斗之际，为拯救同伴，以毁掉水瓶座阿葵亚的钥匙为代价，召唤星灵王进行战斗，取得胜利。<br>【吉尔达兹】<br>妖精尾巴公会最强魔导士之一，其掌控的粉碎魔法能够无意识地破坏整条街道建筑物，实力强大！<br>2、优化委托任务玩法中的讨伐任务，降低BOSS难度；<br>3、优化探索玩法—第十关防御值增加99buff，一键复位可重新获取；<br>4、优化六魔入侵玩法开启时间，更改为每日8:00—24:00均可挑战，请各位魔导士合理分配时间！"},{"version_id":"841407433","version_name":"1.0.17","version_date":"2021-05-06 09:07:49.000 +0800","version_description":"1、新增全新SSR伙伴<br>【杰拉尔】<br>乐园之塔支配者，圣十大魔导士水准，可灵活运用多种魔法，甚至驾驭威力强大的天体魔法！<br>【妖刀红缨·艾露莎】<br>妖尾红缨——艾露莎强力铠甲之一，舍弃一切护具，释放被铠甲禁锢的内心，将全部魔法集中于“妖刀红缨”，赌上信念进行战斗！<br>【星灵王加护·露西】<br>星灵魔法掌控者，冥府之门战斗之际，为拯救同伴，以毁掉水瓶座阿葵亚的钥匙为代价，召唤星灵王进行战斗，取得胜利！<br>【雷炎龙·纳兹】<br>妖精尾巴公会最强魔导士之一，其掌控的粉碎魔法能够无意识地破坏整条街道建筑物，实力强大！<br>【SSR伙伴_神乐·御雷】<br>人鱼之踵最强女剑士，出鞘之刃，斩杀怨念！<br><br>2、新增玩法：【装备觉醒】，突破桎梏，强化装备，越战越强！<br>3、新增玩法：【巅峰对决】跨服个人战玩法，大陆的对面，悄悄走来一群强者，角力巅峰！<br>4、优化：“探索”：新增第11-14关，四季变换，解密通关！<br>5、优化：“强者之路”玩法增加钻石快速通关，助力极速收菜！"},{"version_id":"842704356","version_name":"1.0.18","version_date":"2021-06-18 06:25:16.000 +0800","version_description":"1、新增UR伙伴【哈迪斯】<br><br>恶魔の主宰，最强黑暗公会会长”魔法的本质即为黑暗“！<br><br>新增全新SSR伙伴<br><br>【沃络德·辛肯】<br><br>妖精尾巴的创始人之一、现为圣十大魔导士第四名、伊修迦尔四天王之一，木之魔法，强势保驾护航；<br><br>【爱之翼·朱毕安】<br><br>朱毕安第二魔法源解放！为爱而生的强大力量，爱之翼格雷 sama Love！<br><br><br>2、新增功能：【精灵系统】，通关指定冒险副本“48-10”即可解锁“精灵系统”，它们不仅拥有可爱呆萌的外形，聪明灵活的头脑还有不俗的战斗力！<br><br>3、新增副本：【精灵圣地】精灵碎片产出地，助力魔导士快速提升战力！<br><br>4、新增玩法：【公会争霸】全新跨服公会战玩法，公会跨服同台竞技，谁能登上巅峰宝座，快来一拼高下吧！<br><br>5、优化：【好友赠送耐力友情点】改为赠送好友时自动获得友情点和耐力，不再需要别人赠送！"}]