[{"version_id":"837784316","version_name":"1.0.2","version_date":"2020-09-15 19:22:32.000 +0800","version_description":"A Great PERFORMANCE Update!<br><br>- Now the HOME Tab and the LIVE Walls TAB can load wallpapers preview at the max speed<br>- We've completely removed the lag when scrolling the home page. Now it's fast and smooth<br>- Improvements for the FEED Tab, where we host your uploaded-wallpapers<br>- Improvements for the Wallpapers Preview"},{"version_id":"837939700","version_name":"1.1","version_date":"2020-09-25 19:00:16.000 +0800","version_description":"THIS IS A HUUUUUUUGE UPDATE!<br><br>The app is now FAST and SMOOTH.&nbsp;<br>We also have some great new Features like iOS 14 Support, Widget, Apple Watch App and more!<br><br>- A new Widget that you can use on your Home Screen with iOS 14.&nbsp;<br>Available in 3 different sizes, it shows the latest \"Wallpaper of the Day\". Just one tap on the Widget to open the App and download the Wallpaper.<br><br>- Apple Watch App:&nbsp;<br>Now you can install our custom Watch Faces directly from the Apple Watch with the new App and it own Complication. Requires watchOS 7<br><br>- A whole new FEED section: <br>Now we use a new dedicated server to manage this. So you will be able to download new wallpapers from here and upload your own awesome images to share them with the Community. A great opportunity for graphic designers or photographers from all over the world!<br><br>- A New Tab for \"FACES\":<br>We removed the \"Settings\" tab and added a \"Faces\" Tab. It contains Apple Watch Faces that you can download with just one tap. Requires watchOS 7. <br><br>- A whole new \"SEARCH\" Area: <br>We completely recreated the Search feature. Now it's super fast, it can auto-complete everything that you type, and it also shows Categories.<br><br>- Introducing CATEGORIES <br>A great way to filter our Wallpapers Catalog. Search by category is very good to find the correct wallpaper for every moment.<br><br>- Haptic feedback<br>We've added an haptic vibration to some actions: for example when you browse the home page or when you download a wallpaper or when you tap the heart to add a wallpaper to favorites<br><br>- The app is now lighter. About 11 MB less. This means A LOT of optimizations.<br><br>- NEW: The new FEED area is now accessibile from our website too! You can download every wallpaper uploaded by our user as from the app as from the website.<br><br>- The Download Button appears immediately to PRO Users. Normally it appears after 2/3 seconds.<br><br>This is a huge update. If you like the app and how we are working on it, please leave a review on the App Store.<br><br>Wallpapers Central is not affiliated or endorsed by Apple. iPhone, Apple Watch, watchOS and images displayed are trademarks of Apple Inc."},{"version_id":"838081458","version_name":"1.1.1","version_date":"2020-10-05 16:09:38.000 +0800","version_description":"- NEW: Try the new \"Faces\" tab. All the Apple Watch Faces are now showed inside a watch frame. This is really much nicer then before.<br><br>- NEW: Introducing a new Download counter system. Now in real-time. As soon as you will tap on a DOWNLOAD button, the download counter will increase under your eyes.<br><br>- CHANGE: The Home tab is no longer displaying Live Wallpapers. It was a bit confusing for some users. So if you want to download LIVE Wallpapers NOW, you just need to enter the \"LIVE Walls\" Tab <br><br>- CHANGE: We've added a popup alert when you upload a new wallpaper to Wallpapers Central. There are some rules to get approved and you must respect them. For example: you cannot upload selfies, child photos, family photos, images in low resolution (less then 3000 px in heigh) and more. We know you have great photos but hey.. they are your photos. There is a difference between cool photos and cool wallpapers. Think at this before to upload a new Wall.<br><br>- FIX: We've solved a problem with iPad in landscape. NOW you will be able to tap on the DOWNLOAD button"},{"version_id":"838108877","version_name":"1.1.2","version_date":"2020-10-14 21:55:13.000 +0800","version_description":"- IMPORTANT FIX: we solved a problem that caused the opening of a different Wallpaper than the one selected<br><br>- New Watch Faces added<br><br>- SURPRISE: we’ve added 13 different app icons. Go to Settings &gt; App Icon and choose your preferred icon style. We think that our app is useful to customize your HomeScreen so we must be able to fit every style and theme with our app icon! What do you think?"},{"version_id":"838293999","version_name":"1.2","version_date":"2020-10-21 20:28:41.000 +0800","version_description":"A NEW MAJOR UPDATE IS HERE!<br><br>Today we are glad to introduce a new feature: COLLECTIONS.<br><br>** What are Collections?**<br><br>Collections are a great way to discover and download similar Wallpapers. We will use them to group Halloween Wallpapers, Christmas Wallpapers, our original DUAL Wallpapers, and much much more.<br>With a constantly growing number of wallpapers available on our service, we need to keep everything neat and easily accessible for users. We are sure that you will greatly appreciate our Collections.<br><br>ALSO IN THIS UPDATE:<br>• NEW - \"Link for Credits\" on new Uploads: In addition to the author's name, you can now enter a link (which can redirect to your Instagram account, Telegram channel, Twitter page, personal website and so on). Credits are very important for photographers and designers who have chosen to upload their work to our service to get more followers and popularity.<br>• NEW - Author's name are showed with an \"arrow\" icon when a link is available. So you quickly understand that the Author's name is clickable.<br>• IMPROVED - White and Light Wallpapers now shows a Black font in the Preview.<br><br>We are working very hard to develop this application. Since it was launched, we have been adding great features in every update. If you like Wallpapers Central, please spend 20 seconds of your time to add a review on the App Store right now, before moving on to another app. Many thanks in advance!"},{"version_id":"838365255","version_name":"1.2.1","version_date":"2020-10-27 17:48:50.000 +0800","version_description":"Wallpaper Previews are now Dynamics.<br><br>WHAT DOES IT MEANS?<br>For some wallpapers (like those of the DUAL Collection) we will no longer show the classic \"Lockscreen Style Preview\". We've added 6 HomeScreen styles which will offer you a better preview of the Wallpaper. You can also get inspired by our styles and reproduce it on your device taking full advantages of iOS 14 in combination with Widgets.<br><br>And if it wasn't enough, we implemented the possibility to open the wallpaper on tap of the widget! <br><br>Cool, right?"},{"version_id":"838438589","version_name":"1.2.2","version_date":"2020-10-31 16:57:20.000 +0800","version_description":"WIDGETS!<br><br>Introducing 3 brand new Widgets (small, medium and big). They looks so different from the previous one. You're gonna love them! <br>The small widget shows a download counter with automatic update. Medium and Big Widgets, shows 4 latest wallpapers instead of 1.<br><br>If you like our work, please leave a good review in App Store and make us to be the Best Wallpaper App!"},{"version_id":"840025525","version_name":"1.2.5","version_date":"2021-01-20 23:02:11.000 +0800","version_description":"THIS IS A BIG UPDATE!<br><br>1. INTRODUCING COINS: Use them to unlock a single LIVE Wallpaper without paying for a full subscription. You will spend coins for each LIVE Wallpaper. If you love them all or if you don't like limits, so we still suggest to choose for a subscription plan.<br><br>2. INTRODUCING DASHBOARD: This is a personal area from where you will be able to check your Coins, your uploaded wallpapers and much more (coming)<br><br>3. HOMEPAGE UPDATED: We've updated the homepage which now uses json. Contents are now dynamical, which means that we are able to update them without updating the whole app.<br><br>4. HOW TO CHECK REMAINING COINS: You can do that from the left menu and from the new Dashboard (the \"account\" icon on the top right).<br><br>5. COLLECTIONS NOW SUPPORTS LIVE WALLPAPERS. We've created a new Collection: \"Calendar LIVE Walls\". It's very particular because it offers LIVE Wallpapers with a sticky Calendar on them. Check them out, we will add new items every month and you need less coins to unlock them!<br><br>6. We've added a Black Lockscreen Preview for Clear Wallpapers<br><br>7. To prevent uploading low quality wallpapers, we've added a new restriction. Now you can upload images in high resolution only! This will help us to approve wallpapers more quickly. <br>Please remember: we will never approve: selfies, family photos, babies, children and everything that doesn't fit good enough to be a considered \"a great wallpaper\".<br><br>Thank you for trusting us and making Wallpapers Central the best rated app about Wallpapers!"},{"version_id":"840197586","version_name":"1.3.1","version_date":"2021-01-26 15:10:15.000 +0800","version_description":"WHAT'S NEW:<br><br>1) When you save a Wallpaper from this app, it will go under an Album named \"Wallpapers Central\" in your Photos App.<br><br>2) On iPhone X and above, now we can show a wallpaper description<br><br>3) In Collections, we've added a button that will open a website or instructions in some cases<br><br>4) Introduced 4 new Homescreen layout-designs to get inspired from<br><br>5) In the Dashboard you can now tap on \"Uploads\" to open \"My Uploads\" page<br><br>6) We've fixed a problem with the Search Icon"},{"version_id":"840337295","version_name":"1.3.3","version_date":"2021-02-04 15:30:49.000 +0800","version_description":"===== IMPORTANT TO READ ======<br>If you are not able to SAVE wallpapers, it's not a bug, it's just a permissions issue. You probably denied the access to your camera roll so the app cannot save them. Here's how to solve:<br>Open iOS Settings, scroll down to Wallpapers Central and tap on it. Now under \"Photos\" select \"All Photos\".<br><br>===== NEW IN THIS UPDATE ======<br><br>1. We've introduced a new opportunity to earn Coins for free. You just need to watch an Ad video to earn Coins, then you will be able to use them to unlock LIVE Wallpapers for free! (max 2 videos per day)<br><br>2. We've added new Previews for our special \"PixelPerfect\" Wallpapers"},{"version_id":"840359540","version_name":"1.3.4","version_date":"2021-02-05 14:58:18.000 +0800","version_description":"We've FINALLY solved an annoying bug. Until now, it could happen that selecting a Wallpaper would open another Wallpaper! That was crazy but we've fixed it!<br><br>To solve the problem we've removed a Ad, so if you update to this version, you will get 2 advantages: 1) the disappearance of the bug and the removal of an advertising banner. We home you appreciate our efforts to provide you with the best user experience so far. If you like this app, please leave a review on the App Store."},{"version_id":"840385065","version_name":"1.4","version_date":"2020-09-07 07:00:00.000 +0800","version_description":"We have fixed the problem with \"Free Coins\" not being correctly credited after watching a video. Now you can earn Free credits watching in-app videos.. Thank you very much for the feedbacks and your patience. Join us on Telegram for Wallpapers Notifications and to get in touch with the Staff. Open Telegram and search: @wallpaperselection"}]