[{"version_id":"839316291","version_name":"1.3.95","version_date":"2020-11-22 18:55:56.000 +0800","version_description":"- Added an option to scale the UI. (Tablets only)<br>- Fixed: Random crash when speedsolving the 15-Puzzle.<br>- Fixed: Crash on iOS 12.4 devices."},{"version_id":"840873999","version_name":"1.4.0","version_date":"2021-03-14 12:59:58.000 +0800","version_description":"- Major Update 1.4: Students and Theories.<br>- A release with a lot of new content to play with.<br>- Students form another prestige layer after Supremacy. They provides upgrades that will help you progress further than before.<br>- Theories are parallel projects that contributes to the main equation and unlocked by students.<br>- New story chapters.<br>- New achievements.<br>- A new minigame.<br>- Auto-Supremacy."},{"version_id":"840911210","version_name":"1.4.1","version_date":"2021-03-16 15:53:52.000 +0800","version_description":"- Fixed: Scores for the Arrow Puzzle were not published to the leaderboards.<br> - Updated Italian translations."},{"version_id":"840940615","version_name":"1.4.2","version_date":"2021-03-17 23:59:00.000 +0800","version_description":"- Rebalanced the second theory.<br> - Fixed: The auto-buyer selection for theories was not serialized."},{"version_id":"840979954","version_name":"1.4.3","version_date":"2021-03-22 03:55:06.000 +0800","version_description":"- Increased the tap area of the publication icon.<br> - The variable 'f' was missing from the parameter list in Math Expressions.<br> - Fixed: Some errors were not displayed in the 'Test an Expression' field.<br> - Fixed: On screen with notch, the top and bottom area did not change color when displaying a story.<br> - Updated translations: Chinese (Simplified/Traditional), Italian, German, and Russian."},{"version_id":"841021348","version_name":"1.4.5","version_date":"2021-03-24 17:18:23.000 +0800","version_description":"- Changed Theory 4 to use analytical calculation of 'q'.<br> - Fixed: The currency of Theory 6 could get negative for some time.<br> - Fixed: Some variables continued ticking even when refunded in Theory 2.<br> - Fixed: The upgrade panel was always updated regardless of its visibility.<br> - Updated translations: Chinese (Simplified/Traditional), Portuguese, Polish, and Turkish."},{"version_id":"841056139","version_name":"1.4.6","version_date":"2021-03-25 13:34:11.000 +0800","version_description":"- Fixed: Some milestones of Theory 5 could be hidden even when bought.<br> - Fixed: Theory 8 could create NaN values."},{"version_id":"841095291","version_name":"1.4.7","version_date":"2021-03-29 12:58:01.000 +0800","version_description":"- Completed Theory 9<br> - Rebalanced research upgrade #9.<br> - Removed some endgame supremacy upgrades (may be added back later).<br> - Fixed: Research upgrade #8 could be refunded when #9 was purchased.<br> - Updated translations: Spanish and Russian."},{"version_id":"841123403","version_name":"1.4.8","version_date":"2021-04-01 05:26:53.000 +0800","version_description":"- Math Expression won't reset its state if the entered expression is unchanged.<br> - Fixed: Slight misalignment of 'Upgrades' and 'Permanent' in theory panels.<br> - Fixed: Research 9 was displaying '/10' instead of '/20' even if it was using '/20' for calculations.<br> - Fixed: Theory 9 could skip some parts.<br> - Fixed: Refunding upgrades for which the first one is free was not giving back the money of the first upgrade of the batch.<br> - Fixed: Many memory leaks related to popups and change of theories. But there might be more...<br> - Updated translations: Spanish, German, and Polish."},{"version_id":"841167859","version_name":"1.4.9","version_date":"2021-04-02 06:10:21.000 +0800","version_description":"- Added a way to replay lemmas.<br> - The info button of theories now displays the current value of each upgrade.<br> - Variadic min/max. For example, 'min(4,2,1,3)' returns 1.<br> - Optional amount for cost functions. For example, 'costUpS(1,2)' returns the cumulative cost of the next 2 upgrade levels.<br> - The labels of theories' upgrade panels will highlight when an upgrade is available in the other panel.<br> - Fixed: The equation of Theory 3 was sometimes clipped on Tablets.<br> - Fixed: Crash when graph values goes out of range."},{"version_id":"841207252","version_name":"1.4.10","version_date":"2021-04-04 16:15:36.000 +0800","version_description":"- Added back all levels of the third supremacy upgrade.<br> - Theories: Added the next value of upgrades when holding the info button.<br> - Theory 9: Won't pause anymore when all upgrades are refunded.<br> - Theory 9: Navigation won't be available until it is completed."},{"version_id":"841221248","version_name":"1.4.11","version_date":"2021-04-06 01:15:39.000 +0800","version_description":"- Added a confirmation to disable offline progress.<br> - 3 new languages: Finnish, Hungarian, and Vietnamese!<br> - Fixed: Theory 9 navigation could disappear."},{"version_id":"841303207","version_name":"1.4.12","version_date":"2021-04-10 21:22:56.000 +0800","version_description":"- The game will now save after a graduation or a publication.<br> - 1 new language: Japanese!<br> - Changed the Chinese fonts to sans serif to improve readability.<br> - Fixed: Slight misalignment in the summary bar.<br> - Fixed: Equation of Theory 3 had an offset depending on the device's DPI."},{"version_id":"841313621","version_name":"1.4.13","version_date":"2021-04-12 15:21:52.000 +0800","version_description":"- Increased the contrast of both themes.<br> - 1 new language: Korean!<br> - Fixed: Missing characters in the Chinese Traditional font."},{"version_id":"841588589","version_name":"1.4.15","version_date":"2021-04-19 16:03:47.000 +0800","version_description":"- 1 new language: Indonesian!<br> - The values of 'b' and 'mu' are now displayed only with scientific notation.<br> - Fixed: The UI was too big on small screens.<br> - Fixed: Colors on MiUi OS (take 2).<br> - Fixed: Cost comparison was wrong with permanent levels in some occasions.<br> - Updated translations: French, Japanese, Korean, Vietnamese."},{"version_id":"841976210","version_name":"1.4.16","version_date":"2021-04-28 06:10:22.000 +0800","version_description":"- 3 new languages: Arabic, Farsi, and Hebrew!<br> - Added the eye icon to the publication window.<br> - Reduced the overlap of variables labels that could happen in some specific occasions.<br> - Fixed: Parts of Theory 9 could start too early.<br> - Fixed: Setting music to 'off' could still generate static noise when connected to a Bluetooth device."}]