[{"version_id":"842504892","version_name":"1.0.2","version_date":"2021-06-15 15:00:00.000 +0800","version_description":"Main Theme\nChase the Light in this Thrilling New Adventure!\nA revolutionary line strategy RPG that pushes the genre to new heights！\nMagnificent Stories Full of Fantasy and Adventure\nDiscover a riveting world brimming with magic and technology.\nThe light of the Aurora streaks across the stratosphere... Follow its radiant glow to the limits of the skies above and beyond the outer stretches of the universe. Our journey begins now!\nAstra, where the Aurorians and Caelestites have lived since the beginning of time.\nThe hundred years of peace has been disrupted with the sudden appearance and invasion by dark creatures known as Eclipsites, controlled by a mysterious organization from the shadows.\nThe Caelestites have all but perished at the hands of the Eclipsites... As the sole survivor, you endure countless hardships and began a long and tortuous life of exile, deep underground.\n17 years later, by chance, you were discovered by an Aurorian who brought you back up to the surface, where the Light shines brightly...\nThe reality that cannot be reversed... your newfound bonds with Aurorians... responsibilities that are all yours to shoulder. Command the Colossus, a relic from your ancient civilization, and soar through the sacred cities and harsh deserts. Find the Light alongside your loyal band of allies and friends, all with their own distinct personalities. The time has come to lead the Light and create your own story, and become the shining hope for the future of the world!\nBreathtaking Art Style and Graphics\nOur team of 150+ talented artists have proudly illustrated each and every Aurorian character with extensive detail. Watch the characters come to life through exciting battle animations and breathtaking concept designs.\nWorld-Class Voiceover Talents\nImmerse yourself in a captivating fantasy world, with the finest voiceover cast bringing each beloved character to life in the fantasy world of Aurora.\nUnique Characters, Bursting With Personality\nVice: Member of the Illumina Federation. Gentle, intelligent, diligent, and enthusiastic.\nCarleen: Lumo Gardens Captain. Born into a noble family, she possesses a strong sense of justice.\nIstvan: Leader of Umbraton. Easygoing yet decisive. Loyalty is of the utmost importance to him.\nKleken: The notorious trickster of Umbraton. Capable of lying without batting an eye.\nSinsa: The blunt and energetic leader of the Rediesel Wrench. He lives a carefree life with his many comrades.\nBethlehem: The ruler of Northland, possessing the composure to handle any matter with grace.\nInnovative Strategic Gameplay\nOriginal turn-based combat—master elemental attributes to draw the optimal plan of attack.\nOptional auto-combat mode is available as well.\nApproachable gameplay for even the most casual of gamers.\nOfficial Links\nWebsite: https://www.alchemystars.com/us\nFacebook: https://www.facebook.com/AlchemyStarsUS\nTwitter: https://twitter.com/AlchemyStarsUS\n"},{"version_id":"843548675","version_name":"1.1.0","version_date":"2021-08-19 11:51:12.000 +0800","version_description":"1. New Limited-time Themed Event\nSummer Memories\nThe first stage of the Ocean Sovereign update, Summer Memories, features a new limited-time themed event, including new event stages, an event redeem store, an event quest system, and a logins event.\n○The themed event will provide with new event stages, unlocked in phases, featuring new enemies and game mechanisms for you to challenge.\n○Clear event stages to get great rewards, as well as event tokens. Once you accumulate a certain number of event tokens, you can redeem them for a 5-Star Event Aurorian and loads of items in the event store.\n○During the event period, log in and sign in to get exclusive sign-in rewards upon reaching the specified sign-in goals.\n\nBrain Freeze\nEating delicious slushies is the greatest joy of every Aurorian's summer! Vice never misses an opportunity to make an extra buck, so it's only natural that she'd open a slushy stand by the beach. She's now calling upon all Navigators to pull together in the name of supplementing daily expenses on the Colossus! Knowing Vice, she won't take no for an answer, so, let's do our best for Vice's summer funds... oh no! For the sake of the Colossus' daily expenses, let's work together to make some slushies!\n\nEndgame\nThe second stage of the Ocean Sovereign, Endgame, will begin in early September. This part will require shrewd tactics and cautious strategizing, so let's see what you've got, Navigator! However, please rest assured that you'll be able to choose the actual difficulty of the stages you take on and will get corresponding rewards... But that doesn't mean you should pass up the chance to take on the event's toughest challenges and push yourself to the limit!\n\n2. New Event Story\nWith the event stages, unravel the summertime story about the Navigator, Vice, and several new characters. Learn all about the legend of the Ocean Sovereign, the trial of the three Goddesses, and the king who sacrificed everything to save his people... what kind of story awaits you?What?There's gonna be a super-awesome robot joining us in this update, too!?！\n……\n\n3. New Recruitment Banner and New Characters\nDuring the Ocean Sovereign event period, new characters will one by one make their debut. They each have their own unique characteristics and stories, and can't wait to become your new best friends!\n○In the first stage of the event, Summer Memories, we'll get to meet 6-Star Aurorians Beryl and Fleur, 5-Star Aurorian Bonacie, also 4-Star Aurorian Pasolo! Bonacie is the exclusive Aurorian to this event only and can be redeemed in the event store.\n○In the second stage of the event, Endgame, 6-Star Aurorian Smokey, and 5-Star Aurorian Genevieve will be available via limited-time recruitment, ready and willing to join your team!\nNote: For specific details on obtaining each of the abovementioned Aurorians, please refer to the actual game content. The actual in-game content shall prevail.\n\n4. The New Outfit System is Officially Here!\nThe summer and beach would not be complete without swimsuits! The Aurorians have prepared a range of new swimsuits for the Ocean Sovereign, turning up the heat on an already scorching summer! The update of Ocean Sovereign will introduce a special new feature to Alchemy Stars—Outfits! Purchase and equip your favorite outfits to your favorite Aurorians!\nThe 5 New Outfits to be released when the update lands are:\n○5-Star Aurorian Vice - Ray of Sunshine\n○4-Star Aurorian Uriah - Sea Voice\n○5-Star Aurorian Kleken - Black Lagoon\n○6-Star Aurorian Carleen - Sea Breeze\n○6-Star Aurorian Eicy - Onyx Iris\n\n5. New Feature: Special Event Record\nAfter the Ocean Sovereign event begins, each Navigator will receive a limited-time Special Event Record, which will guide you as you strive to complete the various summer event quest. After completing the specified quests, you'll receive the corresponding rewards! The more quests you complete, the more rewards you'll get!"},{"version_id":"845081588","version_name":"1.2.7","version_date":"2021-11-04 07:34:06.000 +0800","version_description":"Main Theme\nChase the Light in this Thrilling New Adventure!\nA revolutionary line strategy RPG that pushes the genre to new heights！"},{"version_id":"847486300","version_name":"1.7.0","version_date":"2022-03-10 11:44:19.000 +0800","version_description":"Main Theme\nChase the Light in this Thrilling New Adventure!\nA revolutionary line strategy RPG that pushes the genre to new heights！"}]