[{"version_id":"31732643","version_name":"1.18","version_date":"2013-09-18 23:10:38.000 +0800","version_description":"HUGE UPDATE!  Millions of thanks to the millions of Air Hockey players across the world!  Here’s the low down on the awesome new stuff:<br><br>- Completely redesigned interface!  Air Hockey’s old menu system for the iPhone and iPod touch was pretty boring.  Ugly even.  So, we ripped it out and completely started over.  The new look on the iPhone and iPod touch is fresh, shiny, and (dare we say) way way better.<br><br>- Improved wireless 2 player games!  You have a couple iPads around your house, right?  Who doesn’t!?  Grab them both and play Air Hockey against each other wirelessly.  Since the Air Hockey table size changes quite a bit between the widescreen &amp; non-widescreen iPhones and the iPad, you have to play against someone with a similar screen layout as you -- no iPad to iPhone 3GS games, that’d be silly!  You can even do great stuff like play wireless games between Air Hockey and Air Hockey Gold.  It’s like magic!<br><br>- Performance improvements!  With some more work under the hood, our testing showed a 1-puck single-player game ran at 60 frames per second on the iPhone 5 using only around 3% of the CPU.  Our custom physics engine is still running at 1000Hz (that’s 1000 times a second!) for the best Air Hockey on iOS!  Crazy!<br><br>- Squashed some bugs &amp; probably sprinkled in some new ones.  Line 2550 in the main game file really needed some work.<br> <br>- New icons!  Ok, this isn’t earth shattering, but we want the icon to look great on your device.  The Air Hockey icon looks awesome on your device.  Beautiful corners - we have ‘em.<br><br>- Dropped iOS support for everything before iOS 4.3.  This is a requirement to support the iPhone 5.  We really love our players who are still rockin’ their original iPod touches, but we have to move on.  (Psst!  Get a new iPod touch - they rock too!).<br><br>If you like Air Hockey, please take the time to give us a nice review.  It really helps."},{"version_id":"822512527","version_name":"1.19","version_date":"2017-06-13 00:04:29.000 +0800","version_description":"Thanks to all the millions of Air Hockey players out there! We dragged Air Hockey, kicking and screaming, into iOS 10 happiness. As you know, Air Hockey's been around a while. You wouldn't believe the mess we found in there. So, we ripped off some bandages, stripped out the bailing wire, and had to melt off some duct tape - but here it is! Here's what's new:<br>- 64 BITS OF GOODNESS! You won't see that warning about the developer needing to do an update anymore. Air Hockey, however, still runs exactly as awesomely fast as it ever did.<br>- Added support for iPad Pro along with all the latest iPhone models &amp; screen sizes.<br>- Melted &amp; reformed the menu code. (We'll add that replay button some day...it didn't make this version though.)<br>- Taught the AI some new tricks. The computer player is now a little smarter/different and better at using the whole table.<br>- Reflowed the goal detection logic to make sure we always catch those sneaky pucks.<br>- Made the Air Hockey logo shiny and happy again...and it sits were we told it to.<br>- Fixed the middle-of-the-screen pause screen double tap button placement. It was trying to get away.<br>- Fancied up the menu background translucent coloring a bit.<br>- New launch screen. Some devices &amp; iOS versions saw some odd behavior in the last version. No more!<br>- Reworked the device rotation code. You absolutely won't notice a difference, but it looks so much nicer under the hood.<br>- OK. Would you believe that until now Air Hockey still used a modified version of the way-long-gone OpenFeint to handle GameCenter? It was messy. MESSY. We had to use a chainsaw and leaf blower, but it's all gone &amp; replaced with sweet native Game Center code. (Please please let us know if you can find any Game Center, ummm, \"integration issues\" that are still hanging around.)<br>- Did some really minor graphics tweaks in a couple places. There was a spec that was a quarter pixel off. Kicked it!<br>- Killed some sound bugs.<br>- So many little odds &amp; ends that we forgot them all. We did stuff. It was good. There was much rejoicing.<br><br>Secret developer note from days of old: Did you know that the goal sounds in Air Hockey were recorded by sliding a plastic air hockey puck across a granite kitchen counter top into a glass mixing bowl with a wash cloth in it? It took about 100 tries plus some editing to get the few goal sounds we use in the game. Those were the days!"},{"version_id":"825721283","version_name":"1.20","version_date":"2018-01-24 00:50:23.000 +0800","version_description":"Millions of thanks to our millions of players! Here's what's new:<br>- Edge case bug tackling...previously if you played a wireless multiplayer game on a 12.9\" iPad Pro with a player on a smaller iPad or iPad Pro, things were way messed up. Pucks &amp; mallets were in the wrong places, sounds didn't match up, scores could have even been messed up. FIXED! If you have a 12.9\" iPad Pro and a smaller iPad, you can now play wireless games. Woot!<br>- A crafty player let us know that people were using the always-the-same puck placement to their advantage. So, yeah. Gotta fix that, right? You'll now see that whenever the pucks are placed (like when someone scores or a new game starts), they aren't always in exactly the same places. If you used to do the slide-o-trick to score, it's time to find another trick. (It'd be cool if you tell us what other sneaky tricks you have too.)"},{"version_id":"827888453","version_name":"1.21","version_date":"2018-08-21 03:59:30.000 +0800","version_description":"It's Air Hockey's 10 year anniversary!! Millions of thanks to our millions of players! Here's what's new this version:<br>- iPhone X support. This adds a new Air Hockey table size to fill the iPhone X's screen. It looks awesome! The new aspect ratio of the iPhone also means that wireless multiplayer games on the iPhone X will no longer work with iPhones other than the iPhone X.<br>- Added \"Play Again\" button on the iPhone build so that you don't have to go through the menu again after playing a game.<br>- GDPR update"},{"version_id":"828326923","version_name":"1.21.1","version_date":"2018-08-23 16:53:31.000 +0800","version_description":"Arrrgh! We hate it when a bug sneaks in. This quick update fixes a problem with Air Hockey running on iOS 9 that caused a crash on startup. If you find any other problems, please let us know at support@acceleroto.com.<br><br>v1.21 updates:<br>It's Air Hockey's 10 year anniversary!! Millions of thanks to our millions of players! Here's what's new this version:<br>- iPhone X support. This adds a new Air Hockey table size to fill the iPhone X's screen. It looks awesome! The new aspect ratio of the iPhone also means that wireless multiplayer games on the iPhone X will no longer work with iPhones other than the iPhone X.<br>- Added \"Play Again\" button on the iPhone build so that you don't have to go through the menu again after playing a game.<br>- GDPR update"},{"version_id":"828342089","version_name":"1.21.2","version_date":"2019-02-12 08:00:00.000 +0800","version_description":"This app has been updated by Apple to use the latest Apple signing certificate.<br><br>It's Air Hockey's 10 year anniversary!! Millions of thanks to our millions of players! Here's what's new in versions 1.21 - 1.21.2:<br>- iPhone X support. This adds a new Air Hockey table size to fill the iPhone X's screen. It looks awesome! The new aspect ratio of the iPhone also means that wireless multiplayer games on the iPhone X will no longer work with iPhones other than the iPhone X.<br>- Added \"Play Again\" button on the iPhone build so that you don't have to go through the menu again after playing a game.<br>- GDPR update<br>- Fixed a problem that could cause a crash on startup for devices running iOS 9.<br>- Fixed a menu bug that caused some players' games to not start properly after upgrading."},{"version_id":"841382848","version_name":"1.21.2","version_date":"2019-02-12 08:00:00.000 +0800","version_description":"This app has been updated by Apple to use the latest Apple signing certificate.<br><br>It's Air Hockey's 10 year anniversary!! Millions of thanks to our millions of players! Here's what's new in versions 1.21 - 1.21.2:<br>- iPhone X support. This adds a new Air Hockey table size to fill the iPhone X's screen. It looks awesome! The new aspect ratio of the iPhone also means that wireless multiplayer games on the iPhone X will no longer work with iPhones other than the iPhone X.<br>- Added \"Play Again\" button on the iPhone build so that you don't have to go through the menu again after playing a game.<br>- GDPR update<br>- Fixed a problem that could cause a crash on startup for devices running iOS 9.<br>- Fixed a menu bug that caused some players' games to not start properly after upgrading."}]