[{"version_id":"130942638","version_name":"1.47.3.4","version_date":"2013-11-20 18:23:39.000 +0800","version_description":"In cooperation with Adult Swim Games, we introduce the Adult Swim Games Skin Pack! Decorate your islands with awesome Adult Swim Games characters!<br><br>Turn the island statue into Lord Ferocious from A Monster Ate My Condo, Robot Unicorn from Robot Unicorn, or Alan Probe from Amateur Surgeon.  A Monster Ate My Condo gets more nods when you turn the Dodo into a Dodo/Reginald Starfire hybrid, the Doodler into Mr. Shigoto, and, weirdest of all, the shark into the Geisha Finger! Pay homage to Amateur Surgeon by splatting the islands with blood, or by using a hypodermic needle as a spear. The island's moon can be turned into the Robot Unicorn Crystal Star! And more!<br><br>In response, pygmies make a cameo in Adult Swim Games' hit iOS game, Amateur Surgeon! Alan Probe must perform surgery on Baby Awoogah, a killer whale.  Apparently, Baby Awoogah swallowed Oog Island and the residents are causing all sorts of problems. As you try to heal the whale, you must extract pygmies (as well as jellyfish and dodos) in order to repair the damage they've done!<br>If you’re unfamiliar with Adult Swim Games….where have you been? Go check them out now!<br><br>And don’t forget there are 47 existing episodes for you to explore. View the Challenges to try to find the hundreds of Pocket God interactions including the last APOCALYPTIC episode!<br><br>Episode 47: Apocalypse, Ow!<br>The end is finally here!  All the symbols glow on the Apocalypse Temple as the final room is opened. Past the disco lies the Closet Room, where you must rescue the new guest-Pygmy Tom from his prison! Tom doesn’t necessarily want to come out of the safety of his shell, so it’s up to you to figure out how to extract him. In this room, you will also meet the Thetans, cute alien spirits with their own agenda.<br><br>Still haven't had enough Pygmy?<br><br>Now on the app store: OOGA JUMP!<br>Based on the mini-game in Pocket God, we’ve created an insane new jumper with a whole new “spin” ...or should I say “slam”? Scale the heights in this jumper avoiding crazy obstacles straight from Pocket God and Journey To Uranus, including the Meteors, the Dodo, Barking Spiders and more. This jumper moves FAST as you slam bounce your way up collecting gems and avoiding the baddies…oh, and you break stuff too!  Included in the game is a store with different pygmies you can play, background skins, boosts and more! On the app store this Fall.<br><br>Don’t forget Pocket God: Journey To Uranus!<br>Along with the space age version of Pocket God powers, it has an array of fully realized games. Kill zombies in Decapithon, race aliens in HoverJump, and battle dragons on Uranus. <br><br>Currently on Pocket God, the comic:   In the latest arc “The Pygmies Strike Back” the tribes have divided into two teams to fight back against an unknown enemy who sent the stone Gem Creature (from Gem-Cell Research).  One treks across a desert to a temple where an evil presence lurks and is out to destroy ALL PYGMIES. The other team finds themselves guests of a city of friendly Bird-People... but are they all the same? An exciting conclusion is coming and their world will be changed forever! Catch up on Pocket God the Comic today!"},{"version_id":"1427432","version_name":"1.0","version_date":"","version_description":""},{"version_id":"1435841","version_name":"1.01","version_date":"","version_description":""},{"version_id":"1443154","version_name":"1.02","version_date":"","version_description":""},{"version_id":"1449494","version_name":"1.03","version_date":"","version_description":""},{"version_id":"1457594","version_name":"1.04","version_date":"","version_description":""},{"version_id":"1468632","version_name":"1.05","version_date":"","version_description":""},{"version_id":"1478863","version_name":"1.06","version_date":"","version_description":""},{"version_id":"1488153","version_name":"1.07","version_date":"","version_description":""},{"version_id":"1515041","version_name":"1.09","version_date":"","version_description":""},{"version_id":"1527388","version_name":"1.10","version_date":"","version_description":""},{"version_id":"1560371","version_name":"1.12","version_date":"","version_description":""},{"version_id":"1614122","version_name":"1.13","version_date":"","version_description":""},{"version_id":"1631900","version_name":"1.14","version_date":"","version_description":""},{"version_id":"165632639","version_name":"1.48","version_date":"2014-11-27 04:37:30.000 +0800","version_description":"Episode 48: Call of Booty<br>By popular demand, we introduce to you a whole new update with a vast new undersea area! Find water wings lying around on an island, put them on a pygmy, and he’ll dive in! Explore the depths of the ocean while hunting for hidden treasure. Use the map to locate pieces of booty while avoiding mines that turn pygmies to stone, face-huggers that impregnate you with their young, and hungry oysters that lurk on the ocean floor. Finding the first piece of booty, kicks off the mini-game and gets the attention of the face-huggers who will start to chase you. Swim and swerve to avoid them! Also, the area wraps so even if the treasure is behind you, the best strategy MAY BE to forge ahead until the treasure cross the screen to the front of you. But be warned, time is limited while the mini-game is going and the pygmy can run out of air. Collecting treasure trapped in air bubbles renews his oxygen supply. There are 20 pieces of booty to find. Can you collect them all?<br><br>Be sure to take the Episode 48 God Challenge to earn the Oyster God idol!<br><br>And don’t forget there are 47 previous episodes for you to explore. View the Challenges to try to find the hundreds of Pocket God interactions including the last APOCALYPTIC episode!<br><br>Still haven’t had enough pygmy? Pocket God Journey To Uranus, Ooga Jump and Pocket God comics an all be found on the app store!"},{"version_id":"1685953","version_name":"1.15","version_date":"","version_description":""},{"version_id":"1713432","version_name":"1.16","version_date":"","version_description":""},{"version_id":"1795134","version_name":"1.19","version_date":"","version_description":""},{"version_id":"1824735","version_name":"1.20","version_date":"","version_description":""},{"version_id":"2838778","version_name":"1.33","version_date":"","version_description":""},{"version_id":"2995219","version_name":"1.34","version_date":"2010-09-25 15:39:38.000 +0800","version_description":"Ape Mountain is infested with monkeys! Attract them with bananas and watch them create chaos. You can help or hinder them. Also included is Dance Pack Too, featuring the first ever app POP SONG: \"The Pocket God Update Song\" written and performed by Jonathan Mann as well as 6 other dances.  Be sure to check out the first two issues of the Pocket God comic, available on iTunes!"},{"version_id":"3225016","version_name":"1.36","version_date":"2010-12-20 16:24:54.000 +0800","version_description":"This update adds the mini-game Konkey Dong! Place a pygmy in the grip of the gorilla idol on Ape Mountain (be sure to have the banana tree turned on) and the game will begin. When the game starts, tilt the device to go left and right, tap the right to jump, tap upper left to climb up a ladder and lower left to climb down a ladder. Also included is the Japanese Skin Pack (99cents) where you can give the islands an Eastern flare with an oragami dodo, a buddha statue, bamboo and much more. Also included is the Fishmas skin pack (absolutely free!) which includes a dance where the pygmies sing you a Fishmas Carol! Its like Christmas but with fish!"},{"version_id":"51522635","version_name":"1.47.3.3","version_date":"","version_description":""},{"version_id":"811153642","version_name":"1.48.1","version_date":"2014-12-07 01:05:17.000 +0800","version_description":"Challenge of the Gods Bug Fix:<br>Due to an issue with save data being corrupted, some users are losing their Challenge of the Gods idol data. If you’ve lost your data, we’ve included a fix. In Challenge Options (accessible from the opening screen), there are two new buttons. “Unlock All Challenges” will automatically unlock idols for all episode challenges and “Level Up All Idols” to set all idols to 20. We apologize for any inconvenience. For those of you who haven't lost your save data, Merry Christmas you can now unlock all your challenges and max out your idols.<br><br>Episode 48: Call of Booty<br>By popular demand, we introduce to you a whole new update with a vast new undersea area! Find water wings lying around on an island, put them on a pygmy, and he’ll dive in! Explore the depths of the ocean while hunting for hidden treasure. Use the map to locate pieces of booty while avoiding mines that turn pygmies to stone, face-huggers that impregnate you with their young, and hungry oysters that lurk on the ocean floor. Finding the first piece of booty, kicks off the mini-game and gets the attention of the face-huggers who will start to chase you. Swim and swerve to avoid them! Also, the area wraps so even if the treasure is behind you, the best strategy MAY BE to forge ahead until the treasure cross the screen to the front of you. But be warned, time is limited while the mini-game is going and the pygmy can run out of air. Collecting treasure trapped in air bubbles renews his oxygen supply. There are 20 pieces of booty to find. Can you collect them all?<br><br>Be sure to take the Episode 48 God Challenge to earn the Oyster God idol!<br><br>And don’t forget there are 47 previous episodes for you to explore. View the Challenges to try to find the hundreds of Pocket God interactions including the last APOCALYPTIC episode!<br><br>Still haven’t had enough pygmy? Pocket God Journey To Uranus, Ooga Jump and Pocket God comics an all be found on the app store!"},{"version_id":"813082377","version_name":"1.48.2","version_date":"2015-08-20 02:05:15.000 +0800","version_description":"This app has been updated by Apple to use the latest Apple signing certificate.<br><br>64 bit compatibility"},{"version_id":"837145991","version_name":"1.48.2","version_date":"2015-08-20 02:05:15.000 +0800","version_description":"This app has been updated by Apple to use the latest Apple signing certificate.<br><br>64 bit compatibility"}]