[{"version_id":"11343454","version_name":"3.1.3","version_date":"","version_description":""},{"version_id":"2571411","version_name":"1.5","version_date":"","version_description":""},{"version_id":"3006996","version_name":"2.0","version_date":"","version_description":""},{"version_id":"3150218","version_name":"2.1","version_date":"","version_description":""},{"version_id":"3277904","version_name":"2.2","version_date":"","version_description":""},{"version_id":"52152641","version_name":"3.2.3","version_date":"","version_description":""},{"version_id":"589402698","version_name":"4.0.2","version_date":"","version_description":""},{"version_id":"655032711","version_name":"4.1","version_date":"","version_description":""},{"version_id":"706242667","version_name":"4.2","version_date":"","version_description":""},{"version_id":"763753211","version_name":"4.3","version_date":"","version_description":""},{"version_id":"80342668","version_name":"3.2.4","version_date":"","version_description":""},{"version_id":"811632490","version_name":"4.4","version_date":"","version_description":""},{"version_id":"812137504","version_name":"4.5","version_date":"2015-04-28 23:04:38.000 +0800","version_description":"There are so many PressReader articles published, shared and commented on every day. Are you wondering what everyone's talking about? Now you can find all current discussions happening on PressReader on the Opinion Trends map, found in the app menu.<br><br>The map will display the most active opinions in your community. Browse the list of opinions for topics that interest you, or just have a peek at what your neighbors are saying. If you find one that you agree with, just tap to add it to your own account. You can become an opinion leader on PressReader by rallying supporters to your cause. Just add your opinion to articles, share them to your social networks, and make your voice heard!<br><br>This update also includes improved download management, bug fixes and performance improvements."},{"version_id":"812340056","version_name":"4.5.1","version_date":"2015-05-05 21:03:33.000 +0800","version_description":"There are so many PressReader articles published, shared and commented on every day. Are you wondering what everyone's talking about? Now you can find all current discussions happening on PressReader on the Opinion Trends map, found in the app menu.<br><br>The map will display the most active opinions in your community. Browse the list of opinions for topics that interest you, or just have a peek at what your neighbors are saying. If you find one that you agree with, just tap to add it to your own account. You can become an opinion leader on PressReader by rallying supporters to your cause. Just add your opinion to articles, share them to your social networks, and make your voice heard!<br><br>This update also includes improved download management, bug fixes and performance improvements."},{"version_id":"813120241","version_name":"4.7","version_date":"2015-08-27 18:08:18.000 +0800","version_description":"Sign in to PressReader with one click using your Twitter, Facebook or Google+ account! When you create your free account, you’ll get an unlimited stream of top news stories that you can read, share, and save for later. You can also create personalized news feeds, alerts and keyword monitors on the 4,000+ titles that we carry. <br><br>We’ve also included bug fixes and performance improvements in this update, such as the pre-rendering of high-resolution images. This change will significantly speed up the initial opening of all issues in page view mode."},{"version_id":"815366199","version_name":"4.8","version_date":"2015-12-17 17:48:40.000 +0800","version_description":"Now optimized for iPad Pro and iOS 9! <br>Start reading immediately while your magazine or newspaper loads in the background. You can also listen to stories using your own text-to-speech engine, with full Bluetooth support. (This really comes in handy on road trips.)<br>We’d love to hear what you think! Visit our forums or leave a review with your comments."},{"version_id":"816459866","version_name":"4.8.1","version_date":"2016-03-07 20:27:57.000 +0800","version_description":"3D touch gestures on iPhone 6s/6s+ : Browse the original graphic layouts of your favorite titles and use 3D touch to preview articles. You’ll be able to pop into a mobile-friendly reading view and then use 3D touch from anywhere on your screen to instantly share it or leave a comment.<br><br>Simplified issue ordering : Tap on the thumbnail image or name of the publication to view available supplements and back issues. Or, tap on the arrow to download the title while you continue to browse the catalog."},{"version_id":"816716359","version_name":"4.8.2","version_date":"2016-03-17 17:41:01.000 +0800","version_description":"We've improved the clarity and resolution of pages when a title is first opened, and the list of sections of titles on the Publications screen has also been updated."},{"version_id":"817593615","version_name":"4.9","version_date":"2016-05-31 17:39:58.000 +0800","version_description":"Download the brand new version to receive free magazines and newspapers in PressReader courtesy of our partners!  How?  Simply enable gifts and notifications in the app settings, and you'll receive a note when your location offers gifts.<br>This version is fully optimized for iPad Pro to support split screen mode with side-by-side operations with other applications. We’ve also added support for both Simplified and Traditional Chinese, and included bug fixes."},{"version_id":"817763240","version_name":"4.9.1","version_date":"2016-06-16 17:53:22.000 +0800","version_description":"Download the brand new version to receive free magazines and newspapers in PressReader courtesy of our partners!  How?  Simply enable gifts and notifications in the app settings, and you'll receive a note when your location offers gifts.<br>This version is fully optimized for iPad Pro to support split screen mode with side-by-side operations with other applications. We’ve also added support for both Simplified and Traditional Chinese, and included bug fixes."},{"version_id":"818926004","version_name":"4.9.2","version_date":"2016-09-29 18:19:47.000 +0800","version_description":"This version has been updated for better compatibility with iOS 10. Be sure to enable gifts and notifications in the app to receive free magazines and newspapers in PressReader, courtesy of our partners!"},{"version_id":"819211372","version_name":"4.9.3","version_date":"2016-10-11 00:59:15.000 +0800","version_description":"We've updated the app to take advantage of iOS 10. Be sure to enable gifts and notifications in the app to receive free magazines and newspapers in PressReader, courtesy of our partners!"},{"version_id":"820897426","version_name":"5.0","version_date":"2017-03-06 21:05:07.000 +0800","version_description":"Reading just got a little brighter and a lot more fun! You’ll notice some amazing changes in this release, including a brighter interface, easier navigation and new reading gestures to streamline your reading experience. Here are the best bits in the latest app<br><br>DESIGN<br>— Always know when you’ve successfully connected to a HotSpot. The green teacup will tell you when your magazine and newspaper downloads are being sponsored by one of our partners. <br>—We’ve lightened the app color scheme in keeping with our refreshed brand, and updated our logo and app icon.<br>— On iPhone, you can easily read entire issues. Swipe right on article snippets to pop them open and swipe back again when you’re done.<br>— Hide and seek is fun, but not when you’re looking for something.  You’ll find the menu always on the left side on your iPad, and at the lower edge of the screen on iPhone. <br><br>FEATURES<br>— Look up unfamiliar words and phrases by highlighting them and tapping “Look Up”. This will return relevant dictionary, Wikipedia, website or maps results. (“Look Up” was one of our most popular feature requests — thanks for voting!)<br>— Skip the sign in process when you share articles using any of the apps you already have installed.<br>— Set the size of the type that you’re reading with our new text control.<br>— New users can save articles (without being signed in) to read or share later.<br>— Add multiple images to your comments after registering for a free account. <br>— Change from the printed view to a text view using the menu at the bottom of the screen.<br><br>FIXES<br>— We’ve added a confirmation message for single issue payments after a HotSpot connection. This will avoid any confusion if one HotSpot has expired, and you haven’t picked up a new one yet.<br>— The titles shown in the catalog will be in your chosen language (because that makes good sense).<br>— We’ve added a ‘Forgot Password?’ process to the app on iPhones. <br>— The account page has a back button once again. It had disappeared for readers using split screen. <br>— We’ve fixed the way that articles are saved to note-taking apps. Now they’ll include every piece of the article when it’s continued on multiple pages. <br>— The Publications page has been updated to handle a much faster scroll of the cover thumbnails."},{"version_id":"821643404","version_name":"5.1","version_date":"2017-04-24 23:14:42.000 +0800","version_description":"For the first time in the app, we're introducing a way for you use your library card to unlock the benefits of a full subscription. Keep what you download — no more library late fees! Scroll through the list or use the search field to find your library, then enter your card number and PIN. <br><br>Link all of your social profiles and your library card to your existing PressReader account. Then, you can sign in with any of your social accounts and have all your activity collected in your PressReader channel. Add your library card, Facebook, Twitter and Google accounts on the Accounts tab under social and linked networks.<br><br>Change your password right in the app. Nobody likes guessing when they last updated their password, so we've added a date stamp so that you can see when you did. You can also change the email attached to your account, and your photo or nickname.<br><br>Get quick translations of single stories to keep up to date with the world's press. Read news from many different perspectives. Expand an article and tap on the menu in the top right corner to translate it.<br><br>Fixed: Menus will now disappear as they're supposed to, particularly once an issue has been opened."},{"version_id":"822026788","version_name":"5.1.1","version_date":"2017-05-08 17:14:32.000 +0800","version_description":"Bug fixes<br><br>version 5.1:<br>For the first time in the app, we're introducing a way for you use your library card to unlock the benefits of a full subscription. Keep what you download — no more library late fees! Scroll through the list or use the search field to find your library, then enter your card number and PIN. <br><br>Link all of your social profiles and your library card to your existing PressReader account. Then, you can sign in with any of your social accounts and have all your activity collected in your PressReader channel. Add your library card, Facebook, Twitter and Google accounts on the Accounts tab under social and linked networks.<br><br>Change your password right in the app. Nobody likes guessing when they last updated their password, so we've added a date stamp so that you can see when you did. You can also change the email attached to your account, and your photo or nickname.<br><br>Get quick translations of single stories to keep up to date with the world's press. Read news from many different perspectives. Expand an article and tap on the menu in the top right corner to translate it.<br><br>Fixed: Menus will now disappear as they're supposed to, particularly once an issue has been opened."},{"version_id":"822918440","version_name":"5.1.2","version_date":"2017-07-24 16:32:11.000 +0800","version_description":"— We're celebrating!  More than 7,000 titles have joined PressReader. What are you reading next?<br>— Introducing Graphic Bookmarks: Love a page in one of our magazines? Save it to a collection, or share it with friends. Just tap on the outer corner at the top of the page to get started. <br>— Fixed: We've done a number of things to improve the performance of the app, and clear out pesky bugs. <br><br>If you like what we're doing, please rate and review us. It really helps!"},{"version_id":"823594671","version_name":"5.2","version_date":"2017-09-13 16:08:47.000 +0800","version_description":"iPhone readers, we’ve added channels to the app for you. Just like the web and on the iPad, your channel is your space on PressReader to tell your story and curate news on topics that interest you. Add an opinion to your channel to make it uniquely yours. It takes just a minute.<br><br>Like what we’re doing? If so, feel free to rate us in the app store. You can send questions to care@pressreader.com."},{"version_id":"823868127","version_name":"5.2.1","version_date":"2017-10-02 18:11:18.000 +0800","version_description":"iPhone readers, we’ve added channels to the app for you. Just like the web and on the iPad, your channel is your space on PressReader to tell your story and curate news on topics that interest you. Add an opinion to your channel to make it uniquely yours. It takes just a minute.<br><br>Like what we’re doing? If so, feel free to rate us in the app store. You can send questions to care@pressreader.com."},{"version_id":"823987233","version_name":"5.2.2","version_date":"2017-10-13 16:54:05.000 +0800","version_description":"We now support iOS 11 and iPhone X in case you somehow got one earlier than everybody else.<br> <br>Lucky."},{"version_id":"824124243","version_name":"5.2.3","version_date":"2017-11-02 19:53:52.000 +0800","version_description":"We've fixed a bug affecting readers who wanted to connect to a HotSpot using location services. The table of contents inside a few publications was not clickable. We've fixed that too. And, we've eliminated bugs affecting iPhone X and iOS 11."},{"version_id":"824779308","version_name":"5.2.4","version_date":"2017-11-28 18:40:09.000 +0800","version_description":"We adjusted the interface a little bit so it’s prettier to look at and easier to use. We also repaired some of the crashes you told us about (thanks for that) and squashed a few bugs."},{"version_id":"825346437","version_name":"5.2.5","version_date":"2017-12-18 18:41:40.000 +0800","version_description":"We've added Facebook and Twitter sign in for our friends using iOS 11. Our team has also checked the log files that you've sent in to make the app better, and removed a few bugs."},{"version_id":"826013619","version_name":"5.3.8","version_date":"2018-12-13 17:52:25.000 +0800","version_description":"We’ve spent time boosting performance and squashing bugs."},{"version_id":"826013619","version_name":"5.2.6","version_date":"2018-02-20 23:11:55.000 +0800","version_description":"We made some of our HotSpots bigger. That means you have more places to connect to PressReader and download entire issues to your device."},{"version_id":"826252567","version_name":"5.2.7","version_date":"2018-03-15 20:54:06.000 +0800","version_description":"We've updated search to make it easier for you to find and download favorite issues, and fixed a few bugs."},{"version_id":"826754501","version_name":"5.3","version_date":"2018-05-07 18:02:50.000 +0800","version_description":"We’ve improved the performance of scrolling through stories in text view."},{"version_id":"827285248","version_name":"5.3.1","version_date":"2018-05-28 16:31:27.000 +0800","version_description":"We’ve changed our privacy policy, terms of use and software license agreements to be more transparent and to keep up with changes to European data protection law. Take a moment to review the new policies here: https://www.pressreader.com/help/policies<br><br>We’ve also made an update to the default page view from single page to double for our readers who use landscape mode on larger iPhones. This release includes small bug fixes and updates."},{"version_id":"827931264","version_name":"5.3.2","version_date":"2018-07-23 17:32:35.000 +0800","version_description":"We’ve made an update to the default page view from single page to double for our readers who use landscape mode on larger iPhones. This release also includes small bug fixes and updates."},{"version_id":"828058450","version_name":"5.3.3","version_date":"2018-08-02 17:32:37.000 +0800","version_description":"This release includes small bug fixes and updates"},{"version_id":"828232741","version_name":"5.3.4","version_date":"2018-08-24 17:04:09.000 +0800","version_description":"Abbiamo aggiornato la nostra informativa sulla privacy, le condizioni d’utilizzo e il conratto di licenza software in modo da essere conformi alle direttive della nuova normativa Europea in materia di protezione dati."},{"version_id":"828373692","version_name":"5.3.5","version_date":"2018-09-03 15:38:40.000 +0800","version_description":"While you're deciding what to read next, we're working to make that experience even better. Keep your updates turned on to get the latest for downloading issues and zooming near the edges of the page in page view."},{"version_id":"828873642","version_name":"5.3.6","version_date":"2018-10-15 16:20:59.000 +0800","version_description":"We’ve updated our social network sign-in process, and crushed a few bugs."},{"version_id":"829218414","version_name":"5.3.7","version_date":"2018-11-26 23:11:40.000 +0800","version_description":"Now you can try PressReader Premium FREE for 7 days<br>Get 7 days of totally free access to everything on PressReader. At the end of the trial, your subscription will automatically renew. Cancel at any time.<br> <br>There are some other goodies in this release, too. We’ve updated the Text View reading experience on the iPhone. Plus, if you’re near one of our HotSpots, we’ll let you know so you can get sponsored access to your favorite publications. As usual, we’ve spent some time boosting performance and squashing bugs.<br> <br>Let us know what you think by tapping through Settings &gt; General &gt; Send Us Feedback, or send an email to care@pressreader.com."},{"version_id":"829595573","version_name":"5.3.8","version_date":"2018-12-13 17:52:25.000 +0800","version_description":"We’ve spent time boosting performance and squashing bugs."},{"version_id":"830311477","version_name":"5.4","version_date":"2019-03-13 15:32:17.000 +0800","version_description":"New year, new features! The news feed is appearing for the first time on iPhones. Mastheads have been added to visually tie each story to its source. And thanks to your feedback, the Browse &amp; Downloaded sections have been darkened. Now those covers really pop.<br><br>What’s new on all screens: The menu names for the news feed and the catalog have been changed to For You and Browse. Photo covers have also been added to each category to help filter the catalog.<br><br>As always, we’d love to hear from you. Contact care@pressreader.com to let us know what you think."},{"version_id":"830636035","version_name":"5.4.1","version_date":"2019-03-20 17:41:34.000 +0800","version_description":"You asked for it, and we're listening. We've made a few tweaks based on your feedback. <br>Here's what's changed: <br>** Now you can disable full screen while reading an issue.<br>** The appearance of the headline animation has been strictly limited.<br>** There are some minor adjustments to the look &amp; feel. <br>** Just as in every app update, we also put time towards stability &amp; performance improvements. <br><br>There are a lot of other recently added features that we're continuing to refine for the iPhone. The news feed is appearing for the first time. Mastheads have been added to visually tie each story to its source. And, the Browse &amp; Downloaded sections use a new dark theme. On all screens, the menu names for the news feed and the catalog have been changed to For You and Browse. Photo covers have also been added to each category to help filter the catalog.<br><br>Keep your comments coming! Contact care@pressreader.com to let us know what you think."},{"version_id":"830760669","version_name":"5.4.2","version_date":"2019-04-18 17:52:16.000 +0800","version_description":"We’ve made a few tiny adjustments in this release to get everything just right. <br><br>Here's what we’ve been working on:<br><br>When you dive into a category, you can sort the results in a few different ways. We’ve updated the most current and the most popular sorting tools for the catalog.<br><br>We’ve also been fine-tuning the app design. You might notice minor updates when you view an issue on your iPhone, in article bookmarks, and in the newspapers and magazines recommended in the news feed. <br><br>Let us know what you think. Reach us anytime at care@pressreader.com."},{"version_id":"831171972","version_name":"5.4.3","version_date":"2019-05-15 23:53:02.000 +0800","version_description":"Olá, Merhaba! This update includes Portuguese and Turkish language support. We’ve also made a few other tweaks:<br><br>** Publications open more quickly when you tap on an app notification.<br>** Fixed advanced search for iPad readers.<br>** Ensured that the menus are backward compatible.<br>** Corrected issues sent by readers since our last app update.<br><br>Let us know what you think. Reach us anytime at care@pressreader.com."},{"version_id":"831468553","version_name":"5.5","version_date":"2019-08-12 18:17:25.000 +0800","version_description":"Looking for something specific? In this update, we’ve unleashed the full power of our search results. Previously, results were restricted to stories published in the past three days. No longer. We’ve also made a few other tweaks:\n<br>\n<br>** Upgrades for subscriptions and single issue purchases\n<br>** Improvements to the look and feel of the app\n<br>** Corrected items sent through by you, our readers\n<br>**Support for iOS 11 and up\n<br>\n<br>Let us know what you think. Reach us anytime at care@pressreader.com."},{"version_id":"833661040","version_name":"5.6","version_date":"2019-11-20 19:13:34.000 +0800","version_description":"We’ve launched a new personalization engine in certain regions so that we can better recommend content you’ll love. If you’re lucky, you’ll get to try it out with this update, and if not, just give us a little more time and we’ll roll it out to everyone. <br>In this release we’ve also made compatibility improvements for iOS 13, and added a new login option for Apple ID.<br>Tell us what you think. Reach us anytime at care@pressreader.com."},{"version_id":"833726344","version_name":"5.6.1","version_date":"2019-11-23 20:15:14.000 +0800","version_description":"We’ve launched a new personalization engine in certain regions so that we can better recommend content you’ll love. If you’re lucky, you’ll get to try it out with this update, and if not, just give us a little more time and we’ll roll it out to everyone. <br>In this release we’ve also made compatibility improvements for iOS 13, and added a new login option for Apple ID.<br>Tell us what you think. Reach us anytime at care@pressreader.com."},{"version_id":"833877271","version_name":"5.7","version_date":"2019-12-12 23:35:35.000 +0800","version_description":"Hey tablet users, we're rolling out this out to you: we've launched a new personalization engine in certain regions so that we can better recommend content you’ll love. If you’re lucky, you’ll get to try it out with this update, and if not, just give us a little more time and we’ll roll it out to everyone. Have you made a new discovery lately? Tell us about it. Reach us anytime at care@pressreader.com."},{"version_id":"833990846","version_name":"5.7.1","version_date":"2019-12-17 23:18:42.000 +0800","version_description":"As usual, we’ve spent some time boosting performance and squashing bugs. Have a question? Get in touch with us. Now you can attach log files to your note as well to give our technical folks a head start on any issue happening in the app."},{"version_id":"835412236","version_name":"5.7.2","version_date":"2020-04-15 23:04:32.000 +0800","version_description":"Spending more time at home? We're here for you. In this update we've spent some time smoothing out the sign-in process with your library card.  As usual, we’ve also spent time boosting performance and squashing bugs. Have a question? Get in touch with us. Stay safe, stay healthy, and send an email to care@pressreader.com."},{"version_id":"835776252","version_name":"5.7.3","version_date":"2020-05-01 17:24:24.000 +0800","version_description":"Spending more time at home? We're here for you. In this update, we've boosted performance and squashed bugs. Have a question? Get in touch with us. Stay safe, stay healthy, and send an email to care@pressreader.com."},{"version_id":"836230329","version_name":"5.7.4","version_date":"2020-06-09 20:39:12.000 +0800","version_description":"This update includes more support for the languages that we support in the app.<br><br>Do you have some feedback for us? Reach us anytime at care@pressreader.com."},{"version_id":"836425201","version_name":"5.7.5","version_date":"2020-07-06 16:24:45.000 +0800","version_description":"Spending more time at home? We're here for you. As usual, we’ve spent time boosting performance and squashing bugs. Have a question? Get in touch with us. Stay safe, stay healthy, and send an email to care@pressreader.com."},{"version_id":"837050390","version_name":"5.7.6","version_date":"2020-08-10 17:39:50.000 +0800","version_description":"Ready to turn off the screen, but still want to be caught up with the latest stories? We've got a player for that.\n<br><br>Here's a quick summary of the tweaks we've made in this release: \n<br>•\tyou've got a scrollbar that will change the playback position once you're in a story\n<br>•\tyou can skip 15 seconds forward and back for more fine-tuned control, and \n<br>•\tthere’s a playback speed feature that will let you decide how quickly the story is read. \n<br><br>As usual, we’ve spent time boosting performance and squashing bugs. Have a question? Get in touch with us. Stay safe, stay healthy, and send an email to care@pressreader.com."},{"version_id":"837470918","version_name":"5.7.7","version_date":"2020-08-25 17:31:24.000 +0800","version_description":"Ready to turn off the screen, but still want to be caught up with the latest stories? We've got a player for that.\n<br>\n<br>Here's a quick summary of the tweaks we've made in this release: \n<br>•\tyou've got a scrollbar that will change the playback position once you're in a story\n<br>•\tyou can skip 15 seconds forward and back for more fine-tuned control, and \n<br>•\tthere’s a playback speed feature that will let you decide how quickly the story is read. \n<br>\n<br>As usual, we’ve spent time boosting performance and squashing bugs. Have a question? Get in touch with us. Stay safe, stay healthy, and send an email to care@pressreader.com."},{"version_id":"837546949","version_name":"6.1","version_date":"2020-10-07 18:47:07.000 +0800","version_description":"The dark theme has returned to the tablet. Open any issue in the original print layout to start reading. It's ideal for low-light and late-night situations.  Vertical layouts have been added too. Tilt your screen in any direction to choose your preferred view. Other pieces of the app have been polished: there are new icons for the follow and audio buttons, article tags are clickable, and the navigation and screen designs have been updated."},{"version_id":"838120698","version_name":"6.1.1","version_date":"2020-10-10 16:47:40.000 +0800","version_description":"The dark theme has returned to the tablet. Open any issue in the original print layout to start reading. It's ideal for low-light and late-night situations.  Vertical layouts have been added too. Tilt your screen in any direction to choose your preferred view. Other pieces of the app have been polished: there are new icons for the follow and audio buttons, article tags are clickable, and the navigation and screen designs have been updated. We've also addressed performance and stability issues in this release."},{"version_id":"838196500","version_name":"6.2","version_date":"2020-11-17 20:49:04.000 +0800","version_description":"•\tNow fully supports iOS 14 – yup, we’re happy too. <br>•\tYou spoke, we listened. We’ve debugged based on your feedback"},{"version_id":"839473580","version_name":"6.3","version_date":"2021-01-21 20:00:46.000 +0800","version_description":"Spending more time at home? We're here for you. As usual, we’ve also spent time boosting performance and squashing bugs in this release.<br>Have a question? Get in touch with us. Stay safe, stay healthy, and send an email to care@pressreader.com."},{"version_id":"840151231","version_name":"6.3.1","version_date":"2021-01-28 21:37:15.000 +0800","version_description":"Spending more time at home? We're here for you. As usual, we’ve also spent time boosting performance and squashing bugs in this release.\n<br>Have a question? Get in touch with us. Stay safe, stay healthy, and send an email to care@pressreader.com."},{"version_id":"840252916","version_name":"6.3.2","version_date":"2021-03-22 18:35:28.000 +0800","version_description":"Spending more time at home? We're here for you. As usual, we’ve also spent time boosting performance and squashing bugs in this release.<br>Have a question? Get in touch with us. Stay safe, stay healthy, and send an email to care@pressreader.com."},{"version_id":"841511975","version_name":"6.3.3","version_date":"2021-04-27 01:03:02.000 +0800","version_description":"Various internal app optimizations and fixes. Added additional support for iOS 14.5."},{"version_id":"841995762","version_name":"6.3.4","version_date":"2021-05-03 18:55:21.000 +0800","version_description":"Various internal app optimizations and fixes. Added additional support for iOS 14.5."},{"version_id":"842057246","version_name":"6.3.5","version_date":"2021-05-10 19:57:44.000 +0800","version_description":"We’ve been busy with some improvements:<br>* Resolved Bookmarks bugs on iPad<br>* New version available dialog improvement"},{"version_id":"842493834","version_name":"6.3.6","version_date":"2021-06-16 16:14:07.000 +0800","version_description":"We've been busy with some improvements and updates:<br>- Improved back issues calendar UI allowing easier navigation through previous months and years.<br>- Fix for LTE users: Download Now popup dialog now working correctly."}]