[{"version_id":"816175059","version_name":"9.3","version_date":"2016-02-01 00:15:16.000 +0800","version_description":"-= v9.3 =-<br>- Improved support for iPad<br>- Support for iPad Pro<br><br>-= v9.0 =-<br>- iOS 9 update<br>- 3D Touch Support<br>- Spotlight Search Support<br>- Fixed font change crash when running on iOS 9<br><br>-= v7.9 =-<br>- Additional iOS 8 Fixes and Enhancements<br>- Fixed crash issues on iPad when sharing/printing<br>- Added iCloud Drive import/export option<br>- Google Drive improvements<br>- Improved Icons in iPhone 6 and 6 Plus<br><br>-= v7.8 =-<br>- iPhone 6 &amp; iPhone 6 Plus Native Support<br>- iOS 8 Compatibility fix<br>- Fixed crash in text editing<br>- Stability update in Spreadsheet<br>- Fixed icon rendering on iOS 7.1<br>- Improved file browsing speed<br><br>-= v7.7 =-<br>- Improved landscape support<br>- Additional subscription length<br>- Stability improvements<br><br>-= v7.6 =- <br>- Faster file browsing <br>- Multipage and B&amp;W scanning <br>- Stability bugfixes <br><br>-= v7.5 =- <br>- Minor Bugfixes <br><br>-= v7.4 =- <br>- Improved Landscape Support <br>- Added Chinese Localization <br>- Speed improvements <br>- Stability improvements <br>- Fixed issue with autoscroll <br><br>-= v7.3 =- <br>- Fixed minor UI glitches <br><br>-= v7.2 =- <br>- Fixed issue exiting scanning mode <br><br>-= v7.1 =- <br>- Fixed a issue crash on launch when large pdf files exist <br>- Fixed a UI display issue <br>- Fixed Save As Logic <br><br>-= v7.0 =- <br>- iOS 7 Update <br>- Improved performance <br>- Improved rich text file support <br>- Improved support for attachments <br>- Refreshed UI and transitions <br>- New file transfer options <br>- New tutorial screens <br>- Fixed a rare crash issue on saving <br><br>-= v6.4 =- <br>- Fixed a slowdown/crash issue on directory screen <br><br>-= v6.3 =- <br>- Added support for new video codecs <br>- Fixed a rare launch crash bug <br><br>-= v6.2 =- <br>- Fixed open with bug <br>- Fixed default print margins <br><br>-= v6.1 =- <br>- Added Automatic Document Scanning Option <br>- Added Enhanced Data Protection <br>- Added export to photos feature <br>- Added export to pdf feature <br>- Enhanced media playback support <br>- UI Improvements <br>- Improved rendering speed <br><br>-= v5.9 =- <br>- fixed orientation rotation issues. <br>- fixed multiple email attachment issues. <br>- added document search functionality. <br><br>-= v5.8 =- <br>- Improved handling of currency and percentages in iSpreadsheet <br><br>-= v5.7 =- <br>- Updated UI. <br>- Improved editing for paint documents. <br>- Improved moving documents. <br>- Improved support for online files. <br>- Bugfixes."},{"version_id":"823098907","version_name":"10","version_date":"2017-08-03 11:16:59.000 +0800","version_description":"Newly update with iPad Pro and Multitasking support. Updated support for Dropbox v3, Google Docs v3, and MS OneDrive. Speed improvements in browsing."},{"version_id":"823175145","version_name":"10.1","version_date":"2017-08-05 09:51:49.000 +0800","version_description":"Fixed a crash issue during authentication screen with Google Drive for some users."},{"version_id":"823273822","version_name":"10.2","version_date":"2017-08-12 10:43:42.000 +0800","version_description":"Fixed a connectivity issue with Google Drive which can cause the app to shutdown."},{"version_id":"824053041","version_name":"11","version_date":"2017-10-19 03:26:10.000 +0800","version_description":"iOS 11 UI Update. Fixes content placement issues running on iOS 11 and iPhone X. Also added support for Dropbox V2."},{"version_id":"824753095","version_name":"11.1","version_date":"2017-11-30 02:28:24.000 +0800","version_description":"UI improvements for iPhone X. Face ID Support. Dropbox v2 download fix. Improved support for landscape orientation in spreadsheets."},{"version_id":"825460609","version_name":"11.2","version_date":"2017-12-31 00:08:31.000 +0800","version_description":"Stability update and improved docunment sharing features. Now supports larger spreadsheets."},{"version_id":"825642645","version_name":"11.3","version_date":"2018-01-15 23:16:07.000 +0800","version_description":"Fixed a issue on iPad where the formatting toolbar can become obstructed by other UI."},{"version_id":"826069999","version_name":"11.4","version_date":"2018-02-23 08:57:54.000 +0800","version_description":"This app has been updated by Apple to use the latest Apple signing certificate.<br><br>Fixes an issue on iPad where rich text editing can become covered by the Keyboard on iOS 11. Improved dropbox connectivity. Minor UI Improvements."},{"version_id":"841383769","version_name":"11.4","version_date":"2018-02-23 08:57:54.000 +0800","version_description":"This app has been updated by Apple to use the latest Apple signing certificate.<br><br>Fixes an issue on iPad where rich text editing can become covered by the Keyboard on iOS 11. Improved dropbox connectivity. Minor UI Improvements."}]