[{"version_id":"342272649","version_name":"3.7.1","version_date":"2014-01-30 09:31:11.000 +0800","version_description":"This \"vintage 3.7\" release has a beautiful design upgrade for iOS 7, along with these MAJOR improvements and additions to the Hello Vino app:\n\nBRAND NEW WINE LABEL SCANNER - We've completely replaced the image recognition technology, and added REAL-TIME wine label identification by our team. That's correct - if the label scanner doesn't return a response right away, we'll personally identify the wine label in a matter of seconds.\n\nIMPORTANT NOTE: The wine label image recognition in earlier versions of the app will no longer work - please update to version 3.7 today.\n\nYOUR WINE PHOTOS NOW IN \"THE CLOUD\" - We want to make sure you never lose your wine photos when you upgrade your device, so we're now backing up all beautiful pics up in \"the cloud\" so you can access them on both your iPhone and iPad (and even our web site).\n\nOVER 10,000 NEW WINES available through our revolutionary wine recommendation engine. The app will suggest the perfect wines according to your personal taste preferences, meals and special occasions, while also directing you to nearby stores for purchase (or you can simply order through the app).\n\nEXPERT REVIEWS FOR THE NEW YEAR - Our wine expert has new reviews to help you with wines that are sure to impress (while also helping you avoid some disasters).\n\nTHOUSANDS OF DELICIOUS FOOD & WINE PAIRINGS - If the beautiful photos aren't enough to get you hungry and thirsty, we've added even more dishes to our incredibly comprehensive food & wine pairing section. \n\n-- NOTES FOR 3.7.1 --\n\nThis release includes a fix for a bug that some iPhone 4/4S users were experiencing with the label scanner. Special thanks to Roger F. for discovering it, reaching out, and working with us on squashing the bug!\n\n\nAs always, email hello@hellovino.com with any issues, questions or suggestions. We sincerely appreciate all the love and feedback."},{"version_id":"57142683","version_name":"3.1","version_date":"2013-10-04 07:53:57.000 +0800","version_description":"-- Version 3.1 --\r\n\r\nA MAJOR update to the Wine Label Scanner - We have replaced the image recognition technology with a new provider, and we've added hundreds of thousands of new labels to the database.\r\n\r\nPlease note: Earlier versions of the app are using the old image recognition technology, and will no longer work as of October 7, 2013 - please update to version 3.1 today.\r\n\r\n-- Version 3.0 --\r\n\r\nOur HUGE version 3.0 update - A brand spankin' new design, and rebuilt from the ground up for both speed and reliability. Also, now a universal app for both iPhone & iPad!! \r\n\r\nAll the new features and added content support our goal to help you with your wine shopping - whether at the store, restaurant or now in your home with our new iPad app. \r\n\r\nNEW Insider Wine Deals - Every week, the app will showcase the best deals on wines so you can stock up for the upcoming holiday season. \r\n\r\nNEW Expert Reviews - Wine podcast celebrity Elizabeth Schneider (from \"Wine for Normal People\") reviews wines you can actually find at your local stores. \r\n\r\nNEW Audio Pronunciations - Our friends at Forvo.com have lent their pronunciations for those confusing wine varieties to help you order wines with ease. \r\n\r\nMAJOR Enhancements to the Wine Label Scanner - Based on the scans performed by our million+ users, we've improved the accuracy of the label image recognition. \r\n\r\nIMPROVEMENTS to the \"My Wines\" Feature - Thanks to your feedback, we've added the ability to replace wine labels with your own photos, and also added close-up viewing with multi-device syncing. \r\n\r\nEVEN MORE Recommendations - We've added tens of thousands of new wines to our database, with a re-designed interface to deliver recommendations even faster than before. The app won't recommend obscure wines you'll never be able to find, in fact, you can even get wines based on your location. \r\n\r\nSOCIAL SHARING is now available, making it easy to share your wine discoveries and favorite bottles on Facebook, Twitter or by email. \r\n\r\n\r\nAs always, email hello@hellovino.com with any issues, questions or suggestions. Thanks for making Hello Vino one of the most popular apps in the App Store for the past four years!"},{"version_id":"584482642","version_name":"3.8","version_date":"2014-05-20 04:02:05.000 +0800","version_description":"This huge Spring \"vintage 3.8\" update includes significant improvements and additions to the Hello Vino app:\n\n140,000 STORE & RESTAURANT LOCATIONS ADDED - When you step into the wine aisle or you're ordering wine at a restaurant, the Hello Vino app now includes hundreds of thousands of locations to help you pick the perfect wine.\n\nENHANCED SEARCH ENGINE - Powered by wine-searcher.com, the industry's largest and most reliable wine search engine, the database includes more than 6 million wines!\n\nEXPERT REVIEWS FOR SPRING - Certified Sommelier and podcast celebrity Elizabeth Schneider has new reviews for wines that would be perfect for your Spring festivities. \n\nAnd. . . the 3.8 update also includes requests from our users (thanks for your valuable feedback):\n\nEASY WINE ENTRIES - We've cleaned up the \"Add Wine\" interface for easier and faster saving and tracking of the wines you're purchasing. Also, the app now automatically converts typing to Title Case when adding wines.\n\nNEW FOOD & WINE PAIRINGS - For all you veggie lovers out there, you can thank Miss Springfield for requesting new vegetarian dishes and suggested wine pairings.\n\nUPGRADE TO PREMIUM FEATURES - So many people asked for a \"Pro\" version of the app, so we've now added the ability to update your account for premium sponsor-free features.\n\nAs always, email hello@hellovino.com with any issues, questions or suggestions. We sincerely appreciate all the love and feedback."},{"version_id":"606262710","version_name":"3.8.1","version_date":"2014-06-26 10:15:20.000 +0800","version_description":"This huge Spring \"vintage 3.8\" update includes significant improvements and additions to the Hello Vino app:\n\n140,000 STORE & RESTAURANT LOCATIONS ADDED - When you step into the wine aisle or you're ordering wine at a restaurant, the Hello Vino app now includes hundreds of thousands of locations to help you pick the perfect wine.\n\nENHANCED SEARCH ENGINE - Powered by wine-searcher.com, the industry's largest and most reliable wine search engine, the database includes more than 6 million wines!\n\nEXPERT REVIEWS FOR SPRING - Certified Sommelier and podcast celebrity Elizabeth Schneider has new reviews for wines that would be perfect for your Spring festivities. \n\nAnd. . . the 3.8 update also includes requests from our users (thanks for your valuable feedback):\n\nEASY WINE ENTRIES - We've cleaned up the \"Add Wine\" interface for easier and faster saving and tracking of the wines you're purchasing. Also, the app now automatically converts typing to Title Case when adding wines.\n\nNEW FOOD & WINE PAIRINGS - For all you veggie lovers out there, you can thank Miss Springfield for requesting new vegetarian dishes and suggested wine pairings.\n\nUPGRADE TO PREMIUM FEATURES - So many people asked for a \"Pro\" version of the app, so we've now added the ability to update your account for premium sponsor-free features.\n\nAs always, email hello@hellovino.com with any issues, questions or suggestions. We sincerely appreciate all the love and feedback.\n\n-- This 3.8.1 release resolves a bug that caused app crashes in the \"My Wines\" section for some users. --"},{"version_id":"642842647","version_name":"3.8.2","version_date":"2014-07-29 01:35:16.000 +0800","version_description":"This huge \"vintage 3.8\" update includes significant improvements and additions to the Hello Vino app: \r\n\r\n140,000 STORE & RESTAURANT LOCATIONS ADDED - When you step into the wine aisle or you're ordering wine at a restaurant, the Hello Vino app now includes hundreds of thousands of locations to help you pick the perfect wine. \r\n\r\nENHANCED SEARCH ENGINE - Powered by wine-searcher.com, the industry's largest and most reliable wine search engine, the database includes more than 6 million wines! \r\n\r\nEXPERT REVIEWS FOR SPRING - Certified Sommelier and podcast celebrity Elizabeth Schneider has new reviews for wines that would be perfect for your Spring festivities. \r\n\r\nAnd. . . the 3.8 update also includes requests from our users (thanks for your valuable feedback): \r\n\r\nEASY WINE ENTRIES - We've cleaned up the \"Add Wine\" interface for easier and faster saving and tracking of the wines you're purchasing. Also, the app now automatically converts typing to Title Case when adding wines. \r\n\r\nNEW FOOD & WINE PAIRINGS - For all you veggie lovers out there, you can thank Miss Springfield for requesting new vegetarian dishes and suggested wine pairings. \r\n\r\nUPGRADE TO PREMIUM FEATURES - So many people asked for a \"Pro\" version of the app, so we've now added the ability to update your account for premium sponsor-free features. \r\n\r\nAs always, email hello@hellovino.com with any issues, questions or suggestions. We sincerely appreciate all the love and feedback. \r\n\r\n-- This 3.8.2 release squashes a few bugs that were causing app crashes in the \"My Wines\" and \"Vino\" sections for some users. --"},{"version_id":"694162717","version_name":"4.0","version_date":"2014-09-04 18:57:34.000 +0800","version_description":"It’s here! The incredible 4.0 update - We’ve taken Hello Vino to the next level with these new features, in addition to improvements made to all the features you already love (Recommendations, Label Scanner, My Wines and Search)...\n\nREAL-LIFE CONCIERGE - You can now speak to a LIVE PERSON to help with your wine buying. It’s like having your very own wine expert on call. We have a team of wine-educated assistants based in California wine country, ready to help you find the perfect bottle.\n\nWINE GUIDE - An incredible dictionary of wine varieties. And, by popular demand (we’ve literally received hundreds of requests), you can use the app ”in reverse“ by getting food pairings and recipes based on the wine you already have. For example, if you already have a nice bottle of Pinot Noir, the app will suggest types of foods that pair well (with recipes powered by Yummly!).\n\nPLUS - We polished up the app icon, added hundreds of beautiful photos and also optimized the app speed and download size.\n\nWe hope you’re as excited about this huge update as we are. Please keep the suggestions and feedback coming - Cheers!"},{"version_id":"811454683","version_name":"4.9:SPRING HAS SPRUNG - Delicious new wines and recipe pairings for your big Spring holiday dinner. PLUS","version_date":"","version_description":""},{"version_id":"811972967","version_name":"4.9 --SPRING HAS SPRUNG - Delicious new wines and recipe pairings for the big Spring holidays. PLUS","version_date":"","version_description":""},{"version_id":"812264077","version_name":"4.9.1","version_date":"2015-05-09 01:38:04.000 +0800","version_description":"Several \"under the hood\" app optimization tweaks to speed and reliability for a magical app experience. And... NEW food & wine content for the grilling season. Who loves you more than Hello Vino?\n\n-- New in Version 4.9 --\n\nSPRING HAS SPRUNG - Delicious new wines and recipe pairings for the big Spring holidays. PLUS, you can buy with a single tap using Apple Pay.\n\nLABEL SCANNER UPGRADE - The most accurate wine label scanner in the App Store just got even faster. New human-powered recognition of wine label images within seconds.\n\nNEW COMMUNITY WINE RATINGS - Consumer ratings are now available, contributed by our community of more than 2 million Hello Vino app users.\n\nUPDATED PROFILES - Your personalized wine picks are ready in the updated \"My Profile\" section of the app. Hundreds of wines are hand-picked by our experts, then we deliver the best wines according to your personal taste preferences.\n\nAwesome, huh?\n\nIf you have any not-so-awesome experiences, please email hello@hellovino.com and we'll get you squared away. Unfortunately, we can't reply to App Store reviews, so please email us."},{"version_id":"812403970","version_name":"4.9.2","version_date":"2015-05-22 12:23:11.000 +0800","version_description":"The grilling season is upon us, and we've updated the app with amazing new wines for your outdoor cookouts, holiday parties and some gifts for dear old Dad. Plus, you can buy wines for these special occasions with a single tap using Apple Pay!"}]