[{"version_id":"812528060","version_name":"3.0.3","version_date":"","version_description":""},{"version_id":"813774786","version_name":"3.0.4","version_date":"","version_description":""},{"version_id":"816292103","version_name":"4.0.1","version_date":"","version_description":""},{"version_id":"816413960","version_name":"4.0.2","version_date":"","version_description":""},{"version_id":"816627974","version_name":"4.0.3","version_date":"","version_description":""},{"version_id":"817505375","version_name":"4.1.1","version_date":"","version_description":""},{"version_id":"817550320","version_name":"4.1.2","version_date":"","version_description":""},{"version_id":"817590976","version_name":"4.1.3","version_date":"","version_description":""},{"version_id":"817871883","version_name":"4.1.4","version_date":"","version_description":""},{"version_id":"817922747","version_name":"4.1.5","version_date":"","version_description":""},{"version_id":"818239348","version_name":"4.2.1","version_date":"","version_description":""},{"version_id":"818382811","version_name":"4.2.2","version_date":"","version_description":""},{"version_id":"818838891","version_name":"4.2.3","version_date":"","version_description":""},{"version_id":"820181119","version_name":"4.3","version_date":"","version_description":""},{"version_id":"820525910","version_name":"4.3.2","version_date":"","version_description":""},{"version_id":"821195403","version_name":"4.3.3","version_date":"","version_description":""},{"version_id":"821575654","version_name":"4.3.4","version_date":"","version_description":""},{"version_id":"821820113","version_name":"4.5.1","version_date":"","version_description":""},{"version_id":"821895543","version_name":"4.5.2","version_date":"2017-04-25 22:05:25.000 +0800","version_description":"New in 4.5.2<br>* New Details View templates which are easier on the eye: <br>   - Clear Light<br>   - Clear Dark<br><br>Fixed:<br>* After closing the add games automatically screen, it now selects the latest added game.<br>* Improved “tap” area of hamburger menu button so you can back out of a folder more easily. <br><br>New in 4.5.1<br>Welcome to a completely refreshed CLZ Games!<br><br>* A completely new look, that is cleaner and brighter.<br>* The choice between two skins/themes: Light &amp; Dark.<br>* No bottom toolbar means more screen space for your game collection.<br>* Big floating blue ‘+’ button on bottom right for adding new games.<br>* Access all other features and tools from ‘hamburger’ menu top left.<br>* Access all view settings from menu on top right.<br>* Quickly switch between All / In Collection / Wish List at the top."},{"version_id":"822207867","version_name":"4.5.3","version_date":"2017-05-21 09:56:32.000 +0800","version_description":"New:<br>- The app now remembers view settings / navigation after closing/re-opening.<br><br>Changed:<br>- Old Import from Game Collector has been moved to Settings screen<br><br>* Fixed:<br>- App not showing number of hardware in the top bar in the main screen<br>- Crash when using \"search-as-you-type\""},{"version_id":"822494371","version_name":"4.5.4","version_date":"2017-06-10 22:07:08.000 +0800","version_description":"* New:<br>- Add Games from CLZ Core: New skinned preview templates.<br>- After adding/editing a game, the app will now always find and show your last added game in your main screen.<br>- If you log in to your CLZ Account on a new or empty device, the app will now ask you if you wish to download your games from CLZ Cloud.<br>- Added skinning to Sign up/Log in/In App Purchase screens.<br><br>* Fixed:<br>- After each CLZ Cloud sync the “Quick Search” and “Collection Status Filter” was cleared.<br>- When tapping the “Platform” button in the ‘Unrecognised Barcode’ screen the app could crash.<br>- When a custom cover was downloaded via CLZ Cloud syncing, the thumbnail in the list wasn’t immediately updated.<br>- When a game was removed, the list would scroll back to the top<br>- Various skinning, layout and color fixes"},{"version_id":"822534466","version_name":"4.5.5","version_date":"2017-06-14 01:03:41.000 +0800","version_description":"* Fixed:<br>- iPhone: the main add button turning into an edit button after editing a game<br>- iPhone: navigation is reset to the listview instead of the detail view after editing a game.<br>- False positives for duplicate game detection in the barcode scan screen"},{"version_id":"822962708","version_name":"4.5.6","version_date":"2017-07-20 23:25:11.000 +0800","version_description":"* New:<br>- Added a new “All Games” folder with a back button to go back to your folders<br><br>* Fixed:<br>- Barcode queue was lost when a crash occurred in the add auto screen<br>- The move to wish list functionality in the add auto screen was not working at all"},{"version_id":"823118789","version_name":"4.6.1","version_date":"2017-08-04 02:20:00.000 +0800","version_description":"This update is for the real video game collectors, especially those that are into collecting retro games:<br><br>* New:<br>- Added a new “Completeness” field, to indicate how complete your copy of a game is. Choose from:<br>    • Loose, meaning “cartridge or disc only”.<br>    • CIB, meaning “Complete In Box”, everything included.<br>    • New, meaning CIB and also still sealed.<br>- Two extra checkbox fields “Manual” and “Box” to further specify the “Loose” status. You know, for those cartridges with just a manual, no box. Or in a box, but with the manual missing.<br>- You can also group on the Completeness field as a folder.<br>- Added additional fields to the edit screen:<br>    • Developers<br>    • Publisher<br>    • Region<br>    • Description<br>    • Edition<br>    • Series<br>- Enhanced cloud syncing: now sync 10 more fields:<br>    • Platform: now sync now your own Platform names, including platforms that are not in our Core list.<br>    • Completeness (Loose vs CIB vs New)<br>    • Box Yes/No<br>    • Manual Yes/No<br>    • Developers<br>    • Publishers<br>    • Region<br>    • Description<br>    • Edition<br>    • Series"},{"version_id":"823192196","version_name":"4.6.2","version_date":"2017-08-07 21:14:05.000 +0800","version_description":"This update is for the real video game collectors, especially those that are into collecting retro games:<br><br>* New:<br>- Added a new “Completeness” field, to indicate how complete your copy of a game is. Choose from:<br>    • Loose, meaning “cartridge or disc only”.<br>    • CIB, meaning “Complete In Box”, everything included.<br>    • New, meaning CIB and also still sealed.<br>- Two extra checkbox fields “Manual” and “Box” to further specify the “Loose” status. You know, for those cartridges with just a manual, no box. Or in a box, but with the manual missing.<br>- You can also group on the Completeness field as a folder.<br>- Added additional fields to the edit screen:<br>    • Developers<br>    • Publisher<br>    • Region<br>    • Description<br>    • Edition<br>    • Series<br>- Enhanced cloud syncing: now sync 10 more fields:<br>    • Platform: now sync now your own Platform names, including platforms that are not in our Core list.<br>    • Completeness (Loose vs CIB vs New)<br>    • Box Yes/No<br>    • Manual Yes/No<br>    • Developers<br>    • Publishers<br>    • Region<br>    • Description<br>    • Edition<br>    • Series<br><br>* Fixed:<br>- Crash when adding a game in the add automatically screen"},{"version_id":"823226876","version_name":"4.6.3","version_date":"2017-08-09 13:39:59.000 +0800","version_description":"* Fixed:<br>- Crash when sorting by release year<br>- Crash when editing rating and completed status directly from the details view on iPhone"},{"version_id":"823630020","version_name":"4.6.4","version_date":"2017-09-12 19:05:11.000 +0800","version_description":"* New: download game values from PriceCharting.com<br>- When adding new games, they automatically come with game value info.<br>- Values are determined based on the Completeness field (Loose vs CIB vs New).<br>- See totals for your collection using the new Database Totals screen.<br>- Download up-to-date value information using Update button (in Database Totals screen)."},{"version_id":"823761578","version_name":"4.6.5","version_date":"2017-09-23 04:23:02.000 +0800","version_description":"* Fixed:<br>- The on-screen keyboard was covering the lower input fields in the edit/add manually screens"},{"version_id":"823796621","version_name":"4.6.6","version_date":"2017-09-26 19:37:07.000 +0800","version_description":"* Fixed:<br>- Missing app icons for 12.9 inch iPads"},{"version_id":"824013963","version_name":"4.6.7","version_date":"2017-10-15 09:49:34.000 +0800","version_description":"* New:<br>Redesigned Selection Mode<br>- Tap and hold on a game to select it, select as many games as you like (or select all, using the “Select All” top right).<br>- Then use the blue action button to perform an action on the selected games (Remove / Update from CLZ Core / Update game values from CLZ Core).<br><br>* Fixed:<br>- Crash when saving a cover image to the camera roll<br>- Odd scrolling behavior when expanding/collapsing a game title search result in the Add Automatically screen<br>- Odd scrolling behavior when scanning game barcodes in the barcode scanning screen<br>- Stuck keyboard after searching in main list<br>- Autocorrect was enabled for the main list search bar"},{"version_id":"824032358","version_name":"4.6.8","version_date":"2017-10-16 20:10:33.000 +0800","version_description":"* Fixed:<br>- Crash in add screen on devices running iOS10 or lower"},{"version_id":"824082912","version_name":"4.6.9","version_date":"2017-10-19 23:45:52.000 +0800","version_description":"* New:<br>- Optimized layout of main screen on 10.5 and 12.9 inch iPads<br>- Optimized the performance of the main screen thumbnail view<br>- Fresh placeholder cover images<br><br>* Fixed:<br>- Black bars showing on 10.5 and 12.9 inch iPads<br>- Disappearing floating add button when switching from list to thumbnail view"},{"version_id":"824334716","version_name":"4.6.10","version_date":"2017-11-08 22:35:32.000 +0800","version_description":"* New:<br>- Redesigned list cells in the add automatically screen:<br>- - Slightly smaller font for the game title, so that longer titles fit better. <br>- Color high-lighting: Games already ‘on wish list’ now have an orange title, games already “in collection” show up with a blue title. <br>- Improved scroll behaviour. <br><br>* Fixed:<br>- Full screen cover scroller on iPhone/iPod devices was not properly updating its title bar<br>- No platform icons in platform folder on iPad"},{"version_id":"825581459","version_name":"4.8.1","version_date":"2018-01-09 21:35:25.000 +0800","version_description":"* New: Automatic CLZ Cloud syncing<br>- Add or edit games and your changes will auto-upload to the CLZ Cloud instantly. Made changes on the desktop or Connect side? Just start the app and changes will download automatically. Auto-Syncing is switched OFF by default. Switch it ON in the Sync screen. Don't have a CLZ Cloud account yet? Just sign up from the app, it's free! As always: having problems with this update? Let us know through help.clz.com.<br><br>* New: 'None' entries<br>- Added 'None' entries to list of folders: The [None] folder groups the games you have not set the field for on which you’re currently folder grouping.<br><br>* Fixed:<br>- Search cleared when the X button was pushed in the search bar of the main screen."},{"version_id":"825811943","version_name":"4.9.2","version_date":"2018-02-26 22:04:34.000 +0800","version_description":"* Fixed:<br>- Crash during a search in the device's database."},{"version_id":"825811943","version_name":"4.8.2","version_date":"2018-01-30 14:20:06.000 +0800","version_description":"* Fixed:<br>- Crashes while syncing"},{"version_id":"826059807","version_name":"4.9.1","version_date":"2018-02-21 18:07:45.000 +0800","version_description":"* New: Quick Search: Search-As-You-Type suggestions<br>- In the search box, just start typing the first few letters of the title you are looking for.<br>- While typing, a drop-down list will appear, showing the first five matching games. (for most games, it only takes 2 or 3 letters before it shows up.)<br>- Once you see the one you were looking for, tap it to bring up its detail page.<br><br>* New: Quick Search: Now searches more fields. Now also searches in:<br>- Series<br>- Plot<br>- Notes<br>- Tags<br><br>* Fixed:<br>- Crash within a few seconds of opening the app.<br>- Crash when pressing 'Change account info' in the sync screen.<br>- Faster loading of detail screen."},{"version_id":"826106931","version_name":"4.9.2","version_date":"2018-02-26 22:04:34.000 +0800","version_description":"* Fixed:<br>- Crash during a search in the device's database."},{"version_id":"826730141","version_name":"4.10.1","version_date":"2018-04-18 15:26:20.000 +0800","version_description":"We've added new fields to sort on to change the order in which your games are displayed in your list. Your game list will adapt to sort and show the field you're sorting on. On top of that we've redesigned the Select Sort Order screen to make it more clear what you're choosing.<br><br>Open the Select Sort Order screen by tapping the menu top right, then tap \"Sort order\".<br><br>* All available sort fields:<br>- Platform, then Title (New!)<br>- Platform, then Release Date (New!)<br>- Title<br>- Release Date<br>- Order of Entry (New!)<br>- Purchase Date (New!)<br>- Purchase Price (New!)<br>- Price Charting Value (New!)<br>- Current Value (New!)<br>- Completion Date (New!)<br>- My Rating (New!)<br>- Quantity (New!)<br>- Index<br>- Storage Device (New!)<br><br>All fields can be sorted either ascending or descending. Tap the field you wish to sort on, then tap \"Apply\" to confirm."},{"version_id":"827070902","version_name":"4.10.2","version_date":"2018-05-08 21:57:01.000 +0800","version_description":"* New for the Add Games screen:<br>- Add button is now bigger and easier to spot (some new users missed the little round \"+\").<br>- Add button now \"remembers\" your collection vs. wish list selection. No need to pick from the Collection/Wish List popup menu every time you add anymore.<br><br>* Fixed:<br>- Adding a game would clear the collection status filter in the main screen.<br>- iPad: Main screen: the details view did not refresh after changing the details template.<br>- iPad: Main screen: the 'edit my rating' pop up was rotated when in landscape mode.<br>- The sorting option screen would sometimes not fully show the chosen sort option when opened."},{"version_id":"828350787","version_name":"4.11.1","version_date":"2018-08-26 07:06:07.000 +0800","version_description":"* New: Starting with version v4.11 CLZ Games now uses secure HTTPS connections for all communications with our servers:<br>- for logging in with your username and password<br>- for syncing your data with CLZ Cloud<br>- for sending your searches to Core.<br><br>To make this possible, we have created new secure \"entry points\" on our servers, that are only allowing secure HTTPS connections. The new CLZ Games app only communicates with those secure entry points.<br>For your privacy and security, we strongly recommend updating your app to v4.11.<br><br>* Changed:<br>- The buttons to switch folders, sorting and view options have been moved to more logical places to make them more accessible.<br>- The skins and templates options have been moved to the settings screen.<br>- The selection mode button has been removed, just tap and hold on an item to start selecting items.<br><br>* Fixed:<br>- Last update made some settings disappear in the settings screen. They are back now.<br>- Added bottom margin to the add auto screen on iPhone X to make the add button more reachable.<br>- The sync screen wasn't logging local deletes."},{"version_id":"828530299","version_name":"4.11.2","version_date":"2018-09-11 02:45:14.000 +0800","version_description":"* Fixed:<br>- iPhone: Lists in main screen did not scroll to top when the status bar was tapped.<br>- 'Already in collection' popup was broken for recently added games.<br>- 'Not linked' message when updating from Core for recently added games.<br>- Update Values could give a 0 value for newly added games."},{"version_id":"829236378","version_name":"4.13.1","version_date":"2018-11-16 03:07:55.000 +0800","version_description":"* New: Redesigned app icons<br>We designed new icons that give new users a better indication of what the app actually does (as opposed to just a different color CLZ logo), but still obviously belong together, when shown together.<br><br>* New: the Field Defaults screen now lets you set default values for the Completeness, Has Box and Has Manual fields.<br><br>* Fixed:<br>- Platform list is outdated when Add screen is opened for the first time."},{"version_id":"829537508","version_name":"4.14.1","version_date":"2018-12-06 20:57:24.000 +0800","version_description":"* New: resizable panels (for tablets only):<br>- All panels in the main screen (folders, list and details) are now resizable using draggable separators between the panels, so that you can customize the layout to your own liking.<br><br>* Fixed:<br>- Huge fonts in the collection status picker when the 'Larger Text' accessibility option was turned on.<br>- When moving a game from 'wish list' to 'collection' in the 'Add by ISBN' screen, the search result was not removed form the queue automatically.<br>- Activity indicator was not updated during the 'Update from Core' process."},{"version_id":"829675285","version_name":"4.14.2","version_date":"2018-12-17 22:56:43.000 +0800","version_description":"* New:<br>- The resizable panels in the add screen now have the same design as the ones in the main screen.<br><br>* Fixed:<br>- iPad: Wrong initial panel layout in the main screen when the app is started in landscape mode."},{"version_id":"833128909","version_name":"5.0.1","version_date":"2019-10-22 06:30:23.000 +0800","version_description":"CLZ Games 5.0: Vee Five is alive!<br><br>* CLZ Games is now a subscription app, costing $1.49/month or $14.99/year.<br><br>Important: If you have purchased the app before v5 was released, you have automatically received a life-time app unlock. You do not need to pay for the subscription!<br><br>* Now supports and syncs multiple collections !<br><br>Manage multiple \"sub-collections\" within your database. Use the menu to add a new collection, switch between collections or manage them. <br>Sync multiple collection through the CLZ Cloud, e.g. to/from the Game Connect cloud-based software or the Game Collector desktop software.<br><br>* Automatic cloud-syncing of your own \"custom\" images<br><br>No more need to \"force\" the upload of your own images through the Edit screen. Once you replace an image, the image is automatically flagged as \"Custom Image\" and will automatically sync to the CLZ Cloud.<br><br>* New Statistics screen *<br><br>A cool \"infographic\" style screen showing nice totals and statistics about your game collection. Total number of games and hardware items, total value, number of games by platform, total value by platform, etc...<br><br>* Various improvements to the user interface *<br><br>- Re-designed top-bar<br>- Re-designed main menu<br>- Re-designed Manage Pick Lists screen<br>- Editing: Easier way to select values for pick list fields.<br>- Adding: new Clear Queue button to clear the barcode queue.<br>- On iOS 13, the app now uses the \"sheet-style\" popup screens"},{"version_id":"833319989","version_name":"5.0.2","version_date":"2019-10-24 21:53:03.000 +0800","version_description":"* Fixed: <br>- Custom images were uploaded too often"},{"version_id":"833836092","version_name":"5.0.3","version_date":"2019-12-03 12:51:22.000 +0800","version_description":"Fixed:<br>- Add from Core could sometimes download the wrong cover images."},{"version_id":"834232735","version_name":"5.0.4","version_date":"2020-01-06 23:25:35.000 +0800","version_description":"* New:<br>- 'Purchase date year' and 'completed date year' folders.<br><br>* Fixed:<br>- Rare incident where timeouts occurred during CLZ Cloud sync."},{"version_id":"835159353","version_name":"5.2.1","version_date":"2020-03-18 14:25:38.000 +0800","version_description":"* Faster CLZ Cloud syncing!<br><br>Several structural changes to the CLZ Cloud syncing, making it much much faster than before, especially when syncing large amounts of entries up or down.<br><br>Note that most of the performance improvements are in the actual Sync with CLZ Cloud screen. The Auto-Syncing in the background is also slightly faster now, but if you need to sync many entries, please use the CLZ Cloud screen.<br><br>* New design for Sync with CLZ Cloud screen<br><br>While we were at it, we decided to do a quick make-over for the Sync screen, with a new look and layout and a direct link to your CLZ Cloud page online."},{"version_id":"835422524","version_name":"5.3.1","version_date":"2020-04-07 06:33:49.000 +0800","version_description":"Two new online services for your CLZ Games app!<br><br>* Add Games by Platform<br><br>A new 3rd tab in the Add Games screen for quickly adding all games you own for a platform: just checkbox the games you own from a full list of games per platform. The list also clearly highlights the games you already have In Collection or On Wishlist, making it a perfect tool for platform completionists.<br><br>* Add Hardware from Core<br><br>Search our new Core online hardware database, to easily add consoles, controllers and other accessories. Automatically get descriptions, box images, device images, backdrop images, sometimes even YouTube promo videos.<br><br>IMPORTANT: both are premium online services, so require an active CLZ Games subscription!<br><br>Fixed:<br>- When downloading new entries from CLZ Cloud, previously cleared fields could get filled in.<br>- In the Add from Core screen, when adding a game that is already in your app as 'On Wish List' or 'On Order', the app will now offer to change its status to 'In Collection'."},{"version_id":"835489898","version_name":"5.3.2","version_date":"2020-04-10 16:11:04.000 +0800","version_description":"Fixed:<br>- Add by Platform list was messy on some devices (platform names showing)<br>- Add Hardware / 'Search for' - popup did not show up right on devices with large font<br>- On devices with intermittent internet connection, app could revert to trial mode<br>- After down-syncing update cover images, the list could still show old cover.<br>- Improved error messages in case of core search problems."},{"version_id":"836355849","version_name":"5.4.1","version_date":"2020-06-11 06:34:32.000 +0800","version_description":"* New:<br>- Folder options are now nicely grouped for easier selection<br>- Faster Update from Core<br><br>* Fixed: <br>- Loan info wasn't shown correctly"},{"version_id":"839779893","version_name":"6.2.1","version_date":"2020-12-28 11:37:16.000 +0800","version_description":"Another big update for your CLZ Games app, version 6.2!<br><br>New today:<br><br><br>* New Pre-fill screen that pops up when adding games, letting you set various fields right then and there. No more need to edit your added games afterwards!<br><br><br>Fields available in the Pre-fill screen: Completeness, Location, Owner, Purchase Date, Purchase Store, Purchase Price, Quantity and Tags.<br><br>* All Collection Status options are now available under the Add button in the Add Screen.<br>* New look and layout of Field Defaults screen."},{"version_id":"840604288","version_name":"6.3.2","version_date":"2021-02-24 02:09:38.000 +0800","version_description":"* Fixed:<br>- Statistics screen: Crash on iOS 9/10 devices.<br>- Main Screen - Collection status filter: Defaulted to \"For Sale\" when it was previously set to \"On Wish List\".<br>- Main screen: Some controls were missing from the top bar on iOS 9/10 devies."}]