[{"version_id":"812635951","version_name":"5.2","version_date":"2015-07-07 01:10:00.000 +0800","version_description":"Relax Melodies for Apple Watch is here! <br>We are thrilled to announce your can now start your relaxing ambience right from your wrist!<br>The update also includes some stability and performance enhencements as well as some bug fixes.<br><br>Apple Watch Features<br>- Play your favorites<br>- Play a random mix<br>- Display your next alarm or timer<br>- Display your current selection<br>- Pause and resume your melodies"},{"version_id":"819893708","version_name":"6.1.3","version_date":"2016-12-08 15:20:54.000 +0800","version_description":"This update focuses on providing you with the best tools to help you sleep better<br><br>- New design<br>- Updated Discovery section<br>- New sounds<br>- New sleep meditation programs<br>- Bedtime Widget to remind you when it’s time to go to sleep<br>- iMessage extension allowing you to share your mix with your friends<br>- Support for WatchOS 2<br>- Mindful Minutes tracking with Apple Health<br>- Also includes some stability and performance enhancements as well as some bug fixes<br><br>Your positive reviews are greatly appreciated! <br>Don't hesitate to contact us through the “More” section inside the app to provide your feedback or request support!"},{"version_id":"820945299","version_name":"6.2","version_date":"2017-05-04 15:39:37.000 +0800","version_description":"This update is oriented towards simplifying your experience and ensuring a proper progression in our meditation programs to help up have a great night sleep.<br><br>- Save your favorite mixes now directly from the sound library.<br>- New Meditation display to better follow your progress and programs.<br>- Community Melodies is now in the favorites section.<br>- Now share your favorites with your friends directly from the favorites section.<br>- Submit your own mix to our content team and have a chance to see it listed in the Community Melodies display for other users to enjoy.<br>- 2 additional Nightstand Clock themes.<br>- Universal version now available in all iOS devices.<br>- It also includes stability and performance enhancers as well as some bug fixes.<br><br>Send us your comments or suggestions at support@ipnos.com"},{"version_id":"826584310","version_name":"6.5","version_date":"2018-04-23 11:03:45.000 +0800","version_description":"WHAT’S NEW<br>In this major update, Relax Melodies has been entirely rewritten for iOS 11, ensuring a smoother experience and a design compatible with iPhone X. We also bring you two more exciting features:<br><br>- A completely revamped meditation section with smarter content categorization and gorgeous graphics<br>- A brand new sound mixer allowing you to mix sounds and control volumes all in one place.<br>- And of course, we’ve taken care of necessary bug fixes.<br><br>We hope you enjoy this version as much as we do. Thank you for all your support and comments. We are looking to hear from you at support@ipnos.com!"},{"version_id":"826807035","version_name":"6.5.1","version_date":"2018-04-26 19:51:00.000 +0800","version_description":"This app has been updated by Apple to use the latest Apple signing certificate.<br><br>WHAT’S NEW<br>In this major update, Relax Melodies has been entirely rewritten for iOS 11, ensuring a smoother experience and a design compatible with iPhone X. We also bring you two more exciting features:<br><br>- A completely revamped meditation section with smarter content categorization and gorgeous graphics<br>- A brand new sound mixer allowing you to mix sounds and control volumes all in one place.<br>- And of course, we’ve taken care of necessary bug fixes.<br><br>We hope you enjoy this version as much as we do. Thank you for all your support and comments. We are looking to hear from you at support@ipnos.com!"},{"version_id":"841385806","version_name":"6.5.1","version_date":"2018-04-26 19:51:00.000 +0800","version_description":"This app has been updated by Apple to use the latest Apple signing certificate.<br><br>WHAT’S NEW<br>In this major update, Relax Melodies has been entirely rewritten for iOS 11, ensuring a smoother experience and a design compatible with iPhone X. We also bring you two more exciting features:<br><br>- A completely revamped meditation section with smarter content categorization and gorgeous graphics<br>- A brand new sound mixer allowing you to mix sounds and control volumes all in one place.<br>- And of course, we’ve taken care of necessary bug fixes.<br><br>We hope you enjoy this version as much as we do. Thank you for all your support and comments. We are looking to hear from you at support@ipnos.com!"}]