[{"version_id":"311642927","version_name":"2.2.3.002740","version_date":"","version_description":""},{"version_id":"590173417","version_name":"2.3.0","version_date":"2014-06-04 09:30:46.000 +0800","version_description":"* Designed for iOS 7.<br>* NEW: A unique catchphrase more memorable than the VNC Server signature is now shown before connecting for the first time, in order to deter man-in-the-middle (MITM) attacks.<br>* A help page containing gestures is now presented on connecting for the first time, to help you learn how to control the computer."},{"version_id":"811669759","version_name":"2.3.2","version_date":"2015-02-19 14:56:43.000 +0800","version_description":"- NEW: Support for iPhone 6 and iPhone 6 Plus devices.<br>- Predictive text and third-party keyboards are disabled if you choose to obscure sensitive text (tap abc above the keyboard).<br>- FIXED: VNC Viewer no longer crashes when connected to computers with very large screen resolutions."},{"version_id":"811955379","version_name":"2.3.3","version_date":"2015-04-07 08:50:55.000 +0800","version_description":"· Keyboard auto-correct is now disabled again by default, so commands sent to a computer’s CLI are executed as intended. If you want to auto-correct spellings (in a Word document, for example), make sure Settings &gt; General &gt; Keyboard &gt; Auto-correct is turned on and additionally turn on 'Use auto-correct if available' in the VNC Viewer app’s settings.<br>· FIXED: The toolbar should no longer get in an unresponsive state."},{"version_id":"812754524","version_name":"2.3.4","version_date":"2015-07-14 10:35:36.000 +0800","version_description":"FIXED: The toolbar no longer permanently disappears when Apple's default keyboard dismissal key, located at the bottom right of the virtual keyboard in landscape mode, is pressed.<br> <br>FIXED: If the toolbar is unpinned when VNC Viewer re-establishes a dropped connection, it now remains responsive when shown again as the connection returns."},{"version_id":"813364881","version_name":"2.3.5","version_date":"2015-09-23 10:47:13.000 +0800","version_description":"Bug fixes for iOS 9."},{"version_id":"813983905","version_name":"2.4.0","version_date":"2015-11-19 12:18:51.000 +0800","version_description":"NEW: Connections can now be made view-only at any time.<br>NEW: The Windows key has been added to the scrolling key bar above the virtual keyboard.<br>The Authentication screen now displays VNC Server's address, catchphrase and signature in order to make this important security information more prominent.<br>FIXED: Users who lack permission to view the desktop can now successfully connect to VNC Server. Instead of the desktop, they will see a checkerboard."},{"version_id":"814752371","version_name":"2.4.1","version_date":"2015-12-02 15:11:52.000 +0800","version_description":"FIXED: VNC Viewer no longer crashes when connecting to big-endian systems such as AMX Touch Panels, KVM switches, and PPC Macs.<br> <br>FIXED: VNC Viewer can connect again seamlessly to VNC-compatible projects from third parties such as UltraVNC and TightVNC."},{"version_id":"815217930","version_name":"2.4.2","version_date":"2016-02-03 15:42:55.000 +0800","version_description":"- FIXED: The cmd and opt keys on the scrolling key bar now function correctly when connecting to Apple Remote Desktop.<br>- Connections to VNC-compatible software from third parties are more reliable. If connection issues persist, try changing the Picture Quality.<br>- Optimised for iOS 9 and iPad Pro"},{"version_id":"815694502","version_name":"2.4.2","version_date":"2016-02-03 15:42:55.000 +0800","version_description":"- FIXED: The cmd and opt keys on the scrolling key bar now function correctly when connecting to Apple Remote Desktop.<br>- Connections to VNC-compatible software from third parties are more reliable. If connection issues persist, try changing the Picture Quality.<br>- Optimised for iOS 9 and iPad Pro"},{"version_id":"817000952","version_name":"2.5.0","version_date":"2016-05-03 13:45:11.000 +0800","version_description":"NEW: Support for iPads with Apple's Split View and Slide Over features, allowing a second app to be used in split-screen alongside VNC Viewer.<br> <br>FIXED: Users no longer experience an \"Unsupported DH generator\" error when connecting to certain older Macs running Apple Screen Sharing."},{"version_id":"818411550","version_name":"2.6.0","version_date":"2016-08-24 14:04:34.000 +0800","version_description":"NEW: Automatically backup and sync connections between all your devices by signing in to VNC Viewer with your RealVNC account credentials.<br> <br>NEW: VNC Viewer can connect via a proxy server if one is specified, providing it does not require authentication.<br> <br>NEW: Desktop previews can be made permanent, instead of updating automatically each time you disconnect.<br> <br>A connection’s desktop preview is now saved independently of its password, meaning you can store one and not the other."},{"version_id":"818670958","version_name":"2.6.1","version_date":"2016-09-03 02:16:19.000 +0800","version_description":"The previous version of VNC Viewer contained a bug which appeared to delete all Address Book entries for a small number of users. These connections have now been restored.<br><br>We apologize for any inconvenience this may have caused."},{"version_id":"818825440","version_name":"3.0.0 adds support for VNC® Connect. Just download VNC Connect to computers you want to control","version_date":"","version_description":""},{"version_id":"818825440","version_name":"2.6.2","version_date":"2016-09-09 20:01:19.000 +0800","version_description":"*FIXED:* VNC connections made via a proxy server are now more likely to succeed. If connectivity problems persist (for example, because the proxy server only permits HTTP/s traffic), try turning off Connect via Proxy from the VNC Viewer Settings menu.<br><br>*FIXED:* The formatting of text pasted to the same remote computer it was copied from is now preserved."},{"version_id":"819516295","version_name":"3.0.0","version_date":"2016-11-01 12:35:00.000 +0800","version_description":"Version 3.0.0 adds support for VNC® Connect. <br><br>Just download VNC Connect to computers you want to control, then sign in to VNC Viewer using your RealVNC® account credentials. Your computers appear automatically; simply tap to connect.<br><br>As well as traditional direct connectivity, VNC Connect adds support for cloud connectivity. This means you no longer have to forward ports and configure routers!<br><br>To learn more about VNC Connect, visit realvnc.com/connect. <br><br>NEW: Sign in to your RealVNC account to automatically discover the VNC Connect computers in your team.<br>NEW: Establish secure, seamless, reliable cloud connections to VNC Connect computers, without network reconfiguration.<br>NEW: Continue to establish direct connections from your Address Book to VNC Connect computers with an Enterprise subscription, to VNC 5.x computers, or to VNC Server-compatible projects from third parties."},{"version_id":"819711527","version_name":"3.0.1","version_date":"2016-11-12 19:10:42.000 +0800","version_description":"Minor bug fixes."},{"version_id":"821385779","version_name":"3.1.0","version_date":"2017-03-20 15:54:35.000 +0800","version_description":"NEW: VNC Viewer now has a Medium picture quality setting, to complement High, Automatic and Low. Picture quality is still set to Automatic by default.<br>NEW: The VNC Viewer app icon now has '3D Touch' functionality on supported devices. Press firmly to reveal your four most recent connections, then tap one to connect.<br>Logs can now be sent to our tech support team from within the app. Simply open the sidebar and tap Send Feedback &gt; Email Technical Support."},{"version_id":"821482597","version_name":"3.1.1","version_date":"2017-03-27 16:03:37.000 +0800","version_description":"FIXED: Crash on startup for some users."},{"version_id":"821544864","version_name":"3.1.2","version_date":"2017-04-03 11:02:40.000 +0800","version_description":"Minor bug fixes."},{"version_id":"821956194","version_name":"3.2.0","version_date":"2017-05-02 15:00:32.000 +0800","version_description":"NEW: Authenticate with VNC Server using RADIUS multi-factor authentication scheme (requires VNC Server 6.1 or later with Professional or Enterprise subscription)"},{"version_id":"822429834","version_name":"3.3.0","version_date":"2017-06-06 14:17:04.000 +0800","version_description":"NEW:  Signed-in users can now sort the Address Book by label.  From the Address Book, tap 'i &gt; Labels' to apply existing labels to a computer (creating a new label must be done through the desktop version of VNC Viewer, when signed-in to the same account).<br>NEW:  VNC Viewer can connect to computers using the 'Smartcard/certificate store' multi-factor authentication scheme. Tap 'Settings &gt; Certificates' for more information.<br>FIXED:  Users with a large number of computers in their team will now find VNC Viewer more responsive."},{"version_id":"822726798","version_name":"3.3.1","version_date":"2017-06-29 16:23:46.000 +0800","version_description":"FIXED:  We've made some tweaks to make it more likely that Apple Remote Desktop will recognize your Shift key press.<br>If it's still not working for you, please let us know."},{"version_id":"823477816","version_name":"3.3.2","version_date":"2017-08-30 15:31:52.000 +0800","version_description":"FIXED: An issue that may cause VNC Viewer to disconnect immediately when connecting to VNC Server 6.2.0"},{"version_id":"826022272","version_name":"3.7.0","version_date":"2019-04-04 18:41:08.000 +0800","version_description":"NEW<br>• High-speed streaming for connections to computers running VNC Server 6.4+ with a Professional or Enterprise subscription, for up to four times the screen refresh rate without compromising on picture quality<br><br>NEW<br>• Floating, flickable toolbar available on all devices<br><br>IMPROVED<br>• Added clarity around RealVNC account sign in and VNC Server authentication<br><br>FIXED<br>• Usernames that contain '$' are now saved correctly"},{"version_id":"826022272","version_name":"3.8.0","version_date":"2019-09-05 10:54:32.000 +0800","version_description":"NEW<br>• Support for high-speed streaming via a new UDP relay service even when peer-to-peer connectivity is not available.<br><br>IMPROVED<br>• Improve reliability of connection establishment.<br><br>IMPROVED<br>• Improve performance particularly in scenarios with high packet loss and latency.<br><br>FIXED<br>• Fixed some bugs reported from the iOS 13 beta."},{"version_id":"826022272","version_name":"3.8.1","version_date":"2019-10-21 15:53:22.000 +0800","version_description":"FIXED<br>• Various crash fixes and backgrounding behavior affecting iOS 13<br><br>FIXED<br>• IPv6 domain resolution for RealVNC Cloud Services for affected ISPs<br><br>IMPROVED<br>• Help menu now redirects to: help.realvnc.com"},{"version_id":"826022272","version_name":"3.6.0","version_date":"2018-10-15 14:39:00.000 +0800","version_description":"IMPROVED<br>• Performance of text input when using dictation<br><br>FIXED<br>• Hardware keyboard support for iOS 12"},{"version_id":"826022272","version_name":"3.4.0","version_date":"2018-02-19 12:42:11.000 +0800","version_description":"New<br>• iPhone X fullscreen support <br>• iPhone X users: unpin the docked toolbar to discover a floating, flickable version<br><br>Improved<br>•  You'll no longer see a green banner if your connection is encrypted; don't worry, you will still see a red one if it isn't.<br><br>Fixed<br>•  Two consecutive hyphens (--) will no longer be converted to an em dash (—), if keyboard auto-correct is disabled in VNC Viewer -&gt; Settings<br>•  Improved handling of external keyboards"},{"version_id":"827513429","version_name":"3.5.0","version_date":"2018-06-13 14:47:18.000 +0800","version_description":"NEW<br>• Control a remote touch panel directly, rather than using the device screen as a trackpad. To do this, select Interaction &gt; Touch panel from a connection’s settings, either before or during a session.<br>• The connection method (whether cloud or direct) is now displayed on the session's information screen.<br><br>FIXED<br>• Hardware left and right arrow keys now work when the scrolling function key bar is active."},{"version_id":"828911769","version_name":"3.6.0","version_date":"2018-10-15 14:39:00.000 +0800","version_description":"IMPROVED<br>• Performance of text input when using dictation<br><br>FIXED<br>• Hardware keyboard support for iOS 12"},{"version_id":"829964325","version_name":"3.7.0","version_date":"2019-04-04 18:41:08.000 +0800","version_description":"NEW<br>• High-speed streaming for connections to computers running VNC Server 6.4+ with a Professional or Enterprise subscription, for up to four times the screen refresh rate without compromising on picture quality<br><br>NEW<br>• Floating, flickable toolbar available on all devices<br><br>IMPROVED<br>• Added clarity around RealVNC account sign in and VNC Server authentication<br><br>FIXED<br>• Usernames that contain '$' are now saved correctly"},{"version_id":"832437482","version_name":"3.8.0","version_date":"2019-09-05 10:54:32.000 +0800","version_description":"NEW<br>• Support for high-speed streaming via a new UDP relay service even when peer-to-peer connectivity is not available.<br><br>IMPROVED<br>• Improve reliability of connection establishment.<br><br>IMPROVED<br>• Improve performance particularly in scenarios with high packet loss and latency.<br><br>FIXED<br>• Fixed some bugs reported from the iOS 13 beta."},{"version_id":"833235165","version_name":"3.8.1","version_date":"2019-10-21 15:53:22.000 +0800","version_description":"FIXED<br>• Various crash fixes and backgrounding behavior affecting iOS 13<br><br>FIXED<br>• IPv6 domain resolution for RealVNC Cloud Services for affected ISPs<br><br>IMPROVED<br>• Help menu now redirects to: help.realvnc.com"},{"version_id":"834536485","version_name":"3.9.0","version_date":"2020-04-02 14:09:39.000 +0800","version_description":"VNC Viewer for iOS 3.9.0 released<br>This is a release of VNC Viewer for iOS devices, used to control remote devices running a VNC server. Search “RealVNC” in the App Store.<br><br>This is a small update, but an important one. For our users who are connecting to non-RealVNC servers, a subscription to VNC Viewer for iOS is now required for an ad-free, smooth connection. You will see a prompt on your screen with two options: watch an ad or subscribe."},{"version_id":"835395257","version_name":"3.9.1","version_date":"2020-04-03 20:36:36.000 +0800","version_description":"Reverting to previous version."},{"version_id":"838126797","version_name":"3.9.2","version_date":"2020-10-29 11:57:41.000 +0800","version_description":"iOS Viewer 3.9.2 Released<br><br>Features: <br><br>FIXED: Bluetooth keyboards not working with VNC Viewer on iOS 14<br>FIXED: Potential crashes during account login on iOS 14"},{"version_id":"838554862","version_name":"3.9.3","version_date":"2020-11-09 15:10:11.000 +0800","version_description":"iOS Viewer 3.9.3 Released<br><br>NEW: You will see a prompt on your screen to help VNC Viewer discover VNC services through the local network. This access will allow you to connect to VNC servers.<br>FIXED: Bluetooth keyboards not working with VNC Viewer on iOS 14<br>FIXED: Potential crashes during account login on iOS 14<br>IMPROVED: Added support for dark mode on iOS 13+"}]