[{"version_id":"114832641","version_name":"3.11","version_date":"2013-11-15 18:38:28.000 +0800","version_description":"New Stuff:<br>Offline Support – Aha now works without a constant network connection! If a network is unavailable, Aha can still play content that has been cached to the device<br>Updated for iOS 7 – New look and feel for the new OS<br><br>Bugs Squished: <br>Playback Issues – Resolved various resume issues when ending a phone call or disconnecting from a compatible car stereo<br>General – Performance improvements and bug fixes<br><br>Fun Stuff:<br>The human head weighs 8 pounds"},{"version_id":"2352254","version_name":"1.0","version_date":"","version_description":""},{"version_id":"2757597","version_name":"1.4.1","version_date":"","version_description":""},{"version_id":"404792640","version_name":"4.3","version_date":"2014-04-15 18:11:21.000 +0800","version_description":"- Faster start-up. No more waiting for a video to load when you launch Aha. Click the icon, and you’re in!<br>-You might notice something new when you go to add new stations - pictures! We’ve also added banners and widgets to help you find our best content.<br>- Bug fixes and performance improvements."},{"version_id":"811789978","version_name":"5.1","version_date":"2015-02-26 21:29:35.000 +0800","version_description":"Portuguese language support. Various bug fixes."},{"version_id":"811900426","version_name":"5.4.1","version_date":"","version_description":""},{"version_id":"814867252","version_name":"5.11","version_date":"2015-12-16 09:15:26.000 +0800","version_description":"\"Try out as a Guest\" login option.<br>Sign up for AHA using Facebook and Google + login.<br>Aha Radio is now available at India and Russia.<br>Bug fixes"},{"version_id":"816729327","version_name":"6.2.1","version_date":"","version_description":""},{"version_id":"816729327","version_name":"6.2","version_date":"2016-03-28 08:39:45.000 +0800","version_description":"Minor User interface enhancements  and bug fixes."},{"version_id":"819040591","version_name":"6.6.5","version_date":"","version_description":""},{"version_id":"819040591","version_name":"6.6","version_date":"2016-10-05 06:02:45.000 +0800","version_description":"Our biggest update ever! The redesigned interface will make the app easier to use. You will see no change to your in-car experience.<br>- “Menu” button on the top left opens an easy to read list of options<br>- Use the \"Discover\" menu item to find and play new stations. <br>- Play any station by simply tapping it. No need to add to your favorites (aka \"presets\") like before.<br>- Add a station to your favorites using the star button in the player.<br>- Under the \"Favorites\" section you'll now have direct access to your linked services (such as Deezer, Slacker, and 8tracks)<br>- If you select Deezer, you will find you have full access to ALL your Playlists, Albums, Artists, Flow, and more. Expect a similar experience with 8tracks and Slacker soon.<br>- Note: Favorites (aka \"presets\") are still the primary way to play stations in the car.<br>- Our search tool will suggest search words as you type and also remember your search history<br>- Easily edit your Favorites by tapping the pencil button<br>- \"Nearby places\" (Hungry, Weather, etc) have been moved to the menu (used to be accessible from \"pinwheel\" at bottom right)"},{"version_id":"820625921","version_name":"7.1","version_date":"2017-03-09 05:08:43.000 +0800","version_description":"Aha Radio 7.1 Release includes lot of new features and enhancements that offer personalized services to the user. Here are some of the improvements that can be found in the latest version.<br> <br>Discover Mode<br>·       Finds relevant audio content with minimal intervention by the user. Available for new Aha Radio 2.0 headunit integrations only.<br>·       Uses recommendation engine to decide what content to play based on behavior of similar users whom also listen to the station that was playing when discover mode was invoked.<br> <br>\"Downloads”<br>·       Provides an option to download Podcasts and audiobooks.<br>·       The downloaded contents can be listened in offline mode<br> <br>\"History”  <br>·      Provides a history of the stations listened to by the user."},{"version_id":"821838568","version_name":"7.6","version_date":"2017-09-06 05:25:04.000 +0800","version_description":"Aha Radio 7.6 Release offers NPR One's personalized news and podcast experience.<br><br>NPR One Content Integration<br>• NPR One allows you to listen to stories, shows and podcasts from NPR and your local public radio station. Connect your NPR One account to Aha to get access to all your followed podcasts and allow NPR One recommendations drive what you listen to.<br>• “Discovery” aka “Station Manager” of NPR One content is available for new Aha Radio 2.0 headunit integrations only. However, NPR One stations that are added in “Favourites” will play in existing headunit integrations."},{"version_id":"823916259","version_name":"8.4","version_date":"2018-05-21 10:31:17.000 +0800","version_description":"Aha Radio 8.4 Release offers Amazon Music’s on-demand music streaming. Amazon Music Unlimited offers access to tens of millions of songs. Connect your Amazon Music account to Aha to get access to “My Music” and browse the Amazon Music catalogue. Mark content as a Favorite to get easy access to it from your car."},{"version_id":"829792753","version_name":"8.12","version_date":"2019-01-01 12:50:03.000 +0800","version_description":"Aha Radio 8.12 is a bug fix maintenance Release to improve stabilization.<br><br>Amazon Music is now live in Aha . Download Aha’s latest app from Play Store and connect your Amazon Music account to Aha to get access to “My Music” and browse the Amazon Music catalogue. Mark content as a Favorite to get easy access to it from your car.<br>Amazon Music Regions Availability: Currently available in US, UK, Germany, Italy , France, Spain and Japan .<br><br>Gaana is now live in Aha . Download Aha’s latest app from Play Store and connect your Gaana Music account to Aha to get access to Music and browse the Gaana catalogue. Mark content as a Favorite to get easy access to it from your car.<br>Gaana Music Regions Availability: Currently available in India Only."},{"version_id":"831128647","version_name":"9.6","version_date":"2019-06-19 09:49:40.000 +0800","version_description":"Minor bug fixes and improvements"},{"version_id":"832985693","version_name":"9.6.2","version_date":"","version_description":""}]