[{"version_id":"815627626","version_name":"2.3.5","version_date":"2016-01-04 13:07:09.000 +0800","version_description":"- Prozess beim Wiederherstellen der Einkäufe verbessert<br>- Vorbereitet um ifap praxisCENTER premium QR-Codes zu scannen"},{"version_id":"818323916","version_name":"2.3.6","version_date":"2016-08-09 08:58:01.000 +0800","version_description":"- neuer Datenstand 15.07.2016<br>- kleiner Verbesserungen"},{"version_id":"823046148","version_name":"2.3.7","version_date":"2017-08-02 11:20:51.000 +0800","version_description":"- Unterstützung von iOS 10<br>- Neuer Datenstand vom 01.07.2017<br>- die Details des Arzneimittel können jetzt aus den Notizen aufgerufen werden<br>- Notizen werden jetzt in allen Arzneimittellisten durch ein Symbol markiert<br>- Bugfixes:<br>- Sporadisch auftretender Verlust der Favoriten und ifox-Check Einträge beim App-Update gefixt<br>- Einträge bei Wechselwirkungen von gleichen Wirkstoffen werden nicht mehr doppelt angezeigt<br>- Absturz bei Krankheitenliste gefixt<br>- kleinere Bugfixes"},{"version_id":"823215908","version_name":"2.3.8","version_date":"2017-09-04 07:29:57.000 +0800","version_description":"- Bugfix: Der Datenstand vom 01.07.2017 könnte teilweise nicht richtig geladen werden in der vorheriger Version."},{"version_id":"827247666","version_name":"2.3.9","version_date":"2018-05-23 15:39:24.000 +0800","version_description":"-Wir bei ifap nehmen Ihre Privatspähre ernst. Wir wollen sicherstellen, dass Ihre Daten bei uns gut aufgehoben sind und hane deshalb unsere Datenschutzerklärung auf den neuesten Stand gebracht, damit sie die Voraussetzung der europäischen Datenschutzgrundverordnung (DSGVO) erfüllt.<br>-Neuer Datenstand 15.05.2018"},{"version_id":"831318202","version_name":"2.3.10","version_date":"2019-05-27 11:09:35.000 +0800","version_description":"Neue Version 2.3.10 mit Datenstand 15.05.2019<br><br>Wir bedanken uns für das Feedback unserer User und arbeiten zur Zeit an einem Upgrade."},{"version_id":"832351802","version_name":"2.3.11","version_date":"2019-08-14 05:38:52.000 +0800","version_description":"Version 2.3.11 mit Datenstand 01.08.2019<br><br>Dies ist ein zwingend erforderliches Datenupdate für alle Nutzer von Arznei aktuell. Bitte installieren Sie dieses Update.<br>Fehlerbehebung durch Datenupdate: Dosierungsinformationen bei Digitoxin Philo 0.25 mg/ml und Salbutamol ratiopharm N Dosieraerosol<br><br>Wir bedanken uns für das Feedback und arbeiten weiter an einem Upgrade von Arznei aktuell."},{"version_id":"833496309","version_name":"2.3.12","version_date":"2019-11-08 14:42:45.000 +0800","version_description":"NEUHEITEN<br> <br>Liebe Arznei Aktuell User, ihr erhaltet mit diesem Update folgende Anpassungen:<br> <br>- Die Suchoptionen wie Wirkstoff, Anbieter, ATC und ICD10  können nun wieder einzeln angewählt werden.<br>- Die mitgelieferte Arzneimitteldatenbank wurde auf den neuesten Stand gebracht. Neuer Datenbankstand ist der 01.11.2019.<br> <br>ACHTUNG: Eine Sicherung der persönlichen Daten (Favoriten, Notizen, i:fox® Einträge) kann aktuell leider nicht gewährleistet werden.<br> <br>Wir arbeiten jedoch weiterhin an Arznei Aktuell, um es für euch zu verbessern."},{"version_id":"833816466","version_name":"2.3.13","version_date":"2019-12-03 14:31:18.000 +0800","version_description":"Liebe Arznei Aktuell User, ihr erhaltet mit diesem Update folgende Anpassung:<br>- Die Nutzung im Dark-Mode ist ab sofort wieder uneingeschränkt möglich.<br>ACHTUNG: Eine Sicherung der persönlichen Daten (Favoriten, Notizen, i:fox® Einträge) kann aktuell leider nicht gewährleistet werden.<br>Wir arbeiten jedoch weiterhin an Arznei Aktuell, um es für euch zu verbessern."},{"version_id":"833905323","version_name":"2.3.14","version_date":"2019-12-09 22:05:56.000 +0800","version_description":"Liebe Arznei Aktuell User, ihr erhaltet mit diesem Update folgende Anpassung:\n<br>- Neuer Datenstand vom 01.12.2019\n<br>- Bugfix: Ausgabe der Warnhinweise zur Fahrtüchtigkeit\n<br>- Bugfix: Absturz beim Aufruf des i:fox® Check\n<br>\n<br>ACHTUNG: Eine Sicherung der persönlichen Daten (Favoriten, Notizen, i:fox® Einträge) kann aktuell leider nicht gewährleistet werden.\n<br>Wir arbeiten jedoch weiterhin an Arznei Aktuell, um es für euch zu verbessern."},{"version_id":"842680016","version_name":"3.13.0","version_date":"2021-06-29 06:35:52.000 +0800","version_description":"Enthaltene Funktionen, Verbesserungen und Bugfixes in Version 3.13:<br><br>Sortierung der Produkte nach Name, Hersteller, Preis und Wirkstoffen&nbsp;<br>Filtern der Suchergebnisse nach Teilbarkeit und Sortimente<br>Anzeige der Zuzahlungsinformation in den Produktdetails&nbsp;<br>Bessere Handhabung im Offline Modus&nbsp;<br>Verbesserung der ICD-Suche<br>Integration eines Videos, das das neue Bezahlmodell erklärt&nbsp;<br>Weitere Verbesserungen der Nutzerinformationen und des App- und Tastatur-Verhaltens<br><br><br>Enthaltene Funktionen, Verbesserungen und Bugfixes in Version 3.12.3:<br><br>Problem behoben, dass ein Kauf aus der vorhergehenden Version nicht erkannt wurde<br><br><br>Enthaltene Funktionen, Verbesserungen und Bugfixes in Version 3.12.2:<br>Neue kompakte Ansicht zur Anzeige von Produktlisten wurde hinzugefügt<br>Der Benutzer kann nun auswählen, welche Ansicht als Standard festgelegt werden soll <br>Es wurde eine Option hinzugefügt, um die App- und die DB-Version anzuzeigen<br>Unterstützung für ATC-basierte Zwischenüberschriften im Produktinformationsbereich wurde zugefügt<br>Kontaktseite wurde hinzugefügt<br>Eine Seite für FAQ &amp; Videos wurde hinzugefügt<br>Im Dashboard wurde ein Banner hinzugefügt, das den Benutzern die Möglichkeit bietet, direkt Feedback zu senden<br>Die Tastatur wird nun automatisch ausgeblendet, wenn die Suchergebnisse gescrollt werden<br>Der News-Feed übernimmt nun die Originalbilder direkt aus dem RSS-Feed<br>Die Infrastruktur für die Bereitstellung der Datenbank wurde verbessert<br>Problem beim Ausführen der App im Offline-Modus während eines Kaufs behoben<br>Problem bei der Wiederherstellung eines vorherigen Kaufs behoben<br>Seltenes Problem behoben, bei dem ein endloser Ladespinner auf dem Kaufbildschirm angezeigt wurde und bei dem sich Benutzer unter iOS nicht anmelden konnten, wenn sie einen Passwort-Manager verwendeten<br><br><br>Enthaltene Funktionen, Verbesserungen und Bugfixes in Version 3.12.1:<br>Bei der Version 3 handelt es sich um eine komplett überarbeitete Version der Arznei aktuell. Sie bietet ein neues, übersichtlicheres Design, verbesserte Handhabung und Stabilität sowie Anpassungen an neue Smartphones und Betriebssystem-Versionen. <br><br>Zusätzlich haben Sie nun die Wahl zwischen einer werbefinanzierten oder einer kostenpflichtigen, werbefreien Variante, die beide viele bisher entgeltpflichtige Funktionen ab sofort ohne weitere Kosten enthalten. Um unsere neue Version der App nutzen zu können, ist nach spätestens 10 Tagen eine Registrierung erforderlich. <br><br>In beiden Varianten der Arznei aktuell sind folgende Funktionen ohne Aufpreis enthalten:<br>- Ein Datenstandupdate pro Quartal, bis mindestens 01.05.2022 zusätzlich 1-2 Datenstandupdates pro Monat<br>- Der Arzneimitteltherapiesicherheitscheck THERAFOX (ersetzt: i:fox)<br>- Barcode Scanner für Arzneimittel<br>- Teilbarkeit von Medikamenten<br>- Alle Sortimente<br>- Text-Notizen<br>- Anzeige der Hilfsstoffe<br><br>Einige Funktionen sind mit dieser Version nicht mehr verfügbar:<br>Dies beinhaltet die Suchhistorie, Suche in den Notizen, Notfallinfo, Neuerscheinungen, Liste der Krankheiten sowie Audio- und Bildnotizen und Notizen mit Erinnerung. <br>Sollten Sie in der Vergangenheit Audio- und Bildnotizen erstellt haben, werden diese dennoch lokal auf Ihrem Smartphone in die neue App Version übertragen und stehen eventuell in einer zukünftigen Version wieder zur Verfügung. Bitte löschen Sie daher vor dem Update Audio- und Bildnotizen, wenn Sie diese nicht mehr benötigen, um Speicherplatz zu sparen. Wir werden nach Bedarf unserer Kunden die Arznei aktuell weiterentwickeln und dem Produkt diese oder andere neue Features hinzufügen. <br><br>Es kommt zu Änderungen beim Arzneimitteltherapiesicherheitscheck. Der i:fox wird durch das neue Medizinprodukt THERAFOX ersetzt. Außerdem entfällt der Fahrtüchtigkeitscheck und die Anzeige von potentiellen Risiken der Anwendung bei Schwangeren oder Stillenden, die Informationen sind jedoch in den Fachinformationen und teilweise im THERAFOX verfügbar."}]