[{"version_id":"814997452","version_name":"1.8.2","version_date":"2015-12-03 22:55:34.000 +0800","version_description":"New:<br>- Optimized for watchOS2 plus complication support for the modular watch face (first station in widget group is always displayed as complication)<br>- Added Japanese localization<br>- Decoder: vertical visibility (VV) is now taken into account for flightrule determination<br>- Updated station/runway/radar/awos database<br><br>Bugfixes and Maintenance:<br>- METAR decoding of RVR might have caused app to crash<br>- Fixed Maldives data source<br>- Minor display and user interface issues (e.g. flightrule icons)"},{"version_id":"816516449","version_name":"1.8.3","version_date":"2016-02-27 07:15:10.000 +0800","version_description":"Bugfixes and Maintenance:<br>- Fixed bug when editing groups <br>- Decoder inprovements for turbulence/icing<br>- Minor display and user interface issues<br>- Updated station/runway/radar/awos database"},{"version_id":"817390966","version_name":"1.8.4","version_date":"2016-05-16 09:01:30.000 +0800","version_description":"- Improved stability of watchOS 2 app/complication<br>- Decoder improvements (e.g. QBB)<br>- Changed database loader (for updates within app)<br>- Changed NOTAM loader for faster and more efficient loading<br>- Updated station/runway/radar/awos database<br>- Last release for iOS 6"},{"version_id":"818254453","version_name":"1.9","version_date":"2016-09-27 06:05:29.000 +0800","version_description":"- Complete redesign of NOTAM section including automatic loading for all stations and offline mode (loading option in settings)<br>- Customizations for watch complication (see settings in iPhone watch app) plus colored flightrule symbols<br>- Added flags when sorting by country for better readability<br>- Added 'TAF available' indicator in overview list<br>- Webcam display bug fix on iPhone 6 and 6 Plus<br>- Minor layout and bug fixes; improved watch connectivity<br>- Updated Airport Database (2016-08-16)<br>- Adapted for iOS 10 (e.g., widget)<br><br>For more detailed explanations on this release please go to https://lakehorn.tumblr.com"},{"version_id":"819099988","version_name":"1.9.1","version_date":"2016-09-29 05:38:28.000 +0800","version_description":"- Bugfixing: raw TAF in detail view; database updater<br>- Improved widget colors"},{"version_id":"819147675","version_name":"1.9.2","version_date":"2016-10-12 06:34:11.000 +0800","version_description":"- Bugfixing: NOTAM loading crashes for certain airports<br>- Added NOTAM loading for QuickSearch results<br>- NOTAM layout: added time stamp when data was loaded<br>- Dropbox: migrated to API2 and minor layout changes<br>- Fixed delayed METAR/TAF loading for Brazilian airports<br>- Minor layout changes and bug fixing<br>- Database update (2016-10-11)"},{"version_id":"819723996","version_name":"1.9.3","version_date":"2016-11-21 20:09:23.000 +0800","version_description":"- Fixed NOTAM loader (which might have caused crashes)<br>- Minor layout changes<br>- Various bug fixes in iOS app and watch app<br>- Updated Airport Database (2016-11-04)"},{"version_id":"820078390","version_name":"1.9.4","version_date":"2016-12-13 07:05:54.000 +0800","version_description":"- Fixed database updater loader<br>- Fixed crashes when restoring user data<br>- Minor NOTAM layout changes<br>- Updated Airport Database (2016-12-08)"},{"version_id":"820949171","version_name":"1.9.5","version_date":"2017-02-20 04:33:25.000 +0800","version_description":"- Minor decoder improvements (RVR and present weather)<br>- TAF loading improvements<br>- Minor bug fixing in iOS app and watch app complication<br>- Updated airport database (2017-02-14)"},{"version_id":"821386136","version_name":"1.9.6","version_date":"2017-03-21 06:55:19.000 +0800","version_description":"- Fixed loading for SuperAWOS stations (US only)<br>- Minor bug fixing<br>- Updated airport database (2017-03-12)"},{"version_id":"822643326","version_name":"1.9.7","version_date":"2017-06-23 07:08:05.000 +0800","version_description":"- Bug fixing (crashes for certain airports when loading NOTAMs)<br>- Added option for optimized connectivity with SKYTRAC ISAT devices<br>- Updated Airport Database (2017-06-17)"},{"version_id":"822911477","version_name":"1.9.8","version_date":"2017-07-21 05:37:10.000 +0800","version_description":"This release is a bug fix for the latest iOS update and includes Watch app stability improvements. <br>Major updates of AeroWeather Lite and Pro are coming very soon."},{"version_id":"823212366","version_name":"1.9.9","version_date":"2017-08-09 06:04:08.000 +0800","version_description":"- Fixed bug that crashed app at startup when using iOS 9.2.x or lower<br>- Fixed bug that could cause app crash at startup due to malformatted NOTAMs"},{"version_id":"824083891","version_name":"2.0","version_date":"2017-10-31 06:14:44.000 +0800","version_description":"Thanks for using AeroWeather! We have re-written large parts of AeroWeather Pro and are happy to release a major update with a lot of new functionality and improvements.<br><br>• Adaptive user interface (split screens, portrait/landscape support) with better lay-outing on all devices<br>• Added support for 3D touch, drag and drop, detail page swiping, dynamic font sizes<br>• Added customisable groups management; in the main list groups and stations can now be mixed<br>• Added group with US ATC delay information (source FAA)<br>• Added group with last 24 hours of earthquakes<br>• Added CloudKit synchronisation of user group among devices with same Apple ID (needs to be unlocked)<br>• Added alert notifications for METARs (needs to be unlocked)<br>• Added user weather images (AeroPix)<br>• Added time-based station background (dark background during nighttime)<br>• Added glossary<br>• Added World Magnetic Model (WMM) for mag. variation calculations<br>• Added support of URL scheme to launch app and show a station<br>• Added support of open data exchange format to import/export data from/to other systems (see web-site for details)<br>• Improved Apple Watch app: displays nearby stations or iPhone list; shows TAF and webcam in detail view (if available); better complication support<br>• Improved today widget: it now has option to show nearby stations based on current location<br>• Improved runway section; now also showing TAF wind situation and runway surface type (mainly US only)<br>• Improved notes section with multiple records per station<br>• Improved map view with direct access to station details<br>• Improved radar and webcam view<br>• Improved sharing and printing<br>• Improved METAR/TAF loading (background fetching)"},{"version_id":"824224463","version_name":"2.0.1","version_date":"2017-10-31 14:20:59.000 +0800","version_description":"Changes 2.0.1:<br>- added missing in-app purchases for alerts and cloud synchronization<br><br>Thanks for using AeroWeather! We have re-written large parts of AeroWeather Pro and are happy to release a major update with a lot of new functionality and improvements.<br><br>• Adaptive user interface (split screens, portrait/landscape support) with better lay-outing on all devices<br>• Added support for 3D touch, drag and drop, detail page swiping, dynamic font sizes<br>• Added customisable groups management; in the main list groups and stations can now be mixed<br>• Added group with US ATC delay information (source FAA)<br>• Added group with last 24 hours of earthquakes<br>• Added CloudKit synchronisation of user group among devices with same Apple ID (needs to be unlocked)<br>• Added alert notifications for METARs (needs to be unlocked)<br>• Added user weather images (AeroPix)<br>• Added time-based station background (dark background during nighttime)<br>• Added glossary<br>• Added World Magnetic Model (WMM) for mag. variation calculations<br>• Added support of URL scheme to launch app and show a station<br>• Added support of open data exchange format to import/export data from/to other systems (see web-site for details)<br>• Improved Apple Watch app: displays nearby stations or iPhone list; shows TAF and webcam in detail view (if available); better complication support<br>• Improved today widget: it now has option to show nearby stations based on current location<br>• Improved runway section; now also showing TAF wind situation and runway surface type (mainly US only)<br>• Improved notes section with multiple records per station<br>• Improved map view with direct access to station details<br>• Improved radar and webcam view<br>• Improved sharing and printing<br>• Improved METAR/TAF loading (background fetching)"},{"version_id":"824283723","version_name":"2.0.2","version_date":"2017-11-23 08:37:39.000 +0800","version_description":"Thank you for using AeroWeather. This update fixes some reported bugs and re-introduces requested features:<br>- Added access to map in station detail view (including pins for nearby stations)<br>- Added option to remove moon data from station detail<br>- Fixed AM/PM time format in TAF<br>- Corrected widget data format (raw/decoded)<br>- Small layout changes/improvements (e.g., position of refresh button)<br>- Fixed issues with some Canadian radar images<br>- Improved watch complication loading<br>- Bug fixing (e.g., CAT indicator, duplicate METARs, webcams, proximity sort order, LT/UTC and flightrule in widget/watch)<br>- Database update (2017-11-17)"},{"version_id":"825227725","version_name":"2.1","version_date":"2017-12-11 15:39:08.000 +0800","version_description":"- Added again printing/PDF sharing for groups<br>- Added sharing of groups thru QR codes<br>- Groups can be sorted by name<br>- Improved station sorting by name<br>- Runway section: AM/PM time format; removed decimals for wind components (now rounded)<br>- Widget: decoded format now also shows FEW/SCT: option for raw TAF<br>- Small layout changes/improvements<br>- Bug fixing (e.g. large font size, CAT indicator; duplicate METARs; widget loading/settings; stuck TAFs)<br>- Updated database (2017-12-04)"},{"version_id":"825487432","version_name":"2.2","version_date":"2018-01-19 07:47:35.000 +0800","version_description":"This update offers some more features and fixes a couple of reported bugs.<br><br>- Added free iMessages app to send raw METAR/TAF (to be used through iOS Messages app)<br>- Added ISA temperature deviation (next to temperature in decoded METAR)<br>- Improved results display for QuickSearch (always shows matching ICAO/IATA results before matching names)<br>- Improved wind components for TAF<br>- Data exchange format reads stations for widget and watch group (for other app developers; see documentation on web-site)<br>- Small layout changes/optimizations<br>- Bug fixing (e.g. CAT indicator; flightrule indicator; twilight +/-30min; proximity sort; scrolling in notes view; NOTAM format filter; watch app)<br>- Updated database (2018-01-04)<br><br>Thank you for your passionate support!"},{"version_id":"825828276","version_name":"2.2.1","version_date":"2018-02-09 13:02:01.000 +0800","version_description":"- Added option to disable automatic loading of METAR/TAF/NOTAM data (if on, use manual refreshing)<br>- Added instrument approach types per runway (US airports only)<br>- Small layout changes/improvements (e.g., added \"any\" selector to station search)<br>- Bug fixing (e.g. crash when using 3D touch; proximity sort in groups; tap on webcam and radar images) and improved loading stability<br>- Updated database (2018-02-01)<br><br>Thank you for using AeroWeather!"},{"version_id":"826535426","version_name":"2.3","version_date":"2018-04-18 11:24:25.000 +0800","version_description":"• Added \"QuickGroup\" feature to create efficiently a new group by just typing in all ICAO and/or IATA location identifers at once (separated by blank or dash)<br>• Station annotation in map includes all data now (runway, NOTAM etc.)<br>• Added positions of nearby webcams in airport map<br>• Added option to transfer your alerts when changing the device (ooo-button in Alert group)<br>• Added past METAR list show/hide button in station detail (show up when in set in settings&gt;format to 2 hours or more); added flightrule indicator for each raw METAR<br>• Added option to show TAF indicator (in overview list) in flightrule colors (for first TAF segment only)<br>• Added interpretation of BECMG and TEMPO for runway wind components TAF time range<br>• Added opt-out for saving of backup snapshots to iCloud<br>• AeroWeather QR codes can be scanned directly from device's Camera app now<br>• Widget: added option to hide airports without METAR/TAF in nearby mode<br>• Small layout changes/optimizations (e.g., improved localizations)<br>• Bug fixing and improved loading stability<br>• The apps RosterBuster and myRoster now support easy transfer of groups/routes to AeroWeather Pro<br>• Updated database (2018-03-29)<br><br>For EE users: this app uses standard code for all network access. If data update over mobile doesn't work, please contact EE (for possible content filtering)."},{"version_id":"826753810","version_name":"2.3.1","version_date":"2018-04-21 07:15:53.000 +0800","version_description":"- Added missing QuickSearch in main list again<br>- Fixed bug which prevented loading of METAR under some circumstances"},{"version_id":"827568491","version_name":"2.3.2","version_date":"2018-06-19 13:03:35.000 +0800","version_description":"This is a maintenance release, improving and fixing mostly internal issues:<br>- Improved data loading stability<br>- Improved coverage of airports for alerts<br>- Watch: improved loading and complication display<br>- Small layout optimizations<br>- Minor internal bug fixing<br>- Improved translations<br>- Updated airport database (2018-06-16)"},{"version_id":"827733135","version_name":"2.4","version_date":"2018-07-06 07:10:34.000 +0800","version_description":"- Added diagram view for runways<br>- Added option in settings for automatic night mode<br>- Added option in settings for raw data displayed with monospace font<br>- Small layout optimizations<br>- Bug fixing (incl. watch complication and watch app) and improved stability"},{"version_id":"827958705","version_name":"2.4.1","version_date":"2018-07-28 08:41:40.000 +0800","version_description":"- Added read out METAR (similar to ATIS) when swiping a station in list to the right (English voice only; req. iOS 11 or higher)<br>- Added flexible configuration of data shown in large modular watch complication (use ooo-button in \"Apple Watch\" group on your iPhone)<br>- Small layout optimizations (map annotations) and translations improvements<br>- Bug fixing (historic METAR time periods, widget layout, alert deactivation in notifications, crash fixes, watch data loading)<br>- Database update (2018-07-17)"},{"version_id":"828163040","version_name":"2.4.2","version_date":"2018-08-12 09:26:24.000 +0800","version_description":"- Added option to assign a predefined flag (like departure or alternate) to stations (per group) for better usability (req. iOS 11 or higher). Swipe station in list from left to right to access it. For stations in a group this flag will also be synchronized among all devices.<br>- Fixed and improved METAR read out texts: added entire cloud segment; minus temperatures; visibility; wind<br>- Added monospace font for raw METAR/TAF also in widget (if enabled in settings)<br>- Minor bug fixing"},{"version_id":"828901813","version_name":"2.5","version_date":"2018-10-18 09:24:10.000 +0800","version_description":"- Added dedicated METAR/TAF data source option (as in-app purchase; valid in Lite and Pro). Due to occasional service issues with public data services we offer now access to METAR/TAF from a certified ANSP through dedicated and redundant servers.<br>- Added satellite background maps and re-arranged wind indicator in runway diagram<br>- Watch: added support for new complications on Series 4<br>- Watch: improved speed of data loading when switching between list and nearby view<br>- Fixed issue for Canadian NOTAMs (when preferred format option was set to \"ICAO\")<br>- Bug fixing (e.g., data loading)<br>- Support for new devices (iPhone and Watch)<br>- Notifications are grouped by airport on iOS 12<br>- Update to latest world magnetic variation model (WMM2015v2)<br>- Database update (2018-10-14)<br><br>If you are happy with the app, please rate it, or even leave a review. <br>This is a great way to support us small developers. Thank you!"},{"version_id":"828988422","version_name":"2.5.1","version_date":"2018-11-16 08:11:37.000 +0800","version_description":"- Support for new iPad devices<br>- Improved decoding of METAR/TAF present weather codes<br>- Minor layout improvements<br>- Bug fixing (e.g., data loading, watch complication)<br>- Database update (2018-11-12)"},{"version_id":"829504919","version_name":"2.5.2","version_date":"2018-12-09 08:06:45.000 +0800","version_description":"- Added Siri shortcuts for METARs<br>- Minor layout improvements<br>- Bug fixing<br>- Database update (2018-12-08)"},{"version_id":"829665414","version_name":"2.6","version_date":"2019-01-08 07:00:20.000 +0800","version_description":"- Added FlightService 1800wxbrief group for LastMinuteCheck and to close/cancel flight plans (for US only)<br>- Added note drawing support in runway diagram view on iPad (will be synchronized with iCloud, if sync feature is unlocked)<br>- Added TAF (raw) to Siri display<br>- Collapsed NOTAMs (when tapped) states are now preserved when updating the app<br>- Adopted Russian runway friction coefficient for runway state decoding<br>- Watch: added station elevation and density altitude in detail view<br>- Minor layout improvements<br>- Bug fixing<br>- Database update (2019-01-03)"},{"version_id":"830161130","version_name":"2.6.1","version_date":"2019-02-01 08:03:38.000 +0800","version_description":"- Minor layout improvements<br>- Bug fixing<br>- Database update (2019-01-31); added many new stations with METAR and/or TAF"},{"version_id":"830297109","version_name":"2.6.2","version_date":"2019-02-17 08:37:37.000 +0800","version_description":"- Added meteograms (based on MOS) with forecasts for temperature, wind, clouds coverage etc. for approx. 3200 stations (available as part of subscription)<br>- Added UP (unknown precipitation) and FZ (freezing fog/rain/drizzle) to alerts present weather<br>- Fixed case in which some NOTAMs would not be loaded properly<br>- Minor layout improvements for dark mode<br>- Bug fixing<br>- Database update (2019-02-14)"},{"version_id":"830496392","version_name":"2.6.3","version_date":"2019-03-07 07:12:00.000 +0800","version_description":"- Added visibility and flightrules to meteogram<br>- Added 1h short/long switch (1 hour vs. 3 hours intervals) for non-US meteograms<br>- Added editing of alerts directly in Alert group<br>- Watch app: flightrule change for corner complication; adapted watch face templates<br>- Minor bug fixing (e.g., updating map annotation; updating meteograms)<br>- Database update (2019-03-01)<br>- Last release with iOS 9 support"},{"version_id":"831026624","version_name":"2.7","version_date":"2019-05-01 07:49:26.000 +0800","version_description":"- Added TAF alerts (sent when new TAF is available)<br>- Added crosswind alerts (sent when crosswind exceeds specified limit on all or any runways)<br>- Added decoder for METAR RMK section (primarily for US, CA, RU, JP)<br>- Added sort order option for watch group (synchronized with watch)<br>- Added detail station access when taping on delays in \"US ATC Delay\" group<br>- Added \"move group to top\" when using \"user-defiend\" sort order (accessible by swiping group to right)<br>- Added longest runway info and runway length filter in nearby group<br>- Added option to color highlight keywords in METAR and TAF (settings &gt; format &gt; highlight keywords)<br>- Added raw METAR in nearby list within station detail<br>- For UK users: added Met Office London CTA Helicopter Forecast. Shown in Imagery for all airports within coverage (part of subscription)<br>- Minor bug fixing<br>- Database update (2019-04-21)"},{"version_id":"831167686","version_name":"2.7.1","version_date":"2019-05-01 23:21:02.000 +0800","version_description":"Version 2.7.1 fixes bug when changing units in alerts<br><br>Version 2.7<br>- Added TAF alerts (sent when new TAF is available)<br>- Added crosswind alerts (sent when crosswind exceeds specified limit on all or any runways)<br>- Added decoder for METAR RMK section (primarily for US, CA, RU, JP)<br>- Added sort order option for watch group (synchronized with watch)<br>- Added detail station access when taping on delays in \"US ATC Delay\" group<br>- Added \"move group to top\" when using \"user-defiend\" sort order (accessible by swiping group to right)<br>- Added longest runway info and runway length filter in nearby group<br>- Added option to color highlight keywords in METAR and TAF (settings &gt; format &gt; highlight keywords)<br>- Added raw METAR in nearby list within station detail<br>- For UK users: added Met Office London CTA Helicopter Forecast. Shown in Imagery for all airports within coverage (part of subscription)<br>- Minor bug fixing<br>- Database update (2019-04-21)"},{"version_id":"831511133","version_name":"2.7.2","version_date":"2019-06-05 15:56:44.000 +0800","version_description":"- Added wind direction range (e.g., from 30 to 90°) for wind alerts<br>- Dynamic font size is now also applied in station list (raw METAR format only)<br>- Minor layout optimizations<br>- Bug fixing (e.g., font size, background tasks)<br>- Internal optimisations<br>- Database update (2019-05-23)"},{"version_id":"831821299","version_name":"2.7.3","version_date":"2019-06-30 11:15:43.000 +0800","version_description":"- \"User Weather Image\" group (previously \"My Weather Images\") now includes own and all other user's images<br>- Added UTC time format option in detail airport view (settings &gt; format)<br>- Minor layout optimizations<br>- Bug fixing (e.g., temperature unit, data loading, webcams)<br>- Database update (2019-06-20)"},{"version_id":"832114623","version_name":"2.7.4","version_date":"2019-07-25 10:02:36.000 +0800","version_description":"New in Plus Package:<br>- Added new widget for meteogram, which shows the first station of the Widget group<br>- Added temporary suspending (do not disturb) of alert notification (Alert group &gt; \"moon\" button)<br><br>Improved and fixed:<br>- Minor layout optimizations (e.g., fractions for visibility in miles)<br>- Bug fixing<br>- Database update (2019-07-18)"},{"version_id":"832528376","version_name":"2.7.5","version_date":"2019-09-06 07:31:16.000 +0800","version_description":"New:<br>- SNOWTAMs are now shown in decoded format<br>- Added “Documents” group to see all user notes at once (use ooo-button on top-level to enable it)<br><br>Improved and fixed:<br>- Improved METAR/TAF present weather decoding (according to WMO)<br>- Faster cloud synchronization<br>- MOS decoder improvements<br>- Bug fixing (e.g., METAR/TAF on Watch and in app when region is set to Thailand)<br>- Database update (2019-08-25)"},{"version_id":"833067825","version_name":"2.7.6","version_date":"2019-10-09 06:45:35.000 +0800","version_description":"- Adaptions for iOS 13<br>- Dark Mode for widgets<br>- Bug fixing (e.g., stuck nearby widget, marked NOTAMs, TAF flighrules when set to ICAO)<br>- Minor layout improvements<br>- Significantly improved Chinese localization<br>- Database update (2019-09-30)"},{"version_id":"833556141","version_name":"2.8","version_date":"2019-11-23 11:23:37.000 +0800","version_description":"New in Plus Package:<br>- METAR raw data archive with up to 6 months of data back (accessible in airport's detail view)<br>- Extreme weather group showing min/max of wind and temperature grouped by continent (accessible via ooo-button in main list)<br>- New alert types: tailwind on any runway, temperature/dew point spread<br><br>New:<br>- METAR stations plots in map (accessible via layer button)<br>- Added toolbox with reference lists and decoders in detail view (where AeroPix camera button used to be; which is now also in the toolbox).<br><br>Improved and fixed:<br>- Dark Mode for all settings and maps<br>- Bug fixing (e.g., dynamic font sizes, METAR/TAF widget)<br>- Minor layout improvements<br>- Database update (2019-11-07)"},{"version_id":"833813617","version_name":"2.8.1","version_date":"2019-12-03 07:36:40.000 +0800","version_description":"Maintenance Release:<br>- Fixed crashes when enabling Cloud-Synchronization and sharing of groups and stations (on iPad only)<br>- Fixed runway state code decoder<br>- Fixed darkmode in alerts and web-viewer<br>- Fixed access to \"weather extremes\" group<br>- Internal optimizations"},{"version_id":"834007136","version_name":"2.8.2","version_date":"2019-12-18 07:24:52.000 +0800","version_description":"New:<br>- Added runway wind components calculator and SNOWTAM decoder to toolbox<br><br>Improved and fixed:<br>- Bugfixing (e.g., large font sizes in decoded view list; map annotations)<br>- Improved translations for Finnish, Italian, Japanese<br>- Updated world magnetic model (WMM) to version 2020<br>- Minor layout improvements<br>- Database update (2019-12-10)"},{"version_id":"834225796","version_name":"2.8.3","version_date":"2020-01-13 14:09:24.000 +0800","version_description":"New:<br>- Added runway length/width in layout diagram<br>- Added Canadian snow radar images (in Imagery tab use ooo-button to toggle between rain and snow)<br><br>Improved and fixed:<br>- Bugfixing (e.g., runway wind calculator, METAR archive)<br>- Translation improvements<br>- Minor layout improvements<br>- Database update (2020-01-03)"},{"version_id":"834679436","version_name":"2.8.4","version_date":"2020-02-13 07:43:38.000 +0800","version_description":"- Added customizable sounds for alert notifications (settings &gt; notifications)<br>- Watch complication loader improvements<br>- Minor layout improvements (e.g., runway layout)<br>- Bugfixing<br>- Database update (2020-02-11)"},{"version_id":"835391453","version_name":"2.8.5","version_date":"2020-04-08 05:25:08.000 +0800","version_description":"- In Plus Subscription Package: added METAR-like data from general weather sources for more airports (currently Switzerland only)<br>- Improved radar imagery for Norway and Canada<br>- Improved TAF indicator icons in overview list (now shows AMD/COR if applicable)<br>- METAR/TAF decoder: display of vertical visibility in decoded station list; additional RMK decoding in TAF<br>- Watch complication loader improvements<br>- Minor layout changes (e.g., LT indicators)<br>- Bugfixing<br>- Database update (2020-03-30)"},{"version_id":"835702721","version_name":"2.9","version_date":"2020-05-06 05:25:44.000 +0800","version_description":"New in Plus Subscription Package<br>- Added D-ATIS for almost 80 US airports<br>- Added push notifications for D-ATIS<br>- Added complementing METAR-like data for UK airports from general weather sources<br><br>New<br>- Added customizable layout of detail station page (use \"Edit view\" at the bottom)<br>- Added synchronization of \"highlight\"-keywords among all devices (via iCloud)<br>- Added possibility to apply \"highlight\"-keywords to specific data (METAR/TAF, ATIS)<br>- Added \"highlight\"-keywords to NOTAMs<br>- Added context menus for most station detail sections (tap and hold)<br>- Added \"auto-disable date\" for alert notifications (switches them off automatically after predefined time)<br><br>Improved and fixed<br>- Minor layout improvements<br>- Webcam provider changed from webcams.travel to windy.com<br>- Bugfixing<br>- Database update (2020-04-26)"},{"version_id":"836007787","version_name":"2.9.1","version_date":"2020-05-22 05:48:40.000 +0800","version_description":"New in Plus Subscription Package:<br>- Added Area Forecast Discussions from US NOAA (currently US only)<br><br>New<br>- Added open-end option for ATIS alert notifications<br><br>Improved and fixed:<br>- Language selection moved to devices settings (for iOS 13 or newer)<br>- Minor improvements (e.g., highlight keywords, D-ATIS loading)<br>- Bugfixing (e.g., runway wind components)<br>- Database update (2020-05-21)"},{"version_id":"836090147","version_name":"2.9.1","version_date":"2020-05-22 05:48:40.000 +0800","version_description":"New in Plus Subscription Package:<br>- Added Area Forecast Discussions from US NOAA (currently US only)<br><br>New<br>- Added open-end option for ATIS alert notifications<br><br>Improved and fixed:<br>- Language selection moved to devices settings (for iOS 13 or newer)<br>- Minor improvements (e.g., highlight keywords, D-ATIS loading)<br>- Bugfixing (e.g., runway wind components)<br>- Database update (2020-05-21)"},{"version_id":"836537031","version_name":"2.9.2","version_date":"2020-06-26 04:49:56.000 +0800","version_description":"Added in subscription:<br>- METAR/LWIS data from NemoWX (Canada)<br><br>New, improved and fixed:<br>- Added \"METAR Plot\" complication (graphic rectangular only)<br>- Minor improvements (e.g., added sharing for area forecasts)<br>- Bugfixing (e.g., language selection, crashes, wind units in runway diagram, Canadian radar layers)<br>- Database update (2020-06-22)"},{"version_id":"836922473","version_name":"2.9.3","version_date":"2020-07-22 05:38:10.000 +0800","version_description":"New:<br>- Added pressure altitude in airport detail on watch<br><br>Improved and fixed:<br>- Minor layout improvements (e.g., home screen context menu)<br>- Minor Bugfixing (e.g., darkmode, original units)<br>- Database update (2020-07-19)"},{"version_id":"837571256","version_name":"2.9.4","version_date":"2020-09-03 14:46:26.000 +0800","version_description":"New in Subscription Package:<br>- Added alert for dew point<br><br>Improved and fixed:<br>- Minor layout improvements (e.g., map annotations)<br>- Minor Bugfixing<br>- Database update (2020-08-17)<br>- Removed two months subscription option<br>- Last release with iOS 10 support"},{"version_id":"837837467","version_name":"3.0","version_date":"2020-10-11 07:43:56.000 +0800","version_description":"New Subscription Levels<br><br>This release incorporates again more weather data. Due to incurring costs to obtain this data and to distribute it we now offer two subscription levels. The previous Plus subscription is a now called \"First\" (with same features as before and more), while the new higher tier subscription \"Captain\" offers even more data on top of that (** indicates new feature in this release):<br><br>'First' Subscription<br>- Alerts push notifications<br>- Dedicated METAR/TAF access (direct from ANSP)<br>- Meteogram (MOS) in app and widget<br>- D-ATIS (US only)<br>- Area Forecast Discussions (US only)<br>- METAR Archive (6 months)<br>- Home Screen Widgets (iOS 14 only) **<br>\t\t<br>'Captain' Subscription<br>- Everything in 'First' subscription<br>- Imagery and Forecast Charts (new group) **<br>- SIGMETs (as map layer and as new group) **<br><br>Changed and fixed:<br>- Minor layout improvements<br>- Minor Bugfixing (e.g. NOTAM loading)<br>- Database update (2020-09-25)"},{"version_id":"838204841","version_name":"3.0.1","version_date":"2020-10-14 16:27:42.000 +0800","version_description":"Info: Today Widgets (prior to iOS 14) are still available. If they don't show up you might have to restart the device.<br><br>New:<br>- Added 'Decoded METAR' home screen widget (requires any subscription)<br>- Added 'Central European Radar with Lightning' in Imagery Group (requires 'Captain' subscription)<br><br>Changed and fixed:<br>- Minor improvements (e.g., widget station searching, SIGMET display)<br>- Minor Bugfixing<br>- Database update (2020-10-13)<br><br>New Subscription Levels<br><br>More weather data is available since version 3.0, however, due to incurring costs to obtain this data and to distribute it we now offer two subscription levels. The previous Plus subscription is a now called \"First\" (with same features as before and more), while the new higher tier subscription \"Captain\" offers even more data on top of that (** indicates new feature in this release):<br><br>'First' Subscription<br>- Alerts push notifications<br>- Dedicated METAR/TAF access (direct from ANSP)<br>- Meteogram (MOS) in app and widget<br>- D-ATIS (US only)<br>- Area Forecast Discussions (US only)<br>- METAR Archive (6 months)<br>- Home Screen Widgets (iOS 14 only) **<br>\t\t<br>'Captain' Subscription<br>- Everything in 'First' subscription<br>- Imagery and Forecast Charts (new group) **<br>- SIGMETs (as map layer and as new group) **"},{"version_id":"838333279","version_name":"3.0.2","version_date":"2020-10-23 16:19:26.000 +0800","version_description":"Info: Today Widgets (prior to iOS 14) are still available. If they don't show up you might have to restart the device.<br><br>New:<br>- Added selector for latest four significant weather charts<br>- Added option to select 'My Location' for METAR/TAF home screen widget<br>- Added DWD as additional SIGMET data source<br><br>Changed and fixed:<br>- Minor improvements (e.g., map display)<br>- Minor Bugfixing<br>- Updated Canadian radar links<br><br>New Subscription Levels<br><br>More weather data is available since version 3.0, however, due to incurring costs to obtain this data and to distribute it we now offer two subscription levels. The previous Plus subscription is a now called \"First\" (with same features as before and more), while the new higher tier subscription \"Captain\" offers even more data on top of that (** indicates new feature in this release):<br><br>'First' Subscription<br>- Alerts push notifications<br>- Dedicated METAR/TAF access (direct from ANSP)<br>- Meteogram (MOS) in app and widget<br>- D-ATIS (US only)<br>- Area Forecast Discussions (US only)<br>- METAR Archive (6 months)<br>- Home Screen Widgets (iOS 14 only) **<br>\t\t<br>'Captain' Subscription<br>- Everything in 'First' subscription<br>- Imagery and Forecast Charts (new group) **<br>- SIGMETs (as map layer and as new group) **"},{"version_id":"838552267","version_name":"3.0.3","version_date":"2020-11-06 15:05:30.000 +0800","version_description":"New (in any subscription):<br>- Added lower/greater comparison to flight rule alerts (e.g., if flight rule is greater/better than MVFR)<br>- Added DWD (German Weather Service) as METAR/TAF data source<br>- Added D-ATIS (bigger US airports only) on watch<br><br>Changed and fixed:<br>- Watch: adapted user interface for watchOS 7 (removed force-touch menus)<br>- Minor improvements (e.g., TAF remaining time)<br>- Bugfixing (e.g., fixed missing advisory and imagery/charts group)<br>- Database update (2020-11-05)"},{"version_id":"839700249","version_name":"3.1.1","version_date":"2020-12-19 12:11:03.000 +0800","version_description":"In this release:<br>- Changed US radar imagery to new US NOAA system<br>- Improved US ATC Delay alerts coverage<br>- Minor bug fixing (e.g., NOTAM sort order; expired NOTAMs)<br>- Database update (2020-12-17)<br><br><br>Version 3.1:<br>- Added simple offline map layer with countries borders (does not require any internet connection); requires iOS 13 or higher<br>- Added cloud ceiling in METAR plot widget (notation as in METAR for BKN and OVC only; located between pressure and ICAO identifier)<br>- Added alert push notifications for US ATC Delays (First or Captain subscription)<br>- Added alert push notifications for SIGMET (Captain subscription)<br>- Added \"Weather/Low-Level Clouds\" forecast charts for Europe (Captain subscription)<br>- Minor improvements (e.g., display of NOTAM issue date, layout of meteogramm home screen widget, display of gusts in TAF in runway section)<br>- Minor bugfixing (e.g., METAR archive access, darkmode, subscription)"},{"version_id":"839962912","version_name":"3.1.2","version_date":"2021-01-19 07:45:33.000 +0800","version_description":"- Improved METAR/TAF coverage Australia and Colombia (for First or Captain subscriptions only)<br>- Updated help page<br>- Bug fixing (e.g., US radar imagery)<br>- Database update (2021-01-16)"},{"version_id":"840347659","version_name":"3.1.3","version_date":"2021-02-08 12:39:07.000 +0800","version_description":"- Minor improvements (added METAR wind in runways time selector; added cloud ceiling in map METAR plots; more weather extremes)<br>- Fixed bug related to subscription issues in some cases (please do \"Restore Purchase\" in settings if it doesn't show up)<br>- Minor bug fixing<br>- Database update (2021-02-03)"},{"version_id":"840639199","version_name":"3.1.4","version_date":"2021-03-04 06:56:13.000 +0800","version_description":"New:<br>- Added \"Recently Searched\" group (tap on ooo-button to make it visible)<br>- Added \"Cold Temperature Correction\" in Tools<br><br>New included in subscription plans:<br>- Added runway visual range (RVR) in runway list with real-time data for bigger US airports and from METAR where available otherwise (First or Captain subscription)<br>- Extended METAR archive from 6 to 12 months (First or Captain subscription)<br><br>Changed and fixed:<br>- Minor improvements<br>- Minor bugfixing (e.g., SNOWTAM filter, restore purchase for cloud-sync)<br>- Database update (2021-02-25)"},{"version_id":"840958816","version_name":"3.1.5","version_date":"2021-04-28 05:09:58.000 +0800","version_description":"- Added runway visual range (RVR) indicator also in runway diagram (requires any subscription plan)<br>- Minor improvements (e.g., highlight keyword)<br>- Minor bugfixing (e.g., runway state decoder in tools)<br>- Database update (2021-04-22)"}]