[{"version_id":"118112637","version_name":"1.9.9","version_date":"","version_description":""},{"version_id":"484692649","version_name":"1.10.1","version_date":"2014-03-28 03:02:09.000 +0800","version_description":"IMPORTANT NOTE: I made a boo-boo. Changing theme or some other setting can potentially crash the app for some users. I'll be submitting another update to fix this. Sorry :(<br>                            <br>This update fixes several annoying bugs introduced with the last update for iOS 7. It also introduces a lighter theme for those who hated the darker color scheme, and a new Avenir option in both light and dark themes. And by the way, Due is also 64-bit since 1.10.<br>                            <br>NEW FEATURES<br>- Light theme<br>- Dark theme with Avenir<br>- Light theme with Avenir<br><br>BUG FIXES<br>- Fixes bug where editing a text view with 3 or more lines of text causes the text view to be clipped and unscrollable<br>- Fixes bug where search bar disappears intermittently<br>- Fixes Dropbox infinite authentication loop bug<br>- Fixes crash when exiting search mode with quick panel visible<br><br>LIKE THE UPDATE?<br>Do consider leaving a review for Due on the App Store, even if you've left one before. The App Store highlights the rating and reviews of the latest version of Due, so your older review will probably be buried by now.<br><br>QUESTIONS? SUGGESTIONS? COMPLAINTS?<br>Write to support@dueapp.com, or tweet me at @dueapp"},{"version_id":"520932839","version_name":"1.10.3","version_date":"2014-04-07 23:09:32.000 +0800","version_description":"BUG FIXES \n<br>- Fixes bug where empty reminder or timer name crashes the app (thanks Tony Reynold)\n<br>- Fixes bug that crashes the app when opening a Due database file on the iPhone on iOS 7\n<br>- Fixes bug where duplicated reminders don't retain the alert sound setting of the original reminder (thanks David Merrilees)\n<br>\n<br>LIKE THE UPDATE? \n<br>Do consider leaving a review for Due on the App Store, even if you've left one before. The App Store highlights the rating and reviews of the current version of Due, so your older review will probably be buried by now. \n<br>\n<br>QUESTIONS? SUGGESTIONS? COMPLAINTS? \n<br>Write to support@dueapp.com, or tweet me at @dueapp"},{"version_id":"630522716","version_name":"1.10.5","version_date":"2014-07-18 02:07:36.000 +0800","version_description":"- Fixes compatibility issue"},{"version_id":"812131526","version_name":"2.1","version_date":"2015-04-15 08:18:17.000 +0800","version_description":"Apple Watch support<br><br>See and manage all of your reminders and timers on your wrist, without taking your iPhone out of your pocket.<br><br>P.S. if you're one of the lucky ones using The Watch now, let me know how this is working out for you"},{"version_id":"813464780","version_name":"2.2","version_date":"2015-09-16 01:16:43.000 +0800","version_description":"iOS Reminders integration<br><br>• Auto import iOS Reminders (requires 2.0 upgrade)<br>• Access your iOS Reminders alongside your Due reminders from the side menu for easy importing<br><br>Slide Over &amp; Split View Support on iOS 9"},{"version_id":"816589540","version_name":"2.3","version_date":"2016-03-03 13:40:09.000 +0800","version_description":"What's New<br><br>• Adds two more Notification Snooze options (useful on Apple Watch and Alerts-based notifications)<br>• Quick Actions with 3D Touch on iPhone 6s<br><br>Bug fixes<br><br>• Snoozing or marking reminders complete from notification may sometimes fail to work<br>• Rescheduling, completing or deleting reminders on Apple Watch may sometimes fail to work<br>• Now prompts to refresh App Store receipt if it goes missing<br>• Shortened Spanish translation for 'in N time' (thanks @_blopa_)"},{"version_id":"818616832","version_name":"2.3.2","version_date":"2016-08-26 01:23:02.000 +0800","version_description":"WHAT'S NEW<br><br>• Improved performance under iOS 10<br>• Local Backups in Due &gt; Settings<br>• Swapped notification actions for Stop/Restart for Timers with auto snooze<br><br>BUG FIXES<br><br>• Recurrence label in reminder editor may sometimes be set in system font"},{"version_id":"819222013","version_name":"2.4","version_date":"2016-10-10 23:23:34.000 +0800","version_description":"IMPORTANT<br>There is a bug in 2.4 that can cause Due to crash on launch. There is a workaround: http://www.dueapp.com/due24crash<br><br>A fix has been submitted to Apple for review and an expedited review requested. Sorry for the inconvenience.<br><br>WHAT’S NEW<br>• Significantly improves performance and reliability under iOS 10<br>• Introduces ‘Repeat At Least’ and ‘Repeat Indefinitely’ settings for Auto Snooze under iOS 10<br><br>BUG FIXES<br>• Auto snooze and Repeat options were truncated on iPad in iOS 10<br>• Insert Contact was crashing Due under iOS 10<br><br>AUTO SNOOZE IN iOS 10<br><br>This update significantly improves performance and reliability by adopting the new notifications technology in iOS 10.<br><br>However, this technology cannot auto snooze indefinitely when reminders are created (or before they become overdue).<br><br>To address this, Due will auto snooze each item 5 times by default. Whenever you launch Due or act on any of its notifications, Due can then auto snooze any overdue items indefinitely.<br><br>For example, a reminder with 10-minute auto snooze that fires at 8:00 AM will repeat its notification for five more times until 8:50 AM. Until you launch Due or act on any of its notifications, you will receive no further notifications for this reminder."},{"version_id":"819249496","version_name":"2.4.1","version_date":"2016-10-11 16:34:05.000 +0800","version_description":"WHAT’S NEW<br>• Significantly improves performance and reliability under iOS 10<br>• Introduces ‘Repeat At Least’ and ‘Repeat Indefinitely’ settings for Auto Snooze under iOS 10<br><br>BUG FIXES<br>• Crash on launch and exit when Badges is set to Today + Overdue on iOS 10<br>• Auto snooze and Repeat options were truncated on iPad in iOS 10<br>• Insert Contact was crashing Due under iOS 10<br><br>NOT GETTING CUSTOM ALERT SOUND ON iOS 10?<br>This is an iOS 10 bug that affects apps that have been updated from the App Store. Please restart your iOS device to resolve the issue.<br><br>AUTO SNOOZE IN iOS 10<br><br>This update significantly improves performance and reliability by adopting the new notifications technology in iOS 10.<br><br>However, this technology cannot auto snooze indefinitely when reminders are created (or before they become overdue).<br><br>To address this, Due will auto snooze each item 5 times by default. Whenever you launch Due or act on any of its notifications, Due can then auto snooze any overdue items indefinitely.<br><br>For example, a reminder with 10-minute auto snooze that fires at 8:00 AM will repeat its notification for five more times until 8:50 AM. Until you launch Due or act on any of its notifications, you will receive no further notifications for this reminder. Once you launch Due or act on any notifications from Due, Due will then be able to auto snooze any overdue items indefinitely."},{"version_id":"819981721","version_name":"2.4.2","version_date":"2016-12-07 07:18:54.000 +0800","version_description":"BUG FIXES<br><br>• Reminders and timers play default iOS notification sound when Sound is disabled in Due &gt; Settings &gt; Alerts &amp; Badges (thanks Pam)<br>• Incorrect badge number with Today and Today + Overdue mode under certain conditions<br>• Visual glitch involving the Today section header when the last reminder due today becomes overdue"},{"version_id":"823089095","version_name":"2.5","version_date":"2017-08-03 07:18:26.000 +0800","version_description":"What's New in Due 2.5<br><br>• Improved syncing speed and reliability with new database format<br>• New watchOS 3 app with Complications<br>• Improved iCloud sync with CloudKit<br>• Background iCloud sync<br>• Updated Dropbox sync to version 2<br><br>Other Changes<br><br>• Reduces battery use when Auto Import is enabled<br>• Settings &gt; Auto Import now has a Background App Refresh Frequency setting, which now defaults to 1 hour<br>• Adding reminders on Apple Watch now offers Dictate/Scribble option along with some tips<br><br>Other Fixes<br><br>• Fixes bug that momentarily shows the 'You have no reminders…\" message on launch<br>• Fixes visual glitch with section header remaining on screen when section has disappeared<br>• Fixes crash when attempting to create calendar events<br>• Fixes bug where relative dates (in 30 minutes) weren't being parsed in supported languages (e.g. Chinese) on the Apple Watch"},{"version_id":"823256723","version_name":"2.5.1","version_date":"2017-08-11 02:26:23.000 +0800","version_description":"• Fixes bug where database does not load correctly in some versions of iOS<br>• Prevents accidental deletion of recurring reminders with a confirmation prompt<br><br>What's New in 2.5<br>• Improved syncing speed and reliability with new database format<br>• New watchOS 3 app with Complications<br>• Improved iCloud sync with CloudKit<br>• Background iCloud sync<br>• Updated Dropbox sync to version 2"},{"version_id":"823492808","version_name":"2.5.2","version_date":"2017-09-04 02:31:36.000 +0800","version_description":"• Fixes bug where editing the text of a reminder causes it to lose formatting<br><br>What's New in 2.5<br>• Improved syncing speed and reliability with new database format<br>• New watchOS 3 app with Complications<br>• Improved iCloud sync with CloudKit<br>• Background iCloud sync<br>• Updated Dropbox sync to version 2"},{"version_id":"823629559","version_name":"2.5.3","version_date":"2017-09-17 04:32:09.000 +0800","version_description":"Bug Fixes<br>• Notifications not firing correctly in some versions of iOS<br>• Clearing the text of a reminder or timer causes it to lose formatting in some versions of iOS<br><br>What's New in 2.5<br>• Improved syncing speed and reliability with new database format<br>• New watchOS 3 app with Complications<br>• Improved iCloud sync with CloudKit<br>• Background iCloud sync<br>• Updated Dropbox sync to version 2"},{"version_id":"824245991","version_name":"2.6","version_date":"2017-11-05 14:47:27.000 +0800","version_description":"• iPhone X compatibility<br>• Fixes bug where swiping to dismiss the editor can lock the interface"},{"version_id":"824425025","version_name":"2.6.1","version_date":"2017-11-16 15:08:44.000 +0800","version_description":"Fixes bugs where:<br>• Reminders created from search bar are wrongly modified on the next search attempt<br>• Search not working properly after creating a reminder from search<br>• Portions of search results underlapping the keyboard<br>• Reminders/Timers may sometimes not be scrolled to top on launch<br>• Visual glitches on iPhone X<br>• “Delete Imported Reminders” button not localized and styled correctly"},{"version_id":"828220260","version_name":"3.0","version_date":"2018-08-29 14:01:00.000 +0800","version_description":"I have exciting new features lined up for Due 3. Instead of keeping you waiting, I want to start 3.0 off with three new features, and to introduce more features in future updates.<br><br><br>THREE NEW THINGS FOR 3.0<br><br>1. Custom Snooze In Notification<br>It used to be just three preset snooze options. Now, you can snooze your reminders to any time using the familiar Quick Access Times, directly from within your notifications.<br><br>2. Pure Black Theme<br>You've heard how gorgeous pure black looks on the iPhone X display.  Now, you can have Due in pure black. And it looks awesome on the other iPhone and iPad too.<br><br>3. Haptic Feedback<br>Animations, sounds and now—subtle haptic feedback on supported iPhones. You'll get a better sense of what's happening as you interact with your reminders and timers.<br><br><br>UPGRADE NOW, LATER, OR NOT<br><br>Upgrade to unlock all 3.0 features, which also gives you access to all 2.x features and future 3.x features as they become available. Or, you can keep using Due without upgrading.<br><br><br>THANK YOU FOR 8 YEARS OF DUE<br><br>In a time where apps come and go, I've been incredibly fortunate to work on Due this long. I look forward to continuing to work and improve on Due for many years to come."},{"version_id":"828481913","version_name":"3.0.1","version_date":"2018-09-12 01:07:04.000 +0800","version_description":"• Notifications are now correctly localized<br><br>New in 3.0<br>• Custom snooze from notification<br>• Pure black theme<br>• Haptic feedback"},{"version_id":"828557771","version_name":"3.1","version_date":"2018-09-21 01:53:39.000 +0800","version_description":"• Support for more iPhone &amp; Apple Watch<br>• New complications<br><br>Bug Fixes<br><br>• Notifications no longer disappears after completing/snoozing a reminder<br>• Fixed various localization issues"},{"version_id":"828686643","version_name":"3.1.1","version_date":"2018-09-24 13:16:51.000 +0800","version_description":"• Fixed crash on watchOS 4 and earlier<br>• Complications now work correctly on pre-Series 4 Watch<br><br>3.1<br>• iPhone XS Max &amp; Watch Series 4 support<br>• New complications for Infograph watch faces<br>• Notifications no longer disappears after completing/snoozing a reminder<br>• Fixed various localization issues"},{"version_id":"829828642","version_name":"3.2","version_date":"2019-01-07 05:23:58.000 +0800","version_description":"Happy new year! This update further improves on the experience of custom snooze.<br><br>First, there's no need to tap on the \"Snooze…\" button to access your Quick Access Times; they now appear right within the notification.<br><br>Next, custom snooze on the Apple Watch should also be more reliable, giving you the list of Quick Access Times instead of the standard text replies.<br><br>There's also some improvement to URL schemes for the geeks out there. More to come!<br><br>What‘s New<br><br>• Interactive Custom Snooze<br>• Added ‘autosnooze’ parameter to /add URL action (thanks TJ Luoma)<br><br>Bug Fixes<br><br>• Quick Access Times not synced with Apple Watch (thanks Mike&nbsp;Verledens)<br>• Search via /search URL action fails to work (thanks Richard Anderson)"},{"version_id":"831454022","version_name":"3.3","version_date":"2019-05-28 16:21:06.000 +0800","version_description":"This update is all about Siri—you can now add reminders directly to Due using Siri on your iPhone. You can't do that on the Watch because of technical limitations—but, but, you get Siri Watch Face integration, which is my favorite new feature this update! There is also some nice enhancements. Sorry this took a while, this Siri thing turned out to be way more challenging than I had expected, especially with the number of languages Due supports.<br><br>Finally, Siri may have trouble recognizing “Due” in certain languages. If you experience this issue, drop me an email at support@dueapp.com. We may have to come up with some alternative names in your language to resolve the issue. Hope you like the update!<br><br>What's New<br>• Ask Siri to remind you on your iPhone<br>• Siri Watch Face support<br>• Clear all logged items easily<br>• Watch app now reveals the reminder/timer when launched from notification<br><br>Known Limitations<br>• Adding and finding reminders using Siri is not available on Apple Watch<br>• Reminders added with Siri may not immediately sync to other devices"},{"version_id":"831546898","version_name":"3.3.1","version_date":"2019-06-05 00:37:27.000 +0800","version_description":"Bug Fixes<br>• Reminders created with Siri did not have default auto snooze applied (thanks @robin_martinez)<br>• “Mark done” is not localized in French (thanks @Razvn)<br><br>Tip<br>If Siri has trouble understanding ‘Due’, deleting Reminders.app would make Due the default app to handle reminder requests from Siri. (thanks @paranoidpookie)<br><br>Your Reminders.app data remains safe and accessible to third-party apps. However, you won‘t be able to use Siri to add reminders on Apple Watch.<br><br>Like Due?<br>Please consider leaving a rating or review."},{"version_id":"832305586","version_name":"3.4","version_date":"2019-09-16 03:11:43.000 +0800","version_description":"• Keyboard shortcuts for iPad<br>• iOS 13 compatibility"},{"version_id":"833574570","version_name":"3.4.1","version_date":"2019-11-13 00:21:34.000 +0800","version_description":"• Improved support for Dark Appearance in iOS 13<br>• Fixed various visual glitches in iOS 13<br>• Fixed Siri interface not adapting to Dark Appearance<br>• Fixed bug in watchOS 6 where tapping on card in Siri watch face does not show the reminder<br>• Sync status now appears at the bottom for all devices in iOS 13<br>• Fixed crashes related to editing reminder during search (thanks Josh Newman)<br>• Fixed embarrassing typos in screenshots (thanks Jane McLaughlin)"},{"version_id":"833617484","version_name":"3.4.2","version_date":"2019-11-15 15:32:53.000 +0800","version_description":"• Fixed bug where notifications do not appear if Banner alerts are disabled in Notification Center<br><br>New in 3.4.1<br>• Improved support for Dark Appearance in iOS 13<br>• Fixed various visual glitches in iOS 13<br>• Fixed Siri interface not adapting to Dark Appearance<br>• Fixed bug in watchOS 6 where tapping on card in Siri watch face does not show the reminder<br>• Sync status now appears at the bottom for all devices in iOS 13<br>• Fixed crashes related to editing reminder during search (thanks Josh Newman)<br>• Fixed embarrassing typos in screenshots (thanks Jane McLaughlin)"},{"version_id":"833617484","version_name":"numbers will now be based on the year","version_date":"","version_description":""},{"version_id":"834378634","version_name":"20.1","version_date":"2020-01-23 02:22:40.000 +0800","version_description":"Happy New Year!<br><br>This is the update that fixes the bug where it is excruciating to select or revise text in the reminder editor. It’s all good now.<br><br>And no, you didn’t miss 17 updates to Due. Version numbers will now be based on the year, and so the first update of 2020 is 20.1.<br><br>Moving forward, each update would focus on one thing. The idea is to get it right, and to get it out fast.<br><br>Bug Fixes<br>• Fixed crash when deleting items with keyboard shortcuts<br>• Improved support when sharing reminders in iOS 13<br>• Fixed bug where it is difficult to select text or move the text insertion point when editing a reminder<br><br>Like Due?<br>Please consider leaving a rating or review."},{"version_id":"834632422","version_name":"20.2","version_date":"2020-02-07 17:05:56.000 +0800","version_description":"Bye Bye Bugs!<br><br>You should now be able to scroll and edit loooooong reminder text properly. Also fixes bugs where:<br><br>• Badge number was sometimes not updated after marking reminders complete.<br>• Overdue items were not made to auto snooze indefinitely whenever you clear a single notification from Due in the Lock Screen or Notification Center.<br>• Old notifications were sometimes not cleared from Notification Center when launching Due."},{"version_id":"834888458","version_name":"20.3","version_date":"2020-02-28 15:59:30.000 +0800","version_description":"Fixed a bug where a repeat-from-completion reminder may sometimes be rescheduled earlier than it should be. Much thanks to Nils&nbsp;Wieland for his help to track down the bug.<br><br>Also made changes to ensure that Due can continue to share a short URL when sharing reminders through Messages.app."},{"version_id":"835221784","version_name":"20.4","version_date":"2020-03-27 08:27:06.000 +0800","version_description":"Fixed a bug where requests to Siri can fail with “You cannot add a reminder to that list.”"},{"version_id":"835719343","version_name":"20.5","version_date":"2020-04-29 12:00:48.000 +0800","version_description":"Hey Siri, Shortcuts!<br>You can now personalize the phrase you say to Siri to create reminders in Due. Never mind that Siri has trouble understanding the word ‘Due’ anymore!<br><br>… and it’ll work on your Apple Watch too.<br>The shortcuts you create on your iPhone will also work on your Apple Watch and iPad."},{"version_id":"835759912","version_name":"20.6","version_date":"2020-04-30 16:25:33.000 +0800","version_description":"20.6: Fixed bug with incorrect Upgrade Pass status. Siri Shortcuts is now accessible to Upgrade Pass subscribers, as well as customers who had purchased Due on or after April 29, 2019. Sorry about the bug.<br><br>---<br><br>Hey Siri, Shortcuts!<br>You can now personalize the phrase you say to Siri to create reminders in Due. Never mind that Siri has trouble understanding the word ‘Due’ anymore!<br><br>… and it’ll work on your Apple Watch too.<br>The shortcuts you create on your iPhone will also work on your Apple Watch and iPad."},{"version_id":"835783975","version_name":"20.7","version_date":"2020-05-01 20:06:31.000 +0800","version_description":"20.7:<br>- Fixed the inability to create reminders based on a contact's birthday.<br>- Fixed another bug with incorrect Upgrade Pass status for certain users.<br><br>---<br><br>Hey Siri, Shortcuts!<br>You can now personalize the phrase you say to Siri to create reminders in Due. Never mind that Siri has trouble understanding the word ‘Due’ anymore!<br><br>… and it’ll work on your Apple Watch too.<br>The shortcuts you create on your iPhone will also work on your Apple Watch and iPad."},{"version_id":"837508455","version_name":"20.8","version_date":"2020-08-26 14:42:45.000 +0800","version_description":"Menu, please!<br>Pop-up menus are now everywhere! Touch and hold (or 3D Touch) on reminders, timers, Quick Access Times and due dates to reveal them.<br><br>Larger repeat intervals<br>The interval at which you can repeat a reminder at has increased from 30 to 999.<br><br>Light theme now uses light appearance keyboard in the editor."},{"version_id":"837814742","version_name":"20.9","version_date":"2020-09-16 17:34:36.000 +0800","version_description":"With widgets, you can now see at a glance what is overdue and what is due soon. The medium-sized widget also gives you shortcuts to jump right into adding and searching reminders, as well as viewing your timers. Stay on top of your reminders even without launching Due."},{"version_id":"837837948","version_name":"20.10","version_date":"2020-09-17 23:56:51.000 +0800","version_description":"With widgets, you can now see at a glance what is overdue and what is due soon. The medium-sized widget also gives you shortcuts to jump right into adding and searching reminders, as well as viewing your timers. Stay on top of your reminders even without launching Due.<br><br>---<br><br>20.10: Improved widget localization for Japanese, French and Polish."},{"version_id":"838212771","version_name":"20.11","version_date":"2020-10-15 02:51:04.000 +0800","version_description":"1. Tapping on the + button in the reminders search results in iOS 14 now correctly creates the reminder immediately, instead of presenting the editor with an uncreated reminder (thanks Matthew&nbsp;Weinberg!)<br>2. French translation for \"logged\" reminders now accurately reflects the logging functionality (thanks Vincent Fleuranceau!)<br>3. Adding and searching reminders with Siri in iOS 14 now properly displays the custom interface<br>4. Search with Siri now returns results in iOS 14<br>5. Portuguese translation for the Upgrade Pass cost/duration is now correct (thanks Murilo!)"},{"version_id":"838497346","version_name":"20.12","version_date":"2020-11-06 17:09:35.000 +0800","version_description":"Widgets can now be always dark, always light, or pure black.<br><br>You can now choose to use a different color theme for your widget, independent from the system appearance. A new pure black mode is now available as well."},{"version_id":"838559758","version_name":"21.0","version_date":"2021-01-13 02:49:59.000 +0800","version_description":"Share button in the reminder and timer editor now makes use of popup menus in iOS 14, allowing:<br>1. Faster access to actions such as Duplicate and Create Event.<br>2. Choice of fields to share (title, due date, add-to-Due link)."},{"version_id":"840117746","version_name":"21.1","version_date":"2021-01-21 00:35:27.000 +0800","version_description":"Improves reliability of badges."},{"version_id":"840506188","version_name":"21.2","version_date":"2021-02-16 23:55:06.000 +0800","version_description":"• Automatic theme switching. You can now choose to switch between light and dark themes automatically when the system appearance changes.<br>• Repeat-at-least setting for auto snooze now works as designed; it was previously repeating one less than what it was supposed to.<br>• Changing system text size no longer introduces a blank space between the first reminder and navigation bar (thanks Greg&nbsp;Mennie!)<br>• Reliability of badges and notifications are further improved."},{"version_id":"840947222","version_name":"21.3","version_date":"2021-03-19 14:33:43.000 +0800","version_description":"• You can now open a .duedb file directly in Due, allowing you to preview and restore it<br>• Backups can now be previewed before restoring<br>• Backups can now be shared via other apps and services instead of just by email<br>• Fixed bug where time left for reminders today may sometimes be incorrect on resuming (thanks Dave C.)<br>• Fixed visual glitch when configuring Notification Snooze in Settings (thanks Shane M. &amp; Daniel S.)<br>• Fixed typo in settings (thanks David B.)<br>• Watch app now properly refreshes the due date of reminders when resumed<br>• Watch app now correctly loads the database on first launch<br>• Watch complication now properly reloads if there are changes when backgrounded"},{"version_id":"841288445","version_name":"21.4","version_date":"2021-04-11 14:42:06.000 +0800","version_description":"• Date parser now detects and removes prepositions from detected dates (e.g. ‘at’, ‘on’) (in English, German, Chinese, Japanese, Italian &amp; Russian)<br>• Date parser no longer corrects ‘today’ to next year when current time is past noon<br>• Multi-finger system gestures (undo/redo/app switching) no longer cause multiple reminders to be swiped"}]