[{"version_id":"712012777","version_name":"3.0.2","version_date":"","version_description":""},{"version_id":"811742177","version_name":"3.6","version_date":"","version_description":""},{"version_id":"811861670","version_name":"3.6.2","version_date":"","version_description":""},{"version_id":"812678368","version_name":"4.1.2","version_date":"2015-07-02 10:42:18.000 +0800","version_description":"Thanks for using the CNBC app! We carefully read all of our app reviews and appreciate hearing from our users. This latest release includes some of the features you've been asking for, with more coming in the near future.<br> <br>- New navigation for quicker access to market data and key insights<br>- Resume the app from where you left off—on launch the app will now resume from the last page visited<br>- Add securities to your Watchlist directly from quote search<br>- Additional market data for Bonds<br>- Expanded Handoff support for Apple Watch<br>- CNBC PRO subscribers can now watch live CNBC TV from around the world<br>- Bug fixes and performance improvements<br> <br>We're invested in making the CNBC App the best app for investors.  We'd love to hear from you.  Tell us what you love, like and how the app can be improved by emailing cnbcllca2@mailmw.custhelp.com."},{"version_id":"816081322","version_name":"4.3","version_date":"2016-02-01 16:08:27.000 +0800","version_description":"Thanks for using the CNBC app! We carefully read all of our app reviews and appreciate hearing from our users. This latest release includes some of the features you've been asking for, with more coming in the near future.<br> <br>- Purchase a monthly or annual subscription to CNBC PRO via In-App Purchase<br>- Access your Watchlists on any iOS device and on your desktop<br>- Sign up for a CNBC account in the app  <br>- View next earnings date, next split date, split factor, ex div date, div amount, and other events data on a stock’s quote page<br>- View EBITDA (TTM) on quote pages<br>- Get the latest market data with CNBC Glance for Apple Watch<br>- Bug fixes and performance improvements<br> <br>We're invested in making the CNBC App the best app for investors. We'd love to hear from you. Tell us what you love, or how the app can be improved by emailing cnbcllca2@mailmw.custhelp.com."},{"version_id":"816539249","version_name":"4.3.1","version_date":"2016-03-03 21:05:34.000 +0800","version_description":"Thanks for using the CNBC app! We carefully read all of our app reviews and appreciate hearing from our users. This latest release includes some of the features you’ve been asking for, with more coming in the near future.<br><br>* More Latin American, European and Asian indexes in the Markets section<br>* Fixed issue where some devices saw a white screen after launching the app<br>* Fixed some app crash issues <br>* Fixed issue where quote page hi/low charts didn’t reflect the current price accurately<br>* Bug fixes and performance improvements"},{"version_id":"816646253","version_name":"4.3.1.12","version_date":"","version_description":""},{"version_id":"817453108","version_name":"4.3.3","version_date":"2016-05-23 16:05:19.000 +0800","version_description":"Thanks for using the CNBC app! We carefully read all of our app reviews and appreciate hearing from our users. This latest release includes some of the features you've been asking for, with more coming in the near future.<br><br>* Market Movers - We reintroduced the top and bottom movers for the DOW 30, NASDAQ 100 and S&amp;P 500 in the Markets section.<br>* News sections you visited are available offline – The app now caches news sections you have visited so you can access news articles while offline with the exception of videos, PRO articles and slideshows. Caching doesn’t apply to markets, Watchlists and other video sections.<br>* We fixed several scenarios that caused the app to crash.<br>* Bug fixes and performance improvements.<br><br>We're invested in making the CNBC App the best app for investors. We'd love to hear from you. Tell us what you love, like and how the app can be improved by emailing cnbcllca2@mailmw.custhelp.com."},{"version_id":"817564886","version_name":"4.3.4","version_date":"2016-07-05 13:21:22.000 +0800","version_description":"Thanks for using the CNBC App! We carefully read all of our app reviews and appreciate hearing from our users. This latest release includes some of the features you’ve been asking for, with more coming in the near future.<br> <br>- Added PRO Uncut, Kensho and PRO Live under More &gt; PRO<br>- Fixed Watchlist sort issues<br>- Fixed some bugs that caused the app to close down<br>- Fixed an issue with Returns data for Indexes that caused it to go to 4 decimals<br>- Fixed an issue with security names in Funds<br>- Performance improvements<br> <br>We’re invested in making the CNBC App the best app for investors. We’d love to hear from you. Tell us what you love, like and how we can improve the app by emailing cnbcllca2@mailmw.custhelp.com."},{"version_id":"818029392","version_name":"4.3.5","version_date":"2016-07-05 23:49:43.000 +0800","version_description":"Fixed a crash when you click on a Breaking News notification."},{"version_id":"818355118","version_name":"4.3.6","version_date":"2016-08-03 15:24:58.000 +0800","version_description":"Many people reported slow app performance so we addressed several issues that should help improve the app’s speed and performance. Please let us know if this version improves your experience by emailing CNBC Customer Care at cnbcllca2@mailmw.custhelp.com"},{"version_id":"818609825","version_name":"4.3.7","version_date":"2016-09-01 18:11:31.000 +0800","version_description":"Thanks for using the CNBC App! We carefully read all of our app reviews and appreciate hearing from our users. This latest release resolves a number of reported issues.<br><br>- Fixed sorting of securities in the Watchlist section<br>- Fixed an app crash that impacted some visitors in the Watch Live section<br>- Other bug fixes and performance improvements<br> <br>We’re invested in making the CNBC App the best app for investors. We’d love to hear from you. Tell us what you love, like and how we can improve the app by emailing customercare@cnbc.com."},{"version_id":"818894708","version_name":"4.3.8","version_date":"2016-09-14 01:13:44.000 +0800","version_description":"Thanks for using the CNBC App! We carefully read all of our app reviews and appreciate hearing from our users. This latest release improves app performance on iOS 10. We’re invested in making the CNBC App the best app for investors. We’d love to hear from you. Tell us what you love, like and how we can improve the app by emailing customercare@cnbc.com."},{"version_id":"818969296","version_name":"4.3.9","version_date":"2016-09-22 13:21:47.000 +0800","version_description":"Thanks for using the CNBC App! We carefully read all of our app reviews and appreciate hearing from our users. This latest release improves app performance on iOS 10. We’re invested in making the CNBC App the best app for investors. We’d love to hear from you. Tell us what you love, like and how we can improve the app by emailing customercare@cnbc.com."},{"version_id":"819528000","version_name":"4.3.10","version_date":"2016-10-31 20:24:11.000 +0800","version_description":"* Bookmark a video - the video will now be in the Bookmarks section rather than in Playlist<br>* In the interactive charts, we added infinite scrolling to view historical data - just keep swiping the charts to reveal more info<br>* In the interactive charts, press two fingers to get custom returns data<br>* Fixed bug where Apple Watch app would close when trying to open it from the dock in WatchOS 3<br>* For PRO Live stream, we fixed a bug where the U.S. stream wouldn't start right away<br>* Various bug fixes and performance improvements"},{"version_id":"820682312","version_name":"4.3.11","version_date":"2017-01-26 21:59:24.000 +0800","version_description":"We've made some updates based on your feedback and summarized them below.<br><br>• Watchlist News (news related to the stocks in your watchlists) is now available in Home. To find it, just tap on the drop down arrow next to Top News in the header and select Watchlist News.<br>• Market Movers now includes 10 movers instead of 5 for each index<br>• Fixed a bug where tapping on a push notification would send you to Home rather than the breaking news article<br>• Fixed a bug for PRO Live users where the U.S. live stream wouldn't play<br>• We removed the Playlist section (you can add videos to the Bookmarks section)<br>• Various other bug fixes and performance improvements<br><br>We always read your feedback so please keep it coming! You can submit feedback to our Customer Care team at customercare@cnbc.com."},{"version_id":"821293893","version_name":"4.4","version_date":"2017-03-20 13:17:49.000 +0800","version_description":"- User experience improvements throughout the app<br>- Fixed an issue that caused occasional audio overlap during video playback<br>- Other bug fixes and performance improvements<br><br>We always read your feedback so please keep it coming! You can submit feedback to our Customer Care team at customercare@cnbc.com."},{"version_id":"821437321","version_name":"4.4.1","version_date":"2017-03-24 19:40:56.000 +0800","version_description":"- Fixed issue with Bluetooth and Airplay connectivity - as a temporary measure, you'll need to use AirPlay Mirroring in the device's Control Panel to AirPlay<br>- Fixed issue where Watch app wouldn't open<br>- Other bug fixes and performance improvements<br><br>We always read your feedback so please keep it coming! You can submit feedback to our Customer Care team at customercare@cnbc.com."},{"version_id":"821545210","version_name":"4.5","version_date":"2017-05-16 16:10:30.000 +0800","version_description":"- We've updated the navigation to make it easier to find the sections you're looking for. In Home, Markets, and Videos, swipe left or right at the top of the screen to find more sections.<br>- Bug fixes and performance improvements.<br><br>We always read your feedback so please keep it coming! You can submit feedback to our Customer Care team at customercare@cnbc.com."},{"version_id":"822741298","version_name":"4.5.1","version_date":"2017-07-07 19:34:36.000 +0800","version_description":"- Open the app from CNBC.com links. Any link that can be viewed in-app will launch CNBC directly to the relevant page or section.<br>- Bug fixes and performance improvements.<br><br>We always read your feedback so please keep it coming! You can submit feedback to our Customer Care team at customercare@cnbc.com."},{"version_id":"823829212","version_name":"4.5.2","version_date":"2017-10-10 22:42:21.000 +0800","version_description":"- Various bug fixes and iOS 11 optimizations<br><br>We always read your feedback so please keep it coming! You can submit feedback to our Customer Care team at customercare@cnbc.com."},{"version_id":"823973761","version_name":"4.5.3","version_date":"2017-10-12 23:47:25.000 +0800","version_description":"- Various bug fixes and iOS 11 optimizations<br><br>We always read your feedback so please keep it coming! You can submit feedback to our Customer Care team at customercare@cnbc.com."},{"version_id":"824058379","version_name":"4.5.4","version_date":"2017-10-23 14:34:20.000 +0800","version_description":"- Various bug fixes and iOS 11 optimizations<br><br>We always read your feedback so please keep it coming! You can submit feedback to our Customer Care team at customercare@cnbc.com."},{"version_id":"824141895","version_name":"4.5.5","version_date":"2017-11-09 00:16:30.000 +0800","version_description":"- iPhone X bug fixes"},{"version_id":"824475416","version_name":"4.5.6","version_date":"2017-11-21 21:24:27.000 +0800","version_description":"- Various bug fixes and performance improvements"},{"version_id":"825199737","version_name":"4.6.0","version_date":"2017-12-20 22:57:19.000 +0800","version_description":"- iPhone X compatibility<br>- Bug fixes and performance improvements<br><br>We always read your feedback so please keep it coming! You can submit feedback to our Customer Care team at customercare@cnbc.com."},{"version_id":"825627821","version_name":"4.6.1","version_date":"2018-02-05 21:33:25.000 +0800","version_description":"- Added Cryptocurrencies in Markets<br>- Bug fixes and performance improvements<br><br>We always read your feedback so please keep it coming! You can submit feedback to our Customer Care team at customercare@cnbc.com."},{"version_id":"826323776","version_name":"4.6.2","version_date":"2018-03-22 22:01:32.000 +0800","version_description":"- Performance improvements<br><br>We always read your feedback so please keep it coming! You can submit feedback to our Customer Care team at customercare@cnbc.com."},{"version_id":"828538972","version_name":"5.0.0","version_date":"2018-11-20 15:06:38.000 +0800","version_description":"**NEW &amp; IMPROVED, REDESIGNED, MORE POWERFUL CNBC APP**<br><br>- Daily, Live TV Free Preview – Watch a daily free preview of CNBC's live TV stream<br>- Personalized News Alerts – Choose alerts by category: Technology, Economy and more<br>- Customizable News Section – Create your own customized news feed by selecting your favorite topics, and save stories for later<br>- \"For You\" News – Personalized recommendations based on your interests<br>- Quotes – More powerful interactive charts and quote data<br>- More Watchlists – Add up to 100 watchlists, each with up to 100 quotes<br>- iPad Multitasking with Picture in Picture - Watch CNBC TV while browsing other apps<br>- Enhanced Search – Search for companies and add them to your watchlist, or view news, all in one screen<br>- Podcasts &amp; CarPlay –  Listen to CNBC podcasts in the app and in the car with CarPlay<br><br>We look forward to your feedback about our latest update. You can submit feedback to our Customer Care team at customercare@cnbc.com."},{"version_id":"829380435","version_name":"5.0.1","version_date":"2018-11-29 17:08:52.000 +0800","version_description":"NEW, REDESIGNED, MORE POWERFUL CNBC APP<br><br>- Daily, Live TV Free Preview – Watch a daily free preview of CNBC's live TV stream<br>- Personalized News Alerts – Choose alerts by category: Technology, Economy and more<br>- Customizable News Section – Create your own customized news feed by selecting your favorite topics, and save stories for later<br>- \"For You\" News – Personalized recommendations based on your interests<br>- Quotes – More powerful interactive charts and quote data<br>- More Watchlists – Add up to 100 watchlists, each with up to 100 quotes<br>- iPad Multitasking with Picture in Picture - Watch CNBC TV while browsing other apps<br>- Enhanced Search – Search for companies and add them to your watchlist, or view news, all in one screen<br>- Podcasts &amp; CarPlay – Listen to CNBC podcasts in the app and in the car with CarPlay<br>- Redesigned look and feel, with performance improvements and bug fixes<br><br>We look forward to your feedback about our latest update. You can submit feedback to our Customer Care team at customercare@cnbc.com."},{"version_id":"829568235","version_name":"5.0.2","version_date":"2018-12-20 16:28:03.000 +0800","version_description":"* NEW: Listen Live to CNBC - in the app or in your car with CarPlay<br><br>REDESIGNED, MORE POWERFUL CNBC APP now also includes:<br>* Daily, Live TV Free Preview – Watch a daily free preview of CNBC's live TV stream<br>* Personalized News Alerts – Choose alerts by category: Technology, Economy and more<br>* Customizable News Section – Create your own customized news feed by selecting your favorite topics, and save stories for later<br>* \"For You\" News – Personalized recommendations based on your interests<br>* Quotes – More powerful interactive charts and quote data<br>* More Watchlists – Add up to 100 watchlists, each with up to 100 quotes<br>* iPad Multitasking with Picture in Picture - Watch CNBC TV while browsing other apps<br>* Enhanced Search – Search for companies and add them to your watchlist, or view news, all in one screen<br>* Podcasts &amp; CarPlay – Listen to CNBC podcasts, in the app or in the car with CarPlay<br>* Redesigned look and feel, with performance improvements and bug fixes<br><br>We look forward to your feedback about our latest update. You can submit feedback to our Customer Care team at customercare@cnbc.com."},{"version_id":"829732080","version_name":"5.0.3","version_date":"2019-01-22 17:34:59.000 +0800","version_description":"- Looking for Pre-Markets in News? Swipe backwards on the markets module to see the latest info<br>- Images too large? Try our new \"Condensed News\" mode in Settings<br>- Navigating News just got easier: after opening a section, swipe left or right to read other sections<br>- Quotes: added Extended Hours volume and more related news stories<br>- 3D Touch to preview articles and quotes<br>- VoiceOver accessibility improvements<br>- Performance and UX improvements, bug fixes and more<br><br>We look forward to your feedback about our latest update. You can submit feedback to our Customer Care team at customercare@cnbc.com."},{"version_id":"830049547","version_name":"5.0.4","version_date":"2019-03-25 15:07:11.000 +0800","version_description":"- Dynamic Type and bold text support across the app<br>- Improved schedule for News Markets Panels<br>- Twitter sharing is now easier than ever <br>- CarPlay audio now resumes from interruptions<br>- Performance improvements, bug fixes and more<br><br>We look forward to your feedback about our latest update. You can submit feedback to our Customer Care team at customercare@cnbc.com."},{"version_id":"830738740","version_name":"5.0.5","version_date":"2019-03-31 21:21:09.000 +0800","version_description":"- Don't want Dynamic Text for the CNBC app? You can disable it in our App settings<br>- Dynamic Type and bold text supported throughout the app<br>- Performance improvements<br><br>We welcome your feedback about our latest update. You can submit feedback to our Customer Care team at customercare@cnbc.com."},{"version_id":"830949412","version_name":"5.0.6","version_date":"2019-05-23 14:12:09.000 +0800","version_description":"- Markets/Watchlists tabs will now always remember the Market or Watchlist you last viewed<br>- Articles: Landscape orientation support for easier reading (iPhone)<br>- Quotes: open a company's website directly from it's quote view: see the company's \"contact information\" <br>- Live Audio has a Siri Shortcut<br>- Visual &amp; performance improvements<br><br>We welcome your feedback about our latest update. You can submit feedback to our Customer Care team at customercare@cnbc.com."},{"version_id":"831419258","version_name":"5.0.7","version_date":"2019-07-24 18:19:11.000 +0800","version_description":"- Quotes: now you can see a company's industry peers<br>- Quotes: added each security's open and previous close data to the Key Stats section<br>- We have more exciting changes coming soon, so keep updating the CNBC app for the latest features and improvements<br><br>We welcome your feedback about our latest update. You can submit feedback to our Customer Care team at customercare@cnbc.com."},{"version_id":"832174378","version_name":"5.0.8","version_date":"2019-09-06 16:36:31.000 +0800","version_description":"Performance improvements and bug fixes.<br><br>We have more exciting changes coming soon, so keep updating the CNBC app for the latest features and improvements.<br><br>We welcome your feedback about our latest update. You can submit feedback to our Customer Care team at customercare@cnbc.com."},{"version_id":"832684149","version_name":"5.0.9","version_date":"2019-10-02 14:04:38.000 +0800","version_description":"iOS 13 Dark Mode support <br>Sign up for our \"Earnings\" push notifications news channel for the latest earnings announcements news<br><br>We have more exciting changes coming soon, so keep updating the CNBC app for the latest features and improvements.<br><br>We welcome your feedback about our latest update. You can submit feedback to our Customer Care team at customercare@cnbc.com."},{"version_id":"833136849","version_name":"5.0.10","version_date":"2019-10-14 13:56:58.000 +0800","version_description":"iOS 13 Dark Mode support <br>Sign up for our \"Earnings\" push notifications news channel for the latest earnings announcements news<br>Performance improvements<br><br>We have more exciting changes coming soon, so keep updating the CNBC app for the latest features and improvements"},{"version_id":"833240868","version_name":"5.1.0","version_date":"2019-11-08 15:06:57.000 +0800","version_description":"Performance improvements<br><br>We have more exciting changes coming soon, so keep updating the CNBC app for the latest features and improvements."},{"version_id":"833535642","version_name":"5.2.0","version_date":"2019-11-14 18:44:26.000 +0800","version_description":"News in Your Watchlist - now you can quickly access news for each of your watchlists<br>Watch Live Alerts - never miss a big event with our new Live TV push channel<br>Performance improvements<br><br>We have more exciting changes coming soon, so keep updating the CNBC app for the latest features and improvements. We welcome your feedback about our latest update at customercare@cnbc.com."},{"version_id":"833695746","version_name":"5.2.1","version_date":"2019-11-25 20:58:30.000 +0800","version_description":"News in Your Watchlist: now you can quickly access news for each of your watchlists<br>Watch Live Alerts: never miss a big event with the new Live TV push alerts<br>Bug fixes &amp; performance improvements<br><br>We have more exciting changes coming soon, so keep updating the CNBC app for the latest features and improvements. We welcome your feedback about our latest update at customercare@cnbc.com."},{"version_id":"833843290","version_name":"5.3.0","version_date":"2019-12-17 20:45:31.000 +0800","version_description":"+ Watchlist Filters: control your watchlist like never before with news and data filters including extended hours movers, unusual volume, upcoming earnings announcements, 52 week high/low and more<br>+ New in Markets: new sections for Most Active, Unusual Volume, Sectors and Global Movers.&nbsp;And now you can quickly swipe to add stocks to your watchlist.<br>+ TV Alerts: never miss a big interview with our new CNBC TV alerts<br>+ Support for Context Menus<br><br>We have more exciting changes coming soon, so keep updating the CNBC app for the latest features and improvements. We welcome your feedback about our latest update at customercare@cnbc.com."},{"version_id":"834126306","version_name":"5.3.1","version_date":"2020-01-31 14:45:57.000 +0800","version_description":"+ Performance Improvements<br><br>We have more exciting changes coming soon, so keep updating the CNBC app for the latest features and improvements. We welcome your feedback about our latest update at customercare@cnbc.com."},{"version_id":"834553534","version_name":"5.4.0","version_date":"2020-03-02 16:02:32.000 +0800","version_description":"~ share and swipe between quotes (in watchlist, markets and search&nbsp;results - for select users)<br>~ easier access to PRO news and clips<br>~ bug fixes and performance improvements<br><br>We have more exciting changes coming soon, so keep updating the CNBC app for the latest features and improvements. We welcome your feedback about our latest update at customercare@cnbc.com."},{"version_id":"835014224","version_name":"5.5.0","version_date":"2020-04-14 14:47:23.000 +0800","version_description":"~ PRO Live stream selected by default for PRO users<br>~ Share symbols<br>~ Performance improvements<br><br>We have more exciting changes coming soon, so keep updating the CNBC app for the latest features and improvements. We welcome your feedback about our latest update at customercare@cnbc.com."},{"version_id":"835576286","version_name":"5.6.0","version_date":"2020-05-08 14:41:41.000 +0800","version_description":"~ Looking for Recently viewed stories? They're now available in search<br>~ The CNBC TV tab is now more intelligent, showing you more of the videos you want to see<br><br>We have more exciting changes coming soon, so keep updating the CNBC app for the latest features and improvements. We welcome your feedback about our latest update at customercare@cnbc.com."},{"version_id":"836042869","version_name":"5.7.0","version_date":"2020-06-08 18:36:02.000 +0800","version_description":"Bug fixes &amp; performance improvements<br><br>We have more exciting changes coming soon, so keep updating the CNBC app for the latest features and improvements. We welcome your feedback about our latest update at customercare@cnbc.com."},{"version_id":"836410607","version_name":"5.8.0","version_date":"2020-07-08 15:16:38.000 +0800","version_description":"Bug fixes &amp; performance improvements<br><br>We have more exciting changes coming soon, so keep updating the CNBC app for the latest features and improvements. We welcome your feedback about our latest update at customercare@cnbc.com."},{"version_id":"836983583","version_name":"5.9.0","version_date":"2020-08-03 15:08:06.000 +0800","version_description":"~ Check out CNBC's new live blogs in News<br>~ COVID-19 Index movers added to the Markets tab<br>~ Performance improvements and bug fixes<br><br>We welcome your feedback about our latest update at customercare@cnbc.com"},{"version_id":"837207543","version_name":"5.10.0","version_date":"2020-08-31 14:38:40.000 +0800","version_description":"~ Trending PRO stories section in news (PRO subscribers only)<br>~ Redesigned CNBC.com account views<br><br>We welcome your feedback about our latest update at customercare@cnbc.com."},{"version_id":"837588276","version_name":"5.11.0","version_date":"2020-09-28 15:04:35.000 +0800","version_description":"Keep updating the CNBC app for the latest features and improvements. We welcome your feedback about our latest update at customercare@cnbc.com.&nbsp;In this version:<br>~ Live TV sign in improvements<br>~ Newly designed subscriber paywall"},{"version_id":"838082040","version_name":"5.12.0","version_date":"2020-10-29 18:18:57.000 +0800","version_description":"~ U.S. elections coverage enhancements<br>~ Try our Politics breaking news push notifications<br>~ Performance improvements<br><br>We welcome your feedback about our latest update at customercare@cnbc.com."},{"version_id":"838459355","version_name":"5.13.0","version_date":"2020-11-24 14:36:12.000 +0800","version_description":"~ iPhone Picture in Picture support<br>~ PRO only: new “PRO Now” section in the News tab<br>~ Performance improvements<br><br>We welcome your feedback about our latest update at customercare@cnbc.com."},{"version_id":"839351683","version_name":"5.14.0","version_date":"2020-12-21 18:24:42.000 +0800","version_description":"We welcome your feedback about our latest update at customercare@cnbc.com."},{"version_id":"839930715","version_name":"5.15.0","version_date":"2021-01-19 15:16:22.000 +0800","version_description":"We welcome your feedback about our latest update at customercare@cnbc.com."},{"version_id":"840472256","version_name":"5.16.0","version_date":"2021-02-17 16:07:47.000 +0800","version_description":"We welcome your feedback about our latest update at customercare@cnbc.com."},{"version_id":"840817708","version_name":"5.17.0","version_date":"2021-03-15 17:36:49.000 +0800","version_description":"We welcome your feedback about our latest update at customercare@cnbc.com."},{"version_id":"841144609","version_name":"5.18.0","version_date":"2021-04-12 14:01:09.000 +0800","version_description":"We welcome your feedback about our latest update at customercare@cnbc.com."}]