[{"version_id":"815537442","version_name":"4.2.7","version_date":"","version_description":""},{"version_id":"816042980","version_name":"4.2.8","version_date":"","version_description":""},{"version_id":"816400590","version_name":"4.2.9","version_date":"","version_description":""},{"version_id":"816483955","version_name":"4.2.10","version_date":"","version_description":""},{"version_id":"816619589","version_name":"4.2.11","version_date":"","version_description":""},{"version_id":"817974987","version_name":"5.0.1","version_date":"","version_description":""},{"version_id":"818128683","version_name":"5.0.3","version_date":"","version_description":""},{"version_id":"818190733","version_name":"5.0.4","version_date":"","version_description":""},{"version_id":"819036648","version_name":"5.0.10","version_date":"2016-09-26 21:19:07.000 +0800","version_description":"- Updated the Multiple Recording Buttons to play the correct recording when more than one local recording is attached to a song.\n\n- Fixed a crash when playing the second recording attached to a song, then the first recording, when the Play First Two Recordings Together setting is on.\n\n- Fixed the in-app recording function when the Continue Audio When Changing Songs setting is on and a recording hasn't been played yet.\n\n- Updated the Next Screen or Song and Previous Screen or Song remote control actions to change songs immediately when used on a song that contains chords but no lyrics.\n\n- Updated the show view to remember the last-used layout for split screen sizes, so you can change between split screen modes on compatible iPads and the selected layout will change automatically.\n\n- Updated the song list to scroll the selected song to the top rather than the middle when changing songs with a swipe or a remote control action, to maximize the number of upcoming songs visible in short lists.\n\n- Closed a note popup when changing to another app to avoid problems closing it when returning to this app.\n\n- Fixed the page resizing when connecting an external keyboard or foot switch while the on-screen keyboard is showing.\n\n- Fixed the page sizing and layout matching on an iPhone when a larger status bar is showing.\n\n- Fixed the sizing of song lists in default layouts on smaller phones with a split-level navigation bar.\n\n- Disabled the top toolbar buttons when viewing any of the pages associated with those buttons.\n\n- Removed the leftover Done button from the top toolbar on a phone after entering text and using the Continue button.\n\n- Updated the edit pages to reselect the current item in the list column after triggering an invalid data alert.\n\n- Fixed a problem that copied the formatting of the last character to the entire text when resizing the text.\n\n- Stopped applying chord formatting to notes text when resizing it.\n\n- Fixed the selected song highlight color, which was changed to pink on some devices in iOS 10.\n\n- Fixed the Word Document Colors: Inverted option to work with .docx file extensions.\n\n- Showed an activity indicator when using the Send Troubleshooting Info and Send Screen Shot functions."},{"version_id":"820385133","version_name":"5.1","version_date":"2017-01-04 16:22:36.000 +0800","version_description":"- Added a popup menu to the title on the set list view page to jump to another set list without leaving the set list view.\n\n- Added + buttons in all the picker windows, so you can now add a new child item without leaving the parent page. For example, you can add a new song from the set list edit page or add a new MIDI preset from the song edit page.\n\n- Updated the default layouts with clearer names. The new names will appear on new devices, or on existing devices if you tap Help > Utilities > Rename Default Layouts.\n\n- Added a popup to the sync button in the top toolbar to provide quick access to some sync functions and a display of the current sync status.\n\n- Added a new song import option to the top of the Songs list. You can now select \"Documents (batch)\" to create a new song for every document that is not already attached to a song. This means you can copy a batch of documents into the app using iTunes File Sharing or \"Open in...\" from another app, then quickly create a song for each of them.\n\n- Updated the document viewer to display the contents of attached .txt files as if they're saved in the built-in lyrics field. This means your text will adopt the app color theme, and you can change the font size, set a chord color and transpose the chords, but you cannot edit the text inside the app.\n\n- Updated the permissions to allow Read Only users to add and edit layouts. \n\n- Added an options button to background boxes in layouts, allowing you to set a color for the box.\n\n- Added Low Latency Recordings and Low Latency Tempos settings to the Settings > Audio & MIDI page. With these settings turned on, recordings and tempos should start playing faster, and the recording and tempo buttons will be activated with a touch down instead of a touch up action. The disadvantages of these settings are decreased battery life and an inability to use long press gesture on the recording button without starting playback.\n\n- Added all the timing fields as possible items in the main area of a layout, in addition to the bottom toolbar. Unlike most layout items, these fields will remain on the screen while viewing a break or pause so you can check your timing during breaks.\n\n- Added a Speak Lyrics button to the document tools menu and a Speak Lyrics song selection action, to preview song lyrics with your device's text-to-speech functionality.\n\n- Added a Speak Title song selection action, to announce the title of each song as you select them, and a Speech Output Channel setting on the Settings > Audio & MIDI page, to route the speech to a specific audio channel.\n\n- Added an option to take a photo within the app and attach it to a song. You can use this to quickly import hard copies of sheet music or lyric sheets.\n\n- Dropped support for iOS 7.\n\n...plus more updates and bug fixes. See the Release Notes page on the Set List Maker website for a complete list."},{"version_id":"820430970","version_name":"5.1.1","version_date":"2017-01-06 17:43:44.000 +0800","version_description":"Disabled installation on iOS 7 devices. Set List Maker now requires iOS 8 or newer."},{"version_id":"820496560","version_name":"5.1.2","version_date":"2017-01-11 20:58:26.000 +0800","version_description":"- Fixed incomplete contents on the show share page on newer devices.\n\n- Added compatibility with Apple's latest security policy, which was blocking device linking on iOS 9.\n\n- Updated the MIDI Beat Clock function to be more consistent.\n\n- Fixed a problem that prevented adding the first MIDI device.\n\n- Updated the document viewer to always fit large photos to the width of small screens.\n\n- Added a Reset Sync ID button to the Help > Utilities page, to generate a new sync ID after restoring app data to a different device."},{"version_id":"820551613","version_name":"5.1.3","version_date":"2017-01-16 17:12:27.000 +0800","version_description":"- Fixed the display of photos when switching to full-screen or fit-height modes."},{"version_id":"820655457","version_name":"5.1.4","version_date":"2017-01-25 16:03:20.000 +0800","version_description":"- Returned to the pre-iOS 10 set list rendering code and restored the Use Alternate Page Rendering utility for iPad Pro and iPhone 7 devices.\n\n- Reverted a change to the MIDI beat clock function that made the clock more accurate but was tracked incorrectly by some devices.\n\n- Fixed incorrect tempo clicks when starting a new tempo wtihout stopping the previous one when the Continue Audio When Changing Songs setting is on.\n\n- Updated the copying of a MIDI preset to another database to connect program changes with devices in the target database that have the same name. \n\n- Updated the song import from documents function to add songs for ChordPro and OnSong documents."},{"version_id":"820914679","version_name":"5.1.5","version_date":"2017-02-13 19:08:06.000 +0800","version_description":"- Adjusted the sequence of remote control actions so you can open a full-screen document and start auto-scrolling from the same message.\n\n- Reset the auto-scroll state when reselecting a song. \n\n- Updated the recording controls to correctly change the recording position when clicking the rewind button or moving the progress slider while the recording is paused.\n\n- Updated the chord transposing and coloring functions to correctly handle the Portuguese word E.\n\n- Added a crossfade animation when showing or hiding the song list in the show view.\n\n- Fixed a problem in edit popup windows on phones where the Save button became unavailable.\n\n- Stopped reloading the layout when switching to another app and back.\n\n- Fixed a problem that caused the app to crash when moving to the background in iOS 8."},{"version_id":"820993722","version_name":"5.1.6","version_date":"2017-02-17 18:18:10.000 +0800","version_description":"- Stopped the document viewer from resetting its scroll position when switching between apps from the set list view.\n\n- Stopped the second recording from restarting at the end of a longer first recording when playing two recordings together.\n\n- Updated the MIDI engine to ignore incoming MIDI Active Sense messages.\n\n- Prevented trying to send spoken text to a multi-route audio channel on iOS versions less than 10."},{"version_id":"821202474","version_name":"5.1.7","version_date":"2017-03-06 23:29:24.000 +0800","version_description":"- Stopped the document viewer from shifting its scroll position when switching between apps from a full-screen display in the show view.\n\n- Stopped showing \"-\" in the Recordings list for iTunes recordings that have an empty album or artist, and stopped showing \"(null)\" in the Recordings list for local recordings whose files have been deleted.\n\n- Updated the More button in the show view to only include buttons that are active for the current song.\n\n- Fixed a problem that could show set names and pause names in the Add Songs list."},{"version_id":"821624342","version_name":"5.1.8","version_date":"2017-04-05 22:23:40.000 +0800","version_description":"- Updated the syncing system to run more efficiently and reduce duplicate entries.\n\n- Stopped the font from temporarily resetting to the default system font when pasting into the Lyrics or Chords fields.\n\n- Fixed duplicate entries when attaching a MIDI preset to another MIDI preset.\n\n- Tweaked the positioning of subheadings when reverse-sorting a list.\n\n- Updated the auto-scroll function to work consistently with JPEG documents.\n\n- Fixed a crash when playing a slow tempo with a downbeat sound.\n\n- Updated the audio engine to not reset the inter-app audio channel for Recording 2 when playing a song with only one recording."},{"version_id":"821742636","version_name":"5.1.9","version_date":"2017-04-14 01:14:32.000 +0800","version_description":"- Fixed an incorrect 211 error when syncing a new database for the first time.\n\n- Fixed a problem with new changes not syncing between devices.\n\n- Fixed incorrect calculations of set list durations since last month's syncing update."},{"version_id":"821960071","version_name":"5.1.10","version_date":"2017-05-01 17:48:51.000 +0800","version_description":"- Updated the device linking functions to use a more efficient networking method. This discovers other devices more quickly, and can optionally work without a wi-fi router if using only iOS devices. If you install this app version on one of your devices, you should install it on all your devices to take advantage of the new method. If you cannot update some devices, or want to continue using the old method, you can turn on Help > Utiltities > Use Old Peer Networking to revert to the old method. You cannot use a mixture of the old and new methods on different devices.\n\n- Fixed a crash when playing a slow tempo with a downbeat sound.\n\n- Fixed a problem that made the on-screen keyboard behave incorrectly when editing a song from the show view with keyboard remote control activated.\n\n- Fixed a missing Added date when copying a song."},{"version_id":"822043631","version_name":"5.1.11","version_date":"2017-05-08 17:48:52.000 +0800","version_description":"- Reworked the set list share function to generate native PDF files that have higher resolution, smaller file size, automatic page breaks and contents that can be copied and pasted.\n\n- Fixed a crash when a device linking slave connects directly (without a wi-fi router).\n\n- Added the date performed or frequency performed values to the list when sorting songs by those values.\n\n- Added a secondary sort by name when sorting songs by date performed or date added."},{"version_id":"822199878","version_name":"5.1.12","version_date":"2017-05-19 11:18:05.000 +0800","version_description":"- Fixed the Titles Only, One Column Per Set option on the show share page for shows that only contain one set.\n\n- Updated the automation track editing window to show the names of selected recordings, documents, MIDI presets and apps.\n\n- Restored missing headings when sharing a smart list sorted by a custom field.\n\n- Fixed incorrect sorting of smart lists sorted by the number of documents or number of recordings.\n\n- Removed an underline from between ChordPro-formatted chords when the first line of the lyrics is underlined."},{"version_id":"822286455","version_name":"5.1.13","version_date":"2017-05-26 01:13:18.000 +0800","version_description":"- Fixed a crash on older devices acting as slaves for device linking.\n\n- Fixed a problem with device linking slaves not receiving some messages.\n\n- Updated the auto-scrolling to be smoother when displayed only the document viewer on an external screen."},{"version_id":"822589430","version_name":"5.1.14","version_date":"2017-06-19 06:09:44.000 +0800","version_description":"- Updated the MIDI preset import function to use the Numbering settings from your MIDI devices.\n\n- Restored the missing Notes buttons to the Shows list.\n\n- Fixed the sorting of the included shows list at the bottom of the song edit page.\n\n- Fixed a problem that unlinked lyrics from a song when syncing lyrics but not document links.\n\n- Fixed a problem that restarted a recording when reaching the end with Low-Latency Recordings turned on.\n\n- Fixed inconsistent Bluetooth connectivity after editing text annotations from the show view."},{"version_id":"822703504","version_name":"5.1.15","version_date":"2017-06-28 04:45:30.000 +0800","version_description":"- Restored the Sync Now and Auto-Sync buttons on the Settings > Database Sync page when first setting up syncing.\n\n- Adjusted the memory management to avoid crashes when device linking.\n\n- Limited the song list on the layout edit page to 100 songs to avoid performance problems on slow devices."},{"version_id":"822837781","version_name":"5.1.16","version_date":"2017-07-11 03:05:32.000 +0800","version_description":"- Added manual database export and import functions. This is an alternative to the database sync function, which will be phased out in early 2018. Please see the support forum for details."},{"version_id":"822875830","version_name":"5.1.17","version_date":"2017-07-13 06:33:33.000 +0800","version_description":"- Fixed a problem that caused crashes or data loss when launching.\n\n- Correctly registered lyrics and chords when importing from a batch file and then syncing to another platform."},{"version_id":"823195841","version_name":"5.1.18","version_date":"2017-08-07 22:55:03.000 +0800","version_description":"- Updated the layouts to follow the Send MIDI Presets Together setting even if the layout only contains the Multiple MIDI Buttons.\n\n- Updated the device linking icon to correctly show that a device linking connection has been broken after locking and unlocking the device.\n\n- Updated the AirTurn framework for compatibility with the latest PED firmware.\n\n- Hid the top toolbar when editing the options for a layout item on a phone in landscape orientation to avoid interfering with a picker's Select button."},{"version_id":"824247593","version_name":"5.2.1","version_date":"2017-11-03 03:33:35.000 +0800","version_description":"- Fixed a crash when enabling the Send MIDI layout action.\n\n- Updated the transpose buttons to remain non-interactive while editing a layout.\n\n- Improved the responsiveness of selecting and deselecting items in the layout editor."},{"version_id":"824322967","version_name":"5.2.2","version_date":"2017-11-09 01:33:42.000 +0800","version_description":"- Fixed a problem that made the Next Page and Previous Page actions behave erratically with multi-page documents.\n\n- Fixed a problem that prevented auto-scrolling from starting from the same action as opening the full-screen display when the lyrics are short.\n\n- Hid the marker buttons in the song list if the current document or lyrics has no markers.\n\n- Fixed a problem that partially hid sets of multiple buttons in a set list only layout.\n\n- Stopped the Next MIDI Preset remote control action from selecting the next song after the last preset.\n\n- Updated the Quick Add menu to indent smart copies of songs."},{"version_id":"824411598","version_name":"5.2.3","version_date":"2017-11-16 01:48:30.000 +0800","version_description":"- Added a Device Linking Status window from the linking button in the top toolbar to help troubleshoot device linking issues.\n\n- Added a Refresh Broadcasting button to the Device Linking Status window to restart the master broadcasting if it stops after a period of inactivity.\n\n- Updated the lyrics scrolling and paging functions to ignore markers in iOS 8-9 where they're not supported.\n\n- Stopped recording Scroll Document To Page actions in an automation track when toggling the full-screen display.\n\n- Stopped triggering a two-fingered tap action from a pinch gesture in the document viewer.\n\n- Fixed a crash when starting auto-scrolling from a song selection action after a delay between songs.\n\n- Stopped triggering song completion actions based on the song duration until the song has been selected the second time, if any song second selection actions are enabled. Also, stopped triggering song completion actions based on the song durationforthefirstsong in the show until the song has been explicitly selected.\n\n- Stopped triggering song completion actions when the app is in the background, unless they are triggered by a recording playing in the background.\n\n- Stopped including layouts with the database export/import functions. Existing layouts will be preserved on each device. If needed, you can still share individual layouts between devices with the layout export/import function.\n\n- Correctly colored and transposed chords that use the half-diminished symbol.\n\n- Updated numeric fields like Tempo to strip out any non-numeric characters.\n\n- Closed the on-screen keyboard when opening a popup window to avoid editing problems."},{"version_id":"824697679","version_name":"5.2.4","version_date":"2017-11-22 22:24:27.000 +0800","version_description":"- Updated the interface for iPhone X.\n\n- Exposed Set List Maker's local document directory to the Files app in iOS 11. This allows you to copy documents and recordings between Set List Maker and other apps using the new Files app. When copying a document or recording into Set List Maker for the first time, you will need to attach it to a song before you can use it. If you later copy a new version of a file into Set List Maker, you don't need to re-attach it.\n\n- Added Control Changes as a separate item in Settings > Audio & MIDI > MIDI Preset Order, and subjected it to the With Delay Between setting.\n\n- Fixed a crash when rearranging MIDI presets attached to a parent preset.\n\n- Fixed erratic tempo playback when starting a new tempo before stopping the previous tempo in iOS 11.\n\n- Fixed invisible buttons in the email window in iOS 11.\n\n- Fixed a crash when editing a layout that uses the Song Number and Restart Song Numbering Per Set options.\n\n- Improved the accuracy of the next page and previous page functions for documents.\n\n- Updated the annotations function to save when only the text in a text annotation was changed.\n\n- Stopped triggering the lyrics highlighting function when double-tapping the Chords field.\n\n- Stopped showing the database export confirmation message after clicking the Cancel button in the export popup."},{"version_id":"825043212","version_name":"5.2.5","version_date":"2017-11-30 03:55:34.000 +0800","version_description":"- Fixed a crash when sending in a file from another app.\n\n- Fixed a problem that stopped loading the first song's buttons when editing a layout.\n\n- Updated the interface for iPhone X.\n\n- Added Settings > Device Linking > Delay Song Selection Actions. If remote control messages appear on linked devices with a consistent delay, you can use this to synchronize the song selection actions on all the linked devices.\n\n- Added Help > Utilities > Filter Duplicate Key Messages to work around some Bluetooth foot switches that send duplicate messages.\n\n- Removed an unnecessary Done button from the Device Linking Status window on a phone.\n\n- Added the two-line top toolbar to the Sync Status window and the Bluetooth MIDI pickers on a phone.\n\n- Updated the default layouts to include a two-fingered tap gesture to toggle the song list for layouts that hide the song list."},{"version_id":"825328559","version_name":"5.2.6","version_date":"2017-12-16 01:38:40.000 +0800","version_description":"- Restored the ability to lay out multiple document, recording, MIDI or marker buttons vertically on a phone.\n\n- Updated the Next Page or Song remote control action to work correctly with markers, and updated the Next Screen or Song remote control acton to ignore markers.\n\n- Updated the database export and set list sharing functions for compatibility with iOS 11.\n\n- Updated the text color in the send email windows for compatibility with iOS 11.\n\n- Restored missing spacing between the bottom toolbar fields in the set list view in iOS 11.\n\n- Updated the layouts on an iPhone X to extend list views into the home button area.\n\n- Fixed a problem that could display the wrong dates before and after daylight saving time.\n\n- Fixed the Cancel button in the Select a Device window when opening from the Settings > Device Linking page.\n\n- Fixed a crash when exporting a database containing formatting from a very old app version."},{"version_id":"825549178","version_name":"5.2.7","version_date":"2018-01-09 01:01:45.000 +0800","version_description":"- Waited to start the search until you finish entering search text on the songs, documents and recording lists.\n\n- Updated the default document, recording and MIDI preset settings to use the last item if the setting is greater than the number of items.\n\n- Updated the automation track edit window to show subseconds in the event list and show times as minutes:seconds.subseconds when editing an item.\n\n- Fixed a crash that could occur when changing the selected fields on the set list share page.\n\n- Updated the break and pause timers to appear on an external screen even if the layout doesn't include a document viewer.\n\n- Fixed some situations where the document button in the show view displayed the wrong icon.\n\n- Fixed the bottom toolbar position in the sync status window on the iPhone X.\n\n- Renamed Settings > Appearance > Top Toolbar Buttons > Database Sync to Database Import/Export since the Import/Export function will replace the Sync function soon.\n\n- Removed the requirement to authorize a change to the sync name, to make it easier to switch to the new Database Import/Export function."},{"version_id":"825748884","version_name":"5.2.8","version_date":"2018-01-24 10:08:34.000 +0800","version_description":"- Changed Settings > Remote Control > Document Scroll Amount to use the visible height instead of the page height for consistency between documents and lyrics.\n\n- Fixed a problem in iOS 8-9 that made a full-screen document appear blank when reopening it after closing it with a two- or three- fingered tap gesture. \n\n- Enabled layout buttons that overlap the recording controls.\n\n- Enabled the left/right hotspots when viewing a document from the Songs list.\n\n- Adjusted the filtering to avoid adding duplicate events when overdubbing an automation track on a slower device.\n\n- Fixed a crash when editing a song from the show view when the auto-scroll duration and auto-scroll pre-roll are set to the same value.\n\n- Waited to start the search until you finish entering search text on the Add Songs and Quick Add Songs lists."},{"version_id":"825931878","version_name":"5.2.9","version_date":"2018-02-09 07:15:29.000 +0800","version_description":"- Fixed a problem that saved separate lyrics in smart copies when they should have inherited from the original copy.\n\n- Added the marker names to the Scroll Document to Page events in the automation track editing window when editing an automation track for a song that uses document or lyrics markers.\n\n- Added support for chord coloring and transposing for Major 7 chords written like C7M and extended chords written like C7(9).\n\n- Copied the contents of the Artist directive into the Artist field when importing a ChordPro file.\n\n- Preserved and added bold to the contents of the Comment directive when importing a ChordPro file.\n\n- Improved the performance of the set list view when the song list includes the song number buttons.\n\n- Updated the database import/export button in the top toolbar to always show the new import/export options instead of the old sync options even if a sync name is still entered.\n\n- After showing the sync shutdown alert four more times, turned off auto-sync."},{"version_id":"826089499","version_name":"5.2.10","version_date":"2018-02-27 00:49:23.000 +0800","version_description":"- Fixed a problem that made the recording controls unresponsive in the Songs list.\n\n- Updated Settings > Audio & MIDI > Receive MIDI In Background to enable background MIDI when using the MIDI Learn button on the MIDI preset edit page.\n\n- Added the current database name when importing a database file, to verify you're importing it into the desired database.\n\n- Added an alert when importing a database file with \"Open In\" when no database is selected.\n\n- Added a confirmation message after importing a database file with \"Open In.\"\n\n- Fixed incorrect formatting when adding text that looks like partial HTML tags into the Lyrics or Chords fields.\n\n- Updated the borders around popup menus to have consistent widths.\n\n- Fixed incorrect field sizing on edit pages when changing between different window sizes on a split-screen tablet.\n\n- Saved edits when changing between different window sizes on a split-screen tablet or rotating a phablet."},{"version_id":"826223972","version_name":"5.2.11","version_date":"2018-03-08 10:33:58.000 +0800","version_description":"- Fixed the import of a database file using \"open in\" from another app.\n\n- Updated the Export to BandHelper function to only include metadata for documents and recordings that are used in the exported database."},{"version_id":"826399552","version_name":"5.2.12","version_date":"2018-03-23 05:15:38.000 +0800","version_description":"- Fixed a problem that removed document annotations and document and recording settings when importing a database from a device that doesn't have the same databases as the target device."},{"version_id":"827480665","version_name":"5.3","version_date":"2018-06-11 07:30:45.000 +0800","version_description":"MAJOR NEW FEATURES\n\n- Added a function for sharing songs. From the show or smart list pages, you can now select either Share Set List to share the list as before, or select Share Songs to share all the songs in the list.\n\n- Added options for sharing set lists.\n\n- Added options for randomizing set lists.\n\n- Added options for playing Standard MIDI Files. (Requires iOS 9.)\n\n- Added support for Flic buttons.\n\nOTHER IMPROVEMENTS\n\n- Included annotations with emailed or printed documents when sent from the new song sharing page.\n\n- Moved the document email and export buttons to the document edit page,andaddedthe same buttons to the recording edit page.\n\n- Added separate email and export buttons to the layout edit page.\n\n- Added a manual save button to the bottom toolbar on edit pages.\n\n- Added Settings > Audio & MIDI > Fade Out Recordings. (Requires the Advanced Audio upgrade.)\n\n- Added skip forward and skip back buttons to the second row of the recording controls layout item.\n\n- Updated the play/pause button in the recording controls to play the recording from the new song after changing songs with Settings > Audio & MIDI > Continue Audio When Changing Songs.\n\n- Updated the next/previous buttons in the recording controls to update the Multiple Recording Buttons to show the current recording.\n\n- Organized the show list with undated shows in the first section, future shows in the second section and a submenu for each past year in the third section.\n\n- Added a color field to the show details edit page, to help organize shows.\n\n- Changed the shortcut menu that appears when clicking the title in the show view. Instead of showing a list of all shows when viewing a show or the list of all smart lists when viewing a smart list, the menu now shows a list of the five most recently viewed shows and the five most recently viewed smart lists.\n\n- Added a Preceding Break Duration setting to the Set Name edit page.\n\n- Added a Toolbar Buttons section to the layout Edit Details page, so you can hide toolbar buttons you aren't using, or show the bottom toolbar even if you haven't added any fields to it.\n\n- Added a layout edit button to the bottom toolbar of the set list view, for editing the current layout without leaving the set list view.\n\n- Updated the Multiple Document, Recording, MIDI, Marker and App Buttons layout items to have resizeable content.\n\n- Updated the Master Volume layout item to include separate volume sliders for recording, tempo, pitch and video. (Requires the Advanced Audio upgrade.)\n\n- Added a long-press gesture to the play/pause button of the recording controls to select a different recording.\n\n- Added a long-press gesture to the pitch button to select a different pitch.\n\n- Changed the button icons in song layouts to maintain their aspect ratio rather than stretching.\n\n- Made links in custom fields clickable in the show view.\n\n- Added a Multi-Line option for custom fields.\n\n- Added the Notes field as an option when sharing a set list.\n\n- Renamed the Bluetooth/USB Keyboard Status window to Remote Control Status, and added remote control activity from MIDI devices to its Activity Log.\n\n- Added a Clear Formatting button (X icon) to the formatting toolbar on the song edit page.\n\n- Added a Search for Chords button to the song edit page.\n\n- Updated the chord transpose functions to only transpose bracketed chords if any chords are bracketed.\n\nPlus more updates and bug fixes ... please see the Support > Release Notes page on the Set List Maker website for more details."},{"version_id":"827535313","version_name":"5.3.1","version_date":"2018-06-14 23:21:05.000 +0800","version_description":"- Fixed a problem that sometimes displayed lyrics with the wrong font.\n\n- Fixed a problem that played tempo downbeat sounds on the wrong beat.\n\n- Fixed erratic playback when starting a tempo without stopping the previous tempo. In this situation, the app now waits a half second for the audio buffers to reset before starting the new tempo.\n\n- Improved the sizing of multiple MIDI, recording, document, app and marker buttons when laid out horizontally.\n\n- Added the missing resize button to the Multiple App Buttons layout item.\n\n- Added the bottom toolbar buttons to newly created default layouts. \n\n- Disabled the share options for empty set lists."},{"version_id":"827697194","version_name":"5.3.2","version_date":"2018-06-29 01:24:59.000 +0800","version_description":"- Potentially fixed a problem that sometimes caused document and recording settings (including document annotations) to be deleted when updating the app version.\n\n- Fixed a problem that prevented databases exported from the iOS version from importing into other versions.\n\n- Added the new manual save button to the show Edit Songs page.\n\n- Added the lyric line highlights to the external display when showing only the lyrics on the external display."},{"version_id":"827889110","version_name":"5.3.3","version_date":"2018-07-17 02:55:23.000 +0800","version_description":"- Improved the spacing of multiple buttons laid out horizontally. \n\n- Added a Print button to the document edit page. You can only print PDF or JPG files from this page, and annotations will not be included.\n\n- Updated smart lists sorted by tags to sort secondarily by the tag names if the tag sort orders are the same.\n\n- Removed the check that prohibits adding multiple layouts with the same name.\n\n- Reset the elapsed time in the recording controls after changing songs while a recording is playing and then pausing the recording.\n\n- Fixed a crash when clicking the Random Song button in a show with only one song. \n\n- Updated the cursor color to match the app color theme.\n\n- Changed some important words in the German translation: tag = Schlagwört, break = Pause, pause = Einschub."},{"version_id":"828234612","version_name":"5.3.4","version_date":"2018-08-15 23:44:52.000 +0800","version_description":"Fixed a problem that corrupted SMF playback with data from the previously played file."},{"version_id":"828437685","version_name":"5.3.6","version_date":"2018-09-07 04:54:04.000 +0800","version_description":"- Fixed a crash when clicking the Quick Add button in the show view.\n\n- Fixed a crash when clicking the document button in a long Songs list after editing a song."},{"version_id":"828917124","version_name":"5.3.10","version_date":"2018-10-15 00:31:13.000 +0800","version_description":"- Updated the Edit Layout button in the show view to include a list of available layouts, which you can select to change layouts without leaving the show view. If your layouts don't include the Edit Layout button, you can add it from Layouts > [layout name] > Edit Details > Bottom Toolbar Buttons.\n\n- Set a default layout for both landscape and portrait when loading default layouts, so a layout is ready if you rotate your device in the show view.\n\n- Updated the interface and the default layouts for all iPhone X models. If you have already added the app on an iPhone X and have not customized your layouts, you can delete the iPhone X layouts and then click Help > Utilities > Load Default Layouts to reload them with the updated sizing.\n\n- Updated the auto-scrolling function so that if you manually scroll while the pre-roll is running, the auto-scroll movements will begin immediately. If Settings > General Settings > Auto-Scroll > Recalculate Speed If Overridden is on, the auto-scroll time will remain the same and the scroll speed will be reduced; if off, the auto-scroll time will be reduced and the scroll speed will remain the same.\n\n- Increased the precision of saved text sizes to avoid a slight shift when pinch-zooming and then saving a text size.\n\n- Fixed a problem that positioned the top toolbar incorrectly when rotating the device in the show view and share pages.\n\n- Improved the spacing around cell buttons."},{"version_id":"829079366","version_name":"5.3.12","version_date":"2018-10-29 08:48:25.000 +0800","version_description":"- Made the documents, recordings and MIDI presets listed on the song edit and MIDI preset edit pages clickable so you can edit attached items in a popup window. \n\n- Fixed a problem that scrolled the text down slightly when opening full-screen lyrics on iOS 12.\n\n- Fixed a problem that skipped the auto-scroll pre-roll when viewing a document with a saved zoom position.\n\n- Fixed a problem that displayed the keyboard and picker done buttons inconsistently on phones.\n\n- Improved the handling of items dragged outside the expected areas in the show songs edit page."},{"version_id":"829246930","version_name":"5.3.14","version_date":"2018-11-12 06:45:11.000 +0800","version_description":"- Added options to the automation buttons to copy and paste automation tracks between songs.\n\n- Updated the automation track edit window to select the last-played event if you stop an automation track before it finishes and then edit it.\n\n- Added disclosure indicators and indents to make the automation track edit window easier to read.\n\n- Added Settings > General Settings > Maps App to allow using Google Maps instead of Apple Maps for directions to a show address.\n\n- Updated the layering of layout items to allow placing the recording controls on top of the document viewer.\n\n- Fixed incorrect text colors in alerts in the dark color theme on iOS 9."},{"version_id":"829613636","version_name":"5.3.17","version_date":"2018-12-13 03:47:36.000 +0800","version_description":"- Added a default text size and default song fields for the show share pages in new databases.\n\n- Improved the spacing of columns on shared set lists."},{"version_id":"830312739","version_name":"5.3.21","version_date":"2019-02-18 06:29:34.000 +0800","version_description":"- Fixed the sorting by Last Performed and Frequency Performed in smart lists.\n\n- Fixed the sending of MIDI Song Select messages from layouts that contain only the set list.\n\n- Fixed a problem that prevented the on-screen keyboard appearing for an email message when remote control is enabled.\n\n- Added a .txt extension after the .db file extension for emailed database files, to prevent other apps from marking them as binary files that can't be imported."},{"version_id":"830404147","version_name":"5.3.22","version_date":"2019-02-27 03:00:53.000 +0800","version_description":"- Restored the 90% overlap when paging through lyrics with the hotspots or remote control.\n\n- Fixed a problem that disabled MIDI input in the show view when editing a MIDI preset in a popup."},{"version_id":"831533044","version_name":"6.0.1","version_date":"2019-06-04 01:52:42.000 +0800","version_description":"- Fixed a crash when viewing songs that were formatted with a very old version of the app.\n\n- Fixed a crash when exporting to BandHelper with songs that were formatted with a very old version of the app.\n\n- Fixed a problem when exporting databases that made them fail to import on other platforms.\n\n- Fixed a problem that prevented removing a link to a recording if it was saved in an incomplete state.\n\n- Fixed a problem that hid the Chords field after changing a layout to use centered lyrics.\n\n- Fixed a problem that removed the lyrics alignment when transposing in the show view."},{"version_id":"831778451","version_name":"6.0.2","version_date":"2019-06-27 02:08:33.000 +0800","version_description":"- Started adding a set of default smart lists to new databases, and added a Help > Utilities > Load Default Smart Lists button for existing databases.\n\n- Added the Quick Add button to smart lists, which provides a way to search for songs in a smart list. The Quick Add button will jump to the selected song if it's in the smart list, and will do nothing if the selected song is not in the smart list. \n\n- Fixed the label and alignment options on the Notes Viewer layout item, and removed the Color option since note colors can be set at the song level. \n\n- Fixed a problem that removed the lyrics alignment when transposing in the show view.\n\n- Removed an unwanted activity indicator that appears when transposing lyrics, then expanding them to full-screen, when the lyrics contain no formatting."},{"version_id":"832441823","version_name":"6.0.4","version_date":"2019-08-21 02:17:51.000 +0800","version_description":"- Fixed a problem that caused the tempo clicks to get out of sync when using a downbeat sound and starting a new tempo without stopping the previous tempo.\n\n- Updated the Add a MIDI File button on the MIDI preset edit page to default to the local directory, and to not require the Advanced Audio upgrade.\n\n- Automatically optimized links to recordings stored in iTunes if needed when viewing a song edit page."},{"version_id":"832606314","version_name":"6.0.5","version_date":"2019-09-03 07:21:19.000 +0800","version_description":"- Added Scroll Set List Up and Select and Scroll Set List Down and Select remote control actions to scroll the set list and select the song that then appears at the top of the list. This allows stepping through the song list in large and small increments (with the Next/Previous Song actions) without touching the device screen.\n\n- Added a landscape orientation option to the show share songs page. You can use this if your songs use landscape documents. If you use landscape orientation and some songs contain portrait documents, or vice versa, documents with the non-matching orientation will be rotated 90 degrees in the output.\n\n- Added an alert to the Add MIDI Presets button on the song edit page if you have not purchased the MIDI upgrade.\n\n- Updated the warning if you enter more than 14 lines of text into the Chords field to only appear once during a batch of song edits."},{"version_id":"833017582","version_name":"6.0.7","version_date":"2019-10-03 09:18:23.000 +0800","version_description":"- Added a default value for Settings > Appearance > Color Theme, to avoid an issue with layouts not appearing on iOS 13 if it is not set."},{"version_id":"835210081","version_name":"6.1.7","version_date":"2020-03-22 05:36:44.000 +0800","version_description":"- Fixed a problem that removed the color from text that was formatted with both color and underline.\n\n- Fixed a problem that sometimes made the lyrics text disappear when transposing in a two-column presentation.\n\n- Added the top toolbar buttons and set the correct text color in the top toolbar title on the Announcements page.\n\n- Fixed a crash when importing songs from a batch of documents.\n\n- Stopped creating duplicate songs when importing a ChordPro or OnSong file with the same name as an existing song.\n\n- Fixed a visual glitch with the Continue button on the new database page and some edit pages in macOS."},{"version_id":"838373025","version_name":"6.1.21","version_date":"2020-10-27 03:33:51.000 +0800","version_description":"- Added built-in support for second-generation Flic buttons. Instead of using the Flic app, you can now click Settings > Remote Control > Connect Second-Gen Flic Button, then click and hold the button until it connects. Then you can select an action, click Flic Button Messages and assign the action to the Click, Double-Click or Hold gesture. (Requires iOS 12 or later.)\n\n- Reduced the latency of the new MIDI beat clock code when Low-Latency Tempos is turned on."}]