[{"version_id":"813658667","version_name":"3.0","version_date":"2015-10-31 17:07:20.000 +0800","version_description":"Nowa aplikacja Citi Mobile® umożliwia zarządzanie codziennymi finansami, gdziekolwiek jesteś, o każdej porze. Przejrzysta i intuicyjna nawigacja zapewnia łatwy i wygodny dostęp do rachunku osobistego i karty kredytowej dla Klientów Citi Handlowy®. Sprawdź poniżej szczegóły i poznaj nowe funkcjonalności aplikacji.<br><br>New Citi Mobile® app helps you manage your everyday finances – any place, any time. Clear and intuitive interface provides easy and convenient access to your Citi Handlowy® personal account and credit card. Check below details and new features of the app."},{"version_id":"819981050","version_name":"3.1","version_date":"2016-12-10 07:51:29.000 +0800","version_description":"Nowa usługa powiadomień Citi Mobile (push) umożliwi Ci otrzymywanie informacji o wybranych aktywnościach, które zostaną zarejestrowane przez Bank na rachunku konta osobistego lub/i karty kredytowej np. obciążenia lub uznania konta. <br><br>New,  Citi Mobile® notifications (push) let you know of some of your personal or/and credit card account activities such as account credits or debits."},{"version_id":"823629335","version_name":"3.2","version_date":"2017-09-13 11:31:10.000 +0800","version_description":"Drobne poprawki<br>Większa stabilizacja aplikacji<br><br>Small improvements<br>Higher stabilization of the app"},{"version_id":"824209424","version_name":"3.3","version_date":"2017-11-06 09:55:57.000 +0800","version_description":"Co nowego: <br>•Drobne poprawki <br>•Wsparcie dla systemu iOS 11 <br><br>What’s new: <br>•Small improvements <br>•iOS 11 support"},{"version_id":"826049117","version_name":"3.5","version_date":"2018-03-12 08:22:03.000 +0800","version_description":"Co nowego:<br>-          Zmiany związane z nowym programem rabatowym <br>-          Drobne poprawki związane z bezpieczeństwem aplikacji<br><br>What’s new:<br>-          Changes related to new discount program<br>-          Small improvements increasing security of the application"},{"version_id":"830615094","version_name":"5.4","version_date":"2019-03-18 11:54:34.000 +0800","version_description":"CO NOWEGO:<br>Nowa odsłona aplikacji dla kart kredytowych: <br>- nowy interfejs do obsługi kart kredytowych i udoskonalona nawigacja,<br>- możliwość nadania i zmiany kodu PIN dla kart kredytowych,<br>- oferty i nagrody przygotowane specjalnie dla Ciebie,<br>- możliwość rozkładania na raty wybranej kwoty zadłużenia z wyciągu  lub transakcji powyżej 100 zł, zrealizowanych kartą kredytową,<br>- pożyczka z karty w szybkim procesie online,<br>- dostęp do wyciągów w formacie PDF za okres ostatnich 12 miesięcy.<br><br>WHAT'S NEW:<br>New version of the application for credit cards:<br>- a new interface for managing credit cards and improved navigation,<br>- the ability to set and change the PIN code for credit cards,<br>- offers prepared especially for you,<br>- the possibility of converting into installments the selected amount of debt from the statement or transactions above PLN 100, carried out with a credit card,<br>- a loan from card in a fast online process,<br>- access to PDF statements for the last 12 months"},{"version_id":"831677760","version_name":"6.1","version_date":"2019-07-01 08:28:48.000 +0800","version_description":"CO NOWEGO:\n<br>Uruchomiliśmy dla Ciebie najnowszą wersję aplikacji, którą zaktualizowaliśmy, wprowadzając drobne usprawnienia i poprawki, aby bankowość z nami była jeszcze łatwiejsza.\n<br>\n<br>WHAT'S NEW:\n<br>We have just launched the latest application update that introduces some small enhancements and corrections to provide you with the best mobile banking experience."},{"version_id":"832555096","version_name":"6.4","version_date":"2019-09-03 09:32:58.000 +0800","version_description":"CO NOWEGO:\n<br>Uruchomiliśmy dla Ciebie najnowszą wersję aplikacji, którą zaktualizowaliśmy, wprowadzając drobne usprawnienia i poprawki, aby bankowość z nami była jeszcze łatwiejsza.\n<br>\n<br>WHAT'S NEW:\n<br>We have just launched the latest application update that introduces some small enhancements and corrections to provide you with the best mobile banking experience."},{"version_id":"832772250","version_name":"7.0","version_date":"2019-09-14 12:21:02.000 +0800","version_description":"CO NOWEGO:<br>Uruchomiliśmy dla Ciebie najnowszą wersję aplikacji, którą zaktualizowaliśmy wprowadzając nowe funkcjonalności i poprawki, aby bankowość z nami była jeszcze łatwiejsza.  Nowe funkcje to m.in:<br>1. Citi Mobile Token - nowe narzędzie do bezpiecznej mobilnej autoryzacji.<br>2. Wygodna aktywacja karty w aplikacji – wystarczy kilka kliknięć.<br>3. Bezpieczny dostęp do finansów – aplikacja powiązana z Twoim urządzeniem mobilnym.<br>4. Wygodny dostęp do historii transakcji – dzięki ulepszonej wyszukiwarce i prostemu w obsłudze modułowi filtrowania. <br>5. Nowa szata graficzna - przejrzysty układ i intuicyjne poruszanie się po aplikacji.<br><br>WHAT'S NEW:<br>We have just launched the latest application update that introduces some new functionalities and corrections to provide you with the best mobile banking experience. New functionalities are:<br><br>1. Citi Mobile Token - a new tool for secure mobile authorization.<br>2. Convenient card activation in the application - just a few clicks.<br>3. Secure access to finance - the application paired with your mobile device.<br>4. Convenient access to transaction history - thanks to improved search engine and easy to use filtering module.<br>5. New graphic design - clear layout and intuitive navigation through the application."},{"version_id":"833293810","version_name":"7.2","version_date":"2019-10-28 14:20:23.000 +0800","version_description":"CO NOWEGO:\n<br>Uruchomiliśmy dla Ciebie najnowszą wersję aplikacji, którą zaktualizowaliśmy, wprowadzając drobne usprawnienia i poprawki, aby bankowość z nami była jeszcze łatwiejsza\n<br>\n<br>WHAT'S NEW:\n<br>We have just launched the latest application update that introduces some small enhancements and corrections to provide you with the best mobile banking experience."},{"version_id":"834266860","version_name":"7.3","version_date":"2020-01-13 07:56:20.000 +0800","version_description":"CO NOWEGO:\n<br>Uruchomiliśmy dla Ciebie zaktualizowaną wersję aplikacji mobilnej, wprowadzając drobne usprawnienia i poprawki związane z logowaniem.\n<br>\n<br>WHAT'S NEW:\n<br>We have just launched the updated version of our mobile application with some small enhancements and improved login process."},{"version_id":"835132939","version_name":"7.4","version_date":"2020-03-19 15:38:32.000 +0800","version_description":"CO NOWEGO:\n<br>Uruchomiliśmy dla Ciebie zaktualizowaną wersję aplikacji mobilnej, wprowadzając poprawki, aby bankowość z nami była jeszcze łatwiejsza. W najnowszej wersji usprawnienia dotyczą m.in. logowania przy użyciu biometrii oraz autoryzacji z wykorzystaniem Citi Mobile® Token.\n<br>\n<br>WHAT'S NEW:\n<br>We have just launched the updated version of our mobile application that introduces some small enhancements to provide you with the best mobile banking experience. In the latest version we optimized i.a. the logon process based on biometrics, as well as enhanced the Citi Mobile® Token mobile authorization."},{"version_id":"836165713","version_name":"7.7","version_date":"2020-06-01 01:37:01.000 +0800","version_description":"CO NOWEGO:\n<br>Uruchomiliśmy dla Ciebie zaktualizowaną wersję aplikacji mobilnej, wprowadzając poprawki, aby bankowość z nami była jeszcze łatwiejsza. W najnowszej wersji wprowadzamy usługę Citi Global Wallet, dzięki której system rozpozna walutę transakcji i automatycznie pobierze środki w konta odpowiadającego walucie transakcji.\n<br>\n<br>WHAT'S NEW:\n<br>We have just launched the updated version of our mobile application that introduces some small enhancements to provide you with the best mobile banking experience. In the latest version We are also introducing a new Citi Global Wallet service, thanks to which our system will recognize the currency of transaction and automatically match the account with currency."},{"version_id":"836712490","version_name":"7.8","version_date":"2020-07-15 08:48:09.000 +0800","version_description":"CO NOWEGO:\n<br>Uruchomiliśmy dla Ciebie zaktualizowaną wersję aplikacji mobilnej, wprowadzając poprawki, aby bankowość z nami była jeszcze łatwiejsza. W najnowszej wersji wprowadzamy możliwość Autoryzacji Mobilnej dla transakcji dokonywanych w Citibank® Online – teraz uwierzytelnisz operacje bankowe szybko i wygodnie klikając w powiadomienie z aplikacji i wprowadzając Citi Mobile Token PIN.\n<br>\n<br>WHAT'S NEW:\n<br>We have launched an updated version of the mobile application for you, making some corrections to make banking with us even easier. In the latest version, we introduce the option of Mobile Authorization for transactions made in Citibank® Online - now you will authenticate banking operations quickly and conveniently by clicking on the notification from the application and entering Citi Mobile Token PIN."},{"version_id":"837262269","version_name":"7.9","version_date":"2020-08-11 12:27:08.000 +0800","version_description":"CO NOWEGO:\n<br>Uruchomiliśmy zaktualizowaną wersję aplikacji mobilnej, wprowadzając poprawki, aby bankowość z nami była jeszcze łatwiejsza. W najnowszej wersji aplikacji przygotowaliśmy nową szatę graficzną, która sprawi, że bankowanie stanie się bardziej intuicyjne oraz uruchamiamy wygodne powiadomienia, dzięki którym nie zapomnisz o ważnych.\n<br>\n<br>WHAT'S NEW:\n<br>We have launched an updated version of the mobile application, making some corrections to make banking with us even easier. In the latest version, we introduce a new refreshed look that will make banking more intuitive and we launch convenient notifications so that you will not forget about important events."}]