[{"version_id":"277682655","version_name":"3.2.6","version_date":"","version_description":""},{"version_id":"586702754","version_name":"4.1.1","version_date":"","version_description":""},{"version_id":"589433031","version_name":"4.2","version_date":"","version_description":""},{"version_id":"610322641","version_name":"4.3.1","version_date":"","version_description":""},{"version_id":"613922723","version_name":"4.3.2","version_date":"","version_description":""},{"version_id":"621502765","version_name":"4.4","version_date":"","version_description":""},{"version_id":"643982985","version_name":"5.0","version_date":"","version_description":""},{"version_id":"652392856","version_name":"5.0.1","version_date":"","version_description":""},{"version_id":"691152662","version_name":"5.1","version_date":"","version_description":""},{"version_id":"811765066","version_name":"6.0","version_date":"","version_description":""},{"version_id":"811906382","version_name":"6.1","version_date":"","version_description":""},{"version_id":"812032034","version_name":"6.1.1","version_date":"","version_description":""},{"version_id":"812168370","version_name":"6.2","version_date":"","version_description":""},{"version_id":"812322317","version_name":"6.3","version_date":"","version_description":""},{"version_id":"812746284","version_name":"7.0","version_date":"","version_description":""},{"version_id":"812864603","version_name":"7.0.1","version_date":"","version_description":""},{"version_id":"813034239","version_name":"7.1","version_date":"","version_description":""},{"version_id":"813255604","version_name":"7.2.1","version_date":"","version_description":""},{"version_id":"813447739","version_name":"7.3","version_date":"","version_description":""},{"version_id":"814325374","version_name":"7.3.11","version_date":"","version_description":""},{"version_id":"815857693","version_name":"8.0","version_date":"","version_description":""},{"version_id":"816254443","version_name":"8.0.1","version_date":"","version_description":""},{"version_id":"816262634","version_name":"8.1.0","version_date":"","version_description":""},{"version_id":"816405266","version_name":"8.2.3","version_date":"","version_description":""},{"version_id":"816856222","version_name":"8.2.4","version_date":"","version_description":""},{"version_id":"816974581","version_name":"8.2.5","version_date":"","version_description":""},{"version_id":"817053167","version_name":"8.2.6","version_date":"","version_description":""},{"version_id":"817923735","version_name":"8.2.9","version_date":"","version_description":""},{"version_id":"818197556","version_name":"8.3.0","version_date":"","version_description":""},{"version_id":"818236698","version_name":"8.3.1","version_date":"","version_description":""},{"version_id":"818274492","version_name":"8.3.2","version_date":"","version_description":""},{"version_id":"818328733","version_name":"8.3.3","version_date":"","version_description":""},{"version_id":"818533855","version_name":"8.3.4","version_date":"","version_description":""},{"version_id":"818737726","version_name":"8.4.0","version_date":"","version_description":""},{"version_id":"818809802","version_name":"8.4.1","version_date":"","version_description":""},{"version_id":"818839509","version_name":"8.4.2","version_date":"2016-09-09 19:37:09.000 +0800","version_description":"Hello readers,\n\nIt’s with some emotion and teary-eyes that we are happy to announce you the arrival of a new member in TheFork family. After Brazil, Portugal, Sweden and more countries, the Netherlands are joining our big Brangelina family. Let’s enjoy gouda, tulips, coffee shops and Vikings!  Pack your things and prepare your next trip: the best Dutch restaurants are now available on your app.\nTo follow up with good news, let’s talk now about the review page, where the valiant customers who tested the restaurant you’re considering testify of their past experience. \nBecause we don’t always have the time to read the last 152 reviews to be sure of our choice, rates are getting more visible to give us the essential information quickly.\nSo, we do we have?\n1-The global rate. Pillar of reviews, mix of the cuisine, cadre and service rates, it’s the basic benchmark to evaluate the whole quality of the restaurant.\n\n2-Detailed rates: cuisine, cadre and service. Because you can enjoy a fabulous food in a greasy spoon, or be looking for a perfect service to impress your mother-in-law or a sumptuous cadre for a big proposal. Those detailed rates will help you to find the perfect restaurant according to your favorite criteria.\n\n3-The evaluation of the price-quality ratio, waiting time and sound level, as a bonus.\n\nThen, no changes, detailed comments and photos from the customers still there.\n\nLast but not least, let’s play tribute to Samumu, a talented developer who left us for new adventures, and did an amazing job on the Android App, making it maybe as good as the iOS one :)\nAs always, don’t forget the 5 stars!\n\nSee you!\n\nmobile@lafourchette.com"},{"version_id":"818845394","version_name":"8.5.0","version_date":"2016-09-13 15:00:36.000 +0800","version_description":"Dear Apple's fans,\n\nAs you may know, iOS 10 is coming this week with its bunch of new features, and among them, the opening of Apple's Apps to third party software editor. So good news! Now you can directly book TheFork's restaurants in Apple Maps! (Don't forget to come see us from time to time, we'll be very happy if ou do so). \n\nIf you didn't have the time to read the never-ending novel of last week, take a look at the rates and reviews of the restaurant page : a small redesign has been made, enhancing this specific H outline of mobile screens. \n\nMany thanks,\n\nmobile@lafourchette.com"},{"version_id":"818984266","version_name":"8.5.1","version_date":"2016-10-03 07:28:06.000 +0800","version_description":"Dear Apple's fans,\n\nAs you may know, iOS 10 is coming this week with its bunch of new features, and among them, the opening of Apple's Apps to third party software editor. So good news! Now you can directly book TheFork's restaurants in Apple Maps! (Don't forget to come see us from time to time, we'll be very happy if ou do so). \n\nIf you didn't have the time to read the never-ending novel of last week, take a look at the rates and reviews of the restaurant page : a small redesign has been made, enhancing this specific H outline of mobile screens. \n\nMany thanks,\n\nmobile@lafourchette.com"},{"version_id":"819192228","version_name":"8.5.2","version_date":"2016-10-13 09:32:06.000 +0800","version_description":"Dear Apple's fans,\n\nAs you may know, iOS 10 has been released recently with its bunch of new features, and among them, the opening of Apple's Apps to third party software editor. So good news! Now you can directly book TheFork's restaurants in Apple Maps! (Don't forget to come see us from time to time, we'll be very happy if ou do so). \n\nIf you didn't have the time to read the never-ending novel of last week, take a look at the rates and reviews of the restaurant page : a small redesign has been made, enhancing this specific H outline of mobile screens. \n\nMany thanks,\n\nmobile@lafourchette.com"},{"version_id":"819357663","version_name":"8.6.0","version_date":"2016-10-27 09:58:16.000 +0800","version_description":"“We are making this release essentially to fix some bugs”, T., Monday October 17th, 4pm, summarized in one concise and effective sentence all the news of today. \n\nYou should know that your comments have been read, understood and heard. The bugs and crashes fixing made a thunderous entry in our list of priorities and we let down other projects to do so. \n\nWe did the dusting in the corners, put in order different things in our app, vacuumed the carpet, I want to break free, oooh I want to break free, without the mustache*, even if Movember is not that far away, and the opening of the app should not encounter anymore issues. \n\nWe are still far away from the Alexandrine, however we put our heart and soul into it. \n\nRemarks, comments, suggestions: as usual, mobile@lafourchette.com \n\nCheers,\n\n*You got it right? Please type “I want to break free” in your favorite search engine and you won’t see the household the same way anymore."},{"version_id":"819738211","version_name":"8.7.1","version_date":"2016-11-22 10:29:22.000 +0800","version_description":"“We are making this release essentially to fix some bugs”, T., Monday October 17th, 4pm, summarized in one concise and effective sentence all the news of today. \n\nYou should know that your comments have been read, understood and heard. The bugs and crashes fixing made a thunderous entry in our list of priorities and we let down other projects to do so. \n\nWe did the dusting in the corners, put in order different things in our app, vacuumed the carpet, I want to break free, oooh I want to break free, without the mustache*, even if Movember is not that far away, and the opening of the app should not encounter anymore issues. \n\nWe are still far away from the Alexandrine, however we put our heart and soul into it. \n\nRemarks, comments, suggestions: as usual, mobile@lafourchette.com \n\nCheers,\n\n*You got it right? Please type “I want to break free” in your favorite search engine and you won’t see the household the same way anymore."},{"version_id":"819930746","version_name":"8.7.2","version_date":"2016-12-01 16:55:51.000 +0800","version_description":"Dear friends readers of the updates journal,\n\nA this time, you are maybe writing your little wish list for Christmas in order to avoid the eternal itchy sweater, the socks decorated with reindeers or any household gadget from your great-aunt -“but look, if you put a pineapple in it, it will cut it with the shape of a seahorse, it completely changed my life!” – gadget that will certainly finished covered by dust above your kitchen unit and will come to light again when you will move to another house. \n\nMaybe you noticed that, in particular during this time when listing your favorites things is a good relaxing activity, your own favorites in TheFork weren’t accessible since our last update. We fixed this bug and now the access to your favorites is possible again. We deeply apologize! \n\nFor the ones who never used this function, FYI you can saved your preferred restaurants and find them again in a matter of clicks in the menu. And it’s very handful (when it works). \n\nCheers,\n\nmobile@lafourchette.com"},{"version_id":"820165004","version_name":"8.7.4","version_date":"2016-12-19 06:08:17.000 +0800","version_description":"Dear readers of the updates journal,\n\nDecember is here. Cold has invaded the streets, Christmas trees are getting settled in the living rooms, chocolates are making their appearance on the tables: Christmas spirit is really here. For this celebration, please let us tell you a winter tale, one of the plentiful tales from the iOS kingdom, the kingdom of the applicative valleys. \n\nOnce upon a time, in the kingdom of the iOS applications, a verdurous valley, the Valley of TheFork. In this valley, everyone can book a restaurant, at any time, days and nights. The inhabitants, valiant travelers, wished to spread this possibility to the nearby valleys, to explore new applicative lands without retracing their steps to get food. \n\nIn this way, one fine day, the little elf developers built a bridge to the Valley of Apple Maps, also named “The Valley of Where are we now?” that allows everyone to book a table without going back to the Valley of TheFork. Everything went for the best, the troubadours nimbly announced the news to all comers. Although, one autumn day, the wind blew strongly, and crash! Bang! The bridge of the fragile code collapsed, leaving the travelers of the Valley of Apple Maps in the deepest disarray. \n\nIn this way, the following day of a way too alcoholic Christmas party, the little elf developers rolled up their sleeves to repair the bridge and the functionality. \n\nOur best Christmas wishes and Merry Christmas!\nmobile@lafourchette.com"},{"version_id":"820352183","version_name":"8.7.5","version_date":"2017-01-16 15:11:23.000 +0800","version_description":"Dear readers of the update journal,\n\nThis is our first update from 2017 so, we wish you all a Happy New Year and we hope that many good things will come to you, and of course, that you will have many foodie moments  with your beloved ones (thanks to us, of course)! \n\nNot much with that first update unfortunately… At least, not a lot that are visible for you! Indeed, this update is a first big step for us. We initialized some technical projects where we rebuild major parts of our app. As you may (or may not) know, in 2017 TheFork will celebrate its 10th birthday. As our company is getting older and older, our app is living the same journey. As a New Year’s resolution we are aiming at being as fit as possible! We are trying to stay young and healthy and for that, we are doing some workout (mostly with our brains) by moving our app to a new generation, technically speaking! \n\nThis project is a long-term journey for us and it starts now. Our next update will be major for us, as we will ship a version with big technical improvements. \nYou may wonder how we will measure our success. It is simple. If you do not experience any difference between this version and the next one, it means that we completed our mission. \n\nComments, remarks, love letters, New Year’s wishes: mobile@lafourchette.com"},{"version_id":"820873810","version_name":"9.0.0","version_date":"2017-02-28 19:06:13.000 +0800","version_description":"Dear readers of the update journal,\n\nWe hope that you all have a great Valentine’s Day. It is always a special moment for us as our mission is to help you to find the best table to complete this day of love (or sport if you are a big fan of soccer!). \n\nLast time we told you about our New Year’s resolution to get our app as fit as possible. And here we are. In this update, we have the first results of our brain workout. We worked hard to move our logic of how we display the restaurant results to a new system. It was hard, long, exhausting but it was worth it. Unfortunately we didn’t add some new features along with this exercise. However, if you experience any difference between this version and the previous one on how the restaurant results are shown to you, please please please contact us at mobile@lafourchette.com. \n\nIt stays between us, but we hope to not hear so much from you about that! Otherwise, it means that we did a poor job and it doesn’t sound good for our jobs… \n\nComments, remarks, love declaration, suggestions: mobile@lafourchette.com \n\nPS: we almost forgot to told you but some restaurant owners ask for a credit card imprint to secure some bookings (on special days for example) so we added a way for you to input your credit card information and secure your booking!"},{"version_id":"821160153","version_name":"9.0.1","version_date":"2017-03-03 18:13:14.000 +0800","version_description":"Dear readers of the update journal,\n\nLast time we told you about our New Year’s resolution to get our app as fit as possible. And here we are. In this update, we have the first results of our brain workout. We worked hard to move our logic of how we display the restaurant results to a new system. It was hard, long, exhausting but it was worth it. Unfortunately we didn’t add some new features along with this exercise. However, if you experience any difference between this version and the previous one on how the restaurant results are shown to you, please please please contact us at mobile@lafourchette.com. \n\nIt stays between us, but we hope to not hear so much from you about that! Otherwise, it means that we did a poor job and it doesn’t sound good for our jobs… \n\nComments, remarks, love declaration, suggestions: mobile@lafourchette.com \n\nPS: we almost forgot to told you but some restaurant owners ask for a credit card imprint to secure some bookings (on special days for example) so we added a way for you to input your credit card information and secure your booking!"},{"version_id":"821220982","version_name":"9.1.0","version_date":"2017-03-09 16:12:24.000 +0800","version_description":"Dear readers of the update journal,\n\nSometimes, when users, who never made a booking with the app, visit sections like ‘My bookings, ‘My reviews’, ‘My favorites’ and so one they see… nothing actually. White screen, monochrome void, disappointment.  \n\nSubject of today, limits and importance of minimalism, you have three hours.\n\nThe ones in favor will praise the refined lines, the seamless navigation, the importance of the utility, no embellishment and unnecessary details. \nThe ones against will tell you that by removing things, we won’t understand anything, by the way, what is the usage of this screen? \n\nWell, let’s be honest, we never discoursed on whether we should display things by default on the account’s screens or not. Let’s consider that as minimalism by omission. Far be it from us to create an app as bling bling as Mariah Carey’s outfit in the night of New Year’s Eve, we still decided to add some information on those white screens to explain what are the purposes of those sections and reduce the disappointment of our users.\n\nMany thanks for using our app. \n\nGot any suggestion? mobile@lafourchette.com"},{"version_id":"821352918","version_name":"9.2.0","version_date":"2017-03-22 16:52:40.000 +0800","version_description":"Dear readers of the update journal, \n\nFor once, let's go straight to the point: there is nothing visible this time, we worked on the core of the application. Starting from Monday next week (we hope), you will be able to experience in France and Spain two new filters, INSIDER and POP, to help you find the perfect restaurant for you! Don't hesitate to test them and give us your feedbacks! \n\nThe referral codes are popping in the reviews like daisy in wide gardens. Don't forget, you will make your mentee win 1000 yums and you will win 500 yums per mentee. Not more, not less, not 2000 yums, not 15€, just 500 yums per mentee. \n\nGreetings, love letters, comments, suggestions? mobile@lafourchette.com\n\nPS: since yesterday, it's Spring! We will have to stop talking about fat and melted cheese... Sadly. Let's observe one minute's silence."},{"version_id":"821556203","version_name":"9.3.0","version_date":"2017-04-05 07:41:54.000 +0800","version_description":"Dear readers of the update journal,\n\nNot lots of visual changes today, however we are working in some optimization to prepare great features! A little teasing our next big thing will happen on the homepage... \n\nIf you are a big fan of TheFork, don't hesitate to give us 5 stars in the store! \n\nThank you for your loyalty,\nmobile@lafourchette.com"},{"version_id":"821857173","version_name":"9.4.0","version_date":"2017-04-26 09:23:40.000 +0800","version_description":"Dear readers of the update journal,\n\nYou can't stand waiting forever? We completely got it!\nUnfortunately we can't do anything to reduce the waiting time when you go vote for your future president or reduce the time of the tv ads between your favorite show. However, we did our best to reduce as much as we could the waiting time to launch the app. In wifi, 4G, 3G or even 2G, if everything goes well, you shouldn't see our green screen during the loading time. \n\nIf you still have it, make sure you updated your app. And then, please tell us by email! \n\nIf you like the app, please give us 5 stars! :)\nmobile@lafourchette.com"},{"version_id":"821949182","version_name":"9.5.0","version_date":"2017-05-02 16:31:10.000 +0800","version_description":"Dear readers of the update journal,\n\nAs they said, ne'er cast a clout till May be out. So in May, we remove the loading screen at the launch of the application (you know the green one with the fork?), if everything goes as expected with our latest improvement, the loading time has been reduced and you shouldn't see this screen. \nIf you still want to see our beloved fork, you can always see it in our logo, next to the users rates, in some old placeholders, in the website... And for the green... you get it, it's visible in the whole app! \n\nMany cheers!\n\nmobile@lafourchette.com"},{"version_id":"822083797","version_name":"9.6.0","version_date":"2017-05-15 08:14:51.000 +0800","version_description":"Dear readers of the update journal,\n\nOne of the advantages of being a French company based in Paris, is that we have this year a lot of bank holidays, especially in May! \n\nBut it also means that we didn’t have much working days to work on outstanding features… Good things come to those who wait. We are currently working on the new homepage that will dazzle you (we hope so…). \n\nIn the mean time you can still give us 5 stars in the store! \n\nCheers,\nmobile@lafourchette.com"},{"version_id":"822155790","version_name":"9.6.1","version_date":"2017-05-15 21:37:40.000 +0800","version_description":"Dear readers of the update journal,\n\nOne of the advantages of being a French company based in Paris, is that we have this year a lot of bank holidays, especially in May! \n\nBut it also means that we didn’t have much working days to work on outstanding features… Good things come to those who wait. We are currently working on the new homepage that will dazzle you (we hope so…). \n\nIn the mean time you can still give us 5 stars in the store! \n\nCheers,\nmobile@lafourchette.com"},{"version_id":"822190352","version_name":"9.6.2","version_date":"2017-05-19 07:16:03.000 +0800","version_description":"Dear readers of the update journal,\n\nOne of the advantages of being a French company based in Paris, is that we have this year a lot of bank holidays, especially in May! \n\nBut it also means that we didn’t have much working days to work on outstanding features… Good things come to those who wait. We are currently working on the new homepage that will dazzle you (we hope so…). \n\nIn the mean time you can still give us 5 stars in the store! \n\nCheers,\nmobile@lafourchette.com"},{"version_id":"822286036","version_name":"9.7.0","version_date":"2017-05-29 15:14:09.000 +0800","version_description":"Dear readers of the update journal,\nOne of the advantages of being a French company based in Paris, is that we have this year a lot of bank holidays, especially in May! \nBut it also means that we didn’t have much working days to work on outstanding features… Good things come to those who wait. We are currently working on the new homepage that will dazzle you (we hope so…). \nIn the mean time you can still give us 5 stars in the store! \nCheers,\nmobile@lafourchette.com"},{"version_id":"822371878","version_name":"9.7.1","version_date":"2017-06-01 08:39:56.000 +0800","version_description":"Dear readers of the update journal,\nOne of the advantages of being a French company based in Paris, is that we have this year a lot of bank holidays, especially in May! \nBut it also means that we didn’t have much working days to work on outstanding features… Good things come to those who wait. We are currently working on the new homepage that will dazzle you (we hope so…). \nIn the mean time you can still give us 5 stars in the store! \nCheers,\nmobile@lafourchette.com"},{"version_id":"822472431","version_name":"9.8.0","version_date":"2017-06-12 07:45:26.000 +0800","version_description":"Dear readers of the update journal, \n\nStill not a new homepage, as they said good things come to those who wait for but we will make sure we don't make you wait too long, because we all know that the updates where nothing happen, they are not really sexy (and it is also hard to write an update text on it, you know the issue of the blank page...). \n\nIn the mean time, if you are like us and you started thinking about your holidays and what you can eat or find and what to bring in your luggage. Let us simplify a little bit your life. Don't forget to bring us with you because wherever you are in France, Spain, Italy, Belgium, Switzerland, Sweden, Portugal, Denmark, Brazil, The Netherlands or even in Australia, TheFork is there for you. Take us with you to easily find a table :) \n\nAs always, comments, suggestion, wedding proposals: mobile@lafourchette.com"},{"version_id":"822538035","version_name":"9.9.0","version_date":"2017-06-28 08:40:49.000 +0800","version_description":"Dear readers of the update journal,\n\nWhen you were a kid, did you love to play hide and seek? You used to hide under the bed with your nose facing the dust bunnies, you couldn't keep from sneezing and get caught and inevitably lose against your cousin Jean-Pinpin, comfortably hidden in an unlikely hideout. \n\nYou will say, what is the link between this story and an update text? Well, the new homepage is like Jean-Pinpin, it is the king of the hide and seek, it is here somewhere, there but hidden. Normally, you should see it next time. \n\nOtherwise don't forget that TheFork is operating in a lot of countries (Spain, France, Portugal, Italy, Switzerland, The Netherlands, Sweden, Belgium, Denmark and Brazil), so if you in holidays, don't forget to use your app to see the best restaurants around you. \n\nCheers, \n\nmobile@lafourchette.com"},{"version_id":"822780499","version_name":"9.10.0","version_date":"2017-07-06 18:02:31.000 +0800","version_description":"Dear readers of the update journal, \n\nAt the menu of this update, some bugs resolution and preparation of the new homepage (her again...). \n\nIf you go out and in holidays in the next few days, don't forget to bring us with you! You can find the best restaurants around you in most countries of Europe and Brazil for the Latinos! \n\nCheers and happy holidays!\nmobile@lafourchette.com"},{"version_id":"822855404","version_name":"9.11.0","version_date":"2017-07-26 07:55:10.000 +0800","version_description":"Dear readers of the update journal,\n\nAt the menu of the update of today, a bug resolution that might interest our friends who love to apply different sort order! Lately we got in a muddle and our sort orders weren't applying the right sorting order. We fixed this bug and now you can serenely use them again! \n\nFor our dear friends who haven't yet make a first booking on this app, this is the moment to do it! With the code APP17 you can earn 10€ with your first booking on the app* !\n\nCheers,\nmobile@lafourchette.com"},{"version_id":"823062822","version_name":"9.12.0","version_date":"2017-08-08 15:50:34.000 +0800","version_description":"Dear readers of the update journal,\n\nAs most of you, we also enjoy the holidays at TheFork, at least we try because the weather is not what we expected for a summer... Don't forget to bring us with you in your holidays! You can easily find many restaurants around you in your holidays destinations. \n\nAnd don't forget to use our special code APP17!  You can earn 10€ if you make your first booking on the app* !\n\nCheers,\nmobile@lafourchette.com"},{"version_id":"823324185","version_name":"9.13.0","version_date":"2017-08-28 10:23:36.000 +0800","version_description":"Dear readers of the update journal, \n\nI hope you all had great holidays and you enjoyed the sun! We've been working a lot this summer and we are finally bringing to you some new stuffs!\n\nGood news for the ones that like to search for restaurants on Google. From now on, if you have the TheFork app you will be automatically redirect to the app when you click on a restaurant search link. No need anymore to go through the mobile website to get the information of the restaurant. You can enjoy a full native app experience even coming from a Google search. \n\nSuggestions, comments: mobile@lafourchette.com"},{"version_id":"823462362","version_name":"10.0.0","version_date":"2017-09-19 08:50:09.000 +0800","version_description":"Dear readers of the update journal,\n\nHere comes iOS 11 and its new features. We are happy to announce that we are already compatible with iOS 11 and you can enjoy our app in the latest OS version of Apple. We took the opportunity to bring you a new iOS 11 feature on iPad. \n\nWe are officially supporting Drag and Drop on iPad. With this new behavior on the iPad app you will be able to easily share your selections of restaurants and put them in your favorite sharing apps like Mail, Notes or iMessage. \n\nPlease feel free to tell us what you think about this new functionality.\n\nmobile@lafourchette.com"},{"version_id":"823762147","version_name":"10.1.0","version_date":"2017-10-02 08:29:55.000 +0800","version_description":"Dear readers of the update journal,\n\nAs you may know (you should have read it in the previous update texts) we were working on a complete new homepage for the apps. We are happy to announce that we finalized the last development! You can now enjoy a new homepage with a new design, with more restaurants around you organized by categories and quick access to the most popular cuisines and neighborhoods of your city! \n\nWe hope that you will enjoy it and please don't hesitate to tell us what you want! \n\nCheers, \nmobile@lafourchette.com"},{"version_id":"823895526","version_name":"10.1.1","version_date":"2017-10-03 17:34:29.000 +0800","version_description":"Dear readers of the update journal,\n\nAs you may know (you should have read it in the previous update texts) we were working on a complete new homepage for the apps. We are happy to announce that we finalized the last development! You can now enjoy a new homepage with a new design, with more restaurants around you organized by categories and quick access to the most popular cuisines and neighborhoods of your city! \n\nWe hope that you will enjoy it and please don't hesitate to tell us what you want! \n\nCheers, \nmobile@lafourchette.com"},{"version_id":"823903441","version_name":"10.2.0","version_date":"2017-10-11 07:25:07.000 +0800","version_description":"Dear readers, dear Yums lovers,\n\nHold your breath, read carefully, this requires your full attention: your fidelity program is changing, et it is more generous on the app. Now on, you will earn 150 Yums for each booking on the apps. Every time. For every restaurant. The discounts don't change though, 1000 Yums = 10€ and 2000 Yums = 25€ discount in the partnered restaurants. \n\nThank you for your fidelity"},{"version_id":"823984806","version_name":"10.3.0","version_date":"2017-10-16 08:29:48.000 +0800","version_description":"Dear readers of the update journal, we know that we recently promote a certain number of discount code. To make sure you can use them we enhance the discount code field in the booking process. Don't forget to validate the code! If you haven't made a booking on the app yet, the code APP17 * is still valid! \n\nCheers, \nMobile@lafourchette.com"},{"version_id":"824037907","version_name":"10.3.1","version_date":"2017-10-18 16:58:39.000 +0800","version_description":"Dear readers of the update journal, we know that we recently promote a certain number of discount code. To make sure you can use them we enhance the discount code field in the booking process. Don't forget to validate the code! If you haven't made a booking on the app yet, the code APP17 * is still valid! \n\nCheers, \nMobile@lafourchette.com"},{"version_id":"824069044","version_name":"10.4.0","version_date":"2017-11-02 16:49:15.000 +0800","version_description":"iPhone X here we come!"},{"version_id":"824257871","version_name":"10.4.1","version_date":"2017-11-03 14:39:06.000 +0800","version_description":"iPhone X here we come!"},{"version_id":"824335324","version_name":"10.5.0","version_date":"2017-11-15 21:20:52.000 +0800","version_description":"Dear readers of the update, not much this time to show. But believe us, we are working hard to provide you new features! To give you a sneak peak we are currently working on building on new search experience. You will soon be able to search by type of cuisine... Stay tuned!\n\nCheers! mobile@lafourchette.com"},{"version_id":"824723688","version_name":"10.6.0","version_date":"2017-11-27 23:29:50.000 +0800","version_description":"Dear readers of the update journal, in this version you might see it but we are preparing you something new... Just wait a little bit more and you will see it! \n\nPS: the push that invites you to review your meal is working again! You can comment, rate, add pictures of your previous meal. \n\nCheers!"},{"version_id":"824992163","version_name":"10.7.0","version_date":"2017-12-07 16:55:05.000 +0800","version_description":"Dear readers of the update journal, on those hard winter days, we are doing our best to pull out our fingers from our gloves and pockets and try to type some characters on our keyboard and try to produce a glimpse of features for you... Hardly, coldly but we still manage to debug some big issues on the app, we hope they didn't bother you too much! \n\nCheers,\nmobile@lafourchette.com"},{"version_id":"825234600","version_name":"10.7.1","version_date":"2017-12-08 18:09:03.000 +0800","version_description":"Dear readers of the update journal, on those hard winter days, we are doing our best to pull out our fingers from our gloves and pockets and try to type some characters on our keyboard and try to produce a glimpse of features for you... Hardly, coldly but we still manage to debug some big issues on the app, we hope they didn't bother you too much! \n\nCheers,\nmobile@lafourchette.com"},{"version_id":"825275125","version_name":"10.8.0","version_date":"2017-12-20 17:34:39.000 +0800","version_description":"Dear readers of the update journal, before the annual App Store closing we would like to bring a new feature for you. We deeply believe that one of our main missions is to make your life as easy as possible. The other thing we know is that one of the most valuable thing in TheFork is the verified restaurants reviews. We thought about these two things and we came up with something new and exciting! \n\nOn the homepage of the app, when you just finished your meal, we will invite you to rate and tell us what you feel about your meal. How simple is that? In one click, you will be able to rate your meal and contribute to our foodie community. \n\nWe hope you will enjoy this new feature and we wish you all a happy end-of-year! We are eager to design new features for you in 2018! \n\nA lot of love from mobile@lafourchette.com"},{"version_id":"825401282","version_name":"10.8.1","version_date":"2017-12-22 00:32:31.000 +0800","version_description":"Dear readers of the update journal, before the annual App Store closing we would like to bring a new feature for you. We deeply believe that one of our main missions is to make your life as easy as possible. The other thing we know is that one of the most valuable thing in TheFork is the verified restaurants reviews. We thought about these two things and we came up with something new and exciting! \n\nOn the homepage of the app, when you just finished your meal, we will invite you to rate and tell us what you feel about your meal. How simple is that? In one click, you will be able to rate your meal and contribute to our foodie community. \n\nWe hope you will enjoy this new feature and we wish you all a happy end-of-year! We are eager to design new features for you in 2018! \n\nA lot of love from mobile@lafourchette.com"},{"version_id":"825500634","version_name":"10.9.0","version_date":"2018-01-10 17:22:04.000 +0800","version_description":"Dear readers of the update journal, to kick off this new year we added an exciting new feature!\n\nOn the homepage of the app, when you just finished your meal, we will invite you to rate and tell us what you feel about your meal. How simple is that? In one click, you will be able to rate your meal and contribute to our foodie community. \n\nWe hope you will enjoy this new feature and we wish you a Happy New Year! \n\nA lot of love from mobile@lafourchette.com"},{"version_id":"825621816","version_name":"10.10.0","version_date":"2018-01-23 01:57:18.000 +0800","version_description":"Dear readers of the update journal, we hope that the last update pleased you. Did you like the new banner on the homepage so you can easily review your last meal? \n\nStay tuned because we are preparing something similar for the next update...\n\nCheers, \nmobile@lafourchette.com"},{"version_id":"825775699","version_name":"10.10.1","version_date":"2018-01-26 14:26:56.000 +0800","version_description":"Dear readers of the update journal, we hope that the last update pleased you. Did you like the new banner on the homepage so you can easily review your last meal? \n\nStay tuned because we are preparing something similar for the next update...\n\nCheers, \nmobile@lafourchette.com"},{"version_id":"825840669","version_name":"10.11.0","version_date":"2018-02-07 17:20:45.000 +0800","version_description":"D-7... Dear readers of the update journal, as you surely know (it can't be may or might, otherwise your partner won't be really happy...) in a very very very very few days, there will be the day devoted to love, to happiness, to cuddle and everything sweet. \n\nWe, as a company who loves this day of the year, will help you out! Of course, by proposing you a nice selection of restaurants for this special day but also, something new and precious for the ones who often have their head in the clouds. To make sure you don't miss your rendezvous, we will remind you your upcoming booking on the homepage of the app. Everything you need to know about your booking is there. \n\nWe wish a very special day full of love and happiness! \n\nCuddles, loves, kisses: mobile@lafourchette.com"},{"version_id":"826108461","version_name":"11.0.0","version_date":"2018-02-28 17:54:41.000 +0800","version_description":"Dear readers of the update journal, this update is for you but also for the daddies and the moms of the team, the long time friends, the people you met at a bar...\n\nYou, who have been whispering in our ears for months (or screaming a bit louder so we can ear it over the 7th 'Despacitooooo' of the evening): 'your app is great but it is really a pain to find a brunch, a Japanese or even a bistro'. \nSo for you, we completely change the way to find a restaurant on TheFork. \n\nEthiopian, Cambodian, Chinese, Korean, Corsican (yes we heard you jdx95), veggie, a brunch (yes Noémie we told you that it will come one day), a burger or tapas... Tell us what you want in the search bar, we do the rest!\n\nTo leave us comments, ask us for improvements, send love and kisses... it is over here: mobile@lafourchette.com\nNot only Elon deserves stars so don't hesitate to make ours shine in the Store."},{"version_id":"826217983","version_name":"11.1.0","version_date":"2018-03-12 17:19:52.000 +0800","version_description":"Dear readers of the update journal, we are happy to know that the new search bar is appreciated! You are many to use it effectively to find the restaurant you want. To keep the momentum, we are currently working on the next part of the search experience so it would be more intuitive and complete!\n\nRemarks, questions: mobile@lafourchette.com"},{"version_id":"826268322","version_name":"11.2.0","version_date":"2018-04-04 15:26:58.000 +0800","version_description":"Dear readers of the update journal, do you happen to say: 'I really love TheFork, I can't stop sending them love letters, restaurants suggestion by email but now I need more than that. Really more. I need a crystal clear communication, something more elegant, more refreshing than a basic mail box body so I can express my needs, my littles problems, the really small bugs I can spot from time to time'. \n\nToday, we are offering you a new communication space with fields where you can input last names that are 80 characters long, email addresses that can be as long as you want, but especially, four thousand five hundred characters for your message. We even added a field where you can select the reason of your contact. \n\nCheers, mobile@lafourchette.com"},{"version_id":"826658845","version_name":"11.3.0","version_date":"2018-04-26 16:35:23.000 +0800","version_description":"Dear readers of the update journal, did you occur to be asking: ‘Do you reminder the name of the restaurant we spotted last week?’ ‘I can’t find anymore the name of the Italian restaurant we would like to try…’ ‘I think I saw it on TheFork but I can’t find it…’ ? \n\nTo help you not to ask those questions anymore, we added on your homepage the list of restaurants you recently viewed. So, no more questions but answers like: ‘Yes this is the restaurant we would like to try!’ ‘Indeed I saw it on TheFork, we can book it for tonight’. \n\nWe hope that we can reduce (a bit) the number of questions you are asking yourselves per day. \n\nRemarks, questions: mobile@lafourchette.com\n\nPS: We are still testing this new feature, some of you might not see it. Sorry for that."},{"version_id":"827178282","version_name":"11.4.0","version_date":"2018-05-22 16:14:26.000 +0800","version_description":"Dear readers of the update journal,\n\nTHANK YOU! Thank you for sending us your littles issues, your doubts, your ideas. All these help us improve this app you love so much! To facilitate your contact with us, if you are connected in the app, the contact form will be automatically filled with your information. \n\nIf you like our app, don’t hesitate to make our stars shine in the store by putting 5 stars!\n\nRemarks, ideas, suggestions: your contact form in the app!"},{"version_id":"827244038","version_name":"11.4.1","version_date":"2018-05-28 16:17:28.000 +0800","version_description":"Dear readers of the update journal,\nTHANK YOU! Thank you for sending us your littles issues, your doubts, your ideas. All these help us improve this app you love so much! To facilitate your contact with us, if you are connected in the app, the contact form will be automatically filled with your information.\n\nIf you like our app, don’t hesitate to make our stars shine in the store by putting 5 stars!\n\nRemarks, ideas, suggestions: your contact form in the app!"},{"version_id":"827356133","version_name":"11.5.0","version_date":"2018-06-04 21:56:50.000 +0800","version_description":"Beste lezers van het updatedagboek,\n\nIt seems that we’ve learned some words coming from the land of tulips and windmills by working for our Dutch market those past weeks. And Claudia, our Mama Italia won’t say the contrary… In her last chat messages with our team she couldn't help replacing her Italian and English by some Dutch.\n\nIf you are passing by the Netherlands to taste their famous gouda cheese or see the beautiful canals of Amsterdam, don’t forget to open your TheFork app. You will also find a lot of restaurants!\n\nKusjes, knuffels van mobile@lafourchette.com \n\nTot ziens!"},{"version_id":"827439185","version_name":"11.5.1","version_date":"2018-06-14 15:58:21.000 +0800","version_description":"Beste lezers van het updatedagboek,\n\nIt seems that we’ve learned some words coming from the land of tulips and windmills by working for our Dutch market those past weeks. And Claudia, our Mama Italia won’t say the contrary… In her last chat messages with our team she couldn't help replacing her Italian and English by some Dutch.\n\nIf you are passing by the Netherlands to taste their famous gouda cheese or see the beautiful canals of Amsterdam, don’t forget to open your TheFork app. You will also find a lot of restaurants!\n\nKusjes, knuffels van mobile@lafourchette.com\n\nTot ziens!"},{"version_id":"827542230","version_name":"11.6.0","version_date":"2018-06-28 16:05:27.000 +0800","version_description":"Dear readers of the update journal,\n\nWe should say that currently, part of our preoccupation is about soccer and the famous event happening in the country of the Russian dolls. Last Thursday and Tuesday, we spent as much time as usual, we just let our keyboards rest a bit (around 90 minutes curiously…). \n\nIf you are like us, passionate about sport and insatiable gourmand, our team expert in restaurants has concocted a great selection of restaurants that ally your two passions. \n\nBetween two whistle blasts, we are working on improving our search experience, maybe some of you already are seeing the new interface? It coming soon for everyone :) \n\nHugs, suggestions: mobile@lafourchette.com"},{"version_id":"827703653","version_name":"11.7.0","version_date":"2018-07-04 12:49:42.000 +0800","version_description":"Dear readers of the update journal,\n\nAt TheFork, we care about our users and our obsession is to make sure they have everything they need to find the restaurant they want at any time! We are currently working on our new search results page and we improved our filtering experience. You will find better filter categories. \n\nWe also modified our way to handle the emails subscription. You can easily chose if you want to receive the great deals and latest news from TheFork.\n\nHugs, suggestions: mobile@lafourchette.com"},{"version_id":"827893941","version_name":"11.8.0","version_date":"2018-07-19 16:18:12.000 +0800","version_description":"Dear readers of the update journal,\n\nOn this release, we launch a new settings screen so you can manage your communication and location preferences in details. \n\nRemarks, suggestion: mobile@lafourchette.com"},{"version_id":"828066226","version_name":"11.9.0","version_date":"2018-08-06 16:07:09.000 +0800","version_description":"Dear readers of the update journal,\n\nIn this release, we improved the way to choose which type of notification push you would like to receive. In your settings, you can choose if you like to receive the booking related notification push or the notification push about the latest best deals or both!\n\nHave a great summer,\n\nmobile@lafourchette.com"},{"version_id":"828307420","version_name":"11.10.0","version_date":"2018-08-29 16:11:21.000 +0800","version_description":"Dear readers of the update journal,\n\nFor this version, we corrected an annoying bug that prevented you from posting food pictures taken during your meal. Don’t hesitate to share your food pictures with the rest of the community. Other users will be pleased to discover the dishes served in a restaurant. \n\nCheers!"},{"version_id":"828412080","version_name":"11.10.1","version_date":"2018-09-06 15:59:29.000 +0800","version_description":"Dear readers of the update journal,\nFor this version, we corrected an annoying bug that prevented you from posting food pictures taken during your meal. Don’t hesitate to share your food pictures with the rest of the community. Other users will be pleased to discover the dishes served in a restaurant.\n\nCheers!"},{"version_id":"828633178","version_name":"15.0.1","version_date":"2019-12-20 16:33:32.000 +0800","version_description":"Dear readers of the update journal,\n\nWe resolved a minor bug in this new version to provide you the best experience possible.\nDiscover also our new feature for Christmas: You can now modify your reservations on TheFork in 10 seconds!\nFind this exciting new feature in your booking list.\n\nCheers,\nTheFork"},{"version_id":"828633178","version_name":"12.0.0","version_date":"2018-09-24 23:09:26.000 +0800","version_description":"Dear readers of the update journal,\n\nWe are currently rolling out progressively new features to some of you! If you don’t see anything new, don’t worry! We will roll out those new features to a larger volume of users at the next update! \n\nIn the mean time, we put in place a new notification push that keeps you updated on the status of your booking. By clicking on it, you can easily access your bookings space. \n\nDon’t hesitate to send us your comments and suggestion directly within the app through the contact form. Our team will be happy to answer you! \n\nTheFork mobile team"},{"version_id":"828633178","version_name":"13.3.0","version_date":"2019-07-22 21:58:04.000 +0800","version_description":"Dear readers of the update,\n\nOur mission is to make sure that your experience with TheFork is the best possible. But we are not perfect and sometimes you can encounter issues with the app or your experience at the restaurant can be not what you expected. A couple of months ago, we implemented a brand new contact form so you can easily contact our customer service to get help. We would like to go further and bring our customer service even closer to you. In this version, you will be able to directly live chat with agents of our customer service to get immediate and quick help. \n\nCheers,\nTheFork"},{"version_id":"828633178","version_name":"13.5.1","version_date":"2019-09-06 17:52:19.000 +0800","version_description":"Dear readers of the update journal,\nIn this release, we fix some navigation issues in the list of reviews. You can now navigate back and forth more easily between a restaurant page and the list of reviews.\n\nCheers,\nTheFork"},{"version_id":"828633178","version_name":"12.11.0","version_date":"2019-04-23 17:45:39.000 +0800","version_description":"Dear readers of the update journal, \n\nIn this update, we made some small fixes on the app concerning the modification of the password. It is now clearer to modify your password in your profile. \n\nCheers,\nTheFork"},{"version_id":"828633178","version_name":"12.7.0","version_date":"2019-02-18 13:50:42.000 +0800","version_description":"Dear readers of the update journal,\n\nIn this update, we improved the user's profile so it is easier for you to edit your personal information. \n\nCheers!\nTheFork"},{"version_id":"828730212","version_name":"12.0.1","version_date":"2018-10-01 16:07:26.000 +0800","version_description":"Dear readers of the update journal,\nWe are currently rolling out progressively new features to some of you! If you don’t see anything new, don’t worry! We will roll out those new features to a larger volume of users at the next update!\n\nIn the mean time, we put in place a new notification push that keeps you updated on the status of your booking. By clicking on it, you can easily access your bookings space.\n\nDon’t hesitate to send us your comments and suggestion directly within the app through the contact form. Our team will be happy to answer you!\n\nTheFork mobile team"},{"version_id":"828851576","version_name":"12.1.0","version_date":"2018-10-15 16:24:57.000 +0800","version_description":"Dear users of the update journal,\n\nIt is with some emotion that we are glad to announce the launch of the new search experience on the app! We have been working on this new delightful search experience for months. \n\nAt the beginning of the year, if you remember well, we launched a new way to search (you can search for a type of food in a place). After this success, we challenged ourselves to enhance the way we present the restaurants in a search results list with more information, a bigger space for the restaurants’ photos in a simple and clear design. \n\nAfter that, we thought: ‘What if we present more filters to our users?’. Done.\n\nAnd then, after having read many of your reviews (thanks Wazben for this JE T’AIME!), we came to the conclusion that we should improve the experience of the… MAP! We are very happy to announce that we launch a new map with better performance, a beautiful design and added features. \n\nWe hope that you will enjoy this new experience as much as we did. \n\nPS: so sorry for the users who still don’t see this new experience. It will come very soon!\n\nMobile team of TheFork."},{"version_id":"828932481","version_name":"12.2.0","version_date":"2018-11-12 17:44:09.000 +0800","version_description":"Dear readers of the update journal,\n\nI think you heard already several times about us launching a new search experience... But we are super, super, super, super... SUPER EXCITED to say it is finally live for all users!\n\nYou can now all enjoy a brand new search experience with a better map experience, a better filters experience... Just try it out and we let you judge :) \n\nDon't hesitate to share your feedback with us directly thanks to the contact button on the app. \n\nTheFork's app team"},{"version_id":"829267801","version_name":"12.2.1","version_date":"2018-11-14 17:05:25.000 +0800","version_description":"Dear readers of the update journal,\nI think you heard already several times about us launching a new search experience... But we are super, super, super, super... SUPER EXCITED to say it is finally live for all users!\n\nYou can now all enjoy a brand new search experience with a better map experience, a better filters experience... Just try it out and we let you judge :)\n\nDon't hesitate to share your feedback with us directly thanks to the contact button on the app.\n\nTheFork's app team"},{"version_id":"829349812","version_name":"12.3.0","version_date":"2018-11-22 17:13:09.000 +0800","version_description":"Dear readers of the update journal,\n\nWith this cold weather, we are feeling a bit nostalgic and we are thinking about our dear colleague Sara who went on a trip to explore South America (especially when she send us some beautiful pictures taken from the other part of the world). Sara, she entrusted us with a task before she left. She told us: ‘Guys if you can do a heavy lifting of the fidelity space on the app, it would be awesome for our users! They will finally know how many Yums are going to expire, how many are pending validation and they can have a look at their Yums’ history’. \n\nWell, we didn’t forget what Sara told us (also because Sara has two great colleagues, Marie and Pierre, who occasionally remind us of Sara’s mission). In this new version of the app, we completely changed the fidelity space and we made it clearer for users. Just try it out!\n\nDon’t forget that a certain amount of your Yums will expire by the end of the year, you can search for the restaurants that accept Yums by directly launching a search about restaurants that accept Yums. \n\nSee you soon!\nApps’ team of TheFork"},{"version_id":"829406367","version_name":"12.3.1","version_date":"2018-11-27 15:38:00.000 +0800","version_description":"Dear readers of the update journal,\nWith this cold weather, we are feeling a bit nostalgic and we are thinking about our dear colleague Sara who went on a trip to explore South America (especially when she send us some beautiful pictures taken from the other part of the world). Sara, she entrusted us with a task before she left. She told us: ‘Guys if you can do a heavy lifting of the fidelity space on the app, it would be awesome for our users! They will finally know how many Yums are going to expire, how many are pending validation and they can have a look at their Yums’ history’.\n\nWell, we didn’t forget what Sara told us (also because Sara has two great colleagues, Marie and Pierre, who occasionally remind us of Sara’s mission). In this new version of the app, we completely changed the fidelity space and we made it clearer for users. Just try it out!\n\nDon’t forget that a certain amount of your Yums will expire by the end of the year, you can search for the restaurants that accept Yums by directly launching a search about restaurants that accept Yums.\n\nSee you soon!\nApps’ team of TheFork"},{"version_id":"829437126","version_name":"12.4.0","version_date":"2018-12-12 18:33:23.000 +0800","version_description":"Dear readers of the update journal,\n\nAs you know, we are just a few weeks before the year’s end celebrations. As usual, the App Store will be closed for a few days around Christmas. So do we! We will take some days off and enjoy some great moments with our loved ones and eat everything we love and we can only eat during the year’s end celebrations! \n\nFor this last update of 2018, we made some modification not visible for you as users but that really matter to us as app developers. We made also some fixes in the app especially in the last step of the booking process. We made the fidelity code validation button clearer so no more excuse to call our customer service and tell them that you didn’t see the fidelity code validation button!\n\nWe wish you to have a wonderful year’s end celebration and we wish you to have some lovely moments with your loved ones. \n\nSee you in 2019!\n\nApps team of TheFork"},{"version_id":"829653237","version_name":"12.5.0","version_date":"2019-01-15 22:45:32.000 +0800","version_description":"Dear readers of the update journal,\n\nNew Year, fresh start! We hope that you all had a great end of year moments with your loved ones. To kick off correctly the year we fix a couple of small annoying bugs that we were postponing again and again. \n\nCheers!\nTheFork apps team"},{"version_id":"830029541","version_name":"12.6.0","version_date":"2019-01-28 17:27:50.000 +0800","version_description":"Dear readers of the update journal,\n\nNot much in this update but we made sure that the check box to burn your Yums is always visible no matter your login status. If you are not connected, you will be invited to enter your password to confirm that you want to burn some of your Yums. \n\nDon’t hesitate to reach out to us through our contact form in the app! \n\nSee you soon,\nTheFork"},{"version_id":"830112799","version_name":"12.7.0","version_date":"2019-02-18 13:50:42.000 +0800","version_description":"Dear readers of the update journal,\n\nIn this update, we improved the user's profile so it is easier for you to edit your personal information. \n\nCheers!\nTheFork"},{"version_id":"830550865","version_name":"12.8.0","version_date":"2019-03-11 18:50:25.000 +0800","version_description":"Dear readers of the update journal,\n\nIn this update, we added a field on your profile edition so you can easily modify your password. \n\nCheers,\nTheFork"},{"version_id":"830603561","version_name":"12.8.1","version_date":"2019-03-14 23:56:32.000 +0800","version_description":"Dear readers of the update journal,\nIn this update, we added a field on your profile edition so you can easily modify your password.\n\nCheers,\nTheFork"},{"version_id":"830652226","version_name":"12.9.0","version_date":"2019-03-25 17:33:31.000 +0800","version_description":"Dear readers of the update journal,\n\nAs you may know, we launched a while ago Insider. With Insider you can book the best tables of the moment with your eyes closed. We selected for you the hype addresses and the safe bet among the best rated restaurants on TheFork. \n\nTo help you better identify the Insider restaurants we added in the app a visual element easy to remember and to spot. With that, you are sure to find the right Insider restaurant for you. \n\nSee you soon,\nTheFork"},{"version_id":"830783861","version_name":"12.10.0","version_date":"2019-04-01 14:49:42.000 +0800","version_description":"Dear readers of the update journal,\n\nIn this release, you are now able to open automatically your search on the app no matter the search engine you use. No need to see the results on a browser, you can see the results on your app. \n\nCheers,\nTheFork"},{"version_id":"830834292","version_name":"12.11.0","version_date":"2019-04-23 17:45:39.000 +0800","version_description":"Dear readers of the update journal, \n\nIn this update, we made some small fixes on the app concerning the modification of the password. It is now clearer to modify your password in your profile. \n\nCheers,\nTheFork"},{"version_id":"831076211","version_name":"12.12.0","version_date":"2019-05-07 15:59:48.000 +0800","version_description":"Dear readers of the update journal and especially the Yums lovers! \n\nIn this release, we heard you Yums lovers. We made several improvements around the visibility of the Yums participating restaurants. We made it clearer for you to identify the Yums participating restaurants. On the Homepage and the list of results, the restaurants part of the Yums program will be identified with a yellow label 'Yums accepted'.\n\nBesides, to confirm that you did use some Yums for a booking, we added the Yums discount value for each booking made with Yums.\n\nCheers,\nTheFork"},{"version_id":"831226283","version_name":"12.12.1","version_date":"2019-05-08 00:16:14.000 +0800","version_description":"Dear readers of the update journal and especially the Yums lovers!\nIn this release, we heard you Yums lovers. We made several improvements around the visibility of the Yums participating restaurants. We made it clearer for you to identify the Yums participating restaurants. On the Homepage and the list of results, the restaurants part of the Yums program will be identified with a yellow label 'Yums accepted'.\n\nBesides, to confirm that you did use some Yums for a booking, we added the Yums discount value for each booking made with Yums.\n\nCheers,\nTheFork"},{"version_id":"831249685","version_name":"13.0.0","version_date":"2019-05-24 22:38:16.000 +0800","version_description":"Dear readers of the update journal,\n\nIn this release, we added some information regarding the Yums benefits on the restaurant page and in the booking funnel. On every restaurant page and booking funnel of the participating restaurants, you will see exactly the fidelity discount you can benefit from and how many Yums you can use. Don't forget to log in the apps so we can have access to your Yums count. \n\nCheers,\nTheFork"},{"version_id":"831442853","version_name":"13.0.1","version_date":"2019-05-27 00:54:56.000 +0800","version_description":"Dear readers of the update journal,\nIn this release, we added some information regarding the Yums benefits on the restaurant page and in the booking funnel. On every restaurant page and booking funnel of the participating restaurants, you will see exactly the fidelity discount you can benefit from and how many Yums you can use. Don't forget to log in the apps so we can have access to your Yums count.\n\nCheers,\nTheFork"},{"version_id":"831457482","version_name":"13.0.2","version_date":"2019-05-28 17:45:03.000 +0800","version_description":"Dear readers of the update journal,\nIn this release, we added some information regarding the Yums benefits on the restaurant page and in the booking funnel. On every restaurant page and booking funnel of the participating restaurants, you will see exactly the fidelity discount you can benefit from and how many Yums you can use. Don't forget to log in the apps so we can have access to your Yums count.\nCheers,\nTheFork"},{"version_id":"831643617","version_name":"13.1.0","version_date":"2019-06-24 16:30:28.000 +0800","version_description":"Dear readers of the update journal,\n\nIn this release, we made an important change in the app even if it is not visible from you (it is if there are some bugs!). We just changed our system to retrieve the different translation for every word and sentence in the apps. It seems nothing but it is in fact super important for us so we can make sure we have the best render and content displayed in the app. If you spot some issues with the sentences don't hesitate to report the issue to our customer care! We would love to have feedbacks from you!\n\nCheers,\nTheFork"},{"version_id":"831778625","version_name":"13.2.0","version_date":"2019-06-26 17:04:30.000 +0800","version_description":"Dear readers of the update journal,\n\nFor all the travelers who like to go to South America, this update is for you! With this new update, you will be able to browse restaurants in 6 new countries in South America: Argentina, Mexico, Peru, Chile, Colombia, Uruguay. Don't forget to take us with you when traveling to those countries! \n\nCheers,\nTheFork"},{"version_id":"831808055","version_name":"13.2.1","version_date":"2019-07-01 17:42:34.000 +0800","version_description":"Dear readers of the update journal,\nFor all the travelers who like to go to South America, this update is for you! With this new update, you will be able to browse restaurants in 6 new countries in South America: Argentina, Mexico, Peru, Chile, Colombia, Uruguay. Don't forget to take us with you when traveling to those countries!\n\nCheers,\nTheFork"},{"version_id":"831931000","version_name":"13.3.0","version_date":"2019-07-22 21:58:04.000 +0800","version_description":"Dear readers of the update,\n\nOur mission is to make sure that your experience with TheFork is the best possible. But we are not perfect and sometimes you can encounter issues with the app or your experience at the restaurant can be not what you expected. A couple of months ago, we implemented a brand new contact form so you can easily contact our customer service to get help. We would like to go further and bring our customer service even closer to you. In this version, you will be able to directly live chat with agents of our customer service to get immediate and quick help. \n\nCheers,\nTheFork"},{"version_id":"832214936","version_name":"13.4.0","version_date":"2019-08-05 16:11:28.000 +0800","version_description":"Dear readers of the update journal,\n\nTo simplify even more your login experience on the app, we just added the Google login option so that you are just one click away to log in in the app when you have your Google account setup. You already have the option to log in with Facebook if you'd like. \n\nCheers,\nTheFork"},{"version_id":"832265513","version_name":"13.4.1","version_date":"2019-08-07 00:13:40.000 +0800","version_description":"Dear readers of the update journal,\nTo simplify even more your login experience on the app, we just added the Google login option so that you are just one click away to log in in the app when you have your Google account setup. You already have the option to log in with Facebook if you'd like.\n\nCheers,\nTheFork"},{"version_id":"832542442","version_name":"13.5.0","version_date":"2019-08-29 15:56:51.000 +0800","version_description":"Dear readers of the update journal,\n\nIn this release, we fix some navigation issues in the list of reviews. You can now navigate back and forth more easily between a restaurant page and the list of reviews. \n\nCheers,\nTheForm"},{"version_id":"832569404","version_name":"13.5.1","version_date":"2019-09-06 17:52:19.000 +0800","version_description":"Dear readers of the update journal,\nIn this release, we fix some navigation issues in the list of reviews. You can now navigate back and forth more easily between a restaurant page and the list of reviews.\n\nCheers,\nTheFork"},{"version_id":"832723353","version_name":"13.6.0","version_date":"2019-09-12 16:50:46.000 +0800","version_description":"Dear readers of the update journal,\n\nThank you for downloading the latest version of the app. We are constantly improving the app and we solved several issues in the booking process. \n\nCheers,\nTheFork"},{"version_id":"832770477","version_name":"13.7.0","version_date":"2019-09-16 18:01:05.000 +0800","version_description":"Dear readers of the update journal,\n\nThank you for downloading the latest version of the app. We are constantly improving the app and we solved several issues when using thrid-party login options.\n\nCheers,\nTheFork"},{"version_id":"832862177","version_name":"13.8.0","version_date":"2019-09-25 20:23:05.000 +0800","version_description":"Dear readers of the update journal,\n\nThank you for downloading the latest version of the app. We are constantly improving the app and we solved several issues when using thrid-party login options.\n\nCheers,\nTheFork"},{"version_id":"832981641","version_name":"13.9.0","version_date":"2019-10-15 16:44:53.000 +0800","version_description":"Dears readers of the update journal,\n\nThank you for downloading the latest version of the app. Good news! We are expanding our business to Australia! You can now enjoy more than 4,500 restaurants across Australia. \n\nCheers,\nTheFork"},{"version_id":"833175649","version_name":"13.10.0","version_date":"2019-10-23 16:08:05.000 +0800","version_description":"Dear readers of the update journal, \n\nWe just fixed some issues regarding the push notification for iOS 13 users. \n\nCheers,\nTheFork"},{"version_id":"833316944","version_name":"13.11.0","version_date":"2019-11-07 22:23:02.000 +0800","version_description":"Dear readers of the update journal,\n\nAfter some setbacks, we finally made it. We are live in Australia! You can now enjoy the thousands of restaurants in Australia from Sydney to Melbourne and all over Australia! You can find restaurants offering some discounts, restaurants that accept Yums, Insider restaurants and more. \n\nEnjoy!\nTheFork"},{"version_id":"833529144","version_name":"13.12.0","version_date":"","version_description":""},{"version_id":"833855528","version_name":"15.0.0","version_date":"2019-12-17 23:18:02.000 +0800","version_description":"Dear readers of the update journal,\n\nFor the end of the year, we prepared a wonderful Christmas gift for you!\nNo need to call the restaurant owner to say that you’ll be late or to add a person, you can now modify your reservations on TheFork in 10 seconds!\nFind this exciting new feature in your booking list!\n\nCheers,\nTheFork"},{"version_id":"834048640","version_name":"15.0.1","version_date":"2019-12-20 16:33:32.000 +0800","version_description":"Dear readers of the update journal,\n\nWe resolved a minor bug in this new version to provide you the best experience possible.\nDiscover also our new feature for Christmas: You can now modify your reservations on TheFork in 10 seconds!\nFind this exciting new feature in your booking list.\n\nCheers,\nTheFork"},{"version_id":"834169116","version_name":"15.1.0","version_date":"2020-01-08 23:50:53.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"834405806","version_name":"15.1.1","version_date":"2020-01-18 07:00:44.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"834521982","version_name":"15.2.0","version_date":"2020-02-04 23:58:46.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"834603616","version_name":"15.2.1","version_date":"2020-02-10 16:56:49.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"834663340","version_name":"15.2.2","version_date":"2020-02-13 16:46:14.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"834707312","version_name":"15.2.3","version_date":"2020-02-18 20:02:36.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \r\nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"834763763","version_name":"15.3.0","version_date":"2020-03-04 15:07:47.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \r\nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"834966379","version_name":"15.3.1","version_date":"2020-03-06 06:19:54.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \r\nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"835009658","version_name":"15.3.2","version_date":"2020-03-19 09:05:44.000 +0800","version_description":"Starting from today you can book home delivery from TheFork restaurants, by calling directly from the app. In this hard times, we want to support our users and our restaurants with this new feature. The service is for free and is available in all the restaurants that provide home delivery."},{"version_id":"835179463","version_name":"15.3.3","version_date":"2020-03-25 00:38:12.000 +0800","version_description":"Starting from today you can book home delivery from TheFork restaurants, by calling directly from the app. In this hard times, we want to support our users and our restaurants with this new feature. The service is for free and is available in all the restaurants that provide home delivery."},{"version_id":"835254479","version_name":"15.4.0","version_date":"2020-04-06 13:42:01.000 +0800","version_description":"Starting from today you can book home delivery from TheFork restaurants, by calling directly from the app. In this hard times, we want to support our users and our restaurants with this new feature. The service is for free and is available in all the restaurants that provide home delivery."},{"version_id":"835420092","version_name":"15.4.1","version_date":"2020-04-08 16:55:00.000 +0800","version_description":"Starting from today you can book home delivery from TheFork restaurants, by calling directly from the app. In this hard times, we want to support our users and our restaurants with this new feature. The service is for free and is available in all the restaurants that provide home delivery.\r"},{"version_id":"835622111","version_name":"15.5.0","version_date":"2020-04-24 15:10:26.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAside from performance improvements, you will now be able to order home delivery or pick-up from TheFork restaurants by calling directly from the app. During this uncertain time, we would like to support our diners and restaurants with this new feature. This service is free and is available to all restaurants that provide takeaway services.\nThanks for choosing and using TheFork!"},{"version_id":"835679717","version_name":"15.6.0","version_date":"2020-05-10 17:30:08.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \r\nAside from performance improvements, you will now be able to order home delivery or pick-up from TheFork restaurants by calling directly from the app. During this uncertain time, we would like to support our diners and restaurants with this new feature. This service is free and is available to all restaurants that provide takeaway services.\r\nThanks for choosing and using TheFork!"},{"version_id":"835907366","version_name":"15.6.1","version_date":"2020-05-13 04:54:18.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \r\nAside from performance improvements, you will now be able to order home delivery or pick-up from TheFork restaurants by calling directly from the app. During this uncertain time, we would like to support our diners and restaurants with this new feature. This service is free and is available to all restaurants that provide takeaway services.\r\nThanks for choosing and using TheFork!"},{"version_id":"836023130","version_name":"16.1.0","version_date":"2020-06-08 03:45:04.000 +0800","version_description":"So many days, weeks and months without going to a restaurant, that must have felt like a long time for you (for us too!)\nRestaurants are now reopening all over Europe, and we are more determined than ever to help you find and book the best restaurants\nWith this new app version, you will be able to: \nView, on the restaurant page, what safety measures the restaurant has put in place to welcome you\nChoose your seating area in some restaurants (terrace, patio, upstairs...)\nAnd, by the way, you are now able to book restaurants in our new countries: UK, Germany and Norway !\nOur restaurants are waiting for you \nTake care \nTheFork"},{"version_id":"836317895","version_name":"16.1.1","version_date":"2020-06-09 09:53:09.000 +0800","version_description":"So many days, weeks and months without going to a restaurant, that must have felt like a long time for you (for us too!)\nRestaurants are now reopening all over Europe, and we are more determined than ever to help you find and book the best restaurants\nWith this new app version, you will be able to: \nView, on the restaurant page, what safety measures the restaurant has put in place to welcome you\nChoose your seating area in some restaurants (terrace, patio, upstairs...)\nAnd, by the way, you are now able to book restaurants in our new countries: UK, Germany and Norway !\nOur restaurants are waiting for you \nTake care \nTheFork"},{"version_id":"836372481","version_name":"16.1.2","version_date":"2020-06-12 18:33:37.000 +0800","version_description":"So many days, weeks and months without going to a restaurant, that must have felt like a long time for you (for us too!)\nRestaurants are now reopening all over Europe, and we are more determined than ever to help you find and book the best restaurants\nWith this new app version, you will be able to: \nView, on the restaurant page, what safety measures the restaurant has put in place to welcome you\nChoose your seating area in some restaurants (terrace, patio, upstairs...)\nAnd, by the way, you are now able to book restaurants in our new countries: UK, Germany and Norway !\nOur restaurants are waiting for you \nTake care \nTheFork"},{"version_id":"836453084","version_name":"16.2.0","version_date":"2020-06-30 23:29:32.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"836650732","version_name":"16.2.1","version_date":"2020-07-08 15:24:24.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"836861088","version_name":"16.3.0","version_date":"2020-07-22 15:16:07.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"836983145","version_name":"16.4.0","version_date":"2020-07-30 08:05:57.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \r\nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"837103510","version_name":"16.4.1","version_date":"2020-08-05 16:12:13.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \r\nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!\r\n"},{"version_id":"837369418","version_name":"16.5.0","version_date":"2020-08-17 16:14:18.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"837447616","version_name":"16.6.0","version_date":"2020-08-31 15:58:03.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"837621063","version_name":"16.7.0","version_date":"2020-09-07 16:17:22.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \r\nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"837711947","version_name":"16.8.0","version_date":"2020-09-18 01:42:16.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \r\nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"837847341","version_name":"16.8.1","version_date":"2020-09-23 17:04:27.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"837945637","version_name":"16.8.2","version_date":"2020-09-26 02:29:15.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \r\nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"838189554","version_name":"17.0.0","version_date":"2020-10-15 15:43:12.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"838279825","version_name":"17.0.1","version_date":"2020-10-21 03:44:34.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"838346831","version_name":"17.1.0","version_date":"2020-10-28 19:20:02.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"838480562","version_name":"17.2.0","version_date":"2020-11-09 16:36:50.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"838951881","version_name":"17.3.0","version_date":"2020-11-16 17:52:16.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \r\nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"839265961","version_name":"17.4.0","version_date":"2020-11-25 22:06:07.000 +0800","version_description":"Performance improvements and bug fixes."},{"version_id":"839407036","version_name":"18.0.0","version_date":"2020-12-01 17:16:36.000 +0800","version_description":"Performance improvements and bug fixes."},{"version_id":"839464510","version_name":"18.0.1","version_date":"2020-12-07 17:04:21.000 +0800","version_description":"Performance improvements and bug fixes."},{"version_id":"839571391","version_name":"18.1.0","version_date":"2021-01-14 01:14:18.000 +0800","version_description":"Performance improvements and bug fixes."},{"version_id":"840085623","version_name":"18.1.1","version_date":"2021-01-21 21:06:42.000 +0800","version_description":"Performance improvements and bug fixes."},{"version_id":"840208931","version_name":"18.2.0","version_date":"2021-02-05 00:52:19.000 +0800","version_description":"Performance improvements and bug fixes."},{"version_id":"840426617","version_name":"18.3.0","version_date":"2021-02-24 17:15:37.000 +0800","version_description":"Performance improvements and bug fixes."},{"version_id":"84092821","version_name":"3.2.1","version_date":"","version_description":""},{"version_id":"841045775","version_name":"18.4.1","version_date":"2021-03-25 17:54:42.000 +0800","version_description":"Performance improvements and bug fixes."},{"version_id":"841070099","version_name":"18.5.0","version_date":"2021-03-31 15:14:43.000 +0800","version_description":"Any updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"841648042","version_name":"18.6.0","version_date":"2021-04-21 14:31:07.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"841987692","version_name":"18.7.0","version_date":"2021-05-20 22:27:45.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"842303557","version_name":"18.8.0","version_date":"2021-05-31 16:17:43.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"842687235","version_name":"18.9.0","version_date":"2021-06-22 15:56:02.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"842810533","version_name":"18.9.1","version_date":"2021-06-28 15:52:24.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"842954522","version_name":"19.0.0","version_date":"2021-07-12 15:24:03.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"843244223","version_name":"19.1.1","version_date":"2021-07-24 23:13:49.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"843434611","version_name":"19.2.0","version_date":"2021-08-05 15:18:24.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"843667366","version_name":"19.3.0","version_date":"2021-08-19 16:36:39.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"844094720","version_name":"19.4.1","version_date":"2021-09-14 16:04:47.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"844225621","version_name":"19.5.0","version_date":"2021-09-27 15:34:03.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"844784913","version_name":"19.6.2","version_date":"2021-10-20 21:16:32.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"845205693","version_name":"19.8.0","version_date":"2021-11-15 17:29:01.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"846074778","version_name":"20.1.0","version_date":"2021-12-27 17:13:46.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"847092085","version_name":"20.3.0","version_date":"2022-02-14 17:12:27.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"847588353","version_name":"20.4.0","version_date":"2022-03-11 09:02:52.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"847838654","version_name":"20.5.0","version_date":"2022-04-11 15:47:38.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"},{"version_id":"848317749","version_name":"20.6.0","version_date":"2022-04-21 21:35:46.000 +0800","version_description":"We constantly update TheFork app to provide you a flawless in-app experience and help you find the right restaurant for your moment. \nAny updates of our app contains performance and reliability improvements. Thanks for choosing and using TheFork!"}]