[{"version_id":"160902658","version_name":"2.0","version_date":"","version_description":""},{"version_id":"3506163","version_name":"1.0","version_date":"","version_description":""},{"version_id":"635502643","version_name":"2.1","version_date":"","version_description":""},{"version_id":"6744173","version_name":"1.6","version_date":"","version_description":""},{"version_id":"790832673","version_name":"2.2","version_date":"","version_description":""},{"version_id":"811960247","version_name":"2.3","version_date":"","version_description":""},{"version_id":"813358822","version_name":"2.3.1","version_date":"","version_description":""},{"version_id":"813515629","version_name":"2.3.1","version_date":"","version_description":""},{"version_id":"815407180","version_name":"3.0.3","version_date":"","version_description":""},{"version_id":"816636236","version_name":"3.0.4","version_date":"","version_description":""},{"version_id":"816823206","version_name":"3.0.5","version_date":"","version_description":""},{"version_id":"817125009","version_name":"3.0.6","version_date":"","version_description":""},{"version_id":"818019982","version_name":"3.1.1","version_date":"","version_description":""},{"version_id":"819122071","version_name":"3.1.2","version_date":"","version_description":""},{"version_id":"819187899","version_name":"3.1.3","version_date":"","version_description":""},{"version_id":"819202293","version_name":"3.1.4","version_date":"","version_description":""},{"version_id":"820351048","version_name":"3.2.1","version_date":"","version_description":""},{"version_id":"821421741","version_name":"3.2.2","version_date":"","version_description":""},{"version_id":"822483820","version_name":"3.2.3","version_date":"","version_description":""},{"version_id":"822664853","version_name":"3.2.4","version_date":"2017-06-26 01:16:18.000 +0800","version_description":"If you've got one of the new iPad Pros, this update is for you. This fixes a cancelling issue with the canvas zoom and pan gesture on both new iPad Pro models. \n\nIf you'd like an inside peek of the really exciting things we're working on, you can find us on Instagram, and we'll see you in the Fall for Procreate 4!"},{"version_id":"823773135","version_name":"4.0.2","version_date":"2017-06-26 01:16:18.000 +0800","version_description":"This is Procreate 4. The biggest update to Procreate ever. Powered by a new and incredibly advanced painting engine, packed full of game changing iOS 11 features, and combined with an elegant, powerful interface. It's the same Procreate you know and love: rebuilt, refined, and revolutionized.\n\n\n• Astonishing new painting engine\nBuilt with technologies like Metal 2, Swift 4, and Accelerate, Silica M has been designed to extract the full power of iPad to provide incredible color depth, fluid and accurate painting, and stunningly fast performance.\n\n• All new Smudge\nUse any brush to smudge and mix paint with extraordinary speed and fidelity. With the power of the Silica M engine, blending colors in Procreate is now an incredible 250 times more accurate. \n\n• Wet painting\nWet yourself with Procreate's new Metal-powered engine that makes mixing paint incredibly accurate and blazingly fast. Procreate now gives you the ability to mix and combine paint on the canvas in all new ways for stunning texture and color blending.\n\n• iOS11 Drag and Drop\nFile management can be a real drag, but no more! If you need to download a custom brush, just drag it into Procreate. Need to quickly email a layer? Just drag it straight into Mail. Need to back up your work? Grab all your artworks from the Gallery and drop them into your favorite cloud service. It's going to completely change how you work with Procreate.\n\n• Layer Masks\nEveryone looks more attractive in a mask (that's why they have those parties) and so will your layer. Use masks to non-destructively erase parts of a layer, so you can modify your image without losing any of the original content, and you won't know who you're going home with.\n\n• New Brushes interface\nThe all new brushes interface gives you instant access to your entire brush library. Navigate hundreds of brushes easily, and instantly import or share multiple brushes at once with iOS 11 Drag & Drop.\n\n• Brush Blend Modes\nYou asked for it (about 4 years ago) and you finally have it. All existing blend modes can be applied to any brush; plus a brand new mode for those who like to paint from Behind.\n\n• Bleed setting in Brushes \nUsing the pressure of your Apple Pencil, Bleed lets you control how much of your brush texture hits the canvas for sharper strokes than ever before.\n\n• Better Sketching\nUsing Apple Pencil Tilt with Sketching brushes has a new level of realism and responsiveness, and all Procreate's drawing tools have been refined for a smoother and more realistic experience.\n\n• Rebuilt color interface\nAll four color selection modes have been neatly ordered into tabs, allowing you to quickly jump between picking colors, managing swatches, and entering precise color values. \n\n• Redesigned Adjustments\nNow you can actually see your canvas while performing complex image adjustments with the new interface design.\n\n• All new Gallery\nThe all-new Procreate 4 Gallery works seamlessly with the new iOS11 Files App to instantly access your files across all of your locations. It's easy to manage thousands of canvases, scroll with blazing speed, and neatly order your artwork into Stacks. And this is just the beginning. We've got lots more in store.\n\n• P3 Wide Color\nCause pleasurable discomfort to your eyeballs with extremely saturated artworks. Procreate now fully supports P3 Wide Colour on compatible devices, including import, export, and video.\n\n• Hundreds of refinements\nNearly every pixel in Procreate has been polished to perfection to make your workflow faster and easier. Including the new AirPlay Canvas feature, a better Copy Paste menu, more canvas information, import and export support for TIFF, significant improvements to performance and stability, and over two hundred other features and refinements, Procreate 4 is everything you love but better.\n\nIf you're enjoying Procreate, we'd love you to leave a review on the App Store. We'd like to tell you more of all the thousands of changes we've made, but we're running out of sp"},{"version_id":"824204431","version_name":"4.0.5","version_date":"2017-10-31 21:53:01.000 +0800","version_description":"Pour some fixes on you.\n\n• You no longer need to live on a prayer when importing massive sized JPGs, odd file formats, and obscure PSDs.\n• We fixed a crash that sometimes happened if you had an appetite for distortion.\n• You can now safely use 'Add to Procreate` after choosing questionable files\n• If you've purchased the Earth brushes set, they're now back in black.\n• We have improved the Calligraphy Set translations for Italian, French, Arabic or Turkish customers.\n• The new Grade slider allows you to soften wet brushes for new effects. Looks so good makes a grown man cry.\n• No longer visually age waiting for the Actions menu to menu.\n• The new Color panel was back-to-front for right-to-left languages.\n• Quicklines with Wet Mix brushes now don't look completely different to the original stroke (no, it won't do that).\n• For first generation iPad Pro customers, you can once again rest your palm without fear lag bringing you to your sha na na na na knees, knees.\n\nIt's the Final Countdown to 11.1 that we're happy to report will fix the freeze, so make sure you update iOS when it's released."},{"version_id":"824267004","version_name":"4.0.7","version_date":"2017-11-03 17:06:41.000 +0800","version_description":"Here's a quick update to restore the correct background and title colors to all your swatch palettes.\n\nIn case you missed it, here's what we changed in the last update:\n\n• You no longer need to live on a prayer when importing massive sized JPGs, odd file formats, and obscure PSDs.\n• We fixed a crash that sometimes happened if you had an appetite for distortion.\n• You can now safely use 'Add to Procreate' after choosing questionable files.\n• If you've purchased the Earth brushes set, they're now back in black.\n• We have improved the Calligraphy Set translations for Italian, French, Arabic or Turkish customers.\n• The new Grade slider allows you to soften wet brushes for new effects. Looks so good makes a grown man cry.\n• No longer visually age waiting for the Actions menu to open.\n• The new Color panel was back-to-front for right-to-left languages.\n• Quicklines with Wet Mix brushes now don't look completely different to the original stroke (no, it won't do that).\n• For first generation iPad Pro customers, you can once again rest your palm without fear of lag bringing you to your sha na na na na knees, knees.\n\nWe're happy to report iOS 11.1 resolves the freezing issue. Huge thanks to all of you that helped diagnose it."},{"version_id":"825369382","version_name":"4.0.8","version_date":"2017-06-26 01:16:18.000 +0800","version_description":"Here are a few more tweaks, just in time for the holidays:\n\n- With the new Shape Filtered switch, brush shapes come in smooth or crunchy.\n- Locked layers are back for PSD import, along with support for all languages in layer names.\n- We've squashed a bug with layer merge, so the bottom won't fall out when you pinch.\n\nAs always we've got huge things in the works for 2018, and the first one is massive but also small: Procreate Pocket 2!"},{"version_id":"826740226","version_name":"4.0.9","version_date":"2018-04-19 21:55:38.000 +0800","version_description":"We're fast approaching some really exciting releases. This is one last stop to pick up the new iPad, and keep your engines running smoothly.\n\n• Sometimes your safety features would fail you and Undo would stop working. It's important to us that you feel safe.\n• Layers sometimes merged without looking, losing layer opacity and layer masks. We've taught them to check their mirrors.\n• Inserted images will no longer cause corrupted or blank exports.\n• If you quit the app while within a document the Gallery thumbnail will still update.\n• Like a child forgotten at sports practice, inserted image layers were occasionally left behind in imported PSDs. We promise it won't happen again. Yes, we can stop for icecream.\n• Galleries jammed with artworks will now load as fast as that really fast car you like, instead of another slow kind of car that you don't like.\n• Big things in the pasteboard won't cause roadblocks in Create Canvas.\n\nWe're working on some hot modifications to Procreate, and can't wait to greatly enhance your ride. We'd love to hear about your journey so far, so please leave a review on the App Store."},{"version_id":"826757205","version_name":"4.0.10","version_date":"2018-04-20 12:26:38.000 +0800","version_description":"We're fast approaching some really exciting releases. This is one last stop to pick up the new iPad, and keep your engines running smoothly.\n\n• Sometimes your safety features would fail you and Undo would stop working. It's important to us that you feel safe.\n• Layers sometimes merged without looking, losing layer opacity and layer masks. We've taught them to check their mirrors. \n• Inserted images will no longer cause corrupted or blank exports. \n• If you quit the app while within a document the Gallery thumbnail will still update. \n• Like a child forgotten at sports practice, inserted image layers were occasionally left behind in imported PSDs. We promise it won't happen again. Yes, we can stop for icecream. \n• Galleries jammed with artworks will now load as fast as that really fast car you like, instead of another slow kind of car that you don't like. \n• Big things in the pasteboard won't cause roadblocks in Create Canvas.\n\nWe're working on some hot modifications to Procreate, and can't wait to greatly enhance your ride. We'd love to hear about your journey so far, so please leave a review on the App Store."},{"version_id":"827814028","version_name":"4.1","version_date":"2018-07-11 03:34:40.000 +0800","version_description":"This update is huge. More than any release before it, Procreate 4.1 is packed with features you’ve requested, giving you more power, more control, and more fun.\n\n• Live Symmetry\nWatch your strokes mirror and rotate across the canvas to make beautiful designs and compositions. You can paint with any brush, smudge and erase, or even ColorDrop for incredible new creations.\n\n• Advanced Drawing Guides\nProcreate’s groundbreaking perspective tools have been massively expanded with 2D and isometric guides. With accurate control over grid measurements and the power of Drawing Assist, Procreate will take you where no one has gone before.\n\n• Warp Transform\nEngage the Warp mode to wrap, fold, and curve your textures and access a new dimension in transformation.\n\n• Liquify Filter\nHarness the power of the Silica-M engine to liquify your artwork for amazing new effects. Twirl, bloat, pinch, and reconstruct, or use it with Symmetry just because it’s ridiculously fun.\n\n• Gesture Controls\nWe’ve opened up a bunch of Procreate’s gestures to access all sorts of features to customize your workflow. Swipe three fingers down to invoke QuickMenu, or bring up Copy & Paste controls with a four-finger tap. The power is yours.\n\n• Layer Select\nCreate faster than light by switching layers right on the canvas. Just touch the content to instantly select the layer. \n\n• Brush Set Sharing\nEntire Brush Sets can now be exported and imported for your convenience and pleasure.\n\n• 30-Second Time Lapse\nNow you can export social media ready 30-second Time-lapse Recordings, as well as those delicious long ones.\n\n• Other Stuff\nThere’s also a bunch of nifty little changes, including better interaction with QuickLine, a color Invert option for layers, and significant improvements to Transform resampling.\n\nWe love reading your reviews on the App Store, so keep 'em comin'. Now we’ve finished talking, so you can go and have fun."},{"version_id":"827839929","version_name":"4.1.1","version_date":"2018-07-11 21:56:24.000 +0800","version_description":"This update is huge. More than any release before it, Procreate 4.1 is packed with features you’ve requested, giving you more power, more control, and more fun.\n\n• Live Symmetry\nWatch your strokes mirror and rotate across the canvas to make beautiful designs and compositions. You can paint with any brush, smudge and erase, or even ColorDrop for incredible new creations.\n\n• Advanced Drawing Guides\nProcreate’s groundbreaking perspective tools have been massively expanded with 2D and isometric guides. With accurate control over grid measurements and the power of Drawing Assist, Procreate will take you where no one has gone before.\n\n• Warp Transform\nEngage the Warp mode to wrap, fold, and curve your textures and access a new dimension in transformation.\n\n• Liquify Filter\nHarness the power of the Silica-M engine to liquify your artwork for amazing new effects. Twirl, bloat, pinch, and reconstruct, or use it with Symmetry just because it’s ridiculously fun.\n\n• Gesture Controls\nWe’ve opened up a bunch of Procreate’s gestures to access all sorts of features to customize your workflow. Swipe three fingers down to invoke QuickMenu, or bring up Copy & Paste controls with a four-finger tap. The power is yours.\n\n• Layer Select\nCreate faster than light by switching layers right on the canvas. Just touch the content to instantly select the layer. \n\n• Brush Set Sharing\nEntire Brush Sets can now be exported and imported for your convenience and pleasure.\n\n• 30-Second Time Lapse\nNow you can export social media ready 30-second Time-lapse Recordings, as well as those delicious long ones.\n\n• Other Stuff\nThere’s also a bunch of nifty little changes, including better interaction with QuickLine, a color Invert option for layers, and significant improvements to Transform resampling.\n\nWe love reading your reviews on the App Store, so keep 'em comin'. Now we’ve finished talking, so you can go and have fun."},{"version_id":"827984903","version_name":"4.1.2","version_date":"2018-07-25 13:48:20.000 +0800","version_description":"As the Savage offices go under construction, Procreate is also getting a lick of paint and a little work on the foundations.\n\n- The exterior is getting a facelift with several improvements to Light Interface.\n - When you entered Filters from Transform it would completely forget why it went in there. Now it no longer stands there looking blankly at you.\n- We’ve upgraded our signage: the Gallery Stack return arrow no longer disappears.\n- Straight lines are important to a good structure, so we've improved your QuickLine experience.\n- Your tool should no longer run out of battery just as you’re screwing in that last screw.\n- Measure twice, cut once: Warp Transform is now more accurate by half a pixel.\n- Everyone is welcome in Procreate, so we've studied up on our translations, and Transform mode is much faster when using Asian languages.\n- Only a foolish person builds their house upon sand, so there are many stability improvements.\n\nNow you can keep filling Procreate with art and make it your home. If you’d like to let us know what you think of the renovations, leave a review on the App Store."},{"version_id":"828126141","version_name":"4.1.3","version_date":"2018-08-10 02:14:20.000 +0800","version_description":"Please enjoy this touchy feely Procreate update.\n\n- Recolor is now not just a one-time deal - touch it again.\n- Some Brush Settings sliders are now much more open about going both ways.\n- The sidebar sliders are more responsive, and won't ignore your desperate calls. U up?\n- The Gallery was showing an old thumbnail, but only if it was an imported or default artwork and only for the first item. Weird. \n- We've greatly improved the experience of transforming the fifteen thousand, eight hundred and seventy-fourth pixel on second-generation iPad Pros.\n- The \"Global Touch\" option in Gesture Controls was sending mixed signals, as in fact it meant the opposite of what it said.\n- Actions menu buttons will light up every time you touch.\n- Everyone likes to bang, but with these new fixes you should crash less.\n\nWe’d love to hear what you think of Procreate. Find @procreate on social media, or leave a review on the App Store."},{"version_id":"828545904","version_name":"4.1.4","version_date":"2018-09-13 04:30:41.000 +0800","version_description":"We're just dropping in with some compatibility fixes, but there's a big update coming soon. We're sorry to Crop these release notes short, and we don't wish to Mask our intentions, but before we Taper off, we want you to know that we're sure the features we've Selected for our next major release will be a real Feather in your cap."},{"version_id":"829172672","version_name":"4.2","version_date":"2018-11-07 04:56:49.000 +0800","version_description":"Our second massive update for 2018 brings you essential professional features, but not as you know them. Clipping Masks, Crop, inking, and Selections have all been redesigned for multitouch and Apple Pencil, and we'll change the way you create with the revolutionary QuickShape and explosive Liquify Dynamics.\n\n• Cutting Edge\nUse the best software with the best hardware. Procreate is fully compatible with the latest iOS, and all available iPads and Apple accessories.\n\n• QuickShape\nEffortlessly create shapes with any brush and without leaving your canvas. Just hold the end of your stroke for perfect ellipses, arcs, circles, rectangles, triangles and more. Change the shape type, edit the major points, or just keep on painting.\n\n• Crop and Resize\nIt's never too late to find the perfect composition. Reframe the focus of your artwork with intuitive touch controls or precise numerical input.\n\n• Clipping Masks\nReimagine your workflow with the power of Clipping Masks. Control the visibility of layers based on the content of another layer for ultimate flexibility.\n\n• Gallery Preview\nShowcase your artwork with Preview. Use Select mode or just pinch outward to view your artworks in full screen without opening them. Tap through your artworks, or swipe for a slideshow.\n\n• Ink Different\nSpecifically for comic artists and inkers, we’ve rebuilt Procreate’s stroke handling to give you precise control over the shape and size of your stroke taper. Perfect your strokes with customizable pressure curves for size and opacity, built directly into every single brush. \n\n• Improved Selections\nUse the new Shape Selections to quickly isolate elliptical or rectangular areas of your artwork, and Feather any selection for a soft edge and beautiful blending.\n\n• Liquify Dynamics\nChallenge your creative limits with these groundbreaking additions to Liquify. Exclusive Edge and Crystals brushes add control and spontaneity, and you can enhance any adjustment with mind-bending Distortion and Momentum.\n\nAs always we've also kept polishing all your favorite features, including rotation and interpolation options in Transform, Duplicate for Brush Sets, and the ability to Drag and Drop layers between canvases. \n\nWe're still working tirelessly to bring you the features you've asked for and never seen before. Tell us how you feel about Procreate by leaving a review on the App Store, and stay alert for more exciting announcements."},{"version_id":"829203199","version_name":"4.2.1","version_date":"2018-11-08 02:33:18.000 +0800","version_description":"Our second massive update for 2018 brings you essential professional features, but not as you know them. Clipping Masks, Crop, inking, and Selections have all been redesigned for multitouch and Apple Pencil, and we'll change the way you create with the revolutionary QuickShape and explosive Liquify Dynamics.\n\n• Cutting Edge\nUse the best software with the best hardware. Procreate is fully compatible with the latest iOS, and all available iPads and Apple accessories.\n\n• QuickShape\nEffortlessly create shapes with any brush and without leaving your canvas. Just hold the end of your stroke for perfect ellipses, arcs, circles, rectangles, triangles and more. Change the shape type, edit the major points, or just keep on painting.\n\n• Crop and Resize\nIt's never too late to find the perfect composition. Reframe the focus of your artwork with intuitive touch controls or precise numerical input.\n\n• Clipping Masks\nReimagine your workflow with the power of Clipping Masks. Control the visibility of layers based on the content of another layer for ultimate flexibility.\n\n• Gallery Preview\nShowcase your artwork with Preview. Use Select mode or just pinch outward to view your artworks in full screen without opening them. Tap through your artworks, or swipe for a slideshow.\n\n• Ink Different\nSpecifically for comic artists and inkers, we’ve rebuilt Procreate’s stroke handling to give you precise control over the shape and size of your stroke taper. Perfect your strokes with customizable pressure curves for size and opacity, built directly into every single brush. \n\n• Improved Selections\nUse the new Shape Selections to quickly isolate elliptical or rectangular areas of your artwork, and Feather any selection for a soft edge and beautiful blending.\n\n• Liquify Dynamics\nChallenge your creative limits with these groundbreaking additions to Liquify. Exclusive Edge and Crystals brushes add control and spontaneity, and you can enhance any adjustment with mind-bending Distortion and Momentum.\n\nAs always we've also kept polishing all your favorite features, including rotation and interpolation options in Transform, Duplicate for Brush Sets, and the ability to Drag and Drop layers between canvases. \n\n\n4.2.1: Here's a bit of polish for your shiny new update:\n\n- If you’d ever connected a third-party stylus to Procreate and you’re now using Apple Pencil, painting was broken forever. We’re sorry. It’s fixed now.\n- Several fixes to Selections\n- Polished up the new Transform rotation node\n- Changing Grid Size in 2D and Isometric Guides now actually works\n- Fixed an issue where Time-lapse would drop segments when leaving Procreate\n\nWe're still working tirelessly to bring you the features you've asked for and never seen before. Tell us how you feel about Procreate by leaving a review on the App Store, and stay alert for more exciting announcements."},{"version_id":"829288495","version_name":"4.2.2","version_date":"2018-11-16 06:10:46.000 +0800","version_description":"We’re back with a few repairs and a coat of polish.\n\n- Fixed a bug with undoing Freehand Selection\n- Applying blurs to a selection now works correctly\n- Fixed a crash when Undoing Select Layer\n- Multitasking gestures now work in Gallery Preview\n- Improved interface for Drawing Guides\n- Fixed an issue with Comparison Color\n- Multitasking gestures now work in Gallery Preview\n- UI improvements for Compact Mode and smaller iPads\n- Improvements to the sidebar sliders\n- The Toggle QuickShape action in QuickMenu has returned\n- New options for Assisted Drawing in Gesture Controls\n- Fixed an issue with 30 Second Time-lapse export for short videos\n\nThank you for all your reports, reviews, and feedback"},{"version_id":"829473278","version_name":"4.2.3","version_date":"2018-12-05 04:09:06.000 +0800","version_description":"Just a Quick visit to keep you in Shape.\n\n- We've spend time strengthening our core and you should see improvements to your stability.\n- The Feather slider in Selections has been doing leg day, and can now keep up with you.\n- An Undone Selection will no longer come back to bite you like yesterday's workout.\n- Recolor gave up after a single rep. Weak.\n- We've included improvements to translations, so you can be the best version of yourself in any language.\n- Whenever you Resized, you'd lose Perspective. Now you can keep your goals in sight, no matter what size you are.\n- The Drawing Guide keypad didn't even lift.\n- Immediately moving an imported Brush Set would crash. We've told it to stretch first.\n- Whether your canvas is smol or swol, you can always look back on your progress with these fixes to Time-lapse Replay.\n- When you went full screen your bottom toolbar was always visible. We strongly believe that you should always have full control over when your bottom can be seen.\n\nPhew, hope we'll be able to walk tomorrow. Let us know how you feel with a review on the App Store."},{"version_id":"829683050","version_name":"4.2.4","version_date":"2018-12-19 06:32:51.000 +0800","version_description":"Good things come in small packages. Have a little something from us for the holiday season.\n\n- Here’s the item we know was first on your list: Layer Masks made from selections won’t corrupt when reopening the canvas.\n- Layer Groups were hiding boxes from you when it wasn't necessary.\n- The Wacom Bamboo Fineline 3 felt Unsupported, so this year we're giving them the gift of love.\n- Twig brush's package was a little too small at minimum size.\n\nIf you're feeling generous, all we really want is your review on the App Store."},{"version_id":"830121335","version_name":"4.2.5","version_date":"2019-01-30 05:29:31.000 +0800","version_description":"We're back, with some big stability improvements for Procreate 4.2. Everything should feel much smoother and generally more wonderful with the addition of these fixes:\n\n- We've fixed issues with inserting and pasting images that stopped Undo from working, as well as causing crashes.\n- Exiting Selection mode with an open selection shape will no longer cause crashes.\n- Transform is now more coordinated, and can flip without crashing.\n- And, uh, there were also crashes when exporting 30-second Time-lapse Recordings.\n- Adonit styluses are not supported in Procreate on iPad Pro models, but they still shouldn't crash tho.\n- Guess what happened when you reloaded a selection mask? It'd crash. Again.\n- Drag and Drop an artwork from Gallery into another canvas, and it would create a broken file duplicate. Oops, we almost forgot: if you dropped it into the Layers menu, it would crash.\n- Rotating the horizon line in a one-point Perspective Guide was busted. It didn't crash, but give us time.\n\nWe know all the crashing wasn't fun. The good news is that the crashes should be behind us now. Things should be nice and stable. Unless it crashes. But it shouldn't."},{"version_id":"830943588","version_name":"4.3","version_date":"2019-04-16 08:46:06.000 +0800","version_description":"A picture may be worth a thousand words, but sometimes you need a thousand words. Thousands of you asked for one vital addition to Procreate. We heard you, and we're thrilled to present it as the centrepiece of 2019's first major update: Text! You'll never be lost for words again.\n\n    •    Text and Typography\nAdd gorgeous editable typography to your illustration. Refine spacing and alignment with precision sliders, and rasterize the results for total control over the finish. The word is your oyster!\n\n    •    Import Fonts\nNeed to create something with a distinctive typeface? Easy. Just drag-and-drop your favorite fonts into Procreate and find your perfect type.\n\n    •    Share Layers\nWith new layer export options, you can share your layers as a folder full of PNG images, a multi-page PDF, or an animated GIF. Or, use full artworks for each frame by selecting them from the Gallery.\n\n    •    View Single Layer\nAll the single layers\n(All the single layers)\nNow put your hands up... and view the contents of a single layer in isolation by holding the Visibility checkbox.\n\n    •    Pressure Smoothing\nAll new pressure smoothing settings will help you create flawless strokes. So smooth under pressure they walk away from explosions in slow motion while asking for your number.\n\n    •    New Layer Blend Modes\nBlend it like Beckham with Darker Color, Lighter Color, Vivid Light, Linear Light, Pin Light, Hard Mix and Divide.\n\n    •    Improvements\nSmoother, better, faster, stronger: 4.3 comes with loads of fixes and polish. Daring souls can now turn off undo/redo gestures.\n\nWe can't wait to spend hours Texting with you. And if you like it, you should put a review on it."},{"version_id":"831022931","version_name":"4.3.1","version_date":"2019-04-19 01:33:56.000 +0800","version_description":"A picture may be worth a thousand words, but sometimes you need a thousand words. Thousands of you asked for one vital addition to Procreate. We heard you, and we're thrilled to present it as the centrepiece of 2019's first major update: Text! You'll never be lost for words again.\n• Text and Typography\nAdd gorgeous editable typography to your illustration. Refine spacing and alignment with precision sliders, and rasterize the results for total control over the finish. The word is your oyster!\n\n• Import Fonts\nNeed to create something with a distinctive typeface? Easy. Just drag-and-drop your favorite fonts into Procreate and find your perfect type.\n\n• Share Layers\nWith new layer export options, you can share your layers as a folder full of PNG images, a multi-page PDF, or an animated GIF. Or, use full artworks for each frame by selecting them from the Gallery.\n\n• View Single Layer\nAll the single layers\n(All the single layers)\nNow put your hands up... and view the contents of a single layer in isolation by holding the Visibility checkbox.\n\n• Pressure Smoothing\nAll new pressure smoothing settings will help you create flawless strokes. So smooth under pressure they walk away from explosions in slow motion while asking for your number.\n\n• New Layer Blend Modes\nBlend it like Beckham with Darker Color, Lighter Color, Vivid Light, Linear Light, Pin Light, Hard Mix and Divide.\n\n• Improvements\nSmoother, better, faster, stronger: 4.3 comes with loads of fixes and polish. Daring souls can now turn off undo/redo gestures.\n\nWe can't wait to spend hours Texting with you. And if you like it, you should put a review on it."},{"version_id":"831153294","version_name":"4.3.2","version_date":"2019-05-01 10:21:39.000 +0800","version_description":"Our last massive update ushered in a bunch of major new features, and now even more improvements and refinements are joining them!\n\n• Rapidly transitioning between modes in Procreate kept crashing it. We've fixed that so you can keep crushing it instead.\n• You can now Insta-ntly share your layers as MP4. And Animated PNG helps you preserve the beautiful colors of your artwork. \n• If you're lucky enough to have a shiny new iPad Air or Mini, Procreate is fully compatible. \n• We've improved autocorrect and suggestion behaviour in text, because everybody ducking loves suggestive texts.\n• Text's friend Dictation just arrived! That's right: now you can dictate Text straight into Procreate. Go have a chat. Dictation is a great listener.\n• Now when you cut a text layer, selected or otherwise, it'll rasterise. \n• The Brush cursor has shaken off wallflower syndrome and is out of hiding.\n• Text layers are cheerfully flaunting their curves histograms.\n• When typing with a font that is missing glyphs, font fallback no longer outstays its welcome.\n• Undo/redo gestures have been re-added for Text mode, even when they're switched off globally.\n• Now you can drag (and drop) your TTC font files to the party.\n• Eyedropper was feeling a bit fuzzy, so we took it out for some fresh air and now it's using nearest neighbour interpolation for a crystal clear down-to-the-pixel visual display.\n• Duplicating groups when soloing now preserves every individual layer's visibility setting.\n• Transform and QuickShape animations were sluggish on 60Hz devices, so we've put a bit of spring in their step.\n• Our extremely outgoing Clipping Masks were showing up on empty layers. They've chilled out now.\n• Thumbnails of PSD exports now preserve flipping, which isn't rude unless fingers are involved.\n\nThank you so much for your support - we're thrilled to hear all your positive comments for the new Procreate Text and Typography. There's so much more to come."},{"version_id":"831176728","version_name":"4.3.3","version_date":"2019-05-07 03:34:25.000 +0800","version_description":"Please enjoy this small but perfectly-formed update as we continue to polish 4.3 to a luminous shine.\n\n* Liquify felt like wet cement on first generation iPad Pros. We have now moistened it. Pray we do not moisten it further.\n* Videos taken in portrait now create a suitable canvas size. Oh, we forgot to mention you could import videos. Surprise!\n* Transform interpolation methods now do as they're told, when they're told.\n* Although Tracking and Kerning are highly related it was pretty confusing for them to have the exact same name in French. Je suis désolé.\n\nWe love reading your reviews on the App Store, so don't be shy."},{"version_id":"831559308","version_name":"4.3.4","version_date":"2019-06-13 01:17:54.000 +0800","version_description":"This update contains fixes for locked layer behaviour, GIF insertion, Text rasterization, image resampling, and UK and Australian language localization.\n\n* Text on locked layers no longer rasterizes on ColorDrop, and locked layers behave much better in general\n* 'Insert a file' now allows insertion of GIFs\n* You can add Text to documents created from imported GIFs\n* Merging a layer with Select contents on it no longer causes a crash\n* We've improved UK and Australian English localization\n* Unnecessary resampling on transform flips has been fixed\n* Flipped PSD and Procreate thumbnails now look nicer\n\nWe've also fixed a few general crashes, and updated the Review button so it sends you to the App Store, as it should! Please try it out, and leave us a review."},{"version_id":"831783492","version_name":"4.3.5","version_date":"2019-06-29 06:03:08.000 +0800","version_description":"This update offers fixes to the importing of older documents, translation corrections, and solutions for assorted crashes.\n\n* Previously, scrubbing to clear a Text layer triggered crashes\n* Issues with editing QuickShapes with Simplified Undo disabled\n* Simplified Undo would not visually update Text layers until another action was performed\n* Loading Gallery Preview no longer causes intermittent crashes\n* Importing older Procreate documents from the Gallery occasionally produced blank layers\n\nPlease share your artwork with the hashtag #procreate, and share your thoughts by leaving us a review."},{"version_id":"832010050","version_name":"4.3.6","version_date":"2019-07-16 07:39:16.000 +0800","version_description":"This update contains stacks of fixes for stacks:\n\n* Duplicate an artwork within a Stack and watch the copy appear inside that Stack, where it belongs.\n* Prefer an elegantly minimal Stack? Trim it down by deleting files from it.\n\nOK. It was just two fixes. But we do love Stacks - stacks and stacks of reviews."},{"version_id":"832799894","version_name":"4.3.7","version_date":"2019-09-24 17:06:55.000 +0800","version_description":"You know how you heard there was going to be a big Procreate update? Well, this isn't it! \n\nInstead this little update will keep you fully compatible with iOS 13 until our major 2019 update arrives. While you wait for Procreate 5, please consider leaving us a review on the App Store."},{"version_id":"832943177","version_name":"4.3.8","version_date":"2019-09-28 01:45:21.000 +0800","version_description":"We love fixing problems for our loyal customers who've been with us since Procreate 2. Especially those of you who ended up with the old Pocket brush set causing a crash.  \n\nAlso the interface is no longer difficult to tap when in compact mode. \n\nNow we're heading back to beefing and polishing up Procreate 5. If you have some time please consider leaving us a review on the App Store!"},{"version_id":"833185714","version_name":"4.3.9","version_date":"2019-10-24 17:47:26.000 +0800","version_description":"This update includes small improvements to keep you going until Procreate 5 is complete. \n\n* Actions and Adjustment headings have been localized for everyone.\n* Share Untitled palettes once more.\n* Canvas Information has been tidied up.\n* You can now always edit your text style from the tap menu.\n* Text Baseline is once again operational.\n* Improved Gallery loading.\n\nWe're working hard on Procreate 5 - and your reviews keep us going!"},{"version_id":"833825779","version_name":"5.0","version_date":"2019-12-09 08:34:56.000 +0800","version_description":"This is the update you’ve been waiting for. Welcome to Procreate® 5, the biggest release we’ve ever given birth to. With hundreds of exciting new features and quality of life improvements we’re going to need that epidural, these forceps, and where are you going with those scissors?!\n\n• Animation Assist\nMaking its debut in Procreate® 5 is the all new Animation Assist. The easy to use and deceptively powerful animation tool. With fundamentals like onion skinning and instant playback, Animation Assist helps you create rich illustrative animations, animatics and looping GIFs to share with others.\n\n• A whole new way to paint\nPainting and drawing in Procreate 5 is a whole new experience. Pencils now feel more natural and organic. The new Artistic and Drawing brushes lay beautiful painterly textures. Your Apple Pencil affects your strokes in ways that feel totally delightful and infinitely controllable.\n\n• Brush Studio\nProcreate 5 introduces the Brush Studio with over 100 new settings for unparalleled customization. Crafting your own brush has never been easier with the new seamless textures generator. An expanded Drawing Pad sets you free to experiment. Save a reset point at any time and keep on refining.\n\n• ABR import\nFor the first time you can import your favorite Adobe® Photoshop® brushes into Procreate®. Imported Adobe® Photoshop® brushes will also paint faster in Procreate® 5 than they do in Photoshop®. lol.\n\n• Author cards\nShare your brushes and artworks impregnated with author information. Add a photo, add your name, and sign so everyone knows who’s the daddy.\n\n• Valkyrie, the next generation Graphics Engine\nThe new Valkyrie engine gives artists the most flexible and versatile painting system on iPad. If you want to make a glazed brush that wet mixes, has color dynamics, and also has wet edges with burnt edges? You can. And all with Procreate’s trademark performance.\n\n• Combine brushes\nWhen a mommy brush and a daddy brush love each other very much, they come together to create something new and beautiful. Just swipe two individual brushes and tap Combine to make a completely new and unique brush.\n\n• Color Dynamics\nCreate depth and vibrance by adding color variation to your brush strokes. Add stroke or stamp jitter for happy accidents, or precisely introduce a secondary color with pressure or tilt.\n\n• Color Companion\nSpeed up your workflow by dragging the Colors menu on to your canvas to spawn a baby Color Companion. Move the Color Companion so it’s out of the way or wherever it’s needed most.\n\n• Color History\nThe new Color History keeps your most recently used colors always within reach.\n\n• Color Profiles\nCreating prints, comics, and books from your Procreate artwork is better than ever. Viewing work through the lens of a specific ICC profile makes a smooth transition from pixel to paper.\n\n• Color Harmony\nChoose from Complimentary, Split Complimentary, Analogous, Triadic and Tetradic profiles. Each of these harmonies help you pick beautiful color combinations every time.\n\n• Clone adjustment\nSometimes you want to reproduce something exactly; just through the power of science. The new Clone adjustment lets you use any brush to paint with the contents of your layer. Hold to lock it into place.\n\n• Much more\nWe've also baked in a new create canvas system, a redesigned and improved interface, increased smudge sampling performance, improved memory handling, more Time-lapse recording options, improved GIF export and so much more.\n\nWe've laboured tirelessly on Procreate 5 and we couldn't be more proud. No presents please, just your App Store reviews."},{"version_id":"834018710","version_name":"5.0.1","version_date":"2019-12-21 05:22:45.000 +0800","version_description":"Now that Procreate 5 has been born and is out in the wild, it's time to deliver the afterbirth of life-giving bug fixes and improvements.\n\n* The annoying snap while using colors is no more\n* Importing CMYK PSDs with transparency got a whole lot more transparent\n* Rotating and inverting grains now works for Texturized grains as well\n* If you had backed up your swatches from Procreate 4 and tried to reimport them you received squat\n* Have no fear moving from Brush Studio straight to Gallery. The bug has been vanquished\n* Background colour is now cool with you jumping back to Gallery\n* Combine modes should remain same for primary and secondary brush (was showing normal and not updating for secondary)\n* Straya and Blighty localisations got some attention\n* Full screen wasn't particularly full screen with the painting toolbar hanging around, and also wouldn't return automatically. lol.\n* Back by popular demand, larger iPads now display all Liquify options and settings\n* Copying and Pasting while the Color Companion is open no longer harms your ability to Transform\n* Just because you reset your custom brush didn't necessarily mean you wanted to remove all your author information \n* Smudging with symmetry now smudges with symmetry\n* Custom brushes in the QuickMenu were replaced with Round Brush if you reset them\n* Fixed a crash when setting a Background Color\n* Gallery Preview got a good kick in the diaper to make it go faster\n* For pixel art people, we've fixed 1px brushes so that they paint at 1px\n* Lots of little ABR support improvements\n* Some lovely improvements to stroke end taper\n* Brush spacing is now the same as it was in Procreate 4\n\nWe haven't cut the umbilical cord on Procreate 5 just yet. Still a few more little surprises and bug fixes to come."},{"version_id":"834671539","version_name":"5.0.2","version_date":"2020-02-14 08:50:33.000 +0800","version_description":"This update comes in peace and brings you gifts of technology.\n\n* Fixed hiding an animation frame which caused a jump back to the first frame\n* Improved color accuracy and precision for your limited human visual capability\n* Little green men would eject during gentle smudge stroking.\n* Smudge was not sampling correctly for QuickShapes while using symmetry \n* Probing for the Orange Peel brush source ended in an uncomfortable crashing sensation\n* The unidentified flying Color Companion has been destroyed. \n* We have learned your languages for improved abductions. \n\nWe have successfully invaded your iPad and infested your world with fixes and improvements. Goodbye."},{"version_id":"835321455","version_name":"5.0.3","version_date":"2020-03-31 03:53:45.000 +0800","version_description":"Here are some fixes and improvements as part of your #ProcreateCarePack\n\n* Improvements to glazed brushes \"banding\" when painting with very low pressure \n* Time-lapse exports can be encoded in HEVC or MP4 on supported devices\n* Adonit styluses will work with Drawing Assist and after you picked a color\n* Apple Pencil tilt angles can now be modified throughout Brush Studio\n* Improved ABR import\n* DPI now exports with all image types\n* CMYK PSDs export correctly with groups\n* Chinese languages will now link to Chinese language handbook, support page, and Learn to Procreate videos \n* Specific special characters will no longer corrupt your artwork\n\nStay safe and grab all your other treats from http://procreate.art/carepack"},{"version_id":"835448676","version_name":"5.0.4","version_date":"2020-04-08 19:33:16.000 +0800","version_description":"We hope you're safe and finding peace in your art. To help you along on that road, here are some new fixes and improvements winging their way to you as part of the #ProcreateCarePack.\n\n* Fixed: the black background Clone Tool kept leaving behind cloned objects when using a glazed brush\n* Smoothed: artefacts and corrupted colors on glazed brushes and glazed smudge\n* Removed: crashes on import of PSDs with text layers\n\nAnd if you haven't already, treat yourself to the freebies and art challenges from http://procreate.art/carepack."},{"version_id":"835830896","version_name":"5.0.5","version_date":"2020-05-12 18:07:50.000 +0800","version_description":"Some more fixes and improvements to keep you powered up and feeling great. \n\n• You now have a charming new option to export HEVC animations. \n• Export delightful animations with transparent backgrounds using HEVC encoding. \n• If you have the majestic new 2020 iPad Pro, you can now create even more layers.\n• Drag and drop no longer allows you to crash and burn past your layer limits.\n• Animated GIF, PNG, and MP4 now import way better and make you feel good.\n\nKeep an eye out on our instagram channel. We're giving away artist-created coloring pages, skill-boosting live streams, and entries for the 2020 Art Prize open May 20!"},{"version_id":"836100210","version_name":"5.0.6","version_date":"2020-05-27 00:35:57.000 +0800","version_description":"Today you have some more goodies and document recovery improvements:\n\n• You can once again rearrange layers when you have reached your device layer limit\n• Painting with solo visibility on a Clipping Mask will no longer cause visual poop\n• Animated HEVC now only appears for devices that support this magnificent codec\n• Importing a PSD file will no longer duplicate text layers\n• If Procreate finds damaged artworks in your Gallery, it will magic them into a neat stack for you \n• Artworks that cannot be recovered successfully can now be exported and your Gallery will keep operating smoothly\n\nThis year's Art Prize theme is illusion and entries are now open. We can't wait to see yours! http://procreate.art/prize"},{"version_id":"836246918","version_name":"5.0.7","version_date":"2020-06-08 18:02:15.000 +0800","version_description":"We have a few important fixes for you today. Broken thumbnails no longer crash your Gallery and video import once again works. Thanks for your patience and especially to the artists that helped us figure out the crash issue."},{"version_id":"837104623","version_name":"5.0.8","version_date":"2020-07-31 06:39:37.000 +0800","version_description":"This update contains a fix for lag when returning to the Gallery and failure to load in some cases. \n\nA new button in the About section has appeared so that the artwork recovery will only begin when you request it. If Procreate finds any damaged artworks, they will be placed in a Recovered Artwork Stack for you. \n\nNow that you have a fully functioning Gallery, you're all set for what comes next…"},{"version_id":"837389517","version_name":"5.1","version_date":"2020-09-22 05:00:33.000 +0800","version_description":"Procreate 5X is here, packed with precision and reimagined features. It is another huge leap forward for creative professionals.\n\n• Pencil Filters\nBrush in image effects with your Apple Pencil. For the first time you can use any brush to paint in adjustments and effects exactly where you want them. Smudge your filter to create textured effects like you’ve never seen before. You can even erase or adjust the amount in realtime.\n\n• Gradient Map\nOne of the your biggest requests is here! Add a new dimension of color by mapping gradients across your value painting. Create your own custom gradients and insert as many knobs as you like, we won't judge.\n\n• All New Filters\nCreating incredible effects and dramatic finishes is easier than ever with a host of new filters and adjustments. There are huge improvements to essential filters like Noise and Blur, and amazing new creative possibilities with Glitch, Chromatic Aberration and more.\n\n• Reference Companion\nAlways keep your composition in focus while you paint in the details. Import a reference image that will stay by your side; ready to provide inspiration and colors.\n\n• FacePaint\nProcreate on your face! See your FacePaint update live and even play your animations. It’s not only for your fans, share your photos and videos with everybody. \n• Palette Capture & SwatchDrop\nCapture the colors around you with your camera or photos in your library. Fill your artwork with color by dropping swatches right onto your canvas. You can also import Adobe® ACO and ASE palette files. Why tho.\n\n• Transform \nMake beautiful compositions with precise new ways to move and scale your artwork. Accurately align objects to your canvas and other layers with new Snapping. Use the new Bounding Box Adjust to scale and stretch from any orientation. Transform with 100% accuracy using numeric entry.\n\n• Selection Color Fill\nAccelerate your workflow by drawing selections that automatically fill with color. Add or Remove with any selection tool to create sharp, vibrant shapes. Use Automatic selections to fill your artwork in all the right places.\n\n• Private Layer\nKeep a layer private so your Time-lapse is free from sketches, notes, nudes and reference images. \n\n• Scribble\nScribble gives you a whole new way to add text to your artwork, without ever having to put down your Apple Pencil. Name layers, change settings, and pick colors, but the best part is - your tool never needs to leave your hand.\n\n• QuickMenu Profiles\nFinger your way to success with QuickMenu profiles. With just a flick of your button, you can swap to tailored QuickMenus for sketching, coloring or finishing. \n\n• Blur Brushes\nEffortless blend colors with the new Blur settings in Brush Studio. Look out for Blend brushes in the Airbrushes set.\n\nProcreate® 5X also has:\nRedesigned Copy and Paste Menu\nCrop and Resize Snapping\nText Numeric Input\nNew Font Companion\niPadOS 14 Quick Launch Widget\nHEVC Time-lapse with alpha\nColor Profile fixes\nBrush Studio performance improvements\nAnimated Transforms\nNew Text Selection appearance\n\nWe hope you have as much fun with Procreate 5X as we did making it. And we can’t wait to get back to making whole new ways for you to create. Don’t forget to show us your FacePaint selfies and videos with #ProcreateFaces!"},{"version_id":"837931842","version_name":"5.1.1","version_date":"2020-09-26 02:50:50.000 +0800","version_description":"Procreate 5X is here, packed with precision and reimagined features. It is another huge leap forward for creative professionals.\n\nThis update includes support for 8th generation iPad and some additional fixes for PSD export with low alpha, playing Time-lapse on your face, transforming Text, Wet mix brushes with pencil filters and layer masks, Palettes from screenshots, and more.\n\n• Pencil Filters\nBrush in image effects with your Apple Pencil. For the first time you can use any brush to paint in adjustments and effects exactly where you want them. Smudge your filter to create textured effects like you’ve never seen before. You can even erase or adjust the amount in realtime.\n\n• Gradient Map\nOne of the your biggest requests is here! Add a new dimension of color by mapping gradients across your value painting. Create your own custom gradients and insert as many knobs as you like, we won't judge.\n\n• All New Filters\nCreating incredible effects and dramatic finishes is easier than ever with a host of new filters and adjustments. There are huge improvements to essential filters like Noise and Blur, and amazing new creative possibilities with Glitch, Chromatic Aberration and more.\n\n• Reference Companion\nAlways keep your composition in focus while you paint in the details. Import a reference image that will stay by your side; ready to provide inspiration and colors.\n\n• FacePaint\nProcreate on your face! See your FacePaint update live and even play your animations. It’s not only for your fans, share your photos and videos with everybody. \n• Palette Capture & SwatchDrop\nCapture the colors around you with your camera or photos in your library. Fill your artwork with color by dropping swatches right onto your canvas. You can also import Adobe® ACO and ASE palette files. Why tho.\n\n• Transform \nMake beautiful compositions with precise new ways to move and scale your artwork. Accurately align objects to your canvas and other layers with new Snapping. Use the new Bounding Box Adjust to scale and stretch from any orientation. Transform with 100% accuracy using numeric entry.\n\n• Selection Color Fill\nAccelerate your workflow by drawing selections that automatically fill with color. Add or Remove with any selection tool to create sharp, vibrant shapes. Use Automatic selections to fill your artwork in all the right places.\n\n• Private Layer\nKeep a layer private so your Time-lapse is free from sketches, notes, nudes and reference images. \n\n• Scribble\nScribble gives you a whole new way to add text to your artwork, without ever having to put down your Apple Pencil. Name layers, change settings, and pick colors, but the best part is - your tool never needs to leave your hand.\n\n• QuickMenu Profiles\nFinger your way to success with QuickMenu profiles. With just a flick of your button, you can swap to tailored QuickMenus for sketching, coloring or finishing. \n\n• Blur Brushes\nEffortless blend colors with the new Blur settings in Brush Studio. Look out for Blend brushes in the Airbrushes set.\n\nProcreate® 5X also has:\nRedesigned Copy and Paste Menu\nCrop and Resize Snapping\nText Numeric Input\nNew Font Companion\niPadOS 14 Quick Launch Widget\nHEVC Time-lapse with alpha\nColor Profile fixes\nBrush Studio performance improvements\nAnimated Transforms\nNew Text Selection appearance\n\nWe hope you have as much fun with Procreate 5X as we did making it. And we can’t wait to get back to making whole new ways for you to create. Don’t forget to show us your FacePaint selfies and videos!"},{"version_id":"838036201","version_name":"5.1.2","version_date":"2020-10-23 00:03:35.000 +0800","version_description":"This update includes some important fixes for Time-lapse and stability.\n\n- Fixes for Time-lapse colors, color profiles on non-HEVC compatible devices, and export compatibility \n- Recolor has been added to QuickMenu while we work on a new home\n- Reduced lag when painting with a Reference Image\n- Holding the Transform button will pinch zoom the layer contents\n- PDF export for CMYK color profiles\n- Unable to enter Background color values with the keyboard\n- Improvements to Pencil filters and layer mask painting\n- Improvements for Arabic user interfaces\n\nThanks for your feedback on Recolor. We're listening and we love that you care."},{"version_id":"838406875","version_name":"5.1.3","version_date":"2020-11-04 00:49:53.000 +0800","version_description":"This update includes fixes for crashing on launch and iPad Air 4 compatibility.\n\n- Gallery scrolling outside of screen size on Air 4\n- Selection Color Fill will no longer use the reference layer's opacity and hidden state\n- Time-lapse stability fixes\n\nMore 5X polishes coming soon!"},{"version_id":"839215034","version_name":"5.1.4","version_date":"2020-11-18 01:35:26.000 +0800","version_description":"Just popping in with some fixes for painting with the maximum number of layers. Also some polishes including:\n\n- One-shot animation preview displays correctly\n- JPEG can have non-standard RGB profiles embedded\n\nDon't forget to share what you love making with #Procreate."},{"version_id":"839747745","version_name":"5.1.5","version_date":"2020-12-22 08:07:06.000 +0800","version_description":"New features:\n- You can now change color profiles after you have created your Canvas. \n- You can now add Layer and Pencil Filters to QuickMenu. \n- New and improved Recolor. Begin by ColorDropping and then tap Continue Filling with Recolor in the Notification bar and away you go! \n\nBug fixes:\n- Full Keyboard Access won't cause Toolbars to become unresponsive. \n- Hold Duration works again!\n- GIFs no longer change background dimensions when exported. \n- FacePaint recordings won't silently fail, and you can even record without audio now. \n- You can now dismiss your Gradient Map menu without causing the app to freeze. \n- QuickMenu won't be invoked by Apple Pencil when set to Touch only. \n- Fix for Selection Color Fill locking up after undo. \n- You can now SwatchDrop from the Floating Color Companion without rearranging your swatches. \n- Performance improvements for Transform on large canvases. \n- Transform Fit to Screen behaviour with Magnetics toggled on is fixed. \n- Air 2 Selection improvements."},{"version_id":"841224462","version_name":"5.1.6","version_date":"2021-04-29 05:16:34.000 +0800","version_description":"Just dropping in with an update, because we noticed that new installations of Procreate didn't have the correct default brushes. \nDid you see our announcements for Procreate 5.2? Check out a preview of what's coming next: http://procre.at/newdimension"},{"version_id":"842106652","version_name":"5.1.7","version_date":"2021-05-12 08:44:03.000 +0800","version_description":"This update fixes some brush sets that could not be opened, and after updating with that issue, a crash opening artworks. \n\nDid you see our announcements for Procreate 5.2? Check out a preview of what's coming here: http://procre.at/newdimension"},{"version_id":"842342074","version_name":"5.1.8","version_date":"2021-05-28 08:59:32.000 +0800","version_description":"This update has performance improvements and even more layers for the new M1 iPad Pros."},{"version_id":"845335715","version_name":"5.2.2","version_date":"2021-11-18 09:24:01.000 +0800","version_description":"In this update you can now add a background to Page Assist, which is great for lined or textured paper sketchbooks. You can also tap 3D materials for helpful actions like Fill and Clear. There's also some fixes for you. \n\n- Thumbnails should no longer show corrupted when you fast scroll in a full Gallery.\n- Your favorite Brushes won't override when using QuickMenu.\n- Hidden layers won't show in Layer Select. \n- You can now easily Apply your change in Gradient Maps. \n- Drawing with your finger with Dynamic Brush Scaling off won't cause strange shapes at the beginning of your stroke.  \n- Undo/Redo is a little more discreet with the removal of the progress bar. \n- No more crashes when merging Text layers."},{"version_id":"9823074","version_name":"1.6.3","version_date":"","version_description":""}]