[{"version_id":"589283590","version_name":"3.410","version_date":"","version_description":""},{"version_id":"821672201","version_name":"4.1.4","version_date":"2017-04-21 09:43:34.000 +0800","version_description":"This is not only an update - it’s the all new Maps 3D.<br>Based on all your input, we decided to stop messing around with details, we started over from scratch. <br>And the good thing: it’s a free upgrade for everybody!<br><br>The most important features coming with our relaunch:<br><br>– Completely new design and philosophy of usage - it’s all about the map. Everything else appears on top of it.<br>Only one well structured menu for all your tools. There is a color scheme guiding through the app distinguishing map, track or waypoint related screens.<br>– Unlimited recording time and track number<br>– Data view with better readability including a new data field for the remaining time along track.<br>– New position marker in the map: a blue arrow always points in your direction of traveling.&nbsp;<br>– New waypoint tool: open it with a long press or via the menu.<br>– Tour start and end points are marked in the map and can be tapped on to open the track information screen.<br>– New list behavior: the lists for maps, tracks and waypoints can be used to show any item directly in the map.  Via the info symbol you open the information screen.<br>– Choose the type of online map directly in map view.<br>– Tap the compass to realign the map to the north.<br>– To increase the contrast between the map and your track, you can adjust the map brightness.&nbsp;<br>– Change the transparency of the track display in the settings.<br>– Small arrows displayed on the track indicate the direction of your route<br>– Use your photo library to add images to waypoints<br>– When loading maps the preview shows the matching map type<br>– Export individual tracks and routes directly to iCloud Drive<br>– New options to import GPX tracks.<br><br>* * * * * If you’d like to support us, please take a minute to update your review for this new version too. Positive reviews in iTunes enable us to continue producing further free updates like this one!<br><br>Thank you for using Maps 3D!"},{"version_id":"821672201","version_name":"1.0.2","version_date":"","version_description":""},{"version_id":"826582770","version_name":"5.2","version_date":"2018-09-26 07:32:45.000 +0800","version_description":"– Adjustments for the new iPhone XS, iPhone XS Max and iPhone XR<br>– Choose from 8 different waypoint colors<br>– Waypoints are now stored in your iTunes backup<br>– Customizable terrain shadowing<br>– New online search module<br><br>* * * * * If you’d like to support us, please take a minute to update your review for this new version too. Positive reviews in iTunes enable us to continue producing further free updates like this one!<br>The movingworld team is working constantly to improve Maps 3D. Any questions or suggestions for improvement? We'd love to hear them! Just e-mail them to us at support@movingworld.de.<br><br>Thank you for using Maps 3D!"},{"version_id":"838279745","version_name":"6.2","version_date":"2020-10-27 16:25:39.000 +0800","version_description":"– Adjustments to iOS 14<br>– Editable text field for track description<br>– Bigger line-of-sight in 3D<br>– Tracks keep their color<br>– Remembering current track in map<br>– New setting to show all waypoints from all maps at once<br>– New slider in the profile view to simulate positions on the track. When moving the map the slider moves accordingly.<br>– Minor bug fixes and improvements<br><br>* * * * * If you’d like to support us, please take a minute to update your review for this new version too. Positive reviews in iTunes enable us to continue producing further free updates like this one!<br>The movingworld team is working constantly to improve Maps 3D. Any questions or suggestions for improvement? We'd love to hear them! Just e-mail them to us at support@movingworld.de.<br><br>Thank you for using Maps 3D!"}]