[{"version_id":"813456396","version_name":"3.5.0","version_date":"2015-09-30 07:13:33.000 +0800","version_description":"[+] updated for iOS9: resolved a problem where the app would crash after re-launch\n[+] added access to member profile (most membership types)\n[+] new membership options & features for mobile card members\n[+] updated styling and sign-in options"},{"version_id":"815317052","version_name":"3.5.1","version_date":"2016-02-05 03:00:27.000 +0800","version_description":"Bug fixes and stability improvements, including:\n[+] iOS9: resolved a problem where the app hang after navigating to driving directions\n[+] resolved a problem where the app would hang after saving a profile update for some members\n[+] resolved minor layout and display issues with category filters\n[+] resolved minor layout and display issues with search toolbar after app re-launch"},{"version_id":"816405749","version_name":"4.0.0","version_date":"2016-06-02 00:52:49.000 +0800","version_description":"+ new home view includes relevant hot deals, nearby locations and new offers\n+ adding ability to track favorite offers for quick access\n+ udpated layout support for larger iPhone 6 displays\n+ bug fixes and stability improvements"},{"version_id":"817643764","version_name":"4.0.1","version_date":"2016-06-09 03:28:06.000 +0800","version_description":"Bug fixes"},{"version_id":"818047881","version_name":"4.0.2","version_date":"2016-07-09 02:06:20.000 +0800","version_description":"bug fixes to improve \"Home\" view stability"},{"version_id":"818118851","version_name":"4.0.3","version_date":"2016-07-20 05:32:29.000 +0800","version_description":"+ improved layouts for larger device (iPhone6+ and iPad) screens"},{"version_id":"818274199","version_name":"4.0.4","version_date":"2016-07-29 01:52:26.000 +0800","version_description":"resolves an issue affecting devices running iOS 9.3.2 (members were prompted to sign in each time the app was launched)"},{"version_id":"819082068","version_name":"4.0.5","version_date":"2016-10-13 00:25:35.000 +0800","version_description":"improved app-handling for notifications\nresolved a handful of minor bugs"},{"version_id":"820158348","version_name":"4.0.6","version_date":"2017-01-17 01:37:15.000 +0800","version_description":"refined home and list view layouts\nresolved a minor bug in the notification timeline"},{"version_id":"821447125","version_name":"4.0.7","version_date":"2017-04-02 23:01:35.000 +0800","version_description":"resolved a bug in the menu for members with in-app upgrade options"},{"version_id":"827737130","version_name":"5.0.1","version_date":"2018-07-04 01:39:26.000 +0800","version_description":"Along with a refreshed look, this latest version includes a suite of new features to help you find what you're looking for. Direct access to category selections are now available from the main navigation. Available content can be filtered using selections that are now located atop each list or map. Additional filter options (such as mealtime or price) and search radius are now under your control.\nUnder the hood, we've also made a whole lot of improvements. The app operates seamlessly with or without Location Services enabled. Merchant websites are launched in your phone browser. App performance has been optimized and all app interfaces have been updated for accessibility!"},{"version_id":"827768500","version_name":"5.0.2","version_date":"2018-07-06 08:54:00.000 +0800","version_description":"Along with a refreshed look, this latest version includes a suite of new features to help you find what you're looking for. Direct access to category selections are now available from the main navigation. Available content can be filtered using selections that are now located atop each list or map. Additional filter options (such as mealtime or price) and search radius are now under your control.\nUnder the hood, we've also made a whole lot of improvements. The app operates seamlessly with or without Location Services enabled. Merchant websites are launched in your phone browser. App performance has been optimized and all app interfaces have been updated for accessibility!"},{"version_id":"827984158","version_name":"5.0.3","version_date":"2018-07-27 00:50:09.000 +0800","version_description":"We're working hard to make sure Passport Mobile works great for everyone! This minor update includes bug fixes to improve app stability and avoid some pesky app-crashes."},{"version_id":"828107119","version_name":"5.0.4","version_date":"2018-08-05 04:29:31.000 +0800","version_description":"Continued updates to make sure Passport Mobile works great for everyone! This minor update includes bug fixes to support new members using an activation code at sign in."},{"version_id":"828334430","version_name":"5.1","version_date":"2018-10-04 02:02:17.000 +0800","version_description":"We're excited to announce a much-improved search feature that presents intuitive quick-access suggestions (locations, categories, restaurants and more) while you type! This update also includes handling for captive Wi-Fi situations and other minor bug fixes."},{"version_id":"828898482","version_name":"5.1.1","version_date":"2018-10-14 04:31:41.000 +0800","version_description":"We're not in Kansas anymore! This update fixes a bug in our most recent 5.1 release where the map could erroneously reset the search location to central Kansas."},{"version_id":"829994095","version_name":"5.2.0","version_date":"2019-03-12 01:36:17.000 +0800","version_description":"We want your Passport membership experience to be excellent! With that in mind, this update fixes a number of pesky bugs: improving app stability and resolving some intermittent issues that caused broken images and sign-outs. This update also adds some new features for better integration with our opt-in emails and notifications."},{"version_id":"833084415","version_name":"5.2.2","version_date":"2019-10-10 06:00:58.000 +0800","version_description":"We want your Passport membership experience to be excellent! This update resolves a collection of layout quirks affecting devices with iOS 13 to avoid elements like the navigation, search toolbar and others from being partially cropped out of view."},{"version_id":"833185298","version_name":"5.3.1","version_date":"2019-10-16 21:38:44.000 +0800","version_description":"We continuously update the Passport Mobile app as we want your membership experience to be excellent! This update resolves some contrast issues in iOS 13 dark mode and includes an updated list view layout tailored for ease-of-use."},{"version_id":"833632900","version_name":"5.3.2","version_date":"2019-11-16 18:38:08.000 +0800","version_description":"We continuously update the Passport Mobile app as we want your membership experience to be excellent! This update add some visual polish to our recently-updated list view layout and resolves a few bugs and quirks to make things easier to access."},{"version_id":"834109079","version_name":"5.4.0","version_date":"2019-12-22 23:15:49.000 +0800","version_description":"We've redesigned the Home view to provide quick visibility to the newest additions in each category while also allowing for faster app-launches."},{"version_id":"834218578","version_name":"5.4.1","version_date":"2020-01-04 09:49:57.000 +0800","version_description":"Starting 2020 right: fixing some typos for the New Year!"},{"version_id":"836749561","version_name":"5.5.2","version_date":"2020-07-09 00:13:32.000 +0800","version_description":"We've updated the search toolbar for improved clarity and ease-of-use when searching for keywords or updating your search location. We also fixed some subtle bugs affecting the list results. Enjoy!"},{"version_id":"840216917","version_name":"5.7.0","version_date":"2021-01-28 03:57:54.000 +0800","version_description":"Adding a new filter option to help you shop local! Use the new 'Local' filter to show only nearby bricks-and-mortar locations honoring your Passport membership."},{"version_id":"840610813","version_name":"5.7.2","version_date":"2021-02-25 02:14:05.000 +0800","version_description":"Adding a few new filter options to help you find good eats! Use the new 'Upscale', 'Family-Friendly' and 'Quick Serve' dining-style filters to show nearby restaurants honoring your Passport membership. Additionally, upgrading the Notifications tab with improved functionality and fixing a few layout quirks affecting some devices."},{"version_id":"840856509","version_name":"5.7.5","version_date":"2021-03-13 01:40:31.000 +0800","version_description":"This update corrects some layout quirks in the upper search & filter icon toolbar area for improved legibility and usability."},{"version_id":"842410811","version_name":"5.7.6","version_date":"2021-05-29 04:45:04.000 +0800","version_description":"Accessibility Focus: improve the luminosity for various elements to improve visibility, resolve some bugs with Swipe focus within the app when VoiceOver is enabled"},{"version_id":"842507003","version_name":"5.7.7","version_date":"2021-06-08 20:12:08.000 +0800","version_description":"Accessibility Focus: update to VoiceOver Swipe interactions with primary navigation, resolving a problem where 'Saved' and 'More' tabs were inaccessible when 'View Offers' is expanded."},{"version_id":"843139053","version_name":"5.7.10","version_date":"2021-07-17 08:07:54.000 +0800","version_description":"Bugfix in Notification view: notifications are now correctly linked to curated collections, etc. Also, updated some controls with improved contrast to meet accessiblity guidelines."}]