[{"version_id":"15945054","version_name":"2.6","version_date":"2013-08-14 23:39:43.000 +0800","version_description":"Another HUGE Update! Seriously check out these new features! (and many more yet to come).<br><br># New photo sizes option! Choose from Square, Landscape or Portrait. Some people prefer Square others like the traditional Portrait and Landscape sizes. So we let you choose. We also made the size of the final image bigger so they look great when you email, save or share to facebook and twitter. The photo you see when adding tattoos is zoomed out so you can see the entire photo in a small place.<br><br># Instagram support! We found that so many of our users were posting their new tattoo'd photos to Instagram that we should help them out a bit and add Instagram support to our save menu. Ohh and while we were add it, how about a new save menu? Now drops from the top and takes up very little space on your iPhone. <br><br># Eraser Upgrade - We upgraded the eraser so it's easier than ever. Now you can choose the size of your eraser and we enhanced how it functions. You can erase even the smallest tattoos with ease and more accuracy when you combine the new zoom functionality.<br><br># Enhanced Zoom - The zoom is now calculated to the size of that tattoo on the screen. So if you have a placed a tattoo and made it really small, you can still zoom in and see if full size. Fine tuning tattoos just keeps getting easier. <br><br># Information / Help Library - Want to learn how to master Tattoo You? Know what tools do what? Check out our new information library which contains information on every button, process and tool. <br><br># Tattoo Type Selector - Updated so it no longer take over the whole screen, so it's much smaller, but still just as functional. Easily switch between tattoo types.<br><br># Fixed a bug where once you shared an image via email, you were no longer able to change tattoo types or open our in app store.<br><br># Added in app support to view all of Appdicted apps and download the ones you want, all without ever leaving Tattoo You. Seriously if you like adding Tattoos to your photos, you'd probably really enjoy trying on a new hairstyle as well. <br><br># Fixed the front facing camera issue where it was not loading the whole photo.<br><br># Fixed the freezing issues some users would experience.  <br><br># Other small tweaks, enhancements and bug fixes<br><br>Questions? Comments? Want to thank us for putting in 18hr days for the past month? <br><br>Twitter @Appdicted<br>support@appdicted.com<br>www.appdicted.com<br><br>Please rate and review this release so we know you like the direction we are taking this app. <br>So please even if you have reviewed us before, review again. We strive to make it the best Tattoo App ever made and will keep working long hours to keep it the best.<br><br>A HUGE thank you to all of our fans, friends and family for your support!"},{"version_id":"813534745","version_name":"3.0.3","version_date":"","version_description":""},{"version_id":"813793082","version_name":"3.0.4","version_date":"2015-10-20 23:05:41.000 +0800","version_description":"This app has been updated by Apple to display the Apple&nbsp;Watch app icon.<br><br>#Fixed the issue when \"Type a Tattoo\" would cause the app to crash in iOS 9<br><br>Need help?<br>support@appdicted.com"},{"version_id":"824466991","version_name":"3.0.4","version_date":"2015-10-20 23:05:41.000 +0800","version_description":"This app has been updated by Apple to display the Apple&nbsp;Watch app icon.<br><br>#Fixed the issue when \"Type a Tattoo\" would cause the app to crash in iOS 9<br><br>Need help?<br>support@appdicted.com"},{"version_id":"841396559","version_name":"3.0.4","version_date":"2015-10-20 23:05:41.000 +0800","version_description":"This app has been updated by Apple to display the Apple&nbsp;Watch app icon.<br><br>#Fixed the issue when \"Type a Tattoo\" would cause the app to crash in iOS 9<br><br>Need help?<br>support@appdicted.com"}]