[{"version_id":"816013657","version_name":"6.7","version_date":"2016-02-04 21:03:14.000 +0800","version_description":"Responding to some valuable customer feedback:<br><br>The month side marker is back! To turn it on click the settings cog on the bottom toolbar and press the Month Marker switch.<br><br>Reinstated the 4 weeks on 4 weeks off Rota preset.<br><br>Some larger updates are in the pipeline, thank you for the support."},{"version_id":"816386051","version_name":"6.8","version_date":"2016-02-16 09:41:18.000 +0800","version_description":"Added localizations for US, Canada and Australia.<br><br>Some minor bug fixes.<br><br>A larger update with some brand new functionality is being worked on."},{"version_id":"816889758","version_name":"7.0","version_date":"2016-04-13 20:39:54.000 +0800","version_description":"Use AirDrop to instantly share your rotas and shift schedules with nearby iOS devices.<br><br>Ensure AirDrop is setup and tap the far left action button on the bottom toolbar."},{"version_id":"818266691","version_name":"7.3","version_date":"2016-07-26 05:14:49.000 +0800","version_description":"Fixed issues with the calendar event/appointment details table.<br><br>The event details table at the bottom where events can be viewed and selected would occasionally glitch, resulting in a blank table or weird behaviour.<br><br>This has now been fixed, thank you to some valuable help from customers who were experiencing the issue.<br><br>Other minor bugs have also been fixed and more features are in the pipeline.<br><br>If you would like to make suggestions or report issues please connect via my Facebook page which I keep updated with news and what I am currently working on:<br><br>www.facebook.com/jrwstudio"},{"version_id":"824233299","version_name":"7.4","version_date":"2017-12-19 15:59:23.000 +0800","version_description":"Thank you for using Rota Calendar this update brings iOS 11 and iPhone X support.<br><br>As always, all feedback and suggestions are noted down and work has started on some new features, enhancements and minor tweaks. Some highlights include: optional dividers between months, exporting shifts as events to other calendars and improvements to the shift marker editing workflow. <br><br>Please Note: Compatibility with iOS 8 has been dropped and from this update onwards the minimum supported version is iOS 9."},{"version_id":"825584501","version_name":"7.4.2","version_date":"2018-01-10 11:58:45.000 +0800","version_description":"Thank you for using Rota Calendar this update is intended to push through some App Store screen shot changes."}]