[{"version_id":"814813668","version_name":"2.0.4","version_date":"2015-12-14 19:53:30.000 +0800","version_description":"- several crashes fixed<br>- usability improvements"},{"version_id":"815401516","version_name":"2.0.9","version_date":"2016-01-15 07:58:06.000 +0800","version_description":"Several bugs and crashes fixed<br>Interface improvements"},{"version_id":"815933207","version_name":"2.0.11","version_date":"2016-01-20 21:53:46.000 +0800","version_description":"Several bugs and crashes fixed<br>Interface improvements"},{"version_id":"816450953","version_name":"2.0.14","version_date":"2016-02-28 06:56:26.000 +0800","version_description":"No More Single Session / Multi Session in UI<br>Minimum rank score is at most 1650+<br>During a Local Play game, the ticket validation animation wil not play any sound and be more discreet<br>Better message when running out of time<br>Better game list filters' tooltips<br>On tablets and phones, figures on the cards are always visible<br>Achievements recording fixed<br>Chat messages are not displayed twice anymore<br>Solo, Online, Local and Pass-and-play buttons work on phones<br>Crashes fixed"},{"version_id":"816792304","version_name":"2.0.15","version_date":"2016-03-22 06:47:38.000 +0800","version_description":"Local Play has been completely reworked. <br>Playing with other devices over Wifi network works much better<br>Disconnections are easily recoverable<br>Creating a game works on all devices<br>On iOS devices, you can play over Bluetooth <br>Invitation's first player setting has been fixed and will not crash the app anymore<br>The first player is randomly choosen by default for pass-and-play, local and solo games<br>The tooltip of the Instant Bot hot-swap switch is now correct<br>Swiss : Error message when trying to claim a double route in a 2 players game should say the minimum nb of players is 3"},{"version_id":"817042624","version_name":"2.1.0","version_date":"2016-04-23 09:31:41.000 +0800","version_description":"• New content: the Nordic Countries board is now available as an in-app purchase. And it’s a vertical map. More maps to come in 2016!<br>• New Achievements are available: be the first one to accomplish them!<br>• Bug fix: Achievements are now saved properly. Don’t hesitate to re-accomplish them!<br>• Various other bug fixes and user interface enhancements."},{"version_id":"817343431","version_name":"using simultaneously 46 old and 19 new destinations!-          The Big Cities of Europe","version_date":"","version_description":""},{"version_id":"817343431","version_name":"2.1.1","version_date":"2016-05-11 06:14:43.000 +0800","version_description":"When 2 players have the same final score, the tie breaker now checks the number of tickets completed<br>Joining a Local Game from a Windows Machine works better<br>Claiming a ferry will not leave the card chooser open (Nordic Countries)<br>iOS: Fixed the crash when clicking the 'restore purchases' button<br>SantaBot added on Nordic Countries<br>Hotswap timeout error message will not pop up anymore when all players withdraw from a game<br>And other bug fixes"},{"version_id":"817366245","version_name":"2.2.0","version_date":"2016-05-26 11:23:56.000 +0800","version_description":"Rediscover the Europe map in Ticket to Ride with Europa 1912 Destinations <br>In this new Ticket to Ride update, you will find the classic Europe board enhanced with 3 new variants.<br>------------------------------------------------------------------------------------------------------------------------<br><br>For reminder, the Europe expansion is the adaptation of the board game Ticket to Ride: Europe. This game integrates the concept of tunnels and ferries and is the only one of the Ticket to Ride collection to implement the train stations feature.<br>Train stations can be built on any empty city to gain access to one route of another player’s network at game end, for the purpose of completing your Destination Tickets.  <br>In a nutshell, Europe is a very strategic board and it now includes new content.<br>------------------------------------------------------------------------------------------------------------------------<br><br>Europa 1912 Destinations is inspired from the original mini-expansion Europe 1912. It will enable you go deeper in the game thanks to 55 new objectives spread across 3 new variants:<br>-          The Extended Version using simultaneously 46 old and 19 new destinations!<br>-          The Big Cities of Europe, which connects only the 9 biggest cities of Europe!<br>-          The Mega Europe, which uses all of the 101 cards!<br>------------------------------------------------------------------------------------------------------------------------<br><br><br>Europa 1912 Destinations are be integrated with Europe map:<br>-          You can get this new content bundled with the Europe map.<br>-          If you already own Europe, you will get access to Europa 1912 Destinations for free just by upgrading your application.<br><br>Jump in the bandwagon!"},{"version_id":"817588482","version_name":"2.2.1","version_date":"2016-06-01 22:00:46.000 +0800","version_description":"Bug fix : 1912 variants for Europe are now properly available to anyone who owns Europe"},{"version_id":"817720284","version_name":"2.2.2","version_date":"2016-06-13 12:44:23.000 +0800","version_description":"- There was a serious bug in the rank computation. It’s fixed and from now on players who left get a rank score penalty<br>- It’s now possible to find offline DoW players<br>- In 1912, Paris-Angora is worth 17 points, not 13<br>- 1912 Big Cities was missing its bonus for the longest path<br>- In Nordic Countries games, discarded tickets do not remain in the game anymore<br>- Stations are now visible when you claim a city on Europe 1912 Big Cities<br>- And some UI improvements"},{"version_id":"817885623","version_name":"2.2.3","version_date":"2016-06-24 22:09:17.000 +0800","version_description":"Fix compatibility with iOS version older than 7.0<br>On 1912 Big Cities of Europe, there is no Bonus. Adding it in 2.2.2 was wrong."},{"version_id":"817956162","version_name":"2.2.4","version_date":"2016-07-01 21:22:18.000 +0800","version_description":"Fixed a crash on Nordic Countries"},{"version_id":"818022273","version_name":"2.3.0","version_date":"2016-09-01 08:12:53.000 +0800","version_description":"- New map: Pennsylvania! A new board with a tactical Stock Shares system, and specific 2-player rules. Adding a new dimension to your strategy, it should completely renew your game experience!<br>- More achievements to complete, that will make you master the Stock Shares system.<br>- Various bug fixes"},{"version_id":"819029923","version_name":"2.3.1","version_date":"2016-10-19 15:59:12.000 +0800","version_description":"- Bug fixes and various improvements"},{"version_id":"819383267","version_name":"2.4.0","version_date":"2016-12-20 11:07:34.000 +0800","version_description":"- New map: Germany! A new board that will test your ability to craft long term strategies while also countering your opponents’ plans!<br>- More achievements to complete.<br>- Improved user interface to start games faster from the main screen.<br>- New More Games section.<br>- Various bug fixes."},{"version_id":"820469173","version_name":"2.4.1","version_date":"2017-01-10 16:24:40.000 +0800","version_description":"Works again on iOS 7.0 and newer."},{"version_id":"823710877","version_name":"2.4.2","version_date":"2017-09-28 12:06:46.000 +0800","version_description":"Added Spanish translation<br>Added Italian translation<br>Bugfixes among which:<br>- the Quilon-Calicut ferry route can now be claimed with one locomotive and a color card<br>- the same ticket cannot be drawn twice anymore on Germany"},{"version_id":"823847912","version_name":"2.4.3","version_date":"2017-10-05 20:39:28.000 +0800","version_description":"Added Spanish translation<br>Added Italian translation<br>Bugfixes among which:<br>- the Quilon-Calicut ferry route can now be claimed with one locomotive and a color card<br>- the same ticket cannot be drawn twice anymore on Germany"},{"version_id":"824118434","version_name":"2.5.0","version_date":"2017-11-15 09:42:25.000 +0800","version_description":"Discover the brand-new Ticket to Ride map, the United Kingdom, and the addition of a new game mechanic, technology! Relive the history of the railway!<br>Special rules for locomotives.<br>11 new technology cards to improve your wagons and 5 others to go even further.<br>Develop technologies to create routes with more than two wagons in England.<br>Create a special route between New York and Southampton that doesn't need any technology cards."},{"version_id":"824831382","version_name":"2.5.2","version_date":"2017-11-27 09:40:22.000 +0800","version_description":"Fix the bug of the opening of Helpshift within the application.<br>Fix the bug of the online Germany map game.<br>Fix the location of the share button to make it visible.<br>Fix the bug of the loco card still displayed when fast drawing from the pile.<br>Remove the button opening the techno dialog box on end of game screen.<br>Add the english fallback when a text is missing in the wanted language."},{"version_id":"825074588","version_name":"2.5.3","version_date":"2017-12-05 08:34:11.000 +0800","version_description":"We have improved the following points in order to improve your gaming experience:<br>• Fix IOS 6 launch crash<br>• Fix compatibility with Germany online game on 2.4.3"},{"version_id":"825272422","version_name":"2.5.4","version_date":"2017-12-12 11:14:15.000 +0800","version_description":"Discover the new Christmas look for Ticket to Ride !"},{"version_id":"825824824","version_name":"2.5.6","version_date":"2018-02-13 08:05:47.000 +0800","version_description":"To offer you a better game experience, we have improved the user interface and fix bugs in the base game app and in some in-apps :<br>Fix the incompatibility with MacOS 10.11<br>Add a validated account checking feature when going online"},{"version_id":"825998401","version_name":"2.5.7","version_date":"2018-02-15 08:28:37.000 +0800","version_description":"Fix the crash when claiming a station on Europe maps"},{"version_id":"826153208","version_name":"2.5.8","version_date":"2018-03-05 13:38:56.000 +0800","version_description":"Fix crash when a user try to resume a finished game."},{"version_id":"829523302","version_name":"2.5.11","version_date":"2018-12-19 10:25:21.000 +0800","version_description":"New in-app purchase: France map<br>Score animation and cards animations enhancements"},{"version_id":"829746668","version_name":"2.5.12","version_date":"2018-12-24 15:18:45.000 +0800","version_description":"Use the safe zone to display properly on iPhone X<br>and several usability improvements"},{"version_id":"829781862","version_name":"2.5.13","version_date":"2018-12-31 08:21:07.000 +0800","version_description":"-IOS Safe area on Iphone X is now usable<br>-Belgium flag is now properly displayed. We apologize for this oversight<br>-Scoring animation can be disabled or sped up via the option menu<br>-Sharing your result at the end of the game do not crash the game anymore<br>-You can now disable the repetitive prompt when you’ve completed all your destination tickets.<br>-We’ve reduced Quit and rematch buttons size in order to not overlap opponents’ hand button<br>-Other minor fixes"},{"version_id":"829856147","version_name":"2.5.14","version_date":"2019-01-09 11:10:49.000 +0800","version_description":"Fix the crash when entering the Shop<br>Fix the crash when going online with an unconfirmed e-mail address<br>Show the message “Not your turn” when trying to draw a card in an online game"},{"version_id":"830092826","version_name":"2.5.15","version_date":"2019-01-29 12:26:09.000 +0800","version_description":"Fix the final scores animation for the board Germany"},{"version_id":"830415177","version_name":"2.6.1","version_date":"","version_description":""},{"version_id":"831102424","version_name":"2.6.2","version_date":"2019-05-03 16:28:05.000 +0800","version_description":"Changelog:<br>* Bugs fix and optimization<br>* Fixed unlocking of impressionism achievement<br>* Enhanced support of iPhoneX fullscreen display<br>* Improved Online User experience"},{"version_id":"831227302","version_name":"2.6.3","version_date":"2019-05-09 08:25:36.000 +0800","version_description":"Fix a crash on iPhone when joining a game on India, France, Germany, Nordic Countries or UK (any portrait map)"},{"version_id":"832311388","version_name":"2.6.4","version_date":"2019-08-13 08:09:04.000 +0800","version_description":"Improvement of wagons orientation on France map<br>In game help when choosing tickets<br>In game help when putting track pieces on France map (highlights of available routes)<br>Display of information when an online game is not joinable<br>Setup of a per map versioning system for game compatibility<br>In game help message when a player failed to claim a route<br>Display of an animated Gerry on the app main screen<br>Link toward privacy policy addition when creating a Days Of Wonder account<br>Links toward privacy policy and user agreement addition<br>Available bots fix when creating an online game<br>Score calculations fix on Pennsylvania map when playing online or local<br>Impressionism achievement fix<br>Screen latency fix when leaving a game<br>Display of in game help on left handed display fix<br>Display of technologies counter fix on United Kingdom map<br>Screen freeze fix when closing the reminding track pieces dialog<br>Display of score calculation fix on Germany map when ending an online game<br>Bots behavior fix on Nordic Countries map<br>Connection to the Days Of wonder account fixed when entering online game setup<br>Crash fixed when creating a Days Of Wonder account<br>Removal of screen display mode settings<br>iPhoneX display fixes<br>Crash fix when selecting a player during a game on United Kindgom Advanced map<br>Removal of the \"It's your turn\" popup at the start of the player turn"},{"version_id":"832379275","version_name":"2.6.5","version_date":"2019-08-19 08:30:16.000 +0800","version_description":"Issue linked to Asmodee.net account authentification has been solved"},{"version_id":"833320150","version_name":"2.6.7","version_date":"2019-11-06 21:38:00.000 +0800","version_description":"- Retry connection pop up displayed when loosing connection<br>- During maintenance, a feedback is displayed within the application<br>- Several tutorial improvements<br>- Contact permission is only asked when actually linking the partner<br>- Sharing end screen don’t cause crash anymore<br>- Flow while leaving a game has been improved<br>- Minor fixes"},{"version_id":"833797562","version_name":"2.6.8","version_date":"2019-12-09 10:57:32.000 +0800","version_description":"Crash issues with Catalina OS fixed\n<br>Card drawing sound has been changed\n<br>Issue that prevent from playing while on airplane mode fixed\n<br>Crash issues fixed"},{"version_id":"834139602","version_name":"2.6.10","version_date":"2020-01-06 15:21:59.000 +0800","version_description":"o iOS and macOS: fix the Local mode so that it can work with all platforms again<br>o Germany: fix the way short tickets are discarded<br>o And fixes of a couple typos and potential crashes"},{"version_id":"834969962","version_name":"2.7.2","version_date":"2020-04-07 13:21:32.000 +0800","version_description":"New turn banner (no more “It’s your turn” black pop up).<br>Adds support for iPad 11 Pro.<br>Fixes the behavior of Jane Stanbot on Europa 1912 Mega.<br>Returns to the main screen when quitting a Solo or Pass-and-play game.<br>Shows the Quit and Rematch buttons on the final scores screen, even when you record a highscore."},{"version_id":"835442471","version_name":"2.7.3","version_date":"","version_description":""},{"version_id":"835480663","version_name":"2.7.4","version_date":"2020-04-20 12:04:57.000 +0800","version_description":"Turn banner has been removed"},{"version_id":"835975336","version_name":"2.7.5","version_date":"2020-05-23 00:08:45.000 +0800","version_description":"Improved stability: fixed a potential crash"},{"version_id":"836093265","version_name":"2.7.5","version_date":"2020-05-23 00:08:45.000 +0800","version_description":"Improved stability: fixed a potential crash"},{"version_id":"836140931","version_name":"2.7.6","version_date":"2020-05-28 00:51:54.000 +0800","version_description":"This version makes it easier to join online games when you are a new player"},{"version_id":"838107735","version_name":"2.7.10","version_date":"2020-10-27 14:25:58.000 +0800","version_description":"- Fix clock behavior: player clock should be synch with the server clock.<br>- Fix online game password behavior: players should not be able to create a game with an empty password.<br>- Fix bot behavior on germany map when replaces a player at the start of a game."},{"version_id":"840406366","version_name":"2.7.11","version_date":"2021-02-09 14:01:10.000 +0800","version_description":"Bug fixes:\n<br>-Chat Gender Emote now usable\n<br>-Technology can no longer be inaccessible on the UK map\n<br>-Server maintenance information is now visible on the application\n<br>-UK rules updated in Germany language"}]