[{"version_id":"15294859","version_name":"4.0.0","version_date":"2013-05-09 00:35:52.000 +0800","version_description":"New in version 4:<br>- larger game controls (improving gameplay)<br>- instantly see your international ranking<br>- higher quality retro graphics <br>- optimized 4\" wide screen support<br>- more ways to share your highscore<br>- option to print your highscore using AirPrint (really!)<br><br>I hope you like this new version, I really wanted to do the iPhone 5 version well. It has it's very own graphics now, much more detailed and crisp than before. It took hours of testing to improve gameplay and make the game more fun. I hope you'll enjoy it!<br><br>Cheers from Amsterdam, Willem."},{"version_id":"3729434","version_name":"2.1","version_date":"2011-05-19 19:52:46.000 +0800","version_description":""},{"version_id":"669423153","version_name":"5.0.0","version_date":"2014-08-15 22:23:08.000 +0800","version_description":"- Removed the (annoying) banners from the game screen<br>- Introducing the famous 3210, 8210 and 8850!<br>- Improvements for newest iOS versions"},{"version_id":"702063031","version_name":"6.0","version_date":"2014-09-12 20:29:35.000 +0800","version_description":"New game modes, now includes Snake 2!<br>Translated into 30+ languages.<br>Optimized memory usage and touch controls.<br>Please leave a review if you like this update, thanks!"},{"version_id":"825997667","version_name":"7.0","version_date":"2018-02-14 18:44:21.000 +0800","version_description":"Big update, featuring: <br>- 5 original and two new larger game modes (3410 / 7110)<br>- optimized graphics (including iPhone X and Plus models)<br>- greatly improved responsiveness of the touch controls<br>- feel the gameplay thanks to vibration feedback (if your device supports it)<br>- play in wide screen (entire screen is a button)<br>- pause anytime by touching the center of the virtual screen<br>- support for hardware (iPad / Bluetooth) keyboards<br>- iPad split screen support <br>- world wide highscores and ranking (all platforms)<br>Please leave a review to let me know if you like this update, thanks!"},{"version_id":"830251815","version_name":"7.1","version_date":"2019-02-12 02:35:35.000 +0800","version_description":"- New: share game results with awesome screenshots<br>- Optimised graphics for new iPhones and iPads<br>- Bug fixes in gameplay and loading<br>- Added translations"}]