[{"version_id":"817225667","version_name":"3.2.6","version_date":"2016-05-04 15:33:29.000 +0800","version_description":"New feature: Reserve Your Spot for Urgent Cares. At select Urgent Care sites, you can now reserve your spot. Just choose the time you want to come in, and we'll hold your spot."},{"version_id":"817568509","version_name":"3.2.8","version_date":"2016-08-24 14:45:08.000 +0800","version_description":"In this version, we've made the following improvements:<br>- MyCarolinas: You can now log in to your account using Touch ID. When you log in, you'll see a new screen that provides access to your appointments, your profile, and health videos. You can direct schedule appointments. MyCarolinas navigation is now simpler.<br>- Find a Doctor: The Carolinas HealthCare System Tree of Life identifies providers employed by Carolinas HealthCare System."},{"version_id":"818985082","version_name":"3.2.9","version_date":"2016-11-05 02:27:53.000 +0800","version_description":"Introducing eVisit! Find relief online, on your time. Log in to MyCarolinas to start your eVisit. Connect with a healthcare provider for help with minor conditions that still need medical attention. **You must be in North Carolina at the time the eVisit is submitted. Unavailable to all pediatric patients under the age of 18."},{"version_id":"819643647","version_name":"3.3.0","version_date":"2017-02-08 13:20:27.000 +0800","version_description":"- Clean, modern design<br>- Easier to access Reserve Your Spot feature for Urgent Care locations<br>- Support for push notifications<br>- Redesigned navigation for quicker access to important features from all screens"},{"version_id":"820907385","version_name":"3.3.1","version_date":"2017-02-12 20:54:21.000 +0800","version_description":"- Fix to display of interior directions for hospital locations.<br>New to 3.3.0:<br>- Clean, modern design<br>- Easier to access Reserve Your Spot feature for Urgent Care locations<br>- Support for push notifications<br>- Redesigned navigation for quicker access to important features from all screens"},{"version_id":"821582590","version_name":"3.3.2","version_date":"2017-06-01 00:42:49.000 +0800","version_description":"Bug fixes"},{"version_id":"822526912","version_name":"3.3.3","version_date":"2017-08-23 02:33:32.000 +0800","version_description":"**This important update is required to continue accessing MyCarolinas.** With this update, we are excited to offer a new experience for MyCarolinas! With a faster log in, you can now immediately see your next appointment information, and how many health messages and customer service messages you have. The appointment scheduling experience is completely new, making it easier than ever for you to direct schedule appointments with your doctor - or any doctor at that practice."}]