[{"version_id":"815900891","version_name":"4.4.0","version_date":"2016-02-08 07:47:02.000 +0800","version_description":"Apparaatbeheer en bugfixing:<br><br>Toegevoegd is de mogelijkheid om je apparaten te beheren. Apparaatbeheer geeft aan welke apparaten (smartphones en tablets) zijn aangemeld op je account. Binnen apparaatbeheer kun je apparaten afmelden en de apparaatnaam wijzigen. Apparaat beheer is standaard beveiligd met je pincode.  Daarnaast zijn in deze versie een aantal kleine bugs opgelost."},{"version_id":"816456523","version_name":"4.4.1","version_date":"2016-03-22 06:35:49.000 +0800","version_description":"•   Er komt meer content beschikbaar voor Programma Gemist van RTL en SBS<br>•   Bugfixes"},{"version_id":"816913150","version_name":"4.5.0","version_date":"2016-05-12 06:41:33.000 +0800","version_description":"Toegevoegd in deze versie is de mogelijkheid om content van KPN Presenteert te bekijken. Voor ITV klanten zijn de KPN Presenteert programma’s direct beschikbaar. Bent u geen ITV klant, dan kunt u inloggen met een KPN ID en daarmee de programma’s van KPN Presenteert bekijken."},{"version_id":"819843764","version_name":"5.1.0","version_date":"2016-11-29 07:30:04.000 +0800","version_description":"De vernieuwde Interactieve TV app is nu ook beschikbaar voor op je iPad.<br><br>Naast een verbeterd design van de app, zijn enkele nieuwe functionaliteiten toegevoegd zoals:<br><br>• Suggesties voor het kijken van bepaalde programma’s, namelijk:<br> - ‘Nu op TV’<br> - ‘Nieuw in gemist’<br> - ‘Mijn opnames’<br> - ‘KPN Presenteert’<br> - ‘Top 10 Films uit On Demand’<br><br>Daarnaast is het nu ook mogelijk verschillende zenders buitenshuis te bekijken, mits in bezit van het zenderpakket. Dit zijn Fox Sports, Kids pakket en verschillende zenders uit het Pluspakket.<br><br>Voor meer informatie over zenders, wijzigingen en de vernieuwde app kijk op www.kpn.com/itvapp<br><br>Let op! Heb je geen geluid? Zorg dan dat het schuifje aan de zijkant van je iPad naar boven staat."},{"version_id":"819993993","version_name":"5.1.1","version_date":"2016-12-07 07:34:48.000 +0800","version_description":"Op basis van jullie feedback zijn er een aantal verbeteringen doorgevoerd:<br>• De gids blijft bij het wisselen van dag op hetzelfde kanaal.<br>• Verbetering in het verwijderen van serie opnames. Gemaakte en geplande opnames kunnen nu apart van elkaar verwijderd worden.<br>• Kleine bugfixes en verbeteringen.<br><br>Voor meer informatie over zenders, wijzigingen en de vernieuwde app kijk op www.kpn.com/itvapp<br><br>Let op! Heb je sinds de vernieuwde app geen geluid? Zorg dan dat of het schuifje aan de zijkant van je iPad omhoog staat, of als je geen schuifje hebt, dat in Control Center (veeg vanaf de onderkant van je scherm omhoog) het icoontje met de doorstreepte bel uit staat."},{"version_id":"820628677","version_name":"5.2.0","version_date":"2017-01-24 08:10:19.000 +0800","version_description":"Bedankt voor jullie feedback op onze app. <br>In deze update hebben wij een groot aantal van jullie genoemde verbeterpunten verwerkt.<br><br>Daarom kan je nu:<br>• Zien wat er op de andere zenders op tv is, terwijl je in volledig scherm tv kijkt<br>• Opnames inplannen voor alle zenders die je ook op je tv-ontvanger hebt<br>• Zien dat je bepaalde opnames niet kan afspelen<br>• Opnames die nog bezig zijn met opnemen bekijken<br>• TV kijken met geluid, ook als je belsignaal op stil staat"},{"version_id":"821219348","version_name":"5.3.0","version_date":"2017-03-08 14:46:35.000 +0800","version_description":"Ook in deze versie zitten weer enkele verbeteringen. Zo kan je nu:<br><br>- Een kanaallijst maken met je favoriete kanalen in de secties TV Kijken en TV Gids. <br>- Als je het Pluspakket hebt, extra aanbevelingen vinden op het Home scherm.<br>- Genieten van andere kleine verbeteringen.<br><br>Daarnaast maken wij vanaf deze versie gebruik van Google Analytics om de gebruikservaring verder te verbeteren. Meer informatie vind je onder Veelgestelde vragen in de app."},{"version_id":"821673373","version_name":"5.3.1","version_date":"2017-04-12 06:34:22.000 +0800","version_description":"Een herinnering instellen voor je favoriete programma? Dat kan nu!<br><br>Daarnaast hebben we een aantal kleine verbeteringen doorgevoerd om jouw ervaring nog beter te maken."},{"version_id":"822024780","version_name":"5.4.0","version_date":"2017-05-11 07:19:46.000 +0800","version_description":"In deze nieuwe versie introduceren we het zoeken in de app. Je kunt nu nog makkelijker je favoriete programma’s vinden door op het zoek-icoontje te klikken (rechts bovenin je scherm). Ook hebben we het app-icoon geüpdatet en een aantal kleine verbeteringen doorgevoerd.<br><br>Sinds de vorige update is het ook mogelijk om herinneringen in te stellen. Ga hiervoor naar TV Kijken of de TV Gids en klik op de drie bolletjes. Kies hierna voor de optie “Herinner mij 5 min. vooraf”."},{"version_id":"822569884","version_name":"5.4.1","version_date":"2017-06-21 16:00:23.000 +0800","version_description":"Bug fixes en performance improvements"},{"version_id":"823255512","version_name":"5.5.0","version_date":"2017-08-16 08:23:12.000 +0800","version_description":"Vanaf nu kijk je via WiFi live TV in HD kwaliteit. <br>Mocht je hierdoor last krijgen van vastlopend beeld, dan kan je in de instellingen de videokwaliteit weer verlagen."},{"version_id":"823336614","version_name":"5.5.1","version_date":"2017-08-21 07:40:00.000 +0800","version_description":"Nieuw in 5.5.1:<br>- Crash opgelost wanneer je naar de Live TV sectie navigeert<br><br>Nieuw in 5.5.0:<br>- Vanaf nu kijk je via WiFi live TV in HD kwaliteit. Mocht je hierdoor last krijgen van vastlopend beeld, dan kan je in de instellingen de videokwaliteit weer verlagen."},{"version_id":"823661044","version_name":"5.6.0","version_date":"2017-09-27 11:18:55.000 +0800","version_description":"Vanaf nu is het mogelijk om de films en series uit On Demand ook onderweg te bekijken"},{"version_id":"823830634","version_name":"5.6.1","version_date":"2017-10-04 07:49:16.000 +0800","version_description":"Kleine verbeteringen"},{"version_id":"825061296","version_name":"5.6.2","version_date":"2017-12-13 08:37:02.000 +0800","version_description":"Wil jij ons helpen met het testen van de nieuwe iTV app? Meld je dan aan via het aanmeldformulier in de app. Het aanmeldformulier is zichtbaar de derde keer dat je de app gebruikt na de update."},{"version_id":"826481242","version_name":"6.0","version_date":"2018-04-03 20:49:24.000 +0800","version_description":"Klaar voor onze grootste update tot nu toe? Vol trots presenteren wij een nieuwe look &amp; feel en een heleboel nieuwe functies, waaronder:<br><br>•    Ieder programma is direct naar de tv te streamen met Chromecast<br>•    Je kan via de tv-gids tot wel 7 dagen terugkijken <br>•    De app is nu overal in de EU te gebruiken, handig voor op vakantie!<br><br>Daarnaast bevat de app natuurlijk ook de functionaliteiten die je van ons gewend bent:<br><br>•    Even geen idee wat je wil kijken? Laat je inspireren door de startpagina!<br>•    Gebruik de tv-gids om te kijken wat er op tv is of om alvast opnames in te plannen<br>•    Als je iets kijkt op volledig scherm zie je snel wat er nu en straks op tv is door een mini tv-gids<br>•    Al je opnames vind je terug via Mijn profiel in het menu"},{"version_id":"826619026","version_name":"6.0.1","version_date":"2018-04-13 08:05:28.000 +0800","version_description":"We hebben een issue opgelost voor iPads met iOS 10.3.3. Het is weer mogelijk om de app op te starten en tv te kijken"},{"version_id":"827177899","version_name":"6.1","version_date":"2018-06-04 08:08:39.000 +0800","version_description":"Deze update staat in het teken van snelheid: de startpagina, de gids en de tv-kijken pagina laden nu veel sneller. Daarnaast hebben we de mogelijkheid toegevoegd om in te loggen met KPN ID: makkelijker en veiliger! Als je liever wilt blijven inloggen met je abonnementsnummer: geen probleem, dit kan nog steeds.<br><br>Achter de schermen zijn ook verbeteringen doorgevoerd. Het zoeken op serietitel gaat nu een stuk gemakkelijker, dus vanavond kijk je weer naar Grey’s Anatomy of The Handmaid’s Tale."},{"version_id":"827661438","version_name":"6.1.1","version_date":"2018-06-28 09:04:04.000 +0800","version_description":"Daar is ’ie dan... onze favoriete(n) update! Je kan na deze update in de TV Gids en Nu op TV aangeven wat je favoriete zenders zijn met het hartje. Deze zenders belanden vervolgens in je ‘Favorieten’-filter. Wanneer je die selecteert is scrollen door de lange lijst zenders vanaf nu verleden tijd!<br><br>Ook hebben we de mogelijkheid toegevoegd om een filter te selecteren voor ‘Buitenshuis beschikbaar’. Zo heb je in één keer een handig overzicht van de zenders die je onderweg kunt bekijken."},{"version_id":"827721641","version_name":"6.1.2","version_date":"2018-07-02 13:39:22.000 +0800","version_description":"Bedankt voor jullie feedback over favoriete zenders: vanaf deze versie worden je favorieten onthouden :)"},{"version_id":"827926513","version_name":"6.1.3","version_date":"2018-07-24 09:01:12.000 +0800","version_description":"In deze versie is het inloggen is aangepast aan de vernieuwde privacywetgeving. In sommige gevallen moet je daarom eenmalig je inloggegevens invoeren. Kun je deze niet vinden? Klik dan op ‘Inloggegevens vergeten?’ in de app."},{"version_id":"828320620","version_name":"6.2","version_date":"2018-08-27 11:47:58.000 +0800","version_description":"Terwijl iedereen genoot van het lekkere weer, zijn wij op kantoor gebleven om aan de app te werken. Dus ga er even voor zitten, want hier komt het lijstje met nieuwe functionaliteiten:<br><br>- Je vindt een overzicht van populaire series in het Kijken-menu bij ‘Series’ <br>- Bingewatchen is een stuk makkelijker geworden: klik op de detailpagina van een serie op 'Meer afleveringen' om alle afleveringen uit dat seizoen te zien<br>- Gebruik 'Primetime' in het Kijken-menu om in één oogopslag te zien wat er ’s avonds op tv is of wat je afgelopen week hebt gemist<br>- In de TV Gids op tablets kun je nu ook snel naar een andere zender door te klikken op ‘Snel naar…’<br>- De ‘Nu op TV’ pagina heeft een kleine make-over gekregen: we tonen alle programma’s die nu én straks op tv zijn"},{"version_id":"828480063","version_name":"6.2.1","version_date":"2018-09-11 06:58:24.000 +0800","version_description":"In deze update is het zoeken in de TV Gids verbeterd: alle programma's die nu op tv zijn of later worden uitgezonden, vind je terug in \"Nu &amp; Later\". Is het programma al op TV geweest? Dan kun je deze vinden onder het kopje \"Kijk terug\".<br><br>Heb je feedback over de app? Dan kun je ons vanaf nu bereiken via Profiel &gt; Geef ons feedback."},{"version_id":"828915124","version_name":"6.2.2","version_date":"2018-10-17 08:19:13.000 +0800","version_description":"De avonden worden langer en de tv staat weer wat vaker aan.. Daarom hebben we in deze update een aantal verbeteringen die jouw tv-avond helemaal compleet maken! Zo kun je vanaf nu bijvoorbeeld:<br><br>- Makkelijk opnames inplannen via de ‘drie puntjes’. Deze kun je vinden op de startpagina en in de gids, maar ook op andere plekken in de app<br>- Trailers kijken voor een aantal films uit On Demand<br>- Heb je een leuke serie gevonden in de gids? Vanaf nu kun je een overzicht vinden van alle afleveringen onder ‘Meer afleveringen’<br>- En ontdek je een leuke serie tijdens het terugkijken? Plan dan de serie-opname in zodat je geen afleveringen meer mist!"},{"version_id":"830312140","version_name":"6.3","version_date":"2019-02-20 09:39:08.000 +0800","version_description":"Eindelijk is het zover! Met veel trots presenteren we een groot aantal nieuwe features:<br><br>- Vanaf nu mis je nooit meer het begin van een programma met Begin Gemist. Klik hiervoor het op het Begin Gemist-icoon linksonder in de player<br>- Word je gestoord tijdens het tv-kijken? Geen probleem met Live TV pauzeren!<br>- Twee gloednieuwe pagina’s met alle films en series uit het Basis- en Pluspakket. Zoek een film uit door je favoriete genre te kiezen, of blader door de nieuwste films<br>- Alle apparaten die zijn aangemeld op de iTV app beheer je gemakkelijk in je profiel"},{"version_id":"830495762","version_name":"6.3.1","version_date":"2019-03-07 15:21:00.000 +0800","version_description":"Nieuw in 6.3.1:<br>- Snelheidsverbetering in het opvragen van de TV Gids<br><br>Nieuw in 6.3.0:<br>- Vanaf nu mis je nooit meer het begin van een programma met Begin Gemist. Klik hiervoor het op het Begin Gemist-icoon linksonder in de player<br>- Word je gestoord tijdens het tv-kijken? Geen probleem met Live TV pauzeren!<br>- Twee gloednieuwe pagina’s met alle films en series uit het Basis- en Pluspakket. Zoek een film uit door je favoriete genre te kiezen, of blader door de nieuwste films<br>- Alle apparaten die zijn aangemeld op de iTV app beheer je gemakkelijk in je profiel"},{"version_id":"830687008","version_name":"6.3.2","version_date":"2019-03-22 11:23:10.000 +0800","version_description":"In deze update vind je een aantal nieuwe functionaliteiten en verbeteringen terug:<br><br>- Ondersteuning voor iOS 12.2<br>- In Films en Series kun je er voor kiezen om te filteren op programma’s die geschikt zijn voor kinderen, of deze er juist uit filteren<br>- Op de detailpagina voor films en series vind je nu het tabblad “Meer zoals dit”, waarmee je snel een soortgelijk programma vindt<br>- Een aantal kleine verbeteringen in Zoeken, zoals bijvoorbeeld gegroepeerde zoekresultaten voor series en een verbeterde vormgeving"},{"version_id":"830826820","version_name":"6.3.3","version_date":"2019-04-03 14:21:22.000 +0800","version_description":"Nieuw in 6.3.3:<br>- We hebben een bug opgelost in de TV Gids, waardoor je programma's uit het verleden weer kunt zien<br><br>Nieuw in 6.3.2:<br>- Ondersteuning voor iOS 12.2<br>- In Films en Series kun je er voor kiezen om te filteren op programma’s die geschikt zijn voor kinderen, of deze er juist uit filteren<br>- Op de detailpagina voor films en series vind je nu het tabblad “Meer zoals dit”, waarmee je snel een soortgelijk programma vindt<br>- Een aantal kleine verbeteringen in Zoeken, zoals bijvoorbeeld gegroepeerde zoekresultaten voor series en een verbeterde vormgeving"},{"version_id":"831456407","version_name":"6.3.4","version_date":"2019-06-17 14:20:56.000 +0800","version_description":"Het is nu nog makkelijker geworden om de iTV app te gebruiken met de volgende nieuwe functionaliteiten:<br><br>- Vanaf nu log je veilig en eenvoudig in met Touch ID of Face ID<br>- Je kunt een overzicht vinden van de films op TV via de Films-pagina<br>- De app is nu ook beschikbaar in het Engels"},{"version_id":"832160674","version_name":"6.4.0","version_date":"2019-07-30 06:56:25.000 +0800","version_description":"Een grote update speciaal voor de allerkleinsten. Heb je het Plus- of het Kidspakket? Dan kun je vanaf nu gebruikmaken van de Kids-omgeving: een omgeving waar kinderen op een speelse en gemakkelijke manier kunnen kijken. Met de raket vlieg je mee door alle afleveringen van je favoriete series of films. Er is altijd iets nieuws te ontdekken in het aanbod van meer dan 250 films en series."},{"version_id":"832328975","version_name":"6.4.1","version_date":"2019-08-15 08:04:19.000 +0800","version_description":"Heb je onze speciale Kids-omgeving op tablets al ontdekt? De omgeving is beschikbaar voor alle klanten met het Plus- of Kidspakket en biedt een veilige omgeving voor kinderen om nieuwe films en series te ontdekken. Wil je meer weten? Kijk dan op kpn.com/opvoeden"},{"version_id":"832555176","version_name":"6.4.2","version_date":"2019-08-29 14:07:38.000 +0800","version_description":"Jouw kijkervaring staat centraal in deze update. Er zijn een aantal verbeteringen doorgevoerd waarbij het nóg makkelijker en leuker wordt om via de iTV app te kijken. Je vindt vanaf nu de volgende functionaliteiten in de app:<br><br>- Spoel snel 30 seconden terug of vooruit bij je opnames en bij films en series uit On Demand<br>- De volgende aflevering van de serie start automatisch of wanneer je de \"Volgende aflevering\"-knop gebruikt (alleen beschikbaar in volledig scherm)<br>- Neem je vaak programma's op of kijk je terug via de gids? Dan hebben we goed nieuws! De programma's beginnen nu op het juiste moment, dus de reclames aan het begin worden automatisch overgeslagen<br><br>Daarnaast hebben we ook nog een verbetering in de TV Gids klaarstaan: de SD en HD kanalen zijn samengevoegd, waardoor de kanalen niet meer dubbel in de gids staan. De kwaliteit van de live-kanalen is natuurlijk ongewijzigd."},{"version_id":"832677154","version_name":"6.4.3","version_date":"2019-09-11 06:00:12.000 +0800","version_description":"Deze update bevat een zeer belangrijke verbetering onder de motorkop zodat je zonder problemen de app kunt blijven gebruiken.<br><br>Heb je alle functionaliteiten van de vorige update al uit kunnen proberen? Bijvoorbeeld:<br>- Spoel snel 30 seconden terug of vooruit bij je opnames en bij films en series uit On Demand<br>- De volgende aflevering van een serie start automatisch of wanneer je de \"Volgende aflevering\"-knop gebruikt (alleen beschikbaar in volledig scherm)<br>- Neem je vaak programma's op of kijk je terug via de gids? Dan hebben we goed nieuws! De programma's beginnen nu op het juiste moment, du de reclames aan het begin worden automatisch overgeslagen"},{"version_id":"832919676","version_name":"6.4.4","version_date":"2019-09-25 17:33:47.000 +0800","version_description":"Ondersteuning voor iOS 13"},{"version_id":"833021628","version_name":"6.5.0","version_date":"2019-10-10 07:06:30.000 +0800","version_description":"Het viel ons op dat jullie erg vaak de iTV app gebruikten tijdens sportevenementen, dus speciaal voor alle sportliefhebbers hebben we een nieuwe pagina in de app: Sport! Je vindt deze via Kijken &gt; Sport. Op de sportpagina vind je een overzicht van alle sportevenementen en programma's:<br><br>- Alle grote sportevenementen worden uitgelicht bovenin de pagina<br>- Daaronder vind je een overzicht van alle wedstrijden, samenvattingen en programma's in het teken van sportcommentaar<br>- Je kunt de selectie makkelijk verkleinen door te filteren op een sport<br><br>Daarnaast zit er in deze update ook nog een verbetering voor álle tv-liefhebbers: via de 'drie puntjes' stel je gemakkelijk een herinnering in. Vlak voordat het programma begint, ontvang je een notificatie op je toestel of je Apple Watch. Je kunt een herinnering instellen voor alle programma's in de Gids."},{"version_id":"833278549","version_name":"6.5.1","version_date":"2019-10-24 08:33:41.000 +0800","version_description":"Je ziet nu makkelijker terug welke programma's, films of series je aan het kijken bent of welke je al hebt gekeken. Wel zo makkelijk!"},{"version_id":"833745531","version_name":"6.5.3","version_date":"2019-11-27 11:36:21.000 +0800","version_description":"Kleine verbeteringen die het nóg makkelijker maken om programma's verder te kijken"},{"version_id":"833781192","version_name":"6.5.4","version_date":"2019-12-01 06:12:58.000 +0800","version_description":"Deze versie heeft een oplossing voor enkele chromecast verbindingsproblemen"},{"version_id":"834022906","version_name":"6.5.5","version_date":"2019-12-17 09:53:42.000 +0800","version_description":"Deze update bevat een aantal stabiliteitsverbeteringen voor tv kijken in de app én met Chromecast.<br><br>We zijn benieuwd wat je er van vindt! Laat je feedback achter in Profiel &gt; Geef ons feedback."},{"version_id":"834132123","version_name":"6.5.6","version_date":"2019-12-31 14:11:19.000 +0800","version_description":"Deze update bevat een aantal stabiliteitsverbeteringen voor tv kijken in de app én met Chromecast.<br><br>We zijn benieuwd wat je er van vindt! Laat je feedback achter in Profiel &gt; Geef ons feedback."},{"version_id":"834348512","version_name":"6.5.7","version_date":"2020-01-16 13:18:58.000 +0800","version_description":"Deze update bevat een aantal stabiliteitsverbeteringen voor tv kijken.<br><br>We zijn benieuwd wat je er van vindt! Laat je feedback achter in Profiel &gt; Geef ons feedback."},{"version_id":"834602771","version_name":"6.5.8","version_date":"2020-02-07 13:59:29.000 +0800","version_description":"In deze update introduceren we de ‘30 seconden’ knoppen ook voor live tv, begin gemist en terugkijken. Daarnaast zitten er ook wat kleine bug fixes en verbeteringen in."},{"version_id":"834656885","version_name":"6.5.9","version_date":"2020-02-12 08:35:36.000 +0800","version_description":"In deze update introduceren we de ‘30 seconden’ knoppen ook voor live tv, begin gemist en terugkijken. Daarnaast zitten er ook wat kleine bug fixes en verbeteringen in."},{"version_id":"834840026","version_name":"6.5.10","version_date":"2020-02-25 08:26:35.000 +0800","version_description":"In deze versie hebben wij de player verbeterd om de kijkervaring nog beter te maken. Nu kun je ook de videogrootte aanpassen met een knijpbeweging op het scherm afhankelijk van de telefoon die je hebt."},{"version_id":"835109170","version_name":"6.6.0","version_date":"2020-03-19 07:10:16.000 +0800","version_description":"In deze update hebben we op de startpagina een snelkoppeling toegevoegd naar Films en Series"},{"version_id":"835393213","version_name":"6.6.1","version_date":"2020-04-07 07:37:18.000 +0800","version_description":"Deze update bevat speciale nieuwe knoppen waardoor je nog makkelijker door de app kunt navigeren. Met een knop vanuit de hoofdpagina hebben we een speciaal ingerichte educatieve pagina voor de kleine onder ons. Daarnaast kun je nog sneller de sport- en kids omgeving bereiken via de hoofdpagina."},{"version_id":"835462354","version_name":"6.6.2","version_date":"2020-04-10 06:20:56.000 +0800","version_description":"Deze update bevat speciale nieuwe knoppen waardoor je nog makkelijker door de app kunt navigeren. Met een knop vanuit de hoofdpagina hebben we een speciaal ingerichte educatieve pagina voor de kleine onder ons. Daarnaast kun je nog sneller de sport- en kids omgeving bereiken via de hoofdpagina."},{"version_id":"835570950","version_name":"6.6.3","version_date":"2020-04-20 07:43:38.000 +0800","version_description":"Deze update bevat speciale nieuwe knoppen waardoor je nog makkelijker door de app kunt navigeren. Met een knop vanuit de hoofdpagina hebben we een speciaal ingerichte educatieve pagina voor de kleine onder ons. Daarnaast kun je nog sneller de sport- en kids omgeving bereiken via de hoofdpagina."},{"version_id":"835638018","version_name":"6.6.4","version_date":"2020-04-22 05:38:45.000 +0800","version_description":"Deze update bevat speciale nieuwe knoppen waardoor je nog makkelijker door de app kunt navigeren. Met een knop vanuit de hoofdpagina hebben we een speciaal ingerichte educatieve pagina voor de kleine onder ons. Daarnaast kun je nog sneller de sport- en kids omgeving bereiken via de hoofdpagina."},{"version_id":"835919197","version_name":"6.7.0","version_date":"2020-05-13 06:56:31.000 +0800","version_description":"In deze update introduceren we Picture-in-picture. Hiermee is het mogelijk om te multitasken terwijl je je favoriete content kijkt. Daarnaast hebben we een nieuw design om je Chromecast te bedienen. Het is nu mogelijk om terug en vooruit te spoelen met de 30-seconden knoppen."},{"version_id":"836152602","version_name":"6.7.1","version_date":"2020-05-28 07:24:58.000 +0800","version_description":"In deze update introduceren we Picture-in-picture. Hiermee is het mogelijk om te multitasken terwijl je je favoriete content kijkt. Daarnaast hebben we een nieuw design om je Chromecast te bedienen. Het is nu mogelijk om terug en vooruit te spoelen met de 30-seconden knoppen."},{"version_id":"836355635","version_name":"7.0.0","version_date":"2020-06-11 12:00:20.000 +0800","version_description":"In deze versie hebben wij een gloednieuwe homepagina met een verbeterde performance"},{"version_id":"836642124","version_name":"7.0.1","version_date":"2020-07-15 09:52:44.000 +0800","version_description":"In deze update hebben wij het uiterlijk van de app vernieuwd. We hebben nu ook een welkomscherm voor nieuwe gebruikers, en een verbeterde manier om snel je favoriete kanalen weer te geven."},{"version_id":"836959725","version_name":"7.0.2","version_date":"2020-07-23 09:55:34.000 +0800","version_description":"In deze update hebben wij het uiterlijk van de app vernieuwd. We hebben nu ook een welkomscherm voor nieuwe gebruikers, en een verbeterde manier om snel je favoriete kanalen weer te geven."},{"version_id":"837207364","version_name":"7.0.3","version_date":"2020-08-05 11:02:53.000 +0800","version_description":"In deze update hebben wij het uiterlijk van de app vernieuwd. We hebben nu ook een welkomscherm voor nieuwe gebruikers, en een verbeterde manier om snel je favoriete kanalen weer te geven."},{"version_id":"837334525","version_name":"7.1","version_date":"2020-08-16 22:02:53.000 +0800","version_description":"Voor deze release hebben wij iets waar jullie allemaal op aan het wachten waren. Airplay is nu beschikbaar om je favoriete content te streamen naar je tv. Tap op de cast icoon. Hier zul je nu de optie krijgen om te streamen via Airplay. Veel plezier!"},{"version_id":"837485469","version_name":"7.1.1","version_date":"2020-08-25 11:11:53.000 +0800","version_description":"Voor deze release hebben wij iets waar jullie allemaal op aan het wachten waren. Airplay is nu beschikbaar om je favoriete content te streamen naar je tv. Tap op de cast icoon. Hier zul je nu de optie krijgen om te streamen via Airplay. Veel plezier!"},{"version_id":"837699709","version_name":"7.1.2","version_date":"2020-09-10 07:45:02.000 +0800","version_description":"Voor deze release hebben wij iets waar jullie allemaal op aan het wachten waren. Airplay is nu beschikbaar om je favoriete content te streamen naar je tv. Tap op de cast icoon. Hier zul je nu de optie krijgen om te streamen via Airplay. Veel plezier!"},{"version_id":"838078723","version_name":"7.2","version_date":"2020-10-09 09:11:06.000 +0800","version_description":"Je kan nu sneller en makkelijker bij je opnames. Daarnaast hebben wij bekende problemen in de app opgelost."},{"version_id":"838419280","version_name":"7.2.1","version_date":"2020-10-29 09:55:10.000 +0800","version_description":"Je kan nu sneller en makkelijker bij je opnames. Daarnaast hebben wij bekende problemen in de app opgelost."},{"version_id":"838453140","version_name":"7.2.2","version_date":"2020-10-31 06:01:28.000 +0800","version_description":"Je kan nu sneller en makkelijker bij je opnames. Daarnaast hebben wij bekende problemen in de app opgelost."},{"version_id":"838484748","version_name":"7.2.3","version_date":"2020-11-03 15:25:20.000 +0800","version_description":"Je kan nu sneller en makkelijker bij je opnames. Daarnaast hebben wij bekende problemen in de app opgelost."},{"version_id":"839282669","version_name":"7.3","version_date":"2020-11-23 12:18:54.000 +0800","version_description":"In deze update introduceren we een nieuwe manier van navigeren. Daarnaast is het nu mogelijk om een opname te plannen of te verwijderen via de drie puntjes"},{"version_id":"839470502","version_name":"7.3.1","version_date":"2020-12-07 14:23:59.000 +0800","version_description":"In deze update introduceren we een nieuwe categorie: stemmingen. Hierin kun je spannende nieuwe films en series bekijken op basis van je eigen stemming. Daarnaast hebben we enkele performance verbeteringen doorgevoerd."},{"version_id":"840126759","version_name":"7.3.2","version_date":"2021-01-22 14:26:18.000 +0800","version_description":"In deze update zitten een paar kleine verbeteringen. Een kleine update, maar wel een goede!<br>Wil je vanaf nu altijd up-to-date zijn? Ga dan nu naar Instellingen en navigeer naar 'App Store'. Selecteer de optie 'App-updates'."},{"version_id":"840162275","version_name":"7.3.3","version_date":"2021-01-27 08:18:01.000 +0800","version_description":"In deze update zitten een paar kleine verbeteringen. Een kleine update, maar wel een goede!<br>Wil je vanaf nu altijd up-to-date zijn? Ga dan nu naar Instellingen en navigeer naar 'App Store'. Selecteer de optie 'App-updates'."},{"version_id":"840468701","version_name":"7.3.4","version_date":"2021-02-15 08:13:49.000 +0800","version_description":"In deze update zitten een paar kleine verbeteringen. Een kleine update, maar wel een goede!<br>Wil je vanaf nu altijd up-to-date zijn? Ga dan nu naar Instellingen en navigeer naar 'App Store'. Selecteer de optie 'App-updates'."},{"version_id":"840614297","version_name":"7.3.5","version_date":"2021-02-25 08:40:59.000 +0800","version_description":"In deze update zitten een paar kleine verbeteringen. Een kleine update, maar wel een goede!<br>Wil je vanaf nu altijd up-to-date zijn? Ga dan nu naar Instellingen en navigeer naar 'App Store'. Selecteer de optie 'App-updates'."},{"version_id":"841087536","version_name":"7.3.6","version_date":"2021-03-31 16:19:51.000 +0800","version_description":"In deze update zitten een paar kleine verbeteringen. Een kleine update, maar wel een goede!<br>Wil je vanaf nu altijd up-to-date zijn? Ga dan nu naar Instellingen en navigeer naar 'App Store'. Selecteer de optie 'App-updates'."}]