[{"version_id":"814569197","version_name":"1.6.22","version_date":"2015-11-17 16:05:01.000 +0800","version_description":"- Added iPhone 6S and iPhone 6S Plus support"},{"version_id":"815783512","version_name":"1.6.23","version_date":"2016-01-11 03:17:55.000 +0800","version_description":"- Changed network mechanism, which should improve stability of online game<br>- Fixed freezing chat window bug<br>- Minor interface improvements"},{"version_id":"816980057","version_name":"1.6.24","version_date":"2016-04-14 03:30:53.000 +0800","version_description":"- Added push-notifications for private messages from friends<br>- Disabled notification upon friend rejection or friend removal<br>- Badge on game icon and on mailbox now show amount of unread message groups<br>- Changed game menu interface<br>- \"Surrender\" button now allows to end the current round at any moment<br>- \"Leave the game\" button now ends the game and shows result window<br>- When a player surrenders, he loses 2 points except in cases when at least one checker has been borne off<br>- Upon initial roll dice is automatically cast once the timer runs out<br>- When timer runs out in a match of 3 points or more the current round ends, but not the whole game<br>- Minor fixes"},{"version_id":"820201039","version_name":"1.7.0","version_date":"2016-12-23 02:47:03.000 +0800","version_description":"- Christmas theme<br>- Changed game logic<br>- Fixed game rule bugs<br>- Improved interface design<br>- iPhone 7+ support<br>- iOS 10 support"},{"version_id":"820309104","version_name":"1.7.1","version_date":"2017-01-04 01:38:46.000 +0800","version_description":"- Improved checker selection<br>- Increased checker movement animation speed<br>- Fixed bug where dice disappeared upon bear off<br>- Fixed bug upon checker movement<br>- Fixed bug upon bearing checkers off<br>- Fixed bug with win display in online games<br>- Fixed bug with chat disappearing after game<br>- Fixed various small bugs"},{"version_id":"821199235","version_name":"1.7.2","version_date":"2017-03-14 02:55:22.000 +0800","version_description":"- Fixed bug with checker blocking in narde<br>- Fixed bug in Hotseat mode<br>- Fixed bug in Tavla<br>- Fixed bug upon checker bear-off<br>- Implemented online game reconnection after app shutdown<br>- Implemented option to choose name color upon registration<br>- Improved interface during the game<br>- Improved checker movement during the turn<br>- Fixed various bugs"},{"version_id":"821968012","version_name":"1.7.3","version_date":"2017-05-09 02:01:02.000 +0800","version_description":"- Brought back one touch move option with slight changes<br>- Minor changes in animation of checker movement<br>- Fixed bug in narde where it was possible to block all 15 of opponent's checkers<br>- In narde \"Home gammon\" is no longer possible (according to rules of Narde Federation)<br>- Slight interface changes<br>- Fixed the bug with limited friend display in the lobby invitation window"},{"version_id":"822130689","version_name":"1.7.4","version_date":"2017-05-15 12:58:45.000 +0800","version_description":"1.7.4 changelist:<br>- Fix bug upon using Google+ authorization<br>1.7.3 changelist:<br>- Brought back one touch move option with slight changes<br>- Minor changes in animation of checker movement<br>- Fixed bug in narde where it was possible to block all 15 of opponent's checkers<br>- In narde \"Home gammon\" is no longer possible (according to rules of Narde Federation)<br>- Slight interface changes<br>- Fixed the bug with limited friend display in the lobby invitation window"},{"version_id":"822906148","version_name":"1.7.5","version_date":"2017-07-19 03:11:45.000 +0800","version_description":"- Improved interface. Game against AI and online game are now in a single screen<br>- Added option to spectate ongoing tournament games in the active tournament window<br>- Fixed critical bugs"},{"version_id":"823927350","version_name":"1.7.6","version_date":"2017-10-12 03:01:12.000 +0800","version_description":"- Added option to view already finished games with ability to adjust time and speed of the replay<br>- Changed \"Game History\" section, added replay option<br>- It is now possible to view finished tourney games in the tournament window<br>- In the \"Last match\" you can now find dice generation seed<br>- New app icon<br>- iOS 11 support<br>- iPhone 8, iPhone 8+ support<br>- Fixed critical bugs"},{"version_id":"824379520","version_name":"1.7.7","version_date":"2017-11-16 02:56:48.000 +0800","version_description":"- Fixed errors"},{"version_id":"825337425","version_name":"1.7.8","version_date":"2017-12-23 07:25:56.000 +0800","version_description":"- Added Christmas theme<br>- All boards and checkers have been graphically improved. Try out your favourite board and marvel at the new graphics!<br>- Improved detail of boards for high resolution screens<br>- Added green spot indicators to show which checkers can be moved. This will prove convenient for many players and allow making faster moves.<br>- From now on game options are located at the right side of the board. Drag the board to the left or click the popup button on the right side to view them.<br>- Player, bet and time information is located at the left side of the board.<br>- Basic animation speed is now slightly faster and the game speed can no longer be modified in option<br>- Updated the game settings window<br>- Added new emojis<br>- Changed game logic upon bearing off checkers<br>- Fixed game logic bugs and also bugs which lead to app crashing"},{"version_id":"825686540","version_name":"1.7.9","version_date":"2018-01-20 17:11:39.000 +0800","version_description":"- Quick \"Sit&amp;Go\" tournaments are no longer displayed at the lower part of the tournament menu, only regular tournaments.<br>- 64 player limitation has been removed from regular tournaments. Now any amount of maximum players can register for a tournament, however the minimum amount is limited to 32 participants. If there are only less than 32 people registered for the tournament, it will be cancelled.<br>- Each match in regular tournaments now lasts until 2 points. This means that each player has a way to regain lead by winning with 2:1 and progressing to the next tour. Bet cube in tournaments is now available and the winning mode (backgammon, gammon) affects points at the end of the game.<br>- Changed time per move for quick \"Sit&amp;Go\" tournaments and regular tournaments. Just like stated in international rules there are only 12 seconds per move right now and additional time (red timer) which is allocated for the whole match (all rounds in a game between two players). For quick \"Sit&amp;Go\" tournaments this time is 2 minutes, for regular tournaments - 4 minutes, since in regular tourneys game lasts until two points. This way tournament games will become faster. Allocate your time wisely so you have enough additional time for the entire match.<br>- \"Time\" field has been added to the readiness window. First value indicates green timer (time per move which refills), second value indicates the red timer (additional time for the whole match that doesn't refill). <br>- Fixed a bug in player readiness window with \"Ready\" button not always working<br>- Tour number, point limit and current score is now displayed on the left side of the board<br>- Removed holiday theme<br>- Fixed bug in game logic<br>- Fixed minor bugs"},{"version_id":"826576242","version_name":"1.7.11","version_date":"2018-04-09 03:25:58.000 +0800","version_description":"- Added new tournament medals<br>- Added medal display in player's profile<br>- Removed “City\" field on profile<br>- Fixed bugs in the shop<br>- Fixed minor bugs"},{"version_id":"826877863","version_name":"1.7.12","version_date":"2018-05-02 14:55:51.000 +0800","version_description":"- Changed dice roll animation<br>- Added proxy-connection. In cases where direct connection to server fails, app will automatically try to connect via proxy <br>- Changed system when waiting for tour to start. Now player awaits for opponent in the board screen<br>- Fixed bugs with boards"},{"version_id":"827088275","version_name":"1.7.13","version_date":"2018-05-10 06:10:36.000 +0800","version_description":"- Changed server connection settings"},{"version_id":"828193503","version_name":"1.7.14","version_date":"2018-08-24 02:22:31.000 +0800","version_description":"- Updated interface<br>- Removed limit of friends list<br>- Regular, no gold games are available only with friends<br>- Added ability to spectate friend games<br>- Adding of friends now takes place through chat. Added additional function to add friends via invitation link and receive gold for invited friends.<br>- Fixed various bugs"},{"version_id":"828378021","version_name":"1.7.15","version_date":"2018-09-08 23:27:30.000 +0800","version_description":"- Fixed a bug in the tournament when you click on the \"Play\" button<br>- Fixed a situation where it was necessary to throw cubes, if it is so obvious that \"No moves\"<br>- Fixed support for iOS 7<br>- The gaming chat now works only with a friendly match. For regular games, players can exchange quick phrases.<br>- A player who looks through other people's matches can no longer read chat and throw fast phrases<br>- Above the board will appear the Eye icon with the players who view this match"},{"version_id":"828543552","version_name":"1.7.16","version_date":"2018-09-12 15:05:41.000 +0800","version_description":"Bug fixes in game logic"},{"version_id":"828703091","version_name":"1.7.18","version_date":"2018-09-25 19:31:44.000 +0800","version_description":"Crash fixes"},{"version_id":"829678758","version_name":"1.7.19","version_date":"2018-12-25 02:42:21.000 +0800","version_description":"- Added Holiday theme!<br>- Added 6 amazing emotes! Share your feelings during the game with the opponent!<br>- Added wonderful stickers to boards during tournament games to reflect the Holiday spirit!<br>- Changed in-game system of storing graphical components<br>- Various small fixes"},{"version_id":"829909799","version_name":"1.7.21","version_date":"2019-01-10 23:17:39.000 +0800","version_description":"Minor bug fixes"},{"version_id":"830106001","version_name":"1.7.23","version_date":"2019-01-29 11:40:10.000 +0800","version_description":"- Minor bug fixes"},{"version_id":"831184131","version_name":"1.7.26","version_date":"2019-05-08 17:41:25.000 +0800","version_description":"Change list 1.7.26:<br>- Implemented automatic opponent matchmaking<br>- Each bet now has an appropriate board<br>- Tournaments are now held on a different board<br>- Rematch in gold games against a single player is available only one time. Meaning - two players can play a gold game against each other only two consecutive times<br>- Level system has been abolished and starting Elo is now equal to 1500. Elo has been recalculated for each player<br>- Added option to invite a player to friends after a game<br>- Added sounds for emotes<br>- Chat has become full screen to make it easier to communicate<br>- Quick phrases and emotes are now on a single screen<br>- Disabled game chat between opponents in gold games and tournaments. Communicating with opponent is possible via quick phrases and emotes. If you want to have a chat with your opponent add them to friends, since chat is available in friend games<br>- Emotions and quick phrases now appear next to player's avatar<br>- Removed boards from the shop. All boards are available to all players depending on the bet<br>- Added some new emoji<br>- Minor graphical changes<br>- Minor changes"},{"version_id":"831271622","version_name":"1.7.27","version_date":"2019-05-11 17:53:12.000 +0800","version_description":"- Critical bug fixes"},{"version_id":"831286812","version_name":"1.7.28","version_date":"2019-05-14 11:41:16.000 +0800","version_description":"- Fixed critical bug in the shop<br>- Added choosing a board when playing with a friend"},{"version_id":"832001013","version_name":"1.7.29","version_date":"2019-07-19 03:07:54.000 +0800","version_description":"- Added \"bet lock\" option<br>- Added \"Board numeration\"<br>- Added \"Wooden board by default\" option<br>- Fixed bug upon backgammon win calculation<br>- Fixed bug upon bearing checkers off the board<br>- Updated the white board"},{"version_id":"832071406","version_name":"1.7.30","version_date":"2019-07-19 19:37:17.000 +0800","version_description":"- Fixed style selector"},{"version_id":"832080077","version_name":"1.7.31","version_date":"2019-07-20 15:18:11.000 +0800","version_description":"- Fixed critical bug in the game logic"},{"version_id":"832167193","version_name":"1.7.32","version_date":"2019-07-30 13:06:20.000 +0800","version_description":"- Fixed a bug in the game logic<br>- Added a cube bet in Narde against AI"},{"version_id":"832246164","version_name":"1.7.33","version_date":"2019-08-05 13:15:56.000 +0800","version_description":"- Fixed critical bug in the game logic"},{"version_id":"832964534","version_name":"1.7.35","version_date":"2019-09-29 14:25:27.000 +0800","version_description":"- Bug fixes"},{"version_id":"833207225","version_name":"1.7.36","version_date":"2019-10-21 02:10:10.000 +0800","version_description":"- Fixed a logical error at the end of the game which didn't allow match to finish<br>- Added ability to play gold games with friends. In these games Elo and experience cannot be gained.<br>- Chatting with a friend is now free. A “Friends” tab has been added in chat<br>- Unfinished messages are saved<br>- Improved news feed format with images and polls<br>- Player profile has been redesigned with added avatar"},{"version_id":"833421303","version_name":"1.7.37","version_date":"2019-11-04 02:41:00.000 +0800","version_description":"- Added a gallery section where players will be able to choose board and checker stickers, unique dice and emotes<br>- Gallery will get filled with cards which players will find in reward chests<br>- Event: Halloween! Regular tournament winner gets a chest which contains one of several holiday cards<br>- Changed background image in main menu<br>- Added background music in main menu<br>- Added \"Music\" option in game settings to disable background music<br>- Added option \"Show stickers\" during the game. Players who prefer a \"clean board\" can disable this option in right side panel during the game.<br>- Fixed bug upon entering game<br>- Fixed logical bug which lead to freezing of game"},{"version_id":"834114779","version_name":"1.7.39","version_date":"2019-12-24 07:35:48.000 +0800","version_description":"- Holidays and New Year is here! Let's celebrate in a warm and cozy atmosphere.<br>- Try the new game mode - weekly challenges! The idea of challenge is simple: winners get everything, losers get nothing. During the challenge for each 10 wins player gets a chest. What's inside? Win and find out!<br>- Small changes in gallery<br>- Added option to delete chat messages<br>- Bug fixes"},{"version_id":"834132138","version_name":"1.7.40","version_date":"2019-12-31 20:13:43.000 +0800","version_description":"- Critical bug fixes"},{"version_id":"835379281","version_name":"1.7.42","version_date":"2020-04-06 09:39:11.000 +0800","version_description":"- Added ability to spectate current and last games in challenge leaderboard<br>- Added nardegammon variant (narde with doubling cube)<br>- Fixed app crash<br>- Minor fixes in challenge section"},{"version_id":"839759481","version_name":"1.7.50","version_date":"2021-01-19 03:26:31.000 +0800","version_description":"- iPhone 12 support<br>- Reworked bonus system. Bonus gold can be acquired more frequently by watching an ad. You can use this feature at the shop<br>- Holiday Theme<br>- Fixed various small bugs"},{"version_id":"840109914","version_name":"1.7.51","version_date":"2021-01-21 18:25:57.000 +0800","version_description":"- Fixed the chest bug. Now it's being calculated on server side.<br>- Fixed notification upon server reset<br>- Fixed tiny dot animation in mini avatars<br>- Added closing of selected emote card (clicking an empty screen) in the gallery section<br>- Fixed an animation bug upon choosing emote cards<br>- NEW is not being shown if the card does not belong to player (has not yet been collected)<br>- Changed registration window, added confirmation window<br>- Fixed a bug with an alert upon unfinished single player game during authorisation<br>- Fixed bug with incorrect eye icon in friend list"},{"version_id":"840207715","version_name":"1.7.52","version_date":"2021-01-26 19:53:43.000 +0800","version_description":"- Fixed bug with window blocking at beginning of a game<br>- Fixed bug where player gets returned to lobby after a game<br>- Fixed bug with displaying room number<br>- Added option to skip authorization window at any situation<br>- Added button to view ads for gold bonus in lobby<br>- Changed ban screen window"}]