[{"version_id":"839402478","version_name":"3.39.1","version_date":"2020-12-08 10:18:17.000 +0800","version_description":"Teraz w aplikacji:\n<br>\n<br>- Proste inwestowanie - Sprawdź ile możesz zyskać i poznaj profil inwestora. Śledź wyniki i zarządzaj portfelem\n<br>\n<br>- Nowa zakładka Kontakt – od teraz łatwo przekażesz nam swoje sugestie lub złożysz reklamację.\n<br>\n<br>- Reklamacja operacji kartą – Twoja transakcja budzi wątpliwości? Zgłoś ją nam. Wejdź w Historię, wybierz pożądaną transakcję i kliknij czerwoną ikonę."},{"version_id":"840106006","version_name":"3.39.2","version_date":"2021-01-20 14:07:16.000 +0800","version_description":"Wgraliśmy kilka poprawek. Bankuj bez przeszkód!"},{"version_id":"840617810","version_name":"3.42.0","version_date":"2021-02-25 10:26:27.000 +0800","version_description":"Pay by card without a plastic<br>Check the app for details of your card<br><br>Conveniently arrange your operations<br>Order your credit card documents, reduce your credit card limit, or change the account to be repaid. Go to Your operations.<br><br>Choose your app language<br>Now you can change the application language to English. You can do it in Settings - Services."},{"version_id":"841465594","version_name":"3.43.0","version_date":"2021-04-16 14:25:53.000 +0800","version_description":"Od teraz w aplikacji możesz ustawić swój cel oszczędnościowy widoczny na pulpicie. Przejdź do karty oszczędności, przytrzymaj palcem i wybierz cel, który chcesz widzieć."},{"version_id":"842064216","version_name":"3.43.1","version_date":"2021-05-05 09:19:54.000 +0800","version_description":"Poprawka błędu związanego z niedostępnością dla klienta modułu ubezpieczeń"},{"version_id":"842957528","version_name":"3.44.0","version_date":"2021-07-09 06:02:26.000 +0800","version_description":"Wgraliśmy kilka poprawek. Bankuj bez przeszkód!"},{"version_id":"843238278","version_name":"3.44.1","version_date":"2021-07-23 15:49:10.000 +0800","version_description":"Chcemy jeszcze lepiej chronić Twoje pieniądze, dlatego zablokowaliśmy możliwość nagrywania zawartości Twojego konta w aplikacji mobilnej. Z tej funkcji korzystają złośliwe programy, które służą do zdalnej kontroli nad kontem i pieniędzmi użytkownika. By bezpiecznie korzystać z aplikacji, odinstaluj złośliwe oprogramowanie na swoim telefonie lub wyłącz możliwość nagrywania ekranu Twojego konta w aplikacji mobilnej."},{"version_id":"843396096","version_name":"3.45.0","version_date":"2021-08-05 09:06:29.000 +0800","version_description":"Od teraz w aplikacji potwierdzisz operacje Face ID lub Touch ID."},{"version_id":"843817437","version_name":"3.46.0","version_date":"2021-09-01 12:47:09.000 +0800","version_description":"Od teraz w aplikacji:\n<br>* zautoryzujesz operacje Face ID lub Touch ID<br>\n<br>* ocenisz otrzymane wiadomości, dzięki temu będziemy mogli je pisać lepiej"},{"version_id":"844634666","version_name":"3.47.0","version_date":"2021-10-12 15:47:53.000 +0800","version_description":"Wgraliśmy kilka poprawek. Bankuj bez przeszkód!"}]