[{"version_id":"12639450","version_name":"2.0.3","version_date":"","version_description":""},{"version_id":"274912631","version_name":"2.3","version_date":"","version_description":""},{"version_id":"4022968","version_name":"1.0","version_date":"","version_description":""},{"version_id":"5112602","version_name":"1.0.5","version_date":"","version_description":""},{"version_id":"5530568","version_name":"1.06","version_date":"","version_description":""},{"version_id":"6286171","version_name":"1.11","version_date":"","version_description":""},{"version_id":"813018607","version_name":"4.4","version_date":"","version_description":""},{"version_id":"813248107","version_name":"4.5","version_date":"","version_description":""},{"version_id":"813716671","version_name":"4.6","version_date":"","version_description":""},{"version_id":"814757866","version_name":"5.0","version_date":"","version_description":""},{"version_id":"815409653","version_name":"5.1","version_date":"","version_description":""},{"version_id":"815758625","version_name":"5.1.1","version_date":"","version_description":""},{"version_id":"816366019","version_name":"5.2","version_date":"","version_description":""},{"version_id":"816975013","version_name":"5.3","version_date":"","version_description":""},{"version_id":"818008524","version_name":"6.0","version_date":"","version_description":""},{"version_id":"818096535","version_name":"6.0.1","version_date":"","version_description":""},{"version_id":"818546386","version_name":"6.0.2","version_date":"","version_description":""},{"version_id":"818749880","version_name":"6.0.3","version_date":"","version_description":""},{"version_id":"818983365","version_name":"6.1","version_date":"","version_description":""},{"version_id":"819394032","version_name":"6.2","version_date":"","version_description":""},{"version_id":"819856892","version_name":"6.2.1","version_date":"","version_description":""},{"version_id":"820195898","version_name":"6.3","version_date":"","version_description":""},{"version_id":"820612599","version_name":"6.4","version_date":"","version_description":""},{"version_id":"821145403","version_name":"6.5","version_date":"","version_description":""},{"version_id":"821603770","version_name":"6.6","version_date":"","version_description":""},{"version_id":"822022994","version_name":"6.7","version_date":"","version_description":""},{"version_id":"822265121","version_name":"6.8","version_date":"","version_description":""},{"version_id":"822836191","version_name":"6.9","version_date":"","version_description":""},{"version_id":"823025720","version_name":"6.10","version_date":"","version_description":""},{"version_id":"823189483","version_name":"6.11","version_date":"","version_description":""},{"version_id":"823312982","version_name":"6.12","version_date":"","version_description":""},{"version_id":"823549917","version_name":"17.9.1","version_date":"2017-09-06 08:23:08.000 +0800","version_description":"В культовом фильме «Автостопом по галактике» сверхразумная раса существ для того, чтобы найти Окончательный Ответ на величайший вопрос Жизни, Вселенной и Всего Такого, создала сверхмощный компьютер Думатель, равного которому не было во Вселенной.<br>И вот, спустя семь с половиной миллионов лет непрерывных вычислений, результаты которых были тщательно проверены несколько десятков раз, самая безошибочная машина в истории выдала ответ, который шокировал все разумные расы и поставил под вопрос незыблемые устои и традиции, двигавшие цивилизации вперед и дававший им надежду.<br>Ответ может шокировать и вас, поэтому просим особо впечатлительных дальше не читать, ну а самых смелых с гордостью и трепетом обрадуем, что Ответа на величайший вопрос Жизни, Вселенной и Всего Такого мы вам, конечно, не дадим (посмотрите фильм и узнайте его сами), а вот об изменениях в новой версии приложения расскажем.<br><br>В версии 17.9.1 (да-да, мы немного изменили нумерацию) добавлена возможность покупки фильмов коллекциями (так получается намного дешевле!) и, по традиции, поправлены мелкие баги и ошибки.<br>Всего хорошего, и спасибо за рыбу!"},{"version_id":"823588362","version_name":"17.9.2","version_date":"2017-09-09 09:57:27.000 +0800","version_description":"В культовом фильме «Автостопом по галактике» сверхразумная раса существ для того, чтобы найти Окончательный Ответ на величайший вопрос Жизни, Вселенной и Всего Такого, создала сверхмощный компьютер Думатель, равного которому не было во Вселенной.<br>И вот, спустя семь с половиной миллионов лет непрерывных вычислений, результаты которых были тщательно проверены несколько десятков раз, самая безошибочная машина в истории выдала ответ, который шокировал все разумные расы и поставил под вопрос незыблемые устои и традиции, двигавшие цивилизации вперед и дававший им надежду.<br>Ответ может шокировать и вас, поэтому просим особо впечатлительных дальше не читать, ну а самых смелых с гордостью и трепетом обрадуем, что Ответа на величайший вопрос Жизни, Вселенной и Всего Такого мы вам, конечно, не дадим (посмотрите фильм и узнайте его сами), а вот об изменениях в новой версии приложения расскажем.<br><br>В новой версии добавлена возможность покупки фильмов коллекциями (так получается намного дешевле!) и, по традиции, поправлены мелкие баги и ошибки.<br>Всего хорошего, и спасибо за рыбу!"},{"version_id":"823646865","version_name":"17.9.3","version_date":"2017-09-22 07:14:20.000 +0800","version_description":"Говорят, во время съемок фантастической драмы “Армагеддон“, в которой отряд бурильщиков летит в космос взрывать угрожающий Земле астероид, исполнитель главной роли Бэн Аффлек подошел к режиссеру Майклу Бэю и сказал, что значительно проще было бы научить астронавтов бурению, на что Майкл ответил - “Закрой рот, Бэн“.<br><br>Говорят, что совсем недавно один из наших разработчиков сказал, что было бы значительно проще во время релиза приложения, добавляющего покупки фильмов коллекциями, сразу добавить возможность переходить в коллекцию с карточки фильма, на что ему ответили - “Иди работай, Ваня“.<br><br>Мы были неправы, поэтому добавляем такую возможность только сейчас, заодно оптимизировав приложение под iOS 11."},{"version_id":"823848605","version_name":"17.10.1","version_date":"2017-10-09 06:27:21.000 +0800","version_description":"Иногда кино имитирует жизнь, а иногда жизнь имитирует кино.<br>Доподлинно известно, что в культовой комедии \"Большой Лебовски\" главный герой в исполнении Джеффа Бриджеса, которого все называют просто Чувак, произносит слово \"мужик\" 147 раз.<br>Практически доподлинно известно, что во время работы над этим обновлением наш очень похожий внешне на Чувака главный разработчик, которого все называют просто Данил (потому что это его имя), произнес слово «онбординг» не менее 150 раз. <br>«Большой Лебовски» получил культовый статус – уверены, нововведения в свежей версии приложения вам тоже понравятся:<br>- мы полностью переработали авторизацию и регистрацию – теперь удобнее, быстрее и нагляднее;<br>- мы добавили онбординг при первом запуске приложения – специальный инструмент, позволяющий путем выбора нравящихся фильмов сделать рекомендации точнее;<br>- помимо онбординга, новым пользователям мы покажем еще и короткое видео, рассказывающее о сервисе все самое интересное;<br>- естественно, мы не могли не пофиксить мелкие баги и ошибки."},{"version_id":"824008104","version_name":"17.10.2","version_date":"2017-10-23 08:20:23.000 +0800","version_description":"В фильме Дэвида Финчера «Социальная сеть» Эдуардо Саверин, один из создателей Фейсбука, пишет алгоритм работы соцсети, изменившей мир, буквально на оконном стекле. Мы вдохновились этой сценой и написали на офисном окне код, добавляющий в новую версию приложения денежные переводы, маски для селфи, истории, бесплатную музыку, возможность смотреть кино при выключенном экране и субтитры на латыни к каждому фильму. К сожалению, на выходных в нашем офисе мыли окна, поэтому обновления такие:<br>- новый красивый экран коллекции фильмов;<br>- исправление нескольких неприятных ошибок."},{"version_id":"824215244","version_name":"17.10.3","version_date":"2017-11-01 09:27:10.000 +0800","version_description":"Недавно у нас вышел отличный комедийный сериал с запоминающимся названием «Кевин спасет мир (если получится)». Решив, что в нем заложена воистину гениальная жизненная позиция, в очередном обновлении приложения мы сделали следующее:<br>- возможно, исправили ошибку на экране «Создатели»;<br>- с некоторой долей вероятности, повысили стабильность работы с сетью;<br>- очень может быть, кто-то из нас поправил пачку мелких багов."},{"version_id":"824257381","version_name":"17.11.1","version_date":"2017-11-04 12:07:24.000 +0800","version_description":"Джордж Лукас, один из наших любимых режиссеров, имеет потрясающее хобби - он берет оригинальные «Звездные войны», добавляет туда пару новых сцен, изменяет несколько кадров, чуть фиксит спецэффекты и выпускает эту версию в продажу как новое издание, которое фанаты сметают как горячие пирожки (он делал так уже раз пять).<br><br>Что ж, мы на лавры Лукаса не претендуем, но представляет вам полное расширенное юбилейное финальное издание нашего последнего обновления приложения, в которое мы добавили поддержку iPhone X."},{"version_id":"824434517","version_name":"17.11.2","version_date":"2017-11-21 14:01:23.000 +0800","version_description":"У всех же в детстве было такое – вы возвращались из школы домой по пустынной улице, небо было в серых тучах, и ваше внимание могла привлечь любая яркая деталь. Чаще всего ей становился красный шарик, парящий над канализационным стоком. Поскольку любопытство – ваше второе имя, вы не могли не подойти к шарику, услышав откуда-то снизу странный шепот, зовущий вас по имени и повторяя «мы все здесь летаем». Опустившись на колени и посмотрев в сток, вы видели зловещего размалеванного клоуна, который, взвизгивая, предлагал вам сладкую вату, игрушки и посмотреть вместе с ним какой-нибудь фильм в мобильном приложении какого-нибудь крупнейшего онлайн-кинотеатра.<br>Но вас так легко не провести – вы понимали, что никакой фильм он вам не покажет, потому что в канализации плохо ловит Интернет, а с офлайн-просмотром на тот момент в приложении были некоторые проблемы. Вы отказывались и дальше шли домой, размахивая шариком и напевая «не в этот раз, глупый Пеннивайз».<br>Гордимся вами, но предупреждаем, что во второй раз такой трюк может не пройти – большинство проблем с офлайн-просмотром в этой версии приложения мы устранили."},{"version_id":"825071444","version_name":"17.11.3","version_date":"2017-11-30 17:15:34.000 +0800","version_description":"Недавно Ридли Скотт вырезал из своего уже готового фильма «Все деньги мира» сцены с оскандалившимся Кевином Спейси, заменив его на другого актера. Узнав, что, оказывается, так можно было, в будущих версиях приложения мы планируем добавить режим «No space for Spacey», который во всех фильмах и сериалах с Кевином, от «Карточного домика» до «Красоты по-американски», будет заменять его персонажа на Дэнни ДеВито.<br>Ну, а в этой версии обновления такие:<br>-  возвращена (наконец-то) возможность подписки на push-уведомления;<br>-  механизм авторизации стал безопаснее;<br>-  исправлена проблема с загрузкой сериалов для пользователей из Европы и Америки."},{"version_id":"825205527","version_name":"17.12.1","version_date":"2017-12-06 09:17:37.000 +0800","version_description":"Никто не застрахован от ошибок – уже после окончания съемок недавней «Лиги справедливости» создателям фильма пришлось вызвать на досъемки исполнителя роли Супермена Генри Кавилла, который на тот момент обзавелся пышными усами и по контракту не мог их сбрить. Деваться было некуда, и в авральном режиме специалисты по спецэффектам убирали усы актера на компьютере – наверно, не об этом они мечтали в детстве. <br>Примерно в таком же авральном режиме мы пилили это обновление, которое исправляет один весьма неприятный баг – обязательно обновитесь, или усатый Супермен теперь будет мерещиться вам в каждом фильме DC."},{"version_id":"825273313","version_name":"17.12.2","version_date":"2017-12-15 13:01:56.000 +0800","version_description":"В кинематографе хорошее название для фильма должно выполнять не только идентификационную функцию, но и быть его лицом, делая тонкий намек на сюжетную линию, визуальный ряд и атмосферу кино, слегка передавая суть, но не говоря слишком многое, чтобы у зрителя было пространство для удивления.<br><br>Совсем недавно у нас стартовал один из лучших российских фильмов года с лаконичным названием «Как Витька Чеснок вез Леху Штыря в дом инвалидов». Как раз в это же время мы выпускаем новую версию приложения с кодовым названием «Как наши разработчики исправили проблему с анимацией при открытии плеера, сделали более правильное переключение плеера в полноэкранный режим в iPhone X, исправили проблему, когда купленные фильмы могли быть недоступны в приложении, убрали лишнюю рекламу для пользователей с подпиской и пофиксили кучу мелких багов ошибок».<br><br>К сожалению, список изменений в этой версии – секретная информация."},{"version_id":"825401345","version_name":"17.12.3","version_date":"2017-12-28 10:12:56.000 +0800","version_description":"Ах, 2017-ый - отличный в плане кино получился год! Чего тут только не было - вселенская несправедливость на “Оскаре“, когда прокатили великолепный “Ла-Ла Ленд“, кассовый рекорд “Пиратов Карибского моря“, выход сразу двух отличных российских фильмов про космос, триумф “Нелюбви“,  возвращение “Бегущего по лезвию“,  “Трейнспоттинга” и “Могучих рейнджеров“, скандал из-за самизнаетекакогофильма, всемирный шок от “мамы!” Аранофски, новый Нолан, Райт, Шьямалан и еще куча всего прекрасного. Особенно отрадно, что вишенкой на торте этого великолепия стало “Оно“, который мы искренне считаем лучшим фильмом года и который уже доступен у нас на сервисе.<br><br>Все это время мы с большой любовью работали над нашим приложением, чтобы вы вместе с нами могли разделить самую большую любовь на свете - любовь к искусству.  <br>Поздравляем вас с Новым годом и от всей души надеемся, что 2018-ый будет успешен для вас, для нас и для всего мирового кинематографа. В новой версии приложения мы добавили новогодние украшения и поправили кучу мелких багов, чтобы в Новом году у вас сразу было меньше поводов для печали.<br>С праздником!"},{"version_id":"825650459","version_name":"18.1.1","version_date":"2018-01-23 11:23:51.000 +0800","version_description":"Очень важные события, уже произошедшие в 2018 году:<br>1.  1975-летний юбилей со дня вторжения римских легионов под командованием Авла Платия на британские острова.<br>2.  Эксклюзивная премьера на ivi исторического сериала «Британия», где гордые и воинственные кельты дают отпор могущественной римской армии, зачем-то решившей установить имперские порядки на кельтских землях.<br>3.  Вышло обновление нашего приложения, благодаря которому управлять плеером теперь можно с внешних устройств (например, с гарнитуры)<br><br>Как минимум одно из этих событий обязательно войдет в учебники истории, вот увидите"},{"version_id":"825790741","version_name":"18.1.2","version_date":"2018-01-31 09:24:16.000 +0800","version_description":"Иронично, что в российском дубляже черной комедии «Субурбикон» Мэтта Дэймона озвучивает очень похожий на него внешне Гарик Харламов.<br>Не менее иронично, что хронометраж другой комедии с Мэттом Дэймоном, «Короче», длиннее среднестатистической продолжительности голливудского фильма примерно на полчаса.<br>Но знаете, что еще более иронично? В этом обновлении мы убрали «+» из названия подписки «ivi+» (теперь это просто «подписка ivi»), но плюсов (как и фильмов с Мэттом Дэймоном) от этого в приложении стало только больше"},{"version_id":"825894252","version_name":"18.2.1","version_date":"2018-02-14 09:05:05.000 +0800","version_description":"Недавно нам написало несколько человек — мол, списки изменений слишком длинные и им лень все это читать.<br>Во-первых, обидно.<br>Во-вторых, мы официально запрещаем вам смотреть выигравшего семь Оскаров «Лоуренса Аравийского», ведь он идёт аж 3 часа 36 минут (раньше такое в кинотеатрах смотрели, и ничего!)<br>В-третьих, изменения такие:<br>- Новые улучшенные субтитры<br>- Улучшенная загрузка картинок при плохом соединении<br>- Возможность оценить сериал в плеере после просмотра сезона."},{"version_id":"826184707","version_name":"18.2.2","version_date":"2018-03-06 11:13:59.000 +0800","version_description":"После слегка разочаровывающих результатов Оскара мы решили, что теперь будем мерить крутость вещей по шкале от нуля до трех билбордов. <br>Например, «Форма воды» получает 2 по шкале из трех билбордов.<br>«Три билборда на границе Эббинга, Миссури» — 3/3 билбордов.<br>Это восхитительное обновление — 4/3 билбордов:<br><br>- просмотр сериалов стал еще удобнее;<br>- добавлена информация о датах выхода новых серий;<br>- поправлены мелкие баги и ошибки;<br>- билборды билборды билборды билборды."},{"version_id":"826423945","version_name":"18.3.1","version_date":"2018-03-30 08:48:34.000 +0800","version_description":"Лучшие вещи в мире удивительны, незабываемы и скоротечны — первая любовь, кинотеатральный прокат «Довлатова», список изменений в этом обновлении.<br><br>- сделали немножко исправлений и улучшений в сериалах;<br>- поправили еще чутка прочих багов и ошибок."},{"version_id":"826764941","version_name":"18.4.1","version_date":"2018-05-07 08:09:16.000 +0800","version_description":"Топ-3 самых героических поступков в истории киноиндустрии:<br>3. Самостоятельно выполнить трюк на самолете в пятой части «Миссии: Невыполнима» — как Том Круз;<br>2. Набрать, а затем сбросить 20 кг во время съемок в комедии «Я худею» — как Александра Бортич;<br>1. Сделать долгожданное обновление приложения, делающее ivi в десятки раз круче, но отложить его до следующей версии — как наши разработчики.<br><br>Тем не менее, и в этой версии улучшений достаточно:<br>- сделали более умные и полезные уведомления;<br>- постепенно добавляем поддержку перемотки с превью кадра в плеере;<br>- добавили карточки фильмов, которые появятся в приложении в ближайшее время;<br>- ускорили работу плеера."},{"version_id":"827158744","version_name":"18.5.1","version_date":"2018-05-21 08:23:42.000 +0800","version_description":"Изначально список изменений был в 2 раза длиннее, но потом наш программист Констанос щелкнул пальцами, и половина обновлений со словами «Мистер Смакт, я плохо себя чувствую» испарилась. Вот то, что осталось:<br>- исправлена проблема с авторизацией по коду в приложение ivi на Smart TV;<br>- исправлена проблема с приостановкой воспроизведения при блокировке устройства во время стриминга на Apple TV."},{"version_id":"827390780","version_name":"18.5.2","version_date":"2018-06-07 08:36:08.000 +0800","version_description":"Мы пофиксили несколько неприятных багов и ошибок, а еще добавили секретный усатый режим, включение которого добавляет всем персонажам всех фильмов усы как у Александра Петрова в «Гоголе.Вие» (да, мы точно делали что-то подобное)"},{"version_id":"827540865","version_name":"18.6.1","version_date":"2018-07-02 10:58:27.000 +0800","version_description":"Мало кто знает, но фантастический блокбастер Стивена Спилберга сначала назывался «Первому игроку приготовиться к выходу на ivi \"Первому игроку приготовиться\" и обновить приложение»"},{"version_id":"827925686","version_name":"18.7.1","version_date":"2018-09-10 08:33:45.000 +0800","version_description":"Релиз с исправлениями и улучшениями :)"},{"version_id":"827925686","version_name":"19.9.1","version_date":"2019-09-20 10:26:30.000 +0800","version_description":"Всё лучшее — детям!<br>Если вы с этим не согласны, попробуйте обсудить эту тему со своими детьми, и они приведут вам тысячу причин, почему это так. Нам хватило одной: ребёнок должен развиваться. И поэтому мы улучшили наше приложение и сделали его ещё полезнее для маленьких зрителей.<br>Теперь вы сможете создать персональный профиль для каждого ребёнка. Детям не придется больше спорить между собой о том, какие мультфильмы должны быть в подборках.<br>Также вам больше не нужно гадать, поместится этот сериал или нет. Мы точно покажем, сколько свободного места осталось на устройстве.<br>Ещё одна приятная мелочь: приложение запоминает выбранное вами качество для загрузки и предлагает его в дальнейшем.<br>Вам остается только вспомнить, кому из детей вы обещали первому устроить просмотр на мобильном устройстве."},{"version_id":"827925686","version_name":"19.3.1","version_date":"2019-03-12 09:26:39.000 +0800","version_description":"Мы всегда слышали наших пользователей. Новая версия приложения не исключение. Теперь для тех, у кого все еще нет подписки, доступны разделы смотреть позже и продолжить просмотр.<br>И это только начало. Оставляйте отзывы и делитесь своими предложениями.<br><br>С уважением и заботой о пользователях,<br>команда ivi"},{"version_id":"827925686","version_name":"19.2.1","version_date":"2019-02-18 11:50:14.000 +0800","version_description":"В обновлении фиксы багов и новые фичи:<br>• у вас несколько аккаунтов и вы хотите восстановить покупки? Теперь проблем с этим не будет.<br>• как узнать сколько новинок на сервисе вы пропустили? Посмотрите на иконку приложения и количество непрочитанных уведомлений.<br>• понять, загружена ли серия любимого сериала, можно по новенькому индикатору «загружена».<br><br>С уважением,<br>ваша команда по истреблению багов"},{"version_id":"828615506","version_name":"18.8.1","version_date":"2018-09-19 10:37:11.000 +0800","version_description":"Релиз с исправлениями и улучшениями :)"},{"version_id":"828920735","version_name":"18.10.1","version_date":"2018-10-18 06:59:03.000 +0800","version_description":"Самое масштабное обновление в истории ivi! ТАКОГО ВЫ ЕЩЕ НЕ ВИДЕЛИ! <br>Сотни программистов и дизайнеров трудились над обновлением на протяжении многих месяцев,  чтобы представить лучший продукт ivi из всех, что мы когда-либо делали.<br>Запускайте скорее наше обновленное приложение, и да пребудет с вами кино от ivi. Всегда и везде.<br>P.S. И, конечно же, мы сделали поддержку iOS 12 и всех новомодных устройств."},{"version_id":"829078485","version_name":"18.10.2","version_date":"2018-10-29 09:35:33.000 +0800","version_description":"Самое масштабное обновление в истории ivi! ТАКОГО ВЫ ЕЩЕ НЕ ВИДЕЛИ! <br>Сотни программистов и дизайнеров трудились над обновлением на протяжении многих месяцев, чтобы представить лучший продукт ivi из всех, что мы когда-либо делали.<br>Запускайте скорее наше обновленное приложение, и да пребудет с вами кино от ivi. Всегда и везде.<br>P.S. И, конечно же, мы сделали поддержку iOS 12 и всех новомодных устройств."},{"version_id":"829113942","version_name":"18.11.1","version_date":"2018-11-19 15:05:31.000 +0800","version_description":"Мы постоянно работаем над качеством нашего продукта, поэтому сейчас вы получаете очередное обновление с улучшениями."},{"version_id":"829349319","version_name":"18.11.2","version_date":"2018-11-27 07:37:57.000 +0800","version_description":"Привет, друзья! У нас вышел очередной апдейт: небольшие улучшения и обновление заставок."},{"version_id":"829433579","version_name":"18.12.1","version_date":"2018-12-04 08:56:38.000 +0800","version_description":"Если вы отключите подписку на ivi, в нашем офисе будет грустить один котик. С появлением нового опроса при закрытии подписки мы сможем узнать вас чуточку лучше. А котик узнает, в каком направлении развивать ваше любимое приложение и больше не будет грустить.<br>Viva la новый релиз!"},{"version_id":"829516732","version_name":"18.12.2","version_date":"2018-12-21 13:35:05.000 +0800","version_description":"- Постеры к фильмам загрузятся быстрее, чем вы прочитаете “самый крупный легальный кинотеатр“. Это значит, что мы оптимизировали механизм загрузки и отрисовки обложек для фильмов и сериалов.<br>- Пропустить новую серию стало сложнее. На постере так и будет написано: “новая серия“. А значит, пора отбросить дела и бежать смотреть сериал.<br>- Ходят слухи, что скоро Новый год. Поэтому мы добавили Деда Мороза и снега в приложение ivi, чтобы вы могли смотреть на снег пока смотрите ivi.<br><br>С наилучшими пожеланиями,<br>команда ivi по разработке хорошего настроения"},{"version_id":"830063775","version_name":"19.1.1","version_date":"2019-02-07 11:08:31.000 +0800","version_description":"Что 2019 год нам принес? Правильно, обновление и новые фичи!<br>• Чтобы посмотреть все серии сериала «След» понадобится 52 дня, 9 часов и 20 минут. Это самый длинный сериал на ivi. А самый длинный пакет подписки на ivi — 12 месяцев, как раз хватит чтобы посмотреть все сезоны! А управлять подпиской теперь можно прямо из приложения. В наличии пакеты по 1, 3, 6 и 12 месяцев.<br>• Что происходит, когда вы покупаете контент? Проверьте сами! Спойлер: теперь можно перейти к просмотру контента сразу после покупки.<br>• Теперь ничто не помешает смотреть загруженный контент. Мы пофиксили досадный баг связанный с просмотром при выключенном интернете уже скачанных серий.<br><br>С наилучшими пожеланиями,<br>команда ivi по подсчету длительности сериалов"},{"version_id":"830222925","version_name":"19.2.1","version_date":"2019-02-18 11:50:14.000 +0800","version_description":"В обновлении фиксы багов и новые фичи:<br>• у вас несколько аккаунтов и вы хотите восстановить покупки? Теперь проблем с этим не будет.<br>• как узнать сколько новинок на сервисе вы пропустили? Посмотрите на иконку приложения и количество непрочитанных уведомлений.<br>• понять, загружена ли серия любимого сериала, можно по новенькому индикатору «загружена».<br><br>С уважением,<br>ваша команда по истреблению багов"},{"version_id":"830495355","version_name":"19.3.1","version_date":"2019-03-12 09:26:39.000 +0800","version_description":"Мы всегда слышали наших пользователей. Новая версия приложения не исключение. Теперь для тех, у кого все еще нет подписки, доступны разделы смотреть позже и продолжить просмотр.<br>И это только начало. Оставляйте отзывы и делитесь своими предложениями.<br><br>С уважением и заботой о пользователях,<br>команда ivi"},{"version_id":"830770194","version_name":"19.4.1","version_date":"2019-04-04 10:38:24.000 +0800","version_description":"В этом обновлении — «Игра престолов», 8-й сезон! Смотрите на телеканале FOX 15 апреля в 22:00, по подписке ivi — с 16 апреля.<br>«Игра престолов», «Ходячие мертвецы», «Готэм» —  не пропускайте новые сезоны.<br>Теперь следить за драконами, зомби или детективами проще простого: для новых сериалов телеканала FOX — новая карточка. Мы сделали специальные страницы сериалов: индивидуальное оформление для каждого сериала с указанием дат выхода новых серий. Заходите в приложение и убедитесь сами.<br><br>С уважением,<br>команда ivi по защите Семи королевств от белых ходоков."},{"version_id":"830872437","version_name":"19.4.2","version_date":"2019-04-06 08:26:14.000 +0800","version_description":"Это обновление для того, чтобы сказать спасибо вам — нашим пользователям.<br><br>Чтобы приложение радовало вас новыми удобным интерфейсом, новыми функциями, присылайте свои идеи support@ivi.ru<br><br>С уважением,<br>команда ivi по выпуску обновлений."},{"version_id":"831003716","version_name":"19.4.3","version_date":"2019-05-06 09:22:16.000 +0800","version_description":"В этой версии мы исправили некоторые ошибки и сделали технические улучшения. Смотреть кино, сериалы и мультфильмы на ivi стало ещё удобнее."},{"version_id":"831209888","version_name":"19.6.1","version_date":"2019-06-13 14:26:47.000 +0800","version_description":"Теперь можно настроить ivi с учетом своих интересов. Вы никогда не встретитесь с любимым сериалом бабушки, а дети не увидят ваши детективы. Заведите для членов семьи персональные профили и каждый получит свой кинотеатр. Без чужих настроек и фильмов."},{"version_id":"831773959","version_name":"19.6.2","version_date":"2019-07-03 09:54:11.000 +0800","version_description":"Теперь можно настроить ivi с учетом своих интересов. Вы никогда не встретитесь с любимым сериалом бабушки, а дети не увидят ваши детективы. Заведите для членов семьи персональные профили и каждый получит свой кинотеатр. Без чужих настроек и фильмов.<br><br>P.S. Кстати — информация для всех любителей ТВ каналов: они переехали в Каталог. Ищите их теперь там.<br><br>С уважением, команда ivi"},{"version_id":"831884007","version_name":"19.7.1","version_date":"2019-08-01 10:54:51.000 +0800","version_description":"О необходимости быстрой перемотки говорили многие наши пользователи. И вот, принимайте работу!<br><br>Запускайте плеер. Инструкция на экране подскажет, куда нажимать, чтобы промотать на 10 секунд вперед или назад. Это удобно, если вы любите пересматривать эффектные сцены или не выносите длинных диалогов.<br><br>Кстати, переключать персональные профили можно без интернета. А для детского профиля отфильтрованы все загрузки: ни один взрослый фильм не попадет в коллекцию вашего ребенка.<br><br>И наконец, у вас будет больше возможностей для выбора качества видео. Даже если устройство не поддерживает все разрешения, ничто не помешает вам посмотреть это кино на другом экране."},{"version_id":"832362612","version_name":"19.8.1","version_date":"2019-08-29 09:31:56.000 +0800","version_description":"Наш главный разработчик — перфекционист. Мы пытались отправить его в отпуск, но он отказался. И теперь, вместо возможности послушать шум океана, он дал всем возможность поменять длительность подписки. Одним касанием вы можете настроить для себя оптимальные условия и смотреть кино еще выгоднее. Регулярно платите каждый месяц? А можете каждый месяц экономить по 149 рублей, если сразу подключите годовую подписку.<br><br>На этом он не остановился и сделал так, чтобы ваш отпуск точно удался. Загрузите фильмы в свой профиль заранее и вам не придется скучать в самолете или на пляже. И даже скачивая в роуминге, ваш трафик не пострадает. Теперь при загрузке не через Wi-Fi всегда появляется предупреждающий баннер. Отдыхайте и смотрите кино в приложении ivi."},{"version_id":"832569795","version_name":"19.9.1","version_date":"2019-09-20 10:26:30.000 +0800","version_description":"Всё лучшее — детям!<br>Если вы с этим не согласны, попробуйте обсудить эту тему со своими детьми, и они приведут вам тысячу причин, почему это так. Нам хватило одной: ребёнок должен развиваться. И поэтому мы улучшили наше приложение и сделали его ещё полезнее для маленьких зрителей.<br>Теперь вы сможете создать персональный профиль для каждого ребёнка. Детям не придется больше спорить между собой о том, какие мультфильмы должны быть в подборках.<br>Также вам больше не нужно гадать, поместится этот сериал или нет. Мы точно покажем, сколько свободного места осталось на устройстве.<br>Ещё одна приятная мелочь: приложение запоминает выбранное вами качество для загрузки и предлагает его в дальнейшем.<br>Вам остается только вспомнить, кому из детей вы обещали первому устроить просмотр на мобильном устройстве."},{"version_id":"832857853","version_name":"19.10.1","version_date":"2019-10-22 16:02:23.000 +0800","version_description":"Вы можете забыть дома ключи и даже какой сегодня день недели. Но с обновленными уведомлениями вы точно не забудете о своих любимых сериалах и фильмах. Теперь вы первым узнаете, когда появится новая серия, выйдет долгожданный сезон или будет добавлен в подписку нашумевший фильм. Представьте: вечер, дорога домой и приятный сюрприз – сообщение о выходе новой серии.<br><br>На этом изменения не заканчиваются. Загружайте фильм на свой смартфон, смотрите в дороге без Интернета и продолжайте дома на своем телевизоре с того места, где остановились."},{"version_id":"833286035","version_name":"19.11.1","version_date":"2019-11-18 11:59:08.000 +0800","version_description":"Обновления происходят каждый день, но самые полезные — в приложении ivi. Скорее обновляйте и проверяйте изменения."},{"version_id":"833655883","version_name":"19.12.1","version_date":"2019-12-20 09:12:52.000 +0800","version_description":"В канун Нового Года мы хотим поделиться с вами приятным изменением.<br><br>Рады представить вам обновлённый набор стикеров для iMessage. Они прокачены атмосферой и энергетикой кино. Уверены, каждый поклонник фильмов и сериалов найдёт в них себя.<br><br>Продолжайте делиться своими киноэмоциями, а мы продолжим и дальше совершенствовать приложение ради вас."},{"version_id":"834097410","version_name":"20.1.1","version_date":"2020-01-13 15:07:51.000 +0800","version_description":"Мы продолжаем улучшать обновленное приложение ivi. Если вы хотите отправить нам отзыв по работе приложения пишите на support@ivi.ru или звоните по номеру 8 800 234-49-23"},{"version_id":"834432285","version_name":"20.2.1","version_date":"2020-02-12 09:52:39.000 +0800","version_description":"Знакомьтесь с фильмами в обновленном приложении ivi с ещё большим комфортом. <br>Запускайте дополнительные материалы и регулируйте настройки воспроизведения, не останавливая ролик: прикоснитесь к экрану и выберите «Качество видео», «Языки» или «Субтитры». <br>Ничто не сможет прервать трейлер: нажмите на значок замка – включится блокировка экрана. Всё просто, быстро и удобно."},{"version_id":"834687710","version_name":"20.2.2","version_date":"2020-02-19 09:54:00.000 +0800","version_description":"Мы продолжаем улучшать обновленное приложение ivi. Если вы хотите отправить нам отзыв по работе приложения пишите на support@ivi.ru или звоните по номеру 8 800 234-49-23"},{"version_id":"834777565","version_name":"20.3.1","version_date":"2020-03-17 10:49:20.000 +0800","version_description":"В приложении появился раздел «Спорт». Теперь на ivi вы сможете смотреть не только любимые фильмы и сериалы, но и спортивные матчи.&nbsp;Пока что раздел работает в бета-режим, и мы ждем от вас писем и комментариев о всех недочетах.<br>А пока почти все спортивные события в мире временно взяли паузу, предлагаем провести вечер за просмотром фильмов на любой вкус. Фантастический боевик «Кома» и романтическая комедия «Марафон желаний» с Тарасовой, Нагиевым и Миногаровой эксклюзивно в подписке ivi."},{"version_id":"835145321","version_name":"20.4.1","version_date":"2020-05-25 11:56:46.000 +0800","version_description":"Официально представляем первое обновление в истории ivi, которое писалось халатно. Не в том смысле, что спустя рукава. А наоборот, с творческим огоньком и в домашних халатах. <br><br>Мы добавили во все разделы новый ivi рейтинг, который рассказывает о сильных сторонах фильма, правильно формируя ожидания от просмотра. Он экономит время на изучении отзывов и рецензий, а также показывает разницу между фильмами с одинаковыми баллами. <br><br>Сгруппировали картины в разделе «Покупки» по категориям: фильмы, сериалы и мультфильмы. И упростили переход к каталогу приложения. Нажмите на значок ivi чуть дольше, чем обычно – появится окно с функциями поиска, загрузки и доступа к новинкам. Попробуйте, это очень удобно. <br><br>Выбирайте «Новинки» и ознакомьтесь с недавними премьерами. Узнайте историю королевы фридайвинга Натальи Молчановой в фильме «Один вдох», следите за противостоянием советских ученых и инопланетного существа в триллере «Спутник» и смотрите музыкальную мелодраму «Лед 2» с Александром Петровым."},{"version_id":"836115131","version_name":"20.7.1","version_date":"2020-08-07 12:11:28.000 +0800","version_description":"В обновлении:<br>• Добавили возможность поделиться фильмом, сериалом или мультиком.<br>• Добавили поддержку функции \"Вход с Apple\".<br>• Улучшили внешний вид раздела \"Помощь\".<br>• Добавили возможность общаться с поддержкой в онлайн-чате.<br>• Добавили поиск по просмотренным и отложенным фильмам на устройстве (spotlight)."},{"version_id":"837457864","version_name":"20.8.1","version_date":"2020-09-04 12:16:01.000 +0800","version_description":"Мы обновили приложение, чтобы у вас было больше времени на новые впечатления, а на рутину - совсем чуть-чуть.<br>Поиск фильма - секундное дело: надписи “Выбор ivi” и “Эксклюзив” на карточках фильмов подскажут интересные картины."},{"version_id":"837659873","version_name":"20.9.1","version_date":"2020-09-23 11:31:02.000 +0800","version_description":"Мы продолжаем улучшать приложение ivi.<br>Если вы хотите отправить нам отзыв по работе приложения пишите на support@ivi.ru или звоните по номеру 8 800 234-49-23"},{"version_id":"838055520","version_name":"20.10.1","version_date":"2020-10-14 07:03:54.000 +0800","version_description":"В обновлении:<br>- Поиск и каталог теперь на одном экране<br>- Сделали много классных аватарок для ваших профилей<br>- В плеер добавили возможность разворачивать кино на весь экран и обратно. Это особенно удобно, если включена блокировка книжной ориентации<br>- Если вы хотите смотреть видео всегда в горизонтальной ориентации, то можете включить такой режим в Настройках профиля, раздел 'Просмотр видео'"},{"version_id":"838349692","version_name":"20.11.1","version_date":"2020-11-13 07:54:58.000 +0800","version_description":"В обновлении:<br>- При долгом нажатии на постер фильма или сериала&nbsp;появится меню, где можно быстро и удобно оценить кино или добавить в “Смотреть позже”<br>- Улучшен внешний вид экрана с выбором профиля<br>- Повышена стабильность работы"},{"version_id":"839101146","version_name":"20.11.2","version_date":"2020-11-16 09:40:04.000 +0800","version_description":"В обновлении:<br>- При долгом нажатии на постер фильма или сериала&nbsp;появится меню, где можно быстро и удобно оценить кино или добавить в “Смотреть позже”<br>- Улучшен внешний вид экрана с выбором профиля<br>- Повышена стабильность работы<br><br>Если вы хотите отправить нам отзыв по работе приложения пишите на support@ivi.ru или звоните по номеру 8 800 234-49-23"},{"version_id":"839398607","version_name":"20.12.1","version_date":"2020-12-16 12:12:49.000 +0800","version_description":"Теперь рекомендовать IVI ещё и выгодно!<br>Друг сразу получит 30 дней подписки бесплатно, а вы - 100 ₽ на счёт IVI, когда друг продлит подписку.<br>Также:<br>- Сделали поиск немного удобнее<br>- Добавили возможность поделиться трансляцией<br>- Уведомления для новинок из ‘Скоро на ivi’"},{"version_id":"839805293","version_name":"20.12.2","version_date":"2020-12-31 09:05:10.000 +0800","version_description":"В обновлении:<br>- Сделали поиск немного удобнее<br>- Добавили возможность поделиться трансляцией<br>- Уведомления для новинок из ‘Скоро на ivi’<br><br>Если вы хотите отправить нам отзыв по работе приложения пишите на support@ivi.ru или звоните по номеру 8 800 234-49-23"},{"version_id":"840060006","version_name":"21.1.1","version_date":"2021-01-20 14:00:57.000 +0800","version_description":"Если вы хотите отправить нам отзыв по работе приложения пишите на support@ivi.ru или звоните по номеру 8 800 234-49-23"},{"version_id":"840302724","version_name":"21.2.1","version_date":"2021-02-13 07:16:00.000 +0800","version_description":"В обновлении:<br>- Упростили доступ к Загрузкам, теперь их можно открыть сразу из нижнего меню<br>- Добавили информацию о свободном месте в Настройках<br>- Загрузки для офлайн просмотра стартуют быстрее<br>- Сделали удобнее раздел Просмотры в Профиле: теперь открывается карточка фильма или сериала, а серии объединены в один постер<br>- Открывать подборки стало немного удобнее"},{"version_id":"840489058","version_name":"21.3.1","version_date":"2021-03-15 08:49:41.000 +0800","version_description":"В обновлении:<br>- Стало немного удобнее приглашать друзей в IVI и получать бонусы<br>- Продолжаем развивать поддержку VoiceOver<br>- Исправили некоторые проблемы, которые могли возникнуть при трансляции загруженного контента по Airplay<br>- Улучшили работу плеера при переключении фильмов и сериалов в оффлайне"},{"version_id":"841249931","version_name":"21.4.1","version_date":"2021-04-09 09:38:27.000 +0800","version_description":"В обновлении:<br>- Новая цветовая схема и другие изменения в интерфейсе<br>- Через контекстное меню постера можно открыть похожие фильмы и сериалы<br>- В меню “Загрузить” карточки сериала, теперь можно купить и загрузить отдельный сезон"},{"version_id":"841325261","version_name":"21.5.1","version_date":"2021-05-13 14:21:57.000 +0800","version_description":"В обновлении:<br>- В настройках приложения теперь можно установить пин-код для детского профиля. Он оградит детей от переключения в другие профили и от случайных покупок.<br>- Немного поменяли интерфейс на главном экране"},{"version_id":"842281232","version_name":"21.6.1","version_date":"2021-06-11 09:21:19.000 +0800","version_description":"В обновлении:<br>- Теперь можно пропустить заставку во время просмотра сериала<br>- Добавили настройку рекомендаций для детского профиля: выбираем редактировать профиль и нажимаем \"Настроить возраст и рекомендации\"<br>- Теперь в поиске можно найти любимую телепередачу и подписаться на уведомление, чтобы не пропустить ее<br>- Мы улучшили фильтры и добавили новые параметры выбора среди которых рейтинг ivi<br>- В подборках появилась возможность фильтровать контент, чтобы вы могли настроить ее под свои интересы.<br>- Улучшили работу Voice Over'а для поиска фильмов, запуска трейлера и управления списком просмотров"},{"version_id":"842621435","version_name":"21.6.2","version_date":"2021-06-17 14:39:46.000 +0800","version_description":"В обновлении:<br>- Теперь можно пропустить заставку во время просмотра сериала<br>- Добавили настройку рекомендаций для детского профиля: выбираем редактировать профиль и нажимаем \"Настроить возраст и рекомендации\"<br>- Теперь в поиске можно найти любимую телепередачу и подписаться на уведомление, чтобы не пропустить ее<br>- Мы улучшили фильтры и добавили новые параметры выбора среди которых рейтинг ivi<br>- В подборках появилась возможность фильтровать контент, чтобы вы могли настроить ее под свои интересы.<br>- Улучшили работу Voice Over'а для поиска фильмов, запуска трейлера и управления списком просмотров"},{"version_id":"842712844","version_name":"21.7.1","version_date":"2021-07-14 09:55:30.000 +0800","version_description":"В обновлении:<br>- Теперь можно связать ivi с приложением AppleTV+<br>- Сделали удобнее и понятнее выбор локализаций и субтитров"},{"version_id":"93482650","version_name":"2.1.6","version_date":"","version_description":""}]