[{"version_id":"815139152","version_name":"3.4.2","version_date":"","version_description":""},{"version_id":"817062536","version_name":"3.4.3","version_date":"","version_description":""},{"version_id":"817322618","version_name":"3.4.4","version_date":"","version_description":""},{"version_id":"817955875","version_name":"3.4.5","version_date":"","version_description":""},{"version_id":"818551800","version_name":"3.4.6","version_date":"","version_description":""},{"version_id":"818889990","version_name":"3.4.7","version_date":"","version_description":""},{"version_id":"819014066","version_name":"3.4.8","version_date":"","version_description":""},{"version_id":"819238745","version_name":"3.4.9","version_date":"","version_description":""},{"version_id":"819643683","version_name":"3.5.0","version_date":"","version_description":""},{"version_id":"819947395","version_name":"3.6.0","version_date":"","version_description":""},{"version_id":"820250734","version_name":"3.6.1","version_date":"","version_description":""},{"version_id":"820873694","version_name":"3.6.2","version_date":"","version_description":""},{"version_id":"821058369","version_name":"3.7","version_date":"","version_description":""},{"version_id":"821195411","version_name":"3.8","version_date":"","version_description":""},{"version_id":"822170626","version_name":"3.8.1","version_date":"","version_description":""},{"version_id":"823743440","version_name":"4.0","version_date":"","version_description":""},{"version_id":"826796014","version_name":"4.0.1","version_date":"","version_description":""},{"version_id":"826831150","version_name":"4.0.2","version_date":"","version_description":""},{"version_id":"826876446","version_name":"4.0.3","version_date":"","version_description":""},{"version_id":"826899351","version_name":"4.0.4","version_date":"","version_description":""},{"version_id":"826929869","version_name":"4.0.5","version_date":"","version_description":""},{"version_id":"827076187","version_name":"4.0.6","version_date":"2018-05-23 16:30:24.000 +0800","version_description":"Tack för er feedback, det hjälper oss att förbättra appen!<br><br>Detta är nytt i inköpslistan:<br>- Rensa handlade varor<br>- Återställ handlade varor<br>- Strukna varor hamnar överst i sektionen \"Handlat\"<br>- Ta bort recept från inköpslistan med swipe<br><br>Övrigt<br>- Buggfix<br>- Förtydligat var Hitta butik finns"},{"version_id":"827281745","version_name":"4.0.7","version_date":"2018-05-25 15:36:43.000 +0800","version_description":"Tack för er feedback, det hjälper oss att förbättra appen!<br><br>Detta är nytt:<br>- Sökning av sparade recept<br>- Sparade recept sorteras i den ordning de lades till<br>- Buggfix"},{"version_id":"827308958","version_name":"4.0.8","version_date":"2018-05-29 13:37:57.000 +0800","version_description":"Tack för er feedback, det hjälper oss att förbättra appen!<br><br>Detta är nytt:<br>- Åtgärdat en bugg som får notifikationer att krascha<br>- Bytt namn på \"Välj butik\" till \"Sortera\" i inköpslistan för att tydliggöra sortera inköpslistor"},{"version_id":"827411565","version_name":"4.0.9","version_date":"2018-06-05 16:23:56.000 +0800","version_description":"Tack för er feedback, det hjälper oss att förbättra appen!<br><br>Detta är nytt:<br>- Editera mängd på vara (klicka på tre prickarna)<br>- Ändra kategori när listan är sorterad på butik (klicka på tre prickarna)<br>- Erbjudandeinfo med alla detaljer (klicka på tre prickarna)<br>- Kartikon hittas numera vid swipe på vara<br>- Diverse buggfixar"},{"version_id":"827578074","version_name":"4.0.10","version_date":"2018-06-19 19:18:21.000 +0800","version_description":"Tack för er feedback, det hjälper oss att förbättra appen!<br>Detta är nytt.<br>Inköpslistan<br>- Dela lista återfinns nu i svep åt vänster.<br>Övrigt<br>- Buggfixar"},{"version_id":"827607913","version_name":"4.0.11","version_date":"2018-06-26 08:30:48.000 +0800","version_description":"Tack för er feedback, det hjälper oss att förbättra appen!"},{"version_id":"828380799","version_name":"4.0.12","version_date":"2018-08-30 08:25:44.000 +0800","version_description":"Tack för er feedback, det hjälper oss att förbättra appen!<br>Detta är nytt:<br>- Buggfix för vissa användare som såg ut att vara inloggade trots att de inte var det<br>- Buggfix för butikskartan"},{"version_id":"828467028","version_name":"4.0.13","version_date":"2018-09-13 09:19:37.000 +0800","version_description":"Tack för er feedback, det hjälper oss att förbättra appen! <br>Vi har tagit åt oss utav den feedback ni har skickat in och börjat åtgärda det absolut viktigaste saker<br><br>Följande buggar har vi börjat åtgärda i 4.0.13:<br>- Recept där sorteringen ibland ändrades<br>- Mina Butiken där butiker i vissa fall försvann när man ändrade sin favoritbutik<br>- iPad kunde ibland stänga ner sig när man försökte dela en inköptslista<br>- Inköpslistan sorterade ibland om nytillagda varor felaktigt<br>- Appen kunde ibland stänga ner sig på receptsidan när man bytte sida till sparade recept<br><br>I 4.0.12 började vi åtgäda dessa buggar:<br>- Vissa användare såg ut att vara inloggade trots att de inte var det<br>- Butikskartan fick en uppdatering"},{"version_id":"828581286","version_name":"4.0.14","version_date":"2018-09-19 14:16:06.000 +0800","version_description":"Tack för er feedback, det hjälper oss att förbättra appen! <br>Vi har tagit åt oss utav den feedback ni har skickat in och börjat åtgärda det absolut viktigaste sakerna<br><br>Dessa saker har vi lagt fokus på under release 4.0.14:<br>- Hemflödet uppdateras när du ändrar din favoritbutik, så att erbjudandena alltid är uppdaterade.<br>- Ett problem som gjorde att man behöver starta om appen efter man fick ett pushmeddelande är nu åtgärdat.<br><br>Tidigare i version 4.0.13 har vi börjat åtgärda:<br>- Sorteringen av dina sparade recept<br>- En bugg som gjorde att dina sparade butiker kunde försvinna när du ändrade din Favoritbutik<br>- iPad kunde ibland stänga ner sig när man försökte dela en inköptslista<br>- Inköpslistan sorterade ibland om nytillagda varor felaktigt<br>- Appen kunde ibland stänga ner sig på receptsidan när man bytte sida till sparade recept"},{"version_id":"828675759","version_name":"4.0.15","version_date":"2018-09-24 08:40:47.000 +0800","version_description":"Tack för er feedback, det hjälper oss att förbättra appen! <br>Vi tar åt oss utav den feedback ni har skickat in och börjat åtgärda det absolut viktigaste sakerna.<br><br>Dessa saker har vi lagt fokus på under release 4.0.15:<br> - Rätt namn på butiken visas nu när man skrollar ner i butiksvyn.<br> - På varans detaljsida i inköpslista uppdateras antalet varor i listan korrekt efter att man tar bort en vara.<br> - Man kan nu scanna streckkoden på flera varor till inköpslista, utan att behöva öppna scannern igen.<br> - Att appen kunde krascha när man bytte vy är nu åtgärdat.<br> - På iPad så uppdateras vyn nu på rätt sätt när man vänder enheten till landskapsläge.<br><br>Tidigare i version 4.0.14 har vi börjat åtgärda:<br>- Hemflödet uppdateras när du ändrar din favoritbutik, så att erbjudandena alltid är uppdaterade.<br>- Ett problem som gjorde att man behöver starta om appen efter man fick ett pushmeddelande är nu åtgärdat.<br><br>Tidigare i version 4.0.13 har vi börjat åtgärda:<br>- Sorteringen av dina sparade recept.<br>- En bugg som gjorde att dina sparade butiker kunde försvinna när du ändrade din Favoritbutik.<br>- iPad kunde ibland stänga ner sig när man försökte dela en inköptslista.<br>- Inköpslistan sorterade ibland om nytillagda varor felaktigt.<br>- Appen kunde ibland stänga ner sig på receptsidan när man bytte sida till sparade recept."},{"version_id":"828798042","version_name":"4.0.17","version_date":"2018-10-08 08:55:53.000 +0800","version_description":"Tack för er feedback, det hjälper oss att förbättra appen!<br>Vi tar åt oss av er feedback och har börjat åtgärda de viktigaste sakerna.<br><br>Detta har vi förbättrat i den senaste versionen:<br>- Recepten har fått ett uppdaterat utseende i din iPad<br>- De knappar som var skrivna på engelska är nu på svenska<br>- Lagt till instruktioner om hur du enklast delar en inköpslista med ditt hushåll<br>- Åtgärdat en bugg som i enstaka fall resulterade i att inköpslistor togs bort"},{"version_id":"829392648","version_name":"4.0.19","version_date":"2018-11-27 09:04:25.000 +0800","version_description":"Detta är nytt i den senaste versionen:<br>•    Vi har gjort det enklare för dig att söka efter recept. Välj vilken typ av recept du söker genom våra kategorier för att enklare hitta det du vill ha!<br>•    Du kan nu sortera ordningen på dina sparade recept<br>•    Du kan nu se dina tidigare köp gjorda med ditt ICA-kort<br>•    Enklare att hitta dina bonuscheckar och månadens insamlade bonus<br>•    Varor får nu korrekta namn och mängdenheter när du lägger till ett recept direkt i din inköpslista"},{"version_id":"829995309","version_name":"4.1.0","version_date":"2019-01-24 08:08:53.000 +0800","version_description":"Gott nytt år! Vi på ICA inleder 2019 med att förbättra inköpslistan!<br><br>Nu har vi utvecklat inköpslistan för att ge dig som kund en stabilare och trevligare upplevelse. Problem med listor eller varor som försvinner skall nu vara en sak av det förflutna!<br>Utöver det har vi gjort det enklare att välja mängd och kategori på varor, när du lägger till dem i din inköpslista.<br><br>Vi har dessutom åtgärdat andra buggar i appen."},{"version_id":"830116661","version_name":"4.2.0","version_date":"2019-02-07 13:19:37.000 +0800","version_description":"I denna version av appen har vi förbättrat följande:<br>•    Gjort förbättringar kring ett problem som gör att vissa användare upplever inloggningsproblem.<br>•    Receptlänkar du delar öppnas nu direkt i appen, istället för telefonens webbläsare.<br>•    Du kan nu läsa dina sparade recept i appen även när du inte har nätverk.<br>•    Gjort det tydligare vilka alternativ som finns när du trycker på åtgärdsknapparna (•••) i inköpslistan."},{"version_id":"830221474","version_name":"4.2.1","version_date":"2019-02-12 15:11:57.000 +0800","version_description":"Tack för att ni har uppmärksammat ett problem med appen gällande gamla erbjudanden. Denna version utav appen löser erbjudandeproblemet för butikssidor.<br><br>Tidigare i version 4.2.0 av appen har vi förbättrat följande:<br>• Gjort förbättringar kring ett problem som gör att vissa användare upplever inloggningsproblem.<br>• Receptlänkar du delar öppnas nu direkt i appen, istället för telefonens webbläsare.<br>• Du kan nu läsa dina sparade recept i appen även när du inte har nätverk.<br>• Gjort det tydligare vilka alternativ som finns när du trycker på åtgärdsknapparna (•••) i inköpslistan."},{"version_id":"830451993","version_name":"4.3.0","version_date":"2019-03-04 13:31:17.000 +0800","version_description":"Tack för att du använder vår app, och tack för all värdefull feedback.<br><br>Använder du inköpslistan? Härligt, vi har nu åtgärdat problemet med att flytta varor i den.<br><br>I denna version har vi även:<br>Förenklat hur du tar fram ditt digitala ID, vilket kan användas vid självscanning i utvalda ICA-butiker.<br>Löst problemet med att receptbilder inte visades när du saknade internetuppkoppling.<br><br>Vi arbetar vidare för fullt med att lösa problemet med att visa erbjudanden."},{"version_id":"830616992","version_name":"4.4.0","version_date":"2019-03-15 14:43:23.000 +0800","version_description":"Tack för att du använder vår app. I denna version har vi åtgärdat flera av de problem ni rapporterat med inköpslistan samt gjort förbättringar för er som är iPad-användare. Fortsätt gärna ge feedback!"},{"version_id":"830655952","version_name":"4.5.0","version_date":"2019-05-09 13:52:49.000 +0800","version_description":"Tack för alla kommentarer som hjälper oss att förbättra appen.<br>I den senaste versionen har vi lagt till funktionen \"pull to refresh\" för hemflödet och inköpslistan, vilket innebär att du snabbt och enkelt kan se eventuella uppdateringar. Som du ser har appen även fått ett nytt utseende. Fint, eller hur? Självklart har vi även åtgärdat en hel del buggar som ni rapporterat om."},{"version_id":"831254582","version_name":"4.6.0","version_date":"2019-05-22 11:32:53.000 +0800","version_description":"I denna version har vi uppdaterat vår bildhantering, vilket gör att bilderna visas snabbare. Dessutom har vi löst en del buggar med receptsidan och inköpslistan. Fortsätt gärna ge oss feedback, den hjälper oss att utveckla appen till det bättre."},{"version_id":"831403569","version_name":"4.7.0","version_date":"2019-06-07 07:41:41.000 +0800","version_description":"Vi firar in sommaren med en ny version av appen. I denna uppdatering har hanteringen av recept förbättrats, vilket gör att appen drar mindre data. Har du testat att betala med appen? Vi har nu förtydligat funktionen, så den blir smidigare att använda. Fortsätt gärna ge betyg och kommentera, vi uppskattar ert engagemang."},{"version_id":"831629471","version_name":"4.8.0","version_date":"2019-06-13 07:41:17.000 +0800","version_description":"Ny, snabbare version av appen finns nu att ladda ned. I senaste uppdateringen är inköpslistan både snabbare och enklare att använda. Fortsätt gärna ge betyg och feedback om appen, det hjälper oss att göra appen ännu bättre."},{"version_id":"831667872","version_name":"4.9.0","version_date":"2019-06-24 07:38:23.000 +0800","version_description":"En frisk fläkt i sommarvärmen är att vi löst problemet med att inköpslistan ibland kraschade när man återställde varor. Brukar du använda sökfunktionen för att lägga varor i inköpslistan? Nu har vi ordnat så att varorna du lägger till automatiskt hamnar i rätt kategori. Samma sak gäller för dig som lägger till varor genom att scanna streckkoden på varor. Utöver fix med inköpslistorna har vi även snabbat upp hemflödet i appen en aning, så du snabbt kan hitta tips på sommarens goda recept."},{"version_id":"831772164","version_name":"4.10.0","version_date":"2019-09-04 04:30:41.000 +0800","version_description":"Nu har vi uppdaterat appen med några härliga höstnyheter. Efter era önskemål har vi bland annat fixat följande:<br>- Uppdaterat recepten så man kan läsa andras kommentarer<br>- Ökat ljusstyrkan så det blir enklare att identifiera sig med Digitalt ID<br>- Förbättrat förslagen på varor att lägga i inköpslistan"},{"version_id":"832643736","version_name":"4.10.1","version_date":"2019-09-08 08:29:14.000 +0800","version_description":"Nu har vi uppdaterat appen med några härliga höstnyheter. Efter era önskemål har vi bland annat fixat följande:<br>- Uppdaterat recepten så man kan läsa andras kommentarer<br>- Ökat ljusstyrkan så det blir enklare att identifiera sig med Digitalt ID<br>- Förbättrat förslagen på varor att lägga i inköpslistan"},{"version_id":"833173795","version_name":"4.11.0","version_date":"2019-10-23 07:22:38.000 +0800","version_description":"Hej! Vår senaste version av appen är lite härligare och enklare att använda. Vi har bland annat löst några buggar i inköpslistan, skrivit om texter och uppdaterat ikoner. Fortsätt gärna att betygsätta och kommentera  - det hjälper oss att göra appen bättre."},{"version_id":"833295994","version_name":"4.12.0","version_date":"2019-11-07 08:39:53.000 +0800","version_description":"Glada nyheter! Många av er har efterfrågat digitalt ID i Apple Wallet - nu har vi det!  Hämta ut scannerhandtag med din smarta klocka - hur smidigt som helst.<br>Vi har även gjort det enklare att läsa av QR-koden i självscanningen. Fortsätt gärna att betygsätta och kommentera, så kan vi göra appen ännu bättre."},{"version_id":"833512623","version_name":"4.12.1","version_date":"2019-11-28 14:29:02.000 +0800","version_description":"Hej! Denna version av appen innehåller några mindre buggfixar. Fortsätt gärna kommentera och betygsätta - det hjälper oss att göra appen bättre!"},{"version_id":"834028031","version_name":"4.13.0","version_date":"2019-12-17 13:42:17.000 +0800","version_description":"En tidig julklapp från oss på ICA kommer här. Denna version av appen innehåller både en snabbare inköpslista och möjlighet att ändra textstorleken. För det senare behöver du ställa in större text i inställningarna på din telefon."},{"version_id":"834348381","version_name":"4.14.0","version_date":"2020-01-14 22:58:32.000 +0800","version_description":"Om du laddar ner vår senaste version av appen kommer du kunna skriva receptkommentarer, kul va? Använder du Apple Wallet kan du nu själv välja om du vill bli påmind när du är i närheten av din favoritbutik. Sist men inte minst har vi optimerat inköpslistan och gjort bildladdningen snabbare.&nbsp;<br>God fortsättning!"},{"version_id":"834362085","version_name":"4.15.0","version_date":"2020-01-19 19:11:06.000 +0800","version_description":"Hejdå kortkund. Hallå stammis! Nu är appen uppdaterad efter vårt nya lojalitetsprogram stammis på ICA. Kortpriser heter nu stammispriser, till exempel!<br>En annan nyhet är att vi nu har snabblänkar från appikonen på hemskärmen. I ett kick kommer du åt ditt digitala ID, inköpslistan och din favoritbutik."},{"version_id":"834430445","version_name":"4.15.1","version_date":"2020-01-21 12:29:41.000 +0800","version_description":"Ny version av appen där länken till digitalt ID från appikonen är uppdaterad. Psst! Snabblänkarna från appikonen fungerar för dig med IOS 13.<br><br>Hejdå kortkund. Hallå stammis! Nu är appen uppdaterad efter vårt nya lojalitetsprogram stammis på ICA. Kortpriser heter nu stammispriser, till exempel!<br>En annan nyhet är att vi nu har snabblänkar från appikonen på hemskärmen. I ett kick kommer du åt ditt digitala ID, inköpslistan och din favoritbutik."},{"version_id":"834510220","version_name":"4.16.0","version_date":"2020-01-31 19:00:08.000 +0800","version_description":"Vår senaste version av appen kommer med en ny bonussida – håll koll på ditt poängsamlade direkt i stammishjulet. Den kommer också med lite mindre buggfixar."},{"version_id":"834555602","version_name":"4.16.1","version_date":"2020-02-01 17:34:25.000 +0800","version_description":"Vår senaste version av appen kommer med en ny bonussida – håll koll på ditt poängsamlade direkt i stammishjulet. Den kommer också med lite mindre buggfixar."},{"version_id":"834571489","version_name":"4.17.0","version_date":"2020-02-07 07:25:22.000 +0800","version_description":"I denna version bjuder vi på några grafiska uppdateringar som gör appen härligare att använda. Dessutom innehåller den några mindre buggfixar. Fortsätt gärna att sätta betyg och kommentera - det hjälper oss att göra appen bättre!"},{"version_id":"834857646","version_name":"4.18.0","version_date":"2020-03-05 14:06:43.000 +0800","version_description":"Nyfiken på om du får bonus redan vid 1 000 stammispoäng? Ladda ner den senaste versionen av appen så ser du det i stammishjulet. <br>En annan glad nyhet är att du nu kan se dina betyg på recepten. Smarrigt va? <br>Vi har även gjort det enklare att betala med mobilen och förtydligat vad som ingår i din köphistorik."},{"version_id":"835179366","version_name":"4.19.0","version_date":"2020-03-31 13:01:09.000 +0800","version_description":"Glada nyheter i appen! Nu behöver du inte längre logga in på nytt för att se dina transaktioner och ICA-kort. Om du vill kan du dessutom aktivera snabbsaldo för ICA-betalkort. Utöver det har vi förenklat hur du betalar med appen. Glöm inte att berätta vad du tycker om vår app, det hjälper oss att göra den ännu bättre."},{"version_id":"835363057","version_name":"4.19.1","version_date":"2020-04-02 14:26:39.000 +0800","version_description":"Glada nyheter i appen! Nu behöver du inte längre logga in på nytt för att se dina transaktioner och ICA-kort. Om du vill kan du dessutom aktivera snabbsaldo för ICA-betalkort. Utöver det har vi förenklat hur du betalar med appen. Glöm inte att berätta vad du tycker om vår app, det hjälper oss att göra den ännu bättre."},{"version_id":"835582039","version_name":"4.20.0","version_date":"2020-04-23 07:44:04.000 +0800","version_description":"Du har väl inte missat att du kan få dina ICA-kvitton digitalt via Kivra? I denna version av appen hittar du en smidig genväg till dina digitala kvitton i Kivra under Köphistorik på Kontofliken."},{"version_id":"835941279","version_name":"4.21.0","version_date":"2020-05-13 18:16:30.000 +0800","version_description":"I den här versionen har vi löst några buggar. Bland annat har vi:<br>• Åtgärdat problemet vissa av er hade med inloggning via BankID<br>• Fixat så de transaktioner som saknats under köphistorik är tillbaka<br>Fortsätt gärna att betygsätta och kommentera, det hjälper oss att göra appen bättre."},{"version_id":"836379767","version_name":"4.22.0","version_date":"2020-06-14 12:18:03.000 +0800","version_description":"I den här versionen kan du se din bonushistorik från de senaste sex månaderna. Utöver det har vi gjort en del buggfixar. Glad sommar!"},{"version_id":"836416269","version_name":"4.22.1","version_date":"2020-06-15 21:34:59.000 +0800","version_description":"I den här versionen kan du se din bonushistorik från de senaste sex månaderna. Utöver det har vi gjort en del buggfixar. Glad sommar!"},{"version_id":"837813636","version_name":"4.23.0","version_date":"2020-09-22 06:36:45.000 +0800","version_description":"I vår nya version av appen har vi fräschat upp receptsidorna.<br>Den nya designen ger bättre överblick över tillagningstid, svårighetsgrad och antal ingredienser. Du ser även receptets näringsvärde, klimatavtryck och alternativ för specialkost."},{"version_id":"838208079","version_name":"4.24.0","version_date":"2020-10-20 19:30:31.000 +0800","version_description":"Här kommer en uppdatering där vi har löst ett par störiga buggar.<br>Tack till alla som har kommenterat appen, ni hjälper oss att bli bättre."},{"version_id":"838455080","version_name":"4.25.0","version_date":"2020-11-02 06:39:05.000 +0800","version_description":"I den här versionen har vi fixat en bugg där stammispris visades på fel varor.<br>Utöver det har vi löst ett gäng andra mindre buggar och snyggat till animationen för recept."},{"version_id":"839326961","version_name":"4.26.0","version_date":"2020-11-25 06:53:43.000 +0800","version_description":"I den här versionen har vi uppdaterat designen för hur recept listas i appen.<br>Även bonushistoriken har fått ett nytt hem under \"Visa historik\".<br>Mindre buggfixar"},{"version_id":"839399866","version_name":"4.27.0","version_date":"2020-11-29 18:05:13.000 +0800","version_description":"I den här versionen har vi gjort en buggfix i betalflödet för att göra det mer stabilt."},{"version_id":"839541424","version_name":"4.28.0","version_date":"2020-12-09 12:26:34.000 +0800","version_description":"I den här versionen har vi lagt in stöd för andra webbläsare än Safari.<br>Vi har även tagit hand om ett par buggar, bland annat vissa receptlänkar som inte kunde öppnas.<br>Vi önskar er alla en riktigt god jul och gott nytt år!<br>Vad rädda om varandra!"},{"version_id":"839927975","version_name":"4.29.0","version_date":"2021-01-12 14:53:10.000 +0800","version_description":"Tack för att du använder vår app!<br><br>I denna versionen har vi:<br>* rättat till några buggar<br>* fixat och förbättrat lite under huven så att appen ska funka ännu bättre<br><br>//Appteamet, ICA"},{"version_id":"840452008","version_name":"4.30.0","version_date":"2021-02-18 08:03:49.000 +0800","version_description":"Tack för att du använder vår app!<br><br>I denna versionen har vi:<br>* Förbättrat funktionen Scanna vara, i inköpslistan. Fler varor är nu möjliga att scanna<br>* Ändrat designen på \"Lägg till vara\" i inköpslistan<br>* Lagt till stöd för att skriva in mängd direkt i textfältet för \"Lägg till vara\" i inköpslistan, ex 1 l mjölk, 5 st äpple<br>* Rättat till några buggar<br>* Sedvanliga förbättringar under huven så att appen ska funka ännu bättre<br><br>//Appteamet, ICA"},{"version_id":"840605179","version_name":"4.30.1","version_date":"2021-02-24 10:26:06.000 +0800","version_description":"Tack för att du använder vår app!<br><br>I denna version har vi fixat några buggar i inköpslistan:<br>* Bättre hantering av kategoriseringen av de varor som läggs till<br>* Lagt tillbaka \"Ändra mängd\", när varan läggs till<br>* Förbättrat stödet för att kunna skriva in mängden direkt i textfältet för \"Lägg till vara\", ex 1 liter mjölk eller 5 st äpple<br><br>//Appteamet, ICA"},{"version_id":"841024011","version_name":"4.31.0","version_date":"2021-03-24 08:39:35.000 +0800","version_description":"Tack för att du använder vår app!<br><br>I denna version har vi:<br>* Gjort om utseendet på \"Hem\"-fliken<br>* Rättat till några buggar<br>* Sedvanliga förbättringar under huven så att appen ska funka ännu bättre<br><br>//Appteamet, ICA"},{"version_id":"841175510","version_name":"4.32.0","version_date":"2021-04-07 08:48:17.000 +0800","version_description":"Tack för att du använder vår app!<br><br>I denna version har vi:<br>* Rättat till några buggar<br>* Sedvanliga förbättringar under huven så att appen ska funka ännu bättre<br><br>//Appteamet, ICA"}]