[{"version_id":"15069860","version_name":"2.1","version_date":"2013-04-18 07:19:03.000 +0800","version_description":"نسخة 2.1:<br>- زيادة ذكاء اللاعبين<br>- إصلاح مشكلة كانت تسبب في إغلاق اللعبة<br>- إعادة تصميم خوارزمية توزيع الورق لزيادة العشوائية ولحل مشكلة التكرار لدى بعض المستخدمين<br>- إصلاح مشكلة ظهور زر \"لعبة جديدة\" في حال تعادل الفريقين فوق 151<br>- إصلاحات وتحسينات أخرى متفرقة<br><br>نسخة 2.0.1:<br>- إصلاح مشكلة البطء والتعليق في أجهزة آيفون 3جي إس و 4.<br><br>نسخة 2.0:<br>- دعم آيفون 5<br>- إضافة شراء صن \"قبل\" الخصم في دورة الشراء الأولى<br>- إضافة إمكانية قلب الحكم الثاني إلى صن<br>- إمكانية تحديد نوع الدبل (مقفل أو مفتوح) خلال اللعبة بدلاً من الإعدادات<br>- إضافة علامة في الورقة الصفراء لتحديد المشتري<br>- إضافة إمكانية مشاركة النشرة<br>- تسريع السوا واللعب بشكل عام<br>- تحسينات بسيطة في التصميم<br>- إصلاحات أخرى متفرقة"},{"version_id":"762322675","version_name":"3.0","version_date":"2014-11-03 07:03:06.000 +0800","version_description":"نسخة 3.0:<br>- دعم أجهزة الآيباد<br>- دعم خاص لنظام iOS 8<br>- تحسين الذكاء الإصطناعي"},{"version_id":"832149230","version_name":"3.1.0","version_date":"2019-07-27 12:19:00.000 +0800","version_description":"### المعذرة على التأخر في الدعم لظروف السفر والعمل ###<br>* اللعبة الآن متوافقة مع أنظمة iOS نسخة 9.0 وحتى 13.0<br>* اللعبة متوافقة مع جميع الأجهزة الحديثة<br>* يمكنك الآن مشاركة النتائج والإحصاءات في أي شبكة اجتماعية أو على الواتساب<br>### ترقبوا تحديثاً أكبر قريباً! ###"},{"version_id":"832172151","version_name":"3.1.1","version_date":"2019-07-30 06:35:36.000 +0800","version_description":"* تم رفع الورق قليلاً حتى لايتم غلق اللعبة بالخطأ<br>شكراً لكم على الملاحظات!"},{"version_id":"832472190","version_name":"3.2.0","version_date":"2019-08-22 22:31:16.000 +0800","version_description":"- إصلاح مشاكل كانت تتسبب في إغلاق اللعبة فجأة<br>- إصلاحات بسيطة في واجهة المستخدم<br>- تطوير الذكاء الاصطناعي<br>- يتم الآن حفظ اللعبة في حال الخروج واستعادتها عند العودة حتى بعد وقت طويل<br>- يمكن الإن التحكم بمستوى الصوت بالأزرار الجانبية بغض النظر عن إعدادات الجهاز"},{"version_id":"832508476","version_name":"3.2.1","version_date":"2019-08-26 15:58:50.000 +0800","version_description":"- إظهار النشرة وشريط الحالة كما في السابق في بعض الأجهزة - شكراً على تنبيهكم!"},{"version_id":"832552571","version_name":"3.2.2","version_date":"2019-08-29 01:19:42.000 +0800","version_description":"- إصلاح مشكلة في الصوت في حالة اعلان دبل سرا<br>- إصلاح مشكلة كانت تسبب في إغلاق اللعبة فجأة<br>- تحسين الذكاء الاصطناعي"},{"version_id":"832614373","version_name":"3.2.3","version_date":"2019-09-03 21:05:55.000 +0800","version_description":"- إصلاح مشاكل بسيطة كانت تتسبب في إغلاق اللعبة فجأة"},{"version_id":"832634693","version_name":"3.2.4","version_date":"2019-09-25 16:57:19.000 +0800","version_description":"- تم إصلاح مشكلة سحب الورق في iOS 13"},{"version_id":"833465031","version_name":"4.0","version_date":"2019-11-08 00:25:17.000 +0800","version_description":"- تطوير إضافي للذكاء الاصطناعي<br>- يمكنك الآن اختيار من بين 3 لاعبين أو شراء من بين 8 لاعبين إضافيين بحسب رغبتك وأسلوب اللعب الذي يناسبك<br>- واجهة استخدام مطوّرة تتميز بالبساطة وسهولة الاستخدام. تطويرات خاصة للآيباد للاستفادة من حجم الشاشة<br>- إضافة إعداد يسمح بالأشكل في الدورة الثانية"},{"version_id":"833542369","version_name":"4.0.1","version_date":"2019-11-09 16:21:53.000 +0800","version_description":"- إصلاح مشكلة كانت تتسبب في بدأ اللعبة من جديد بعد إغلاقها"},{"version_id":"833706124","version_name":"4.0.2","version_date":"2019-11-22 02:46:51.000 +0800","version_description":"- الآن يمكن الدخول للاحصائيات بسهولة أكثر وتمت إضافة عدد الفوز والخسارة للرسم البياني<br>- إصلاح مشكلة كانت تتسبب بظهور زر \"بس\" بدلاً من \"ولا\" في الدورة الثانية لبعض المستخدمين<br>- إصلاح مشكلة كانت تتسبب في إغلاق اللعبة بشكل مفاجئ لبعض المستخدمين<br>- بعض التحسينات البسيطة الأخرى"},{"version_id":"837811736","version_name":"4.0.4","version_date":"2020-09-16 20:27:30.000 +0800","version_description":"- متوافق مع نظام iOS 14 الجديد<br>- تحسين الذكاء الاصطناعي لبعض اللاعبين"}]