[{"version_id":"267202720","version_name":"1.3.3","version_date":"2014-01-02 16:10:04.000 +0800","version_description":"* Misc. Bug Fixes"},{"version_id":"4384558","version_name":"1.0.0","version_date":"2011-11-30 19:27:59.000 +0800","version_description":""},{"version_id":"6060570","version_name":"1.1.0","version_date":"2012-02-02 07:50:48.000 +0800","version_description":"Players will now be armed with the fan-favorite Ray Gun and the zombie-attracting Monkey Bomb in the never-ending battle against the undead.<br><br>Players can now also opt to enhance their experience and get out of a jam with the new in-game CoD Point System. With six tiers of in-app purchasing options to choose from, Zombies fans will be able to take their experience to a whole new level by unlocking additional areas and securing better weapons in much less time.  Please note that CoD points are only applicable in single player.<br><br> - Buy CoD points in the Main Menu to use when you run out of earned points in-game.<br> - CoD points can be spent on anything in the game such as reviving, opening doors, weapons, perks, and the mystery box but are only used when you do not have enough earned points.<br> - Revives can also be bought with CoD points if you die without the revive perk, although the three revive limit still applies.<br><br>Note: Your CoD points will be lost if the app is uninstalled from your device.<br><br>A new Save and Continue feature has been added in case you need to take a break from battling Zombies.<br><br>Finally, a variety of optimizations and fixes have also been incorporated into this update to give players the best mobile Zombie experience yet.<br><br>For tips, tricks, and troubleshooting, be sure to check out the Black Ops Zombies Field Manual at www.callofduty.com/blackops/faq/ioszombies"},{"version_id":"6514186","version_name":"1.2.0","version_date":"2012-03-15 16:06:31.000 +0800","version_description":"It’s here!!!  The fan-favorite zombie map \"Ascension\" pits players against hoards of vicious, perk-stealing zombie monkeys, flesh-eating Soviet Zombies and much more in a trap-filled, Cold War era cosmodrome.  Good luck.<br><br>Version 1.2.0 also includes the following updates and additions:<br>-\tAll New weapons: Thunder Gun, Matroyshka dolls, Gersh Device and the Sickle <br>-\tAll New Achievements<br>-\tA one-time gift of 5,000 CoD points for players<br>-\tReturning players will be rewarded with a small amount of CoD points on each day they play<br><br>Finally, a variety of optimizations and fixes have also been incorporated into this update to give players the best mobile Zombie experience yet.<br>For tips, tricks, and troubleshooting, be sure to check out the Black Ops Zombies Field Manual at www.callofduty.com/blackops/faq/ioszombies"},{"version_id":"813616206","version_name":"1.3.4","version_date":"2015-10-12 22:54:36.000 +0800","version_description":"Now compatible with iOS 8/9<br>Added iPhone 6, 6 plus, iPad Air compatibility<br>Online Multiplayer connection improvements<br>Various bug fixes"},{"version_id":"815198240","version_name":"1.3.5","version_date":"2015-12-17 23:37:35.000 +0800","version_description":"This app has been updated by Apple to use the latest Apple signing certificate.<br><br>- Added Air 2 compatibility<br>- Various bug fixes"},{"version_id":"837077992","version_name":"1.3.5","version_date":"2015-12-17 23:37:35.000 +0800","version_description":"This app has been updated by Apple to use the latest Apple signing certificate.<br><br>- Added Air 2 compatibility<br>- Various bug fixes"}]