[{"version_id":"13479223","version_name":"1.76","version_date":"2013-01-31 23:53:17.000 +0800","version_description":"NEW <br>★ As an option, the Mean Lunar Node - an alternate calculation - is now available for display in the chart. The default value remains the True Node. <br>See Settings &gt;&gt; Chart Points. <br>★ For the Part of Fortune, the Day/Night Formula option is also now available in local settings. Most modern Western astrologers use the Day/Night positions which differ from the older standard only in the case of a so-called 'nocturnal' chart - when the Sun is below the horizon. <br>★ House Calculation Method is now set local to each chart, when creating or through Edit, allowing for experimentation. Changing the default House method in Settings will no longer change existing charts, but applies to new ones created subsequently. <br>★ The various House Calculation Methods are described in a new section: <br>Settings &gt;&gt; About House Calculations. <br>★ The app now allows easy return to your last-referenced chart by indexing to it. In comparisons, the app remembers the previous chart loaded, and attempts to navigate there, to make re-running the same comparison quicker. <br><br>FIXES <br>★ Natal and transiting aspects to the nodes were not always working and this has been fixed. <br>★ On the iPhone 5, it was possible to get stuck while dragging the chart graphic around on the page, now fixed. <br>★ The table button for the semi-sextile aspect has been corrected. <br><br><br>Report bugs &amp; other feedback via Contact Support, in Settings, or by email to support@astrograph.com"},{"version_id":"690833984","version_name":"1.80","version_date":"2014-08-27 20:16:37.000 +0800","version_description":"NEW \n<br>* Improvements to the look and feel consistent with iOS features. \n<br>* Minor bug fixes have been included, including the way charts are indexed in user data. \n<br>* For Comparison charts there is now included a list of comparison planet positions.\n<br>* Better in-app purchase process"},{"version_id":"811925492","version_name":"1.84","version_date":"2015-03-13 22:23:59.000 +0800","version_description":"iOS 8 Compatibility fixes<br>Fixes for display issues on iPhone 6+ and iPhone 6<br>Interpretations improvements<br>Graphical improvements<br>Bug fixes"},{"version_id":"812222864","version_name":"1.87","version_date":"2015-04-28 13:42:31.000 +0800","version_description":"- We have cleared up a situation that could result in an incorrect current chart when GPS had been invoked in the past, or when the default city for the local timezone had an error in the atlas lookup.<br>- It was possible for the Part of Fortune to sometimes be calculated incorrectly, for a nocturnal chart, when the Day/Night formula choice was invoked, and this has also been corrected. <br>- This version preserves improvements made in recent builds to text readability when the star field background was interfering."},{"version_id":"813612063","version_name":"1.92","version_date":"2015-10-13 19:54:17.000 +0800","version_description":"Fixes for iOS 9<br> - day wheel was not showing in certain circumstances<br>64 bit support<br>TimePassages now requires iOS 8 or higher"},{"version_id":"814736534","version_name":"2.7.2","version_date":"2019-02-09 17:48:26.000 +0800","version_description":"We have taken care of a problem of losing track of previously purchased charts while traveling; the change to the internal time zone was throwing off the purchase verification.<br>Transit date/time storage now includes local time zone at the point of the original request.<br>We have also added support for \"one-click reviews,\" triggered by usage."},{"version_id":"814736534","version_name":"1.94","version_date":"2015-11-24 01:38:29.000 +0800","version_description":"Sunrise Chart switch not working in some cases, now resolved.<br>Other minor bug fixes."},{"version_id":"828037289","version_name":"2.02","version_date":"2018-08-01 19:03:06.000 +0800","version_description":"Bug fixes, including an updated atlas.<br>Several new display options in Settings - notably White Background for interpretation text.<br>New planets Makemake and Haumea added to the TNOs (with Include Smaller TNOs)."},{"version_id":"828139907","version_name":"2.5","version_date":"2018-08-08 23:09:13.000 +0800","version_description":"Minor bug fixes including Atlas fixes. <br>New bi-wheel chart format for outer ring of planets.<br>New planets Makemake and Haumea added to the TNOs (with Include Smaller TNOs).<br>Several new display options in Settings - including White Background for interpretation text."},{"version_id":"828309583","version_name":"2.6","version_date":"2018-08-31 17:57:49.000 +0800","version_description":"Fixed a bug with establishing connectivity that was causing frequent crashes when there was a poor 3G or 4G signal.<br>The app would sometimes crash when sending a support email using Settings &gt;&gt; Contact Support, fixed.<br>In the \"me\" chart only, the viewing area was being artificially shortened due to a constraints issue, now resolved.<br>The GPS function to allow local current chart is now working.<br>-from 2.5 -<br>Minor bug fixes including Atlas fixes. <br>New bi-wheel chart format for outer ring of planets.<br>New planets Makemake and Haumea added to the TNOs (with Include Smaller TNOs).<br>Several new display options in Settings - including White Background for interpretation text."},{"version_id":"828519408","version_name":"2.6.1","version_date":"","version_description":""},{"version_id":"830235257","version_name":"2.7.2","version_date":"2019-02-09 17:48:26.000 +0800","version_description":"We have taken care of a problem of losing track of previously purchased charts while traveling; the change to the internal time zone was throwing off the purchase verification.<br>Transit date/time storage now includes local time zone at the point of the original request.<br>We have also added support for \"one-click reviews,\" triggered by usage."},{"version_id":"832560234","version_name":"2.7.3","version_date":"2019-09-09 20:02:21.000 +0800","version_description":"We have updated the Atlas information for China - adding new cities and clarifying duplicate database entries and modern time zone usage.<br>Also some of the displayed Time Zone codes have been improved.<br>We have also improved the interpretation handling for Solar Arc Progressions, also called \"Directions.\"<br>We also fixed an annoying cosmetic issue in the transit and progressions pick list, where the timezone was falsely shown off by 1 when daylight savings time was in effect."},{"version_id":"833274885","version_name":"2.7.4","version_date":"2019-10-23 09:09:32.000 +0800","version_description":"We have fixed an annoying issue with pinch-zoom of the chart graphic that cropped up in iOS 13.<br>Also, a previous version update, now fixed, inadvertently gave a false conjunction interpretation in some instances, so that Saturn square Saturn was being written up as though a Saturn return.<br>An earlier calculation decision regarding the Solar Arc Progressed Ascendant has been adjusted to more standard practice, so that (unlike secondary Progressed Ascendant) <br>- SA Progressed Asc will now be calculated by the addition of solar arc from the radical ascendant.<br>Location search has also been modernized to use iOS 13 system calls."},{"version_id":"833439047","version_name":"2.7.5","version_date":"2019-11-02 05:03:27.000 +0800","version_description":"We have fixed an annoying issue with pinch-zoom of the chart graphic not working, INCLUDING comparison charts, for iOS 13.<br>Now \"Dark Mode\" will not interfere with TimePassages screen views, rendering them blank.<br>Also, an incorrect conjunction interpretation, now fixed, was being given in some instances, so that Saturn square Saturn was being written up as though a Saturn return.<br>Additionally, the Solar Arc Progressed Ascendant has been adjusted to more standard practice, so that (unlike secondary Progressed Ascendant) SA Progressed Asc will now be calculated by the simple addition of the solar arc from the natal ascendant.<br>Location search has also been modernized to use newer iOS system calls."},{"version_id":"836427598","version_name":"2.8.0","version_date":"2020-06-19 01:52:05.000 +0800","version_description":"Minor fixes include better pinch-zoom handling for the chart graphic, better sizing of the graphic as shared to email, and better use of the screen real estate for recent iPhone models.<br>Delete confirmation was not always being invoked, and this has been corrected."},{"version_id":"838216261","version_name":"2.8.2","version_date":"2020-10-17 23:26:12.000 +0800","version_description":"Thank you for using TimePassages! We are constantly working to improve our app's stability, speed, and accuracy.<br>- Improved layout for adding and editing chart data.<br>- Improved layout for the Settings page. <br>- Added interpretations for Chiron aspects in synastry.<br>- Edit styles for date and time as separate fields now take advantage of the iOS 14 date/time pickers.<br>- Other general visual improvements plus iPad app icons."},{"version_id":"838357538","version_name":"2.8.3","version_date":"2020-11-09 04:42:31.000 +0800","version_description":"Thank you for using TimePassages! We are constantly working to improve our app's stability, speed, and accuracy.<br>- Improved layout for adding and editing chart data.<br>- this release makes a few adjustments to resolve known issues, among them, problems in setting the default location<br>- general cosmetic improvements"},{"version_id":"839289525","version_name":"2.8.4","version_date":"2020-11-21 21:10:41.000 +0800","version_description":"Thank you for using TimePassages! We are constantly working to improve our app's stability, speed, and accuracy.<br>- Improved layout for adding and editing chart data.<br>- in this release, for iOS 14, we have also reverted the date and time selectors to the previous style as they were causing intermittent crashes.<br>- general cosmetic improvements."},{"version_id":"839560967","version_name":"2.8.5","version_date":"2021-01-06 04:36:28.000 +0800","version_description":"Thank you for using TimePassages! We are constantly working to improve our app’s stability, speed, and accuracy.  <br>Also, due to popular demand, we have put the current transit bi-wheel chart back into the Daily Horoscope; after listening to your feedback, we recognised the value of this feature.  <br>This release also includes some other minor bug fixes and stability improvements."}]