[{"version_id":"288913503","version_name":"3.3","version_date":"","version_description":""},{"version_id":"5511967","version_name":"1.0","version_date":"","version_description":""},{"version_id":"811176126","version_name":"3.4.4","version_date":"2014-12-18 01:38:01.000 +0800","version_description":"Minor bug fixes. Very exciting!"},{"version_id":"812095668","version_name":"3.5","version_date":"2015-04-06 22:36:30.000 +0800","version_description":"Hey Werdsmiths, just a nifty little update for you today, including a brand new Sepia Theme! Take it for a test-drive and let us know what you think."},{"version_id":"812406872","version_name":"3.6","version_date":"2015-05-27 19:29:07.000 +0800","version_description":"&gt;&gt;&gt; PLEASE NOTE: 1. The app won't request your passcode if you've used it in the last minute. 2. This version only shows reading length for items in your \"Projects\" section. We're fixing both of these issues in the next update. Thanks for your patience!<br><br>Original update:<br>-------------<br>Hello there! Tons of awesome little changes in this update to make Werdsmith better for you. The highlights include:<br><br>- Print your projects directly from the app. Just tap the Info button, then Export &gt; Print.<br>- You can send projects to others via AirDrop, and import .txt or .md files from emails into Werdsmith.<br>- You can now unlock your writing studio with TouchID (only for devices that support this feature.)<br>- We've improved the project menu. You can now just type in your word goal, no more sliding. (Thanks for your patience on this one!)<br>- We've added a live-updating word count to the main editing screen, so it's faster to check how long your project is.<br><br>Some housekeeping:<br>- We've moved the font options to the main menu, next to the themes.<br>- The editing screen's font size is now set to your device's font size. You can change this in Settings &gt; General &gt; Accessibility &gt; Larger Text. <br>- The screen to edit your profile info has been moved to the Options menu.<br>- The reading length for your project is now in the project menu, under the word goal.<br>- We've added a back button to the editing screen, for the lost ones among you.<br><br>Thanks for supporting Werdsmith! If you like this update, please give us a 5-star rating in the App Store to help us support more features and future updates."},{"version_id":"812548826","version_name":"3.6.1","version_date":"2015-06-15 18:34:58.000 +0800","version_description":"Just a couple of changes/fixes for you:<br>- If you've enabled the lock, you'll now be asked for your Touch ID/passcode every single time you launch the app (we previously didn't ask if you closed the app less than a minute ago).<br>- The reading length for your project is now shown on the bottom of the info screen.<br>- Fixed a few bugs for users on iOS 7.<br><br>Keep up the writing!"},{"version_id":"812810381","version_name":"3.6.2","version_date":"2015-07-15 20:38:30.000 +0800","version_description":"This version fixes a bug that caused some users' devices to stop syncing. If you believe this has affected you, please contact us and we'll help you resolve this issue.<br><br>You can send us an email by tapping the info button on the main screen, then Options &gt; Support &amp; Feedback &gt; Contact Werdsmith."},{"version_id":"818048519","version_name":"4.0","version_date":"2016-09-23 06:43:59.000 +0800","version_description":"NOTE: This version has a bug that stops some users from accessing features they've purchased. We've fixed this bug and everything will be returned to normal when the update is approved by Apple, which should be in the next couple of days. Thanks for your patience!<br><br>---<br><br>Hello, writers! We’ve been hard at work over the last year rewriting Werdsmith from the ground up. This is a MASSIVE update, so without further ado, here’s what you get:<br><br>•  A brand new design!<br>•&nbsp; Add bold, italics and headings to your writing<br>•&nbsp; Brand new novel-writing and screenplay-writing tools (we think you’ll love these!)<br>•&nbsp; Two new themes<br>•  New writing stats for all your projects to keep you motivated: <br>    - how long you’ve spent writing<br>    - how many words you’ve typed<br>    - how many words you’ve written today<br>•&nbsp; An Apple Watch app to check your writing stats and quickly add ideas from your wrist (secret agent style)<br>•&nbsp; A today widget to keep you updated on your writing stats. Add it to your search screen!<br>•&nbsp; Redesigned history mode and undo options (finally!)<br>•&nbsp; All prompts and exercises in the Unblock app are now free for pro members<br>•  iOS 10 support<br><br>You can use all these features for free, but you will be prompted to upgrade after using the themes or formatting.<br><br>We’ve also made millions of bug fixes and performance enhancements, plus improved support for 3D Touch, iPad multitasking, Spotlight search and accessibility. We hope you love this new version and we’d love to hear your feedback.<br><br>- Your friends at Werdsmith"},{"version_id":"819025991","version_name":"4.0.1","version_date":"2016-09-24 20:14:50.000 +0800","version_description":"Just a quick update to fix a couple of bugs from the big update.<br>• Fixed a bug that would stop some users from accessing features they purchased. Thank you for your patience!<br>• Fixed a bug that would stop you from deleting asterisks.<br><br>---<br><br>In case you missed it, here's what's new in v4.0:<br><br>•  A brand new design!<br>•&nbsp; Add bold, italics and headings to your writing<br>•&nbsp; Brand new novel-writing and screenplay-writing tools (we think you’ll love these!)<br>•&nbsp; Two new themes<br>•  New writing stats for all your projects to keep you motivated: <br>    - how long you’ve spent writing<br>    - how many words you’ve typed<br>    - how many words you’ve written today<br>•&nbsp; An Apple Watch app to check your writing stats and quickly add ideas from your wrist (secret agent style)<br>•&nbsp; A today widget to keep you updated on your writing stats. Add it to your search screen!<br>•&nbsp; Redesigned history mode and undo options (finally!)<br>•&nbsp; All prompts and exercises in the Unblock app are now free for pro members<br>•  iOS 10 support<br>•&nbsp; Bug fixes and performance enhancements improved support for 3D Touch, iPad multitasking, Spotlight search and accessibility<br><br>You can use all these features for free, but you will be prompted to upgrade after using the themes or formatting."},{"version_id":"819108059","version_name":"4.0.2","version_date":"2016-09-30 21:09:43.000 +0800","version_description":"Just a quick update to grease the gears, make everything smoother, cleaner and nicer. As always, email us your feedback!"},{"version_id":"819346601","version_name":"4.0.3","version_date":"2016-10-18 18:20:28.000 +0800","version_description":"Just a quick maintenance update. We've noticed a couple of bugs and we're collecting intelligence so we can squash them as soon as possible. Hang tight!"},{"version_id":"819383294","version_name":"4.0.4","version_date":"2016-10-21 17:50:34.000 +0800","version_description":"Lots of bug fixes, and more to come!"},{"version_id":"819468484","version_name":"4.0.5","version_date":"2016-10-26 21:39:38.000 +0800","version_description":"We've been working hard fixing the bugs you've reported. Thanks for your help and please don't hesitate to email us with feedback!"},{"version_id":"819584809","version_name":"4.1","version_date":"2016-11-03 18:21:17.000 +0800","version_description":"FREEBIE! We’ve been listing to your feedback and from today, the Markup format is free for everyone. <br><br>We also wanted to apologize for the frequency of the popups. This was totally unintentional (and counter-productive) and we’ve reduced the amount of popups significantly.<br><br>If you love Werdsmith, help support our development. Just tap on the Werdsmith icon on the left and leave us a nice review :)"},{"version_id":"819705843","version_name":"4.1.1","version_date":"2016-11-12 01:52:27.000 +0800","version_description":"We've got two little goodies for you today:<br>  - A custom passcode lock option, for those who need extra, EXTRA security<br>  - An option to change the font size of your text<br><br>Love Werdsmith? Help the writers of the world discover us by tapping the moustache on the left and leaving us a nice review :)"},{"version_id":"819747336","version_name":"4.1.2","version_date":"2016-11-19 02:03:51.000 +0800","version_description":"Just a couple of minor fixes. Nothing to see here!"},{"version_id":"820400829","version_name":"4.1.3","version_date":"2017-01-06 16:10:17.000 +0800","version_description":"Just a couple of fixes for you today."},{"version_id":"820585141","version_name":"4.1.4","version_date":"2017-01-18 15:18:04.000 +0800","version_description":"Another minor update to fix a bug with the lock screen. You'll no longer see a sneaky flash of your writing studio when you've got the lock enabled."},{"version_id":"820762348","version_name":"4.1.5","version_date":"2017-01-31 16:19:47.000 +0800","version_description":"Just a mini-update today:<br>- In your project stats, see how many times your projects have been viewed. Keep in mind, this includes times you've viewed them yourself!<br>- A bug that caused the \"words written today\" stat to be inaccurate has been fixed."},{"version_id":"823203250","version_name":"4.1.6","version_date":"2017-08-07 21:42:43.000 +0800","version_description":"Just a small update to add a \"scroll to bottom\" button for long projects and fix a few niggling bugs. A bigger update is coming soon!<br><br>Run into any issues? Let us know by contacting us through the Help section of the app.<br>Love Werdsmith? Support us by tapping the moustache on the left and leaving us a 5-star review. It really helps!"},{"version_id":"823532283","version_name":"4.2","version_date":"2017-09-26 00:46:58.000 +0800","version_description":"This version of Werdsmith is all about iOS 11. The new stuff: import/export to iCloud, Dropbox + more, drag and drop on iPad, and recover deleted work in the new \"Archive\" section. <br><br>For those who want more details:<br><br>- You can now seamlessly export Werdsmith projects to iCloud, Dropbox and more by tapping \"Export\" on your project, then \"Save to Files\". <br><br>- You can instantly import .txt and .md documents into Werdsmith using Airdrop or by tapping the share button in the Files app and selecting \"Copy to Werdsmith\".<br><br>- We've added an Archive screen in the settings section of the app, where you can view deleted projects and recover them. You can also permanently delete projects from this screen if you want all traces destroyed forever.<br><br>- We've added support for drag and drop on iPad. You can have Werdsmith on one side of your screen and drag text from Safari or other apps straight into a Werdsmith project. Perfect for collecting research or inspiration.<br><br>- We've added big discounts on your membership when you subscribe for 6 months or a year at the time.<br><br>- Bug fixes and lots of small improvements to keep everything moving.<br><br>If you love Werdsmith, help the writers of the world discover us by tapping the moustache on the left and leaving us a 5-star review."},{"version_id":"824199210","version_name":"4.2.1","version_date":"2017-10-30 17:15:50.000 +0800","version_description":"Please hit that update button ASAP: this version fixes some nasty bugs."},{"version_id":"824372924","version_name":"4.2.2","version_date":"2017-11-12 21:41:37.000 +0800","version_description":"Just a quick update today to patch some bugs and improve compatibility with the new iPhone X."},{"version_id":"825975840","version_name":"4.2.3","version_date":"2018-03-11 18:47:20.000 +0800","version_description":"Just a quick update to simplify the editing screen. Instead of the \"Aa\" button at the top of the screen, you can now access your formatting or change your idea into a project by tapping the action button in the bottom right hand corner of the screen and choosing \"Formatting\" or \"Move to Projects\". <br><br>This version also fixes a few little issues with iPhone X support and some crashes that affected a small group of users."},{"version_id":"827134365","version_name":"4.2.4","version_date":"2018-05-14 17:30:44.000 +0800","version_description":"We've made a few bug fixes and improvements, plus improved support for iPhone X.<br><br>If you love Werdsmith, help other writers find us by tapping our logo and leaving us a 5-star review. Thanks!"},{"version_id":"827963212","version_name":"4.3","version_date":"2018-07-31 21:50:30.000 +0800","version_description":"Hello POETS! Werdsmith Members can now write beautifully formatted poems. We use the standard poem format: monospaced font and line indents. Check it out and let us know what you think!"},{"version_id":"828605863","version_name":"4.3.1","version_date":"2018-09-16 01:38:12.000 +0800","version_description":"This version removes the Facebook Login option. If your Werdsmith account is connected to Facebook, just check that your account email is correct on the Account page. Email is now the only way to log into your Werdsmith account, so it's crucial your account's email address is correct if you ever lose or change your device! If you need help logging in, just check the Help section.<br><br>This version also: <br>- improves support for iOS 12<br>- improves support for Hebrew and Arabic<br>- shows the scroll-to-bottom button more often"},{"version_id":"832780902","version_name":"4.4","version_date":"2019-09-17 04:19:40.000 +0800","version_description":"This version adds support for iOS 13 and Dark Mode, plus a new Backups feature.<br><br>- The default theme now adapts to Dark Mode automatically - for all Werdsmith users. We're working on adding more themes soon!<br><br>- Every day, a backup file of all your work will be added to the new \"Backups\" section in Settings. You can easily export backups out of the app in case you lose work or want to keep your own backups."},{"version_id":"832809829","version_name":"4.4.1","version_date":"2019-09-18 12:18:47.000 +0800","version_description":"This version fixes a potential issue with devices running iOS 11 or earlier."},{"version_id":"832900559","version_name":"4.4.2","version_date":"2019-09-25 21:11:59.000 +0800","version_description":"We’ve fixed a bug for a small number of users that caused crashes while editing."},{"version_id":"833088076","version_name":"4.4.3","version_date":"2019-10-09 14:47:10.000 +0800","version_description":"This version of the app fixes some annoying crashes. Please message us through the app if you're still running into issues."},{"version_id":"833250370","version_name":"4.4.4","version_date":"2019-10-21 03:11:25.000 +0800","version_description":"This version contains a few more bug fixes."},{"version_id":"833281325","version_name":"4.4.5","version_date":"2019-10-22 17:22:36.000 +0800","version_description":"Another quick bug fix - this time we've fixed a bug that caused issues with the lock screen on iOS 13."},{"version_id":"833912962","version_name":"4.4.6","version_date":"2019-12-07 14:49:58.000 +0800","version_description":"This version fixes a couple of bugs - please contact us if you run into any issues."},{"version_id":"834408905","version_name":"4.4.7","version_date":"2020-01-19 19:31:51.000 +0800","version_description":"This version fixes a bug that stopped some iPad users exporting their work or recovering archived projects."},{"version_id":"837186746","version_name":"4.4.8","version_date":"2020-08-02 13:19:16.000 +0800","version_description":"This version fixes a bug with restoring purchases."},{"version_id":"837806156","version_name":"4.4.9","version_date":"2020-09-17 12:16:17.000 +0800","version_description":"This version improves compatibility with iOS 14."},{"version_id":"839072198","version_name":"4.4.10","version_date":"2020-11-13 22:54:25.000 +0800","version_description":"This version fixes a crash that affected a small group of Werdsmith users. It also improves syncing, compatibility with iOS 14, iPad multitasking and Dark Mode."},{"version_id":"839272565","version_name":"4.5","version_date":"2020-11-19 15:02:52.000 +0800","version_description":"NEW: iOS 14 widgets. Reach your writing goals by tracking your daily writing stats on your home screen.<br><br>To add a widget:<br><br>- Tap and hold on any empty part of your Home Screen. Your apps will start to wiggle.<br>- Tap the \"+\" that appears in the top left hand corner of your screen.<br>- Scroll to the bottom of the widgets list and tap \"Werdsmith\".<br><br>Please note that this is the last version of Werdsmith that'll support iOS 9-12. You can continue using the app on an old version of iOS, but you'll need iOS 13 or 14 to receive new features or bug fix updates."},{"version_id":"839289360","version_name":"4.5.1","version_date":"2020-11-19 23:58:53.000 +0800","version_description":"NEW: iOS 14 widgets. Reach your writing goals by tracking your daily writing stats on your home screen.<br><br>To add a widget:<br><br>- Tap and hold on any empty part of your Home Screen. Your apps will start to wiggle.<br>- Tap the \"+\" that appears in the top left hand corner of your screen.<br>- Scroll to the bottom of the widgets list and tap \"Werdsmith\".<br><br>Please note that this is the last version of Werdsmith that'll support iOS 9-12. You can continue using the app on an old version of iOS, but you'll need iOS 13 or 14 to receive new features or bug fix updates."},{"version_id":"839567203","version_name":"4.5.2","version_date":"2020-12-09 18:49:36.000 +0800","version_description":"This version fixes a crash while editing that affected a small number of users.<br><br>---<br><br>NEW: iOS 14 widgets. Reach your writing goals by tracking your daily writing stats on your home screen.<br><br>To add a widget:<br><br>- Tap and hold on any empty part of your Home Screen. Your apps will start to wiggle.<br>- Tap the \"+\" that appears in the top left hand corner of your screen.<br>- Scroll to the bottom of the widgets list and tap \"Werdsmith\".<br><br>Please note that this is the last version of Werdsmith that'll support iOS 9-12. You can continue using the app on an old version of iOS, but you'll need iOS 13 or 14 to receive new features or bug fix updates."},{"version_id":"839637195","version_name":"4.5.3","version_date":"2020-12-14 16:35:47.000 +0800","version_description":"This version fixes an issue with importing files from the Files app.<br><br>---<br><br>NEW: iOS 14 widgets. Reach your writing goals by tracking your daily writing stats on your home screen.<br><br>To add a widget:<br><br>- Tap and hold on any empty part of your Home Screen. Your apps will start to wiggle.<br>- Tap the \"+\" that appears in the top left hand corner of your screen.<br>- Scroll to the bottom of the widgets list and tap \"Werdsmith\".<br><br>Please note that this is the last version of Werdsmith that'll support iOS 9-12. You can continue using the app on an old version of iOS, but you'll need iOS 13 or 14 to receive new features or bug fix updates."},{"version_id":"844253226","version_name":"4.5.4","version_date":"2021-10-01 00:54:12.000 +0800","version_description":"A huge update to Werdsmith is coming soon. Get a sneak peek at werdsmith.com/5<br><br>Please note: This is the last version of Werdsmith that will support iOS 13."}]