[{"version_id":"638362745","version_name":"2.1","version_date":"2014-07-24 06:42:13.000 +0800","version_description":"New Features:<br>- Prediction Badge™ (Period/Ovulation/Cycle Day/Due Date). See when the next Event occurs already on your Icon.<br>- Notifications for your next Period/Ovulation, Pill or Nuvaring<br>- Create your own Calendar Themes and include even a Background Photo<br>- Backup/Restore via MyDays Cloud Backup, Dropbox or PC<br>- Auto Backup Save/Load<br>- NuvaRing and other birth Control based on Insert/Remove after x Days<br>- Partneremail, eMail your Partner how u felt in the last days and whats coming next.<br>- Choose long touch to change data and short to see more infos of the day<br>- Disable Daily Options, for example for kids or when you don't like to come pregnant<br>- Track more than 20 Symptoms and remember your Breast Self examination<br>- Track when you had sex (protected/unprotected)<br>- See the possible gender your baby may be <br>- Track your Cervix position, openness, firmness &amp; feeling <br>- Track OPK Results (negativ, fertile, peak/ovulation)<br>- Add the actual cycle day to the calendar days<br>- Disable the predictions for period or ovulation on the calendar<br>- Filter what you like to see in your History List (eg. only Data from 2014)<br>- Photo Memories for each Day<br>- Multi Language: EN, DE, ES, FR, IT, AR, RO, PL, PT, BG, HR, NL, CA, ZH<br><br>Fix: <br>- FullScreen Ad (CloseButton)<br><br>Important:<br>- To be sure you keep your data while update crash etc, make a manual backup before you update!"},{"version_id":"819712979","version_name":"2.996","version_date":"2016-11-14 19:23:53.000 +0800","version_description":"Added ability to save and display info for multiple sex sessions in a single day.<br>Fixed error where app could crash when uploading a photo.<br>General bug fixes, optimisations and improvements."},{"version_id":"822675844","version_name":"3.034","version_date":"2017-06-27 16:19:34.000 +0800","version_description":"Chat moved to calendar screen.<br>Email required to set password.<br>Critical bug fixes.<br>Dropbox disabled (due to new version incompatibility).<br>General clean up."},{"version_id":"822723040","version_name":"3.035","version_date":"2017-06-28 21:40:24.000 +0800","version_description":"Chat moved to calendar screen.<br>Email required to set password.<br>Critical bug fixes.<br>Dropbox disabled (due to new version incompatibility).<br>General clean up."},{"version_id":"822821749","version_name":"3.038","version_date":"2017-07-12 07:58:05.000 +0800","version_description":"Re-enabled pregnancy notifications and icon badges."}]