[{"version_id":"10267039","version_name":"9.3.0.176","version_date":"2012-10-26 05:07:30.000 +0800","version_description":"CoPilot GPS is now iPhone 5 and iOS 6 ready! \n\nAnd that’s not all, here’s what’s available for all GPS customers:\n\n• OPTIMIZED FOR iPHONE 5:  Full screen navigation on the iPhone 5’s new taller screen\n\n• UPDATED MAPS:  New 2012 Q2 maps of North America\n\n• GOOGLE SEARCH:  CoPilot’s local search is now powered by Google!\n\n• NEW INFO DISPLAY:  Current Road is now displayed on the map in a customizable box \n\n• OTHER IMPROVEMENTS:  Multiple UI enhancements and fixes\n\nFor Customers with Full Voice-Guided 3D Upgrade:\n• NEW THEMES:  Change the way your CoPilot looks with 4 new free color schemes\n\n• IMPROVED ACTIVETRAFFIC™: Redesigned Traffic Status Bar and Traffic Map (paid subscription feature)\n\nThank you for choosing CoPilot GPS. Please continue sending your feedback on how to improve CoPilot at facebook.com/copilotliveusa"},{"version_id":"12907433","version_name":"9.4.0.146","version_date":"","version_description":""},{"version_id":"14153293","version_name":"9.4.0.176","version_date":"","version_description":""},{"version_id":"15851424","version_name":"9.4.0.276","version_date":"2013-07-25 22:21:02.000 +0800","version_description":"CoPilot 9.4.0.276 is here, and it's packed with great new features, improvements and updated maps to help you navigate the summer with ease:\n•\tCompletely updated street maps\n•\tNew: Connection settings with an offline switch to help you control your data costs - abroad and at home\n•\tNew: Just Drive mode for navigating without a destination\n•\tActiveTraffic improved with better handling of closed roads\n•\tAutomatic Cloud Backup\n\t\nHappy travels from CoPilot team!"},{"version_id":"244962662","version_name":"9.5.0.435","version_date":"2014-01-02 23:18:02.000 +0800","version_description":"Unwrap Your Maps in the New Year\n\nEveryone loves maps—in fact, we'd be lost without them! So here's a gift from us to you: a free map update plus routing improvements to help you navigate to your loved ones safely and stress free in the New Year.\n\n• Free Map Update: The latest premium quality street maps\n• Welcome South East Asia! We've added an entirely new continent to CoPilot, with maps of Brunei, Indonesia, Malaysia, Philippines, Singapore, Taiwan and Thailand\n• Better Routes: We're working hard to get you from A to B via the best way possible, so we’re pleased to introduce some improvements to CoPilot's standard routes based on your feedback\n• Themes Fixed & Improved: In our previous update Themes were broken—we are truly sorry for the trouble this caused. We’ve now fixed the issue and improved the look of all of our Themes\n• iOS 7 Text-to-Speech: Now you can use Apple's own speech engine for voice directions\n• Back by popular demand: Purple route line in the UK map style\n\n*only available with full navigation\n\nHappy travels from all of us here at CoPilot. We've got some exciting things for you down the road in 2014 so stay tuned! "},{"version_id":"474332651","version_name":"9.6.0.638","version_date":"2014-05-14 02:26:50.000 +0800","version_description":"•NEW CommuteMe™ feature learns your preferred daily commute and provides real-time traffic* and ETA info along that personal route you love. You know the one that gets you to work and home for dinner on time! \n•NEW ability to add a POI as your next stop without altering your final destination \n•NEW Drag & Drop trip editing to easily move stops up or down within your trip \n•IMPROVED POI search on your route to find the closest POIs and save time by avoiding driving too far out of your way \n•YOU ASKED FOR IT so we made it simple to change your CoPilot ID (email address) directly within CoPilot, just go to MyCoPilot > My Account \n•ADDED the option to navigate to Decimal Minutes Coordinates \n\n*ActiveTraffic required \n\nSafe travels!\n"},{"version_id":"620883428","version_name":"9.6.736","version_date":"","version_description":""},{"version_id":"620883428","version_name":"9.6.2.707","version_date":"2014-08-21 08:49:01.000 +0800","version_description":"This update is packed with summer travel essentials! \n\n•FREE North America & Europe Map Update – whether you’re local or want to travel like a local, you’ll have the most up-to-date accurate maps guiding you\n•Even More Accurate Routing – ActiveRoutes™*calculates the best route to your destination based on actual road speeds at the time of day you’re traveling\n•New CommuteMe™ Time Settings –  when you’re not on holiday/vacation, you still need to get to work on time\n•Traveling to India?  Now you can download the complete street-level map before you go\n•Enhanced Motion Lock functionality to keep you safe and not distracted\n\n*Requires ActiveTraffic™ subscription and the latest map update. ActiveRoutes™ is available in Europe and USA & Canada only. \n\n"},{"version_id":"715414785","version_name":"9.6.2.736","version_date":"2014-10-08 05:26:56.000 +0800","version_description":"• Map update of Europe and North America bringing enhancements and fixes for reported errors. To download go to:   MyCoPilot > My Maps.  Map update is only available if the maps are currently downloaded.\n• Improved graphics for iPhone 6 \n• Now also supports iOS 8\n• Central Eastern Europe map region is available to download again\n• Iceland is back in Nordics region\n• Includes a few minor fixes here and there"},{"version_id":"776964286","version_name":"9.6.2.752","version_date":"2014-12-03 22:49:54.000 +0800","version_description":"• Includes a few minor fixes here and there\n• Tip: Use of GPS can drain your battery. Go to Settings>Power Saving to conserve your battery life"},{"version_id":"811145160","version_name":"9.6.2.803","version_date":"2014-12-21 10:31:16.000 +0800","version_description":"Plan your Happy Holidays with new maps and features to get you where you need to go this season\n\nImportant note for iOS 6 users: We’ve discovered an issue which prevents CoPilot from running properly with iOS 6. If you are running iOS 6, please do NOT update your CoPilot to our latest version 9.6.2.80x. We're working on a fix and we'll release it soon, so please stay tuned.\n\nNew in 9.6.2.803:\n• Free Map Update for Europe, Brazil and Southern Africa : Up-to-date maps for a busy holiday season full of shopping, parties and family dinners₊\n• Now compatible with iPhone 6 Plus\n• New: Navigate to your Favourites directly from the notification centre\n• Enhanced ActiveTraffic™ service: Better routing around road closures**\n• Bug fixes\n\nTip:  For quick and easy search, view POIs by category.  Go to Points of Interest > More Categories\n\nWe had a great time guiding you this year. See you in 2015!\n\n₊The latest maps are available for your licensed region only.\n**Requires ActiveTraffic subscription and full navigation upgrade"},{"version_id":"811483553","version_name":"9.6.812","version_date":"","version_description":""},{"version_id":"811483553","version_name":"9.6.2.812","version_date":"2015-01-23 12:30:15.000 +0800","version_description":"New version:\n•Fixes an iOS 6 compatibility issue\nPrevious version 9.6.2.803:\n• Free Map Update for Europe, Brazil and Southern Africa**\n•Now compatible with iPhone 6 Plus \n•New: Navigate to your Favourites directly from the notification centre\n•Enhanced ActiveTraffic™ service: Better routing around road closures* \n\nTip:  For quick and easy search, view POIs by category.  Go to Points of Interest > More Categories\n\n**The latest maps are available for your licensed region only.\n*Requires ActiveTraffic subscription and full navigation upgrade"},{"version_id":"811854038","version_name":"9.6.881","version_date":"","version_description":""},{"version_id":"811854038","version_name":"9.6.2.881","version_date":"2015-04-07 19:48:10.000 +0800","version_description":"Free Map Update for Middle East and Australasia*. Go to MyCoPilot > My Maps to get it.\n\nWe hope you enjoy this update which brings some performance improvements and minor fixes.\n\nDid you know? To save crucial battery power, go to Settings > Power Saving and activate the low power mode to keep going. \n\nFor more tips & news, please visit: copilotgps.com, facebook/copilotlive, @copilotgps or +CoPilot\n\n*Available for your licensed region only"},{"version_id":"812376112","version_name":"9.6.929","version_date":"","version_description":""},{"version_id":"812376112","version_name":"9.6.2.929","version_date":"2015-05-27 20:40:18.000 +0800","version_description":"Great news! Apple have fixed the issue with the CoPilot GPS app update not installing after downloading. You can now download and install it on your iPhone or iPad. Thank you for your patience while we worked with Apple to fix the issue.\n\nWe hope you like our new app icons and enjoy this update which brings some performance improvements and minor fixes\n\n•Fixes ETA calculation bug\n\nDid you know? To help you drive more safely, you can enable “Motion Lock” for hands free navigation. Go to Settings > Motion Lock.\n\nFor more tips & news, please visit: copilotgps.com, facebook/copilotlive, @copilotgps or +CoPilot"},{"version_id":"813311398","version_name":"9.6.1013","version_date":"","version_description":""},{"version_id":"813311398","version_name":"9.6.2.1013","version_date":"2015-09-28 23:04:45.000 +0800","version_description":"Free Map Update for Europe*. Go to MyCoPilot > My Maps to get it.\n\nSupport for iOS 9.\n\nCoPilot is now 64-bit optimized. Furthermore, this update provides minor performance enhancements and fixes to continue to improve your CoPilot experience.\n\nDid you know? You can select your mode of travel by going to Route > Vehicle Preferences and choose one out of five transport options.\n\nFor more tips & news, please visit: copilotgps.com, facebook/copilotlive, @copilotgps_us or +CoPilot\n\nDo you have any questions or suggestions? Please contact us at copilotgps.com/support\n\n*Available for your licensed region only"},{"version_id":"813681897","version_name":"9.63.89","version_date":"","version_description":""},{"version_id":"813681897","version_name":"9.6.3.89","version_date":"2015-11-24 00:18:56.000 +0800","version_description":"► Map update with the latest maps of USA and Canada\n► Introducing Personal Driving Profiles to create and save personal routing profiles for different kinds of trips like a weekend drive or your daily commute.  Go to Route > Vehicle Routing Profiles\n► Fixes “Map data not found” error\n► Fixes an issue where ETAs were not accurately reflecting traffic delays\n► Fixes an issue in iOS 9 where the status bar does not display properly in landscape mode\n► Fixes an issue with the “Buy Now” button\n \nFor more tips & news, visit: copilotgps.com, facebook/copilotlive, @copilotgps_us or +CoPilot\n \nHave questions or suggestions? We’re here to help. Visit copilotgps.com/support"},{"version_id":"814722032","version_name":"9.64.100","version_date":"","version_description":""},{"version_id":"814722032","version_name":"9.6.4.100","version_date":"2015-12-22 00:19:24.000 +0800","version_description":"- New restyled POI icons so you can easily find gas stations, restaurants, etc. around you.\n- New, easy to access options to clear your Current Stop or entire Trip when multiple stops remain.\n- Minor performance enhancements and fixes.\n\nFor more tips & news, visit: copilotgps.com, facebook.com/copilotgps, @copilotgps_us or +CoPilot\n\nHave questions or suggestions? We’re here to help. Visit copilotgps.com/support"},{"version_id":"819465836","version_name":"10.0.0.923","version_date":"2016-11-01 21:36:10.000 +0800","version_description":"Meet your all new CoPilot.\n\nCoPilot version 10 to be precise, and it’s a complete overhaul built specifically to meet the demands of you, the driver. We’ve left no stone unturned to improve every detail of the app, from the driving screens and maps to the routing and menu options.\n\nCoPilot is now safer, faster and easier to use.\n\n• Strikingly simpler to use. Menus are redesigned to put the tools you need on the road a tap away. Enjoy quick, easy access to search and planning tools, mute directions and end navigation. \n• Transformed maps. CoPilot’s non-distracting maps are now lightning fast too, with pinch zoom, fluid map panning and scrolling.\n• Re-engineered ActiveTraffic. New, improved live traffic status sidebar, accurate ETAs that factor in live traffic conditions in planning and better re-routing around delays.  Upgraded to the most precise traffic data available today.\n• More efficient trip planning. Now automatically view and compare 3 route options with accurate ETAs for every route. Effectively plan even the most complex itineraries.\n• Polished driver-friendly screens. Guidance screens are even clearer and easier to read and follow at a glance while driving.\n• Easier destination search. A new search screen makes it easier to find addresses and search millions of Points of Interest.\n• More prominent speed limit alerts.  Know immediately if you stray over the local limit.\n\nAnd much more, so jump in and explore!\n\nWe hope you enjoy your new CoPilot.  Share your experience with a review or on our user forum. We also have an all-new website. Check it out at copilotgps.com\n\nJoin the community: facebook.com/copilotgps, @copilotgps_us or +CoPilot\n\nHave questions or suggestions? We’re here to help. Visit copilotgps.com/support"},{"version_id":"819641667","version_name":"10.0.0.936","version_date":"2016-11-09 04:15:12.000 +0800","version_description":"We hope that you’re enjoying your all-new CoPilot. We’ve had tons of great feedback already and this update brings some fixes and tweaks based on your requests.\n\nMissed what is new with CoPilot? See below for details. \n\nThe next generation of CoPilot is here. We’ve improved every detail of the app, from the driving screens and maps to the routing and menu options.\n\n• Simpler to use\n• Transformed maps\n• New traffic status bar, better routing around delays\n• More efficient trip planning\n• Easier destination search\n• More prominent speed limit alerts\n\nAnd much more, so jump in and explore!\n\nJoin the community: facebook.com/copilotgps, @copilotgps_us or +CoPilot\n_____________________________________________________________________\n\nPlease keep letting us know how we can further improve so we can give you, the driver, the very best mobile navigation experience."},{"version_id":"819744033","version_name":"10.00.950","version_date":"","version_description":""},{"version_id":"819744033","version_name":"10.0.0.950","version_date":"2016-11-24 05:30:11.000 +0800","version_description":"As you can see it’s full speed ahead with another useful update to improve your CoPilot experience:\n\n> Improved: Faster search results when typing addresses\n> Improved: Landscape settings\n> Improved: ETA display\n> Improved: You can now add up to 100 different stops to your trip\n> Improved: Quicker destination entry for multi-stop trips\n\nPlease continue to let us know how we can further improve so we can give you, the driver, the very best mobile navigation experience.\n\nWe have no way of replying directly to App Store reviews so if you’d like to give us detailed feedback, please visit http://forum.copilotgps.com or contact support directly at https://support.copilotgps.com/hc/requests/new"},{"version_id":"820648115","version_name":"10.00.984","version_date":"","version_description":""},{"version_id":"820648115","version_name":"10.0.0.984","version_date":"2017-01-25 23:02:12.000 +0800","version_description":"> Fixed: Various minor bugs and brings performance improvements"},{"version_id":"821278159","version_name":"10.41.405","version_date":"","version_description":""},{"version_id":"821278159","version_name":"10.4.1.405","version_date":"2017-07-10 21:17:34.000 +0800","version_description":"Thank you for all of your feedback on the new generation CoPilot. We heard you and have made some significant UI changes and improvements based on what matters most to you, the driver.\n\n> New main menu with larger driver-friendly buttons and easy access to everything you need in one place\n> Re-designed landscape view. The map display is much larger and you’ll find directions back where you like them at the bottom of the screen\n> Map zoom buttons are back\n> Simplified destination search to make it easier to find the places you need\n> New smarter traffic updates now checks more frequently for the latest traffic delays so you’ll know about changing conditions more quickly\n> iPad exclusive: New split screen display combines the 3D/2D map view with directions for clearer guidance\n> Bug fixes and performance enhancements\n\nWe’ve got much more for you down the road. Please keep your feedback coming and help us shape the future of CoPilot - whether it’s through an app store review or our community forum at https://forum.copilotgps.com"},{"version_id":"822871350","version_name":"10.41.425","version_date":"","version_description":""},{"version_id":"822871350","version_name":"10.4.1.425","version_date":"2017-07-28 04:57:33.000 +0800","version_description":"Ready to enjoy your next journey? Get the latest free map update for Europe, Australia & New Zealand and the Middle East now, so that you can navigate like a local, wherever you go. Go to Main Menu > MyCoPilot > My Maps.*\n\n> Import custom POIs of your favorite places or popular 3rd party travel destinations to drive to\n> A couple of minor bugs were squashed\n\nWe’d love to hear your feedback. Write a review or join the community at facebook.com/copilotgps, @copilotgps_us or +CoPilot. \n\nUntil next time, bye for now.\n\n*For your licensed region only."},{"version_id":"823246799","version_name":"10.41.440","version_date":"","version_description":""},{"version_id":"823246799","version_name":"10.4.1.440","version_date":"2017-08-16 02:00:17.000 +0800","version_description":"Sometimes fixing the small things can make a big difference....so we did just that.\n\n> A couple of minor bugs were squashed\n\nWe’d love to hear your feedback. Write a review or join the community at facebook.com/copilotgps, @copilotgps_us or +CoPilot. \n\nUntil next time, bye for now."},{"version_id":"8233635","version_name":"9.1.5.81","version_date":"2012-06-26 13:14:44.000 +0800","version_description":"Thanks for choosing CoPilot GPS! \n\nThis is the first of many exciting updates to come.  It brings some useful fixes and enhancements to keep you heading in the right direction, including:\n\n- We now highlight the segment of the route that corresponds to each turn instruction as you cycle through the turns in the free map viewer mode\n- Southern Africa is now available to download as your one free map region or to purchase as an additional map region\n- Fixes a bug affecting safety camera integration (requires full turn-by turn-navigation)\n- Various performance and stability improvements\n- Minor improvements to the My Maps user interface to make map downloading & purchasing of additional map regions even easier\n\nWe are constantly working to improve all of our CoPilot apps and as always, appreciate your feedback.\n\nLet us know how we can make CoPilot even better at facebook.com/copilotliveusa\n"},{"version_id":"823382409","version_name":"10.111.197","version_date":"","version_description":""},{"version_id":"823382409","version_name":"10.111.80","version_date":"","version_description":""},{"version_id":"823382409","version_name":"10.100.535","version_date":"","version_description":""},{"version_id":"823382409","version_name":"10.41.447","version_date":"","version_description":""},{"version_id":"823382409","version_name":"10.4.1.447","version_date":"2017-09-13 00:35:12.000 +0800","version_description":"Your CoPilot just keeps on getting better….\n\n> A couple of minor bugs were squashed\n\nWe’d love to hear your feedback. Write a review or join the community at forum.copilotgps.com, facebook.com/copilotgps, @copilotgps or +CoPilot. \n\nUntil next time, bye for now."},{"version_id":"823676354","version_name":"10.7.1.178","version_date":"2018-09-26 17:27:13.000 +0800","version_description":"Thanks for using CoPilot! This app update is full of improvements and bug fixes: \n\n- Better cloud backup so you can back up and restore your favorites, trips and settings\n- iPhone X and iPhone 6&7 scaling enhancements\n- General performance and stability improvements\n\nHave questions? Find answers in our support center support.copilotgps.com"},{"version_id":"828933190","version_name":"10.100.535","version_date":"","version_description":""},{"version_id":"828933190","version_name":"10.10.0.535","version_date":"2018-12-03 21:34:34.000 +0800","version_description":"Built for you, the driver. Whether you are behind the wheel of a car, RV or truck we’ve added new features that are designed to meet the needs of all driver and vehicle types as you safely navigate the roads.\n\nNavigation For Car Drivers\n•  New maps of the world to explore any place, anywhere, in any way*\n\nNavigation For RV Drivers**\n•  Advanced RV navigation based on your vehicle size\n•  Customisable routing profiles for your RV’s dimensions \n•  Search millions of offline RV Places including campgrounds and rest areas for your adventure\n•  RV warnings to keep your safe as you travel the road\n\nNavigation For Truck Drivers**\n•  Includes CoPilot Truck routing, restrictions and warnings to keep you safe, compliant and efficient on the road\n•  Customisable truck routing profiles for your vehicle size and load\n•  New low bridge ahead warning\n•  Set governor speeds within truck routing profiles for highly accurate ETAs\n•  Search millions of offline truck Places including truck fuel stations and rest areas for a better life on the road\n\nWe’d love to hear your feedback. Write a review or join the community at facebook.com/copilotgps, @copilotgps or +CoPilot.  Need help? Visit our support centre support.copilotgps.com\n\n*Requires additional map upgrade\n**Not available in all regions"},{"version_id":"830780055","version_name":"10.111.10","version_date":"","version_description":""},{"version_id":"830780055","version_name":"10.11.1.10","version_date":"2019-04-23 21:22:54.000 +0800","version_description":"This app update is full of improvements and bug fixes:\n\n- New in-app volume control\n- General performance and stability improvements\n\nHave questions? Find answers in our support center support.copilotgps.com"},{"version_id":"831241827","version_name":"10.111.35","version_date":"","version_description":""},{"version_id":"831241827","version_name":"10.11.1.35","version_date":"2019-05-16 01:20:05.000 +0800","version_description":"This app update fixes an issue which caused a limited number of addresses to not display house numbers or street names.\n\nHave questions? Find answers in our support center support.copilotgps.com"},{"version_id":"831768333","version_name":"10.111.80","version_date":"","version_description":""},{"version_id":"831768333","version_name":"10.11.1.80","version_date":"2019-07-08 21:22:46.000 +0800","version_description":"This app update is full of improvements, bug fixes and general performance and stability improvements. Thank you for using CoPilot!\n\nHave questions? Find answers in our support center support.copilotgps.com"},{"version_id":"833238645","version_name":"10.111.197","version_date":"","version_description":""},{"version_id":"833238645","version_name":"10.11.1.197","version_date":"2019-10-21 20:57:33.000 +0800","version_description":"This app update is full of improvements, bug fixes and general performance and stability improvements. Thank you for using CoPilot!\n\nHave questions? Find answers in our support center support.copilotgps.com"},{"version_id":"833689525","version_name":"10.14.0.134","version_date":"2019-12-09 22:52:50.000 +0800","version_description":"This update brings you:\n- Enhanced ETAs that incorporate delays at red lights, roundabouts, and intersections. \n- Additional Vehicle Routing Profile preset options to help generate a more precise route. \n- Various bug fixes that include a fix for Travel Time calculations and a fix for the app freezing for iOS users \n\n*Vehicle Routing Profiles vary by region and license type. \n\nHave questions? Find answers at support.copilotgps.com"},{"version_id":"833689525","version_name":"10.140.134","version_date":"","version_description":""},{"version_id":"836046796","version_name":"10.14.0.536","version_date":"2020-06-01 20:03:26.000 +0800","version_description":"The latest version contains bug fixes and general performance and stability improvements.\nAlso including:\nSet it and forget it auto-renew subscriptions!\n\nAdditionally, our trip planning companion app, MileOn, can now send trips to CoPilot\n\nHave questions? Find answers in our support center support.copilotgps.com"},{"version_id":"837741179","version_name":"10.19.0.1291","version_date":"2020-09-15 16:53:33.000 +0800","version_description":"The latest version contains bug fixes and enhancements to help you to navigate safely and efficiently.\n\n- We've updated our Vehicle Routing Profiles for improved routing accuracy\n- You can now customize your route to avoid or favour certain types of roads\n- We've renamed Routing Type choices to Practical (formerly Quickest), Shortest, and Fastest (formerly ActiveRoutes)\n\nHave questions? Find answers in our support center support.copilotgps.com"},{"version_id":"838323301","version_name":"10.19.0.1355","version_date":"2020-10-26 21:16:56.000 +0800","version_description":"This update brings you:\n\n- Enlarged Speed Limit icon for better visibility. \n- Enhanced RV profile settings to allow a set speed cap for more accurate ETAs. \n- Improvements to the subscription renewal process"},{"version_id":"845210348","version_name":"10.19.0.1861","version_date":"2021-11-10 21:06:37.000 +0800","version_description":"With this update....\n\n\n- The latest version contains bug fixes and enhancements to help you to navigate safely and efficiently.\n- We've added a new safety warning to our traffic service. (For Truck licenses only)\n- The maximum RV height has been raised to14ft.\n\nHave questions? Find answers in our support center support.copilotgps.com"},{"version_id":"847705891","version_name":"10.19.3.48","version_date":"2022-04-04 11:40:53.000 +0800","version_description":"With this update:\n\nThe latest version contains bug fixes and translation enhancements to help you to navigate safely and efficiently on the road.\n\nHave questions? Find answers in our support center support.copilotgps.com"},{"version_id":"99122647","version_name":"9.5.0.408","version_date":"2013-11-22 02:25:51.000 +0800","version_description":"We’ve restyled and revamped CoPilot’s interface with an all-new cleaner, fresher (I’m sure by now you’ve heard the term flat design) look to complement iOS 7. \n\nHere’s the full run down of what’s new:\n•Fully compatible with iOS 7\n•A completely restyled user interface and refreshed app icon\n•Motion Lock safety feature to disable map interaction at a specified speed for improved hands free driving \n•Two striking new map styles you just can’t miss\n•Improved POI search to find places near your destination more easily\n•Exit numbers for highways are now displayed on the map giving you clearer highway guidance\n•And finally, a few bug fixes and improvements based on your feedback (thanks for that, keep it coming!)\n\nHave a question about your CoPilot?  We’re here to help.  Just tap MyCoPilot > Help & Feedback \n•Our Community Support Forum is now mobile friendly, faster and more informative \n•Our User Guide with improved search makes exploring CoPilot’s features a breeze\n\nLike our new update and look?  Let us know with a review or rating on the App Store.  \n\nUntil next time…safe travels!"}]