[{"version_id":"100562640","version_name":"3.0","version_date":"2013-11-12 06:34:17.000 +0800","version_description":"- Design Update<br>New icon design.<br><br>- Drag and Drop Re-arrangement Compatible<br>Albums and photos able to be re-arranged by dragging and dropping. Previous re-arrangement method still works.<br><br>- Tag Functionality<br>Photos can now be tagged. Search photos by tag from the top page search button.<br><br>- Improved Import Selection<br>Toggle all/unsaved making it easier to see which items are yet to be imported.<br><br>- Album Cover<br>Set album covers for albumset to any image.<br><br>- Copy Photos<br>Copy selected photos and videos to another album.<br><br>- New Menu Item<br>A visually more easy to understand icon-style menu.<br><br>Other various bug fixes and improvements"},{"version_id":"360552656","version_name":"3.1","version_date":"2014-02-07 06:42:38.000 +0800","version_description":"- Design Update\n<br>New icon design, again! This time we created the completely new flat design.\n<br>\n<br>- Shuffled SlideShow support\n<br>You can now play slideshow in random order.\n<br>\n<br>- Open in support\n<br>\"Open in\" command was supported for sharing menu.\n<br>\n<br>- Recovery function support\n<br>You can recover all your albums and photos/videos by this function from setting. This is the rescue function for in case of emergency.\n<br>\n<br>- View option was changed\n<br>The default of this setting was changed to \"Fit to screen\" from \"Fill screen\"."},{"version_id":"455912815","version_name":"3.2","version_date":"2014-03-13 06:38:53.000 +0800","version_description":"[Sorting function]<br>- Current order setting is now shown at photo order view.<br>- The issue of photo order view was fixed.<br><br>[Bug fix]<br>- MP4 format was added to iTunes import target.<br>- The issue of importing PNG8 was fixed.<br>- The issue of album cover setting was fixed."},{"version_id":"811151642","version_name":"3.4","version_date":"2014-12-27 17:00:19.000 +0800","version_description":"Thank you for your patience!<br>- iPhone6, 6 Plus resolution is now supported.<br><br>An add to home screen function<br>- We added a function to place shortcuts to each album on the iPhone home screen (this can be done from the album information screen).<br><br>Improvements to photo selection<br>- It was difficult to tell the difference between photos when importing, so we made it possible to change the size of the photo displayed on the photo selection screen (there is a switch button on the top right of the screen, so try pressing it).<br><br>Passcode improvements<br>- We changed the passcode to flat design.<br>- We fixed the flickering during start up bug.<br><br>Size change in the photo list view<br>- The number of columns in the photo list view can now be changed.<br>- The size of photos and thumbnails can now be changed from the settings screen.<br>- The size of photos and thumbnails can now be checked from the photo details screen.<br><br>Improvements to the photo editor<br>- We updated the Aviary editor to the latest version.<br>- We added a restore feature so that a photo can be returned to its original state after being edited and overwritten.<br><br>Additions to the items in settings<br>- The character size for slideshow captions can now be made larger.<br>- We changed the configuration of the settings screen."},{"version_id":"813707475","version_name":"3.5","version_date":"2015-10-18 20:31:15.000 +0800","version_description":"■ iOS9 support<br>The issue of sort by dragging &amp; dropping is fixed.<br><br>■ Touch ID support<br>Touch ID is supported for passcode lock.<br><br>■ Improvement of sorting function<br>Sort by filename is supported. You can sort by date photo taken and filename from sort screen of each album.<br><br>■ Improvement of iTunes Import<br>You can now import folders from iTunes file sharing. (Folder layers will not be supported.)<br><br>■ Improvement of Photo info screen<br>Revision added to show metadata not previously displayed; IPTC, Exif, GPS, TIFF, JFIF info now displayed.<br><br>■ Map display bug fixed<br>Bug fixed where GPS coordinates of southern latitude or western longitude (displayed as negative coordinate values) would not display correctly on map."},{"version_id":"813901272","version_name":"3.5","version_date":"2015-10-18 20:31:15.000 +0800","version_description":"■ iOS9 support<br>The issue of sort by dragging &amp; dropping is fixed.<br><br>■ Touch ID support<br>Touch ID is supported for passcode lock.<br><br>■ Improvement of sorting function<br>Sort by filename is supported. You can sort by date photo taken and filename from sort screen of each album.<br><br>■ Improvement of iTunes Import<br>You can now import folders from iTunes file sharing. (Folder layers will not be supported.)<br><br>■ Improvement of Photo info screen<br>Revision added to show metadata not previously displayed; IPTC, Exif, GPS, TIFF, JFIF info now displayed.<br><br>■ Map display bug fixed<br>Bug fixed where GPS coordinates of southern latitude or western longitude (displayed as negative coordinate values) would not display correctly on map."},{"version_id":"816599512","version_name":"4.0","version_date":"2016-11-22 05:46:11.000 +0800","version_description":"It's been a long wait, but we have implemented iOS10 support and other major import improvements.<br><br># Photo Import Feature Improvement<br><br>- The iCloud photo library is now supported, so photos/videos in iCloud can automatically be downloaded and imported.<br><br>- LivePhoto, slow-mo videos, and time lapse video capturing is supported. (LivePhotos will be treated like videos.) Also, photos edited in the photo app will be imported with those changes in place.<br><br>- The defect of being unable to import screenshots in iOS10 has been fixed. Also, we have executed basic rewriting for import processing, and addressed the problem of imports not closing normally.<br><br>-We have increased the photo resolution in the photo selection screen so that you can select distinct images.<br><br>* With iCloud support, the SAVED flag will be reset in this version. Also, please recognize that data awaiting import in the previous version will be reset.<br><br><br># Tag Batch Editing Feature<br><br>- We have added the tag features that countless people requested. In the tagging screen, you can delete or change the names of registered tags. Please try it out.<br><br><br># Other Improvements<br><br>- You can now smoothly transfer to the previous or following month in the calendar screen. Also, up to now, the first photo taken on a given day was displayed with a fixed thumbnail image, but now a random photo taken that day will be displayed.<br><br>- Some design themes have been added and deleted. Also, adjustments have been made so that all themes will be displayed on all screens up to the position of the status bar.<br><br>- Uploading to Dropbox has been improved. The restriction of being unable to store more than 1,000 files in one folder has been removed.<br><br>- The Adobe image editor has been updated.<br>- Other UI changes are being made and some features are being removed.<br><br><br># Notice<br><br>Along with the change in company management, it is possible your purchase status will be temporarily reset. In that case, if you advance to the purchase screen in the app and select \"restore,\" it will return to the purchased version, so please give this a try. (Even if you temporarily repurchase it, you will not be charged again.)"},{"version_id":"819919110","version_name":"4.0.1","version_date":"2016-11-30 05:38:25.000 +0800","version_description":"- Restore SAVED flag<br>Maintenance function for restoring the SAVED flag before ver4.0 has been added. If you execute \"Restore SAVED flag\" in the setting of the app and update the database, it will be restored as much as possible.<br><br>- Fixed the issue of date<br>Fixed a bug that the date will be 1970/01/01 when importing a photo without Exif. Photos already taken in are corrected if you can execute \"Batch correct Date/GPS\" in the settings of the app.<br><br>- Album list format style<br>You can now use album list format style on iPhone again.<br><br>- Bug fixes<br>Fixed a bug that crashed when operating on the photo selection screen.<br>Fixed a bug that crashed when operating on the photo screen after searching the memo."},{"version_id":"823404726","version_name":"4.1","version_date":"2017-09-19 21:48:33.000 +0800","version_description":"■ Compatible with iOS11<br>We verified the operation on iOS11 and supported the new image format (HEIC) and iPhone X layout.<br><br>■ Supports GIF animation<br>GIF animation is now automatically played on the picture detail screen.<br><br>■ Suitable for large photo sizes<br>You can now select the display size of 4032px from the setting. If the photo is smaller than this size, original photos will be displayed, which will also save application disk capacity.<br><br>■ Add LivePhotos settings<br>You can now change the importing method of LivePhotos from setting. (You can choose from movies or photos)<br><br>■ Improvement of photo information screen<br>You can now see the map display when the geo tag is attached to the movie and the detailed information of the movie.<br><br>■ Other<br>- Searchable by file name now becomes possible.<br>- UI for Dropbox backup was improved.<br>- iTunes import was improved.<br>- Fixed bug related to video playback.<br>- Other minor UI and adjustment and bug fixed."},{"version_id":"824143563","version_name":"4.2","version_date":"2017-10-26 01:46:28.000 +0800","version_description":"■ Improve sorting of albums and album sets<br>The album list on the home screen and the album list in the album set can now be sorted in ascending / descending order of names.<br><br>■ Add a draggable scrollbar<br>The scrollbar on the photo list screen can now be dragged. When there are a lot of photos, scroll operation can be performed at high speed. <br><br>■ Supports iOS 11 dark mode<br>We responded so that the photos will not be inverted even in dark mode.<br><br>■ Fixed a problem<br>- Fixed bug related to photo sorting with drag &amp; drop<br>- Fixed a problem that the application drops when the shooting button of the camera is pressed continuously<br>- Fixed a problem that fingerprint authentication ceased due to overlapping review request and fingerprint authentication<br>- Fixed a bug that could not open specified album from shortcut of album in album set<br>- Fixed a bug that the selected check mark would be hidden when switching display on the picture selection screen<br>- Fixed a bug that backup did not work if Dropbox's automatic backup was on and the save destination folder was not set.<br>- Fixed bug where data restoration was not performed correctly when there were multiple albums of the same name"},{"version_id":"825235809","version_name":"4.3","version_date":"2017-12-29 03:20:32.000 +0800","version_description":"■ Improvement of data import<br>Fixed a bug that failed importing from some videos and images. (including from iCloud Photo Library)<br><br>■ Improvement of draggable scroll bar<br>We adjusted the behavior so as not to operate unintentionally at the time of browsing.<br><br>■ Other<br>Fine adjustment of the editing related screen layout."},{"version_id":"825570351","version_name":"4.3.1","version_date":"2018-01-09 14:51:28.000 +0800","version_description":"Fixed a problem that switching between tag search and file name search on the iPad can not be selected."},{"version_id":"826780914","version_name":"5.0","version_date":"2018-05-07 15:08:39.000 +0800","version_description":"■ Automatic deletion after import<br>After importing photos / videos, you can now delete the corresponding photos from the camera roll. You can switch ON / OFF from the settings in the application.<br><br>■ Improve tag<br>You can now delete multiple tags by selecting multiple photos. In addition, you can now use NOT search for tag search.<br><br>■ Searching for albums<br>You can search albums and album sets incrementally from the search bar at the top of the home screen.<br><br>■ New themes<br>Six new themes were added. Also, instead of the theme, you can now select photos from the camera roll and designate them as wallpaper.<br><br>■ Improvement of Camera UI<br>- Improved camera UI.<br>- Added grid line display function.<br><br>■ Other<br>- Album and album set creation UI has been improved.<br>- Improved to inherit the original creation date when importing videos.<br>- Showing current location on album map view.<br>- The toolbar icon of each screen has been changed.<br>- Other minor bug fix."},{"version_id":"827487313","version_name":"5.1.0","version_date":"2018-06-15 14:20:51.000 +0800","version_description":"■ Improvement<br>You can now return to the previous screen by swiping downwards on the photo screen.<br><br>■ Support for file sharing<br>You can now receive photos / videos from other apps. In the format that can be received, MyPics is displayed in the share list. The received file will be saved in \"Shared File\" album.<br><br>■ Bug Fix<br>- Fixed a problem that can not logout from Twitter. (iOS11)<br>- Fixed a problem that crashes when opening the map screen."},{"version_id":"828853430","version_name":"5.2","version_date":"2018-10-19 02:12:09.000 +0800","version_description":"- Optimized for iOS12.<br>- iPhone XR, XS MAX layout supported.<br>- Improved UI of the move / copy destination selection screen.<br>- Added 30, 45 and 60 seconds to the the slideshow setting.<br>- Fixed the bug of when sharing photos / videos from other applications, the sharing source application freezes."},{"version_id":"833087116","version_name":"5.3","version_date":"2019-10-14 17:32:20.000 +0800","version_description":"- Optimized for iOS13.<br>- Fixed an import bug that occurred on iOS13.<br>- Fixed a bug that freezes on iPadOS13."},{"version_id":"835217426","version_name":"5.4","version_date":"2020-04-02 14:33:21.000 +0800","version_description":"- You can now swipe to select a photo.<br>- The design of the list / thumbnail list has been changed.<br>- Moved the behavior of the photo screen to the standard photo app.<br><br>■ Theme<br>- Added light and dark themes.<br>- Changed the default theme to light.<br>- Removed the theme advanced option.<br><br>■ Camera changes<br>- Fixed bugs of camera and Fx Studio.<br>- Changed camera and Fx Studio filters.<br><br>■ Changes related to iPad<br>- Added support for iPad Split View.<br>- Added support for list format in album list.<br>- The iPad camera function has been discontinued.<br><br>■ Regarding the problem that the resolution is low<br>We have received reports that the resolution of the imported photos has been reduced since iOS13, but we investigated and found that when iCloud Photo Library is enabled, the original data of My Photo Stream could not be obtained.<br><br>The influence range is only import from My Photo Stream, but it was uncorrectable behavior on the application side, so we will correct it if we can find a valid method in the future."},{"version_id":"835405490","version_name":"5.4.1","version_date":"2020-04-04 14:13:52.000 +0800","version_description":"Thank you for your feedback on the layout changes I made in the last update. Every time I thought it was better at the time of development, but I was sorry because there were various points of lack of recognition. The following adjustments have been made in this update, so I think it's pretty close to what it was before.<br><br>■ Thumbnail related<br>-The aspect ratio of iPad thumbnails has been returned to 1: 1.<br>-The aspect ratio of iPhone / iPad list format thumbnails has been returned to 1: 1.<br>-Adjusted thumbnail size of iPhone / iPad list format.<br>-Adjusted the number of thumbnails in the iPad album list.<br><br>■ Option<br>-The theme setting option has been restored. However, the default light theme feels that the frame does not fit the design, so it is hidden by default.<br><br>In addition, I would like to improve various usability in the future, so I would appreciate your opinion in the review. Since I'm developing and operating alone, I can not reply all of them individually, but I do use it as a reference for development."},{"version_id":"835467637","version_name":"5.4.2","version_date":"2020-04-09 19:03:56.000 +0800","version_description":"- The iPad Camera function has been reverted and updated. <br>- Photo swipe selection was too responsive, so we adjusted it so that it did not respond too much.<br>- Adjusted the automatic scrolling speed when dragging off the screen when sorting photos."},{"version_id":"835693171","version_name":"5.5","version_date":"2020-04-26 22:25:52.000 +0800","version_description":"Layout related functions have been added / improved.<br>- Supported list format for photo list.<br>- You can now change the thumbnail size of the album list.<br>- Additional thumbnail size for iPad photo list.<br><br>The thumbnail size of the album / photo list can be changed between 3 levels for iPhone and 5 levels for iPad. You can change it from the settings in the app."},{"version_id":"838358772","version_name":"5.6","version_date":"2020-10-27 18:22:09.000 +0800","version_description":"Compatible with iOS14.<br><br>[Improvements]<br>- You can now search for albums on the screen for moving / copying albums and photos.<br>- Images smaller than the screen size are now displayed on the photo screen without being enlarged. (Videos and gif images are not applicable)<br>- After sharing from the photo app etc., the app is not opened automatically.<br>- You can now freely set the slide show interval from 1 to 60 seconds.<br>- The detailed theme settings have been moved into the album list settings.<br>- You can now specify centering of the album name and one-line display in the detailed theme settings.<br>- Added cache deletion to settings.<br><br>[End of function]<br>The following functions have been terminated because it is difficult to operate in the latest environment and extremely few people are using it.<br><br>- Creating Shortcut<br>- AirPlay"},{"version_id":"838470444","version_name":"5.6.1","version_date":"2020-11-01 22:03:54.000 +0800","version_description":"- Fixed the problem that characters could not be selected or copied in the text input field of notes.<br>- Fixed the problem that the slide show selection pop-up was displayed in the upper left on the iPad.<br>- Returned the small image to be enlarged and displayed as before.<br>- Added an option to display small images without enlarging them in the slideshow settings."},{"version_id":"839057568","version_name":"5.6.2","version_date":"2020-11-14 23:00:38.000 +0800","version_description":"- Fixed a bug that the image turned blue when importing.<br>- Added \"Show Original\" item to Settings &gt; Image Size."},{"version_id":"840045794","version_name":"6.0","version_date":"2021-01-15 13:25:56.000 +0800","version_description":"[Expert add-on]<br>We have started selling new Expert add-on. This can use the following expert-only functions in addition to the contents of the Pro (removing registration limit) add-on so far.<br><br>- Enables create album set inside album set.<br>- Enables album search function within album set.<br><br>For details, please see \"Settings &gt; Upgrade\" in the app.<br><br>[Backup to Dropbox]<br>We changed the backup timing to improve this feature. Dropbox backup will be automatically executed when app in foreground. Now, you can check backup status from \"Settings &gt;  Dropbox Backup.\"<br><br>[Other updates]<br>- The initial storage of free ver has been increased to 500.<br>- The maximum storage of free ver has been increased to 1500.<br>- The map screen is now like a standard photo app.<br>- It is now possible to set the default order of albums from the settings.<br>- PathBar has been added. You can switch ON / OFF from the settings.<br>- Other bug fixes and UI adjustments have been made."},{"version_id":"840072355","version_name":"6.0.1","version_date":"2021-01-18 16:31:14.000 +0800","version_description":"Fixed a bug that the Pro add-on purchased in the past is not reflected and returns to the free version."},{"version_id":"840410617","version_name":"6.1","version_date":"2021-02-15 00:28:47.000 +0800","version_description":"- You can now play videos directly on the photo viewing screen.<br>- You can now change the playback speed of the video.<br>- The video is now played automatically when the slide show is executed.<br>- Fixed other minor bugs."},{"version_id":"840569677","version_name":"6.2","version_date":"2021-02-23 19:30:46.000 +0800","version_description":"- You can now play videos repeatedly.<br>- When the video is paused, it will not be played automatically after the seek bar operation.<br>- Added a setting to revert to previous video playback interface. (Settings &gt; Slideshow &gt; Disable autoplay video)<br>- Fixed other minor bugs."},{"version_id":"842831765","version_name":"6.3","version_date":"2021-06-27 23:38:07.000 +0800","version_description":"- Improved Dropbox backup.<br>- Dropbox backup now uploads files larger than 150MB.<br>- Increased the number of sheets that can be shared from other apps at once."}]