[{"version_id":"814669553","version_name":"6.1.1","version_date":"","version_description":""},{"version_id":"816311942","version_name":"6.2.1","version_date":"","version_description":""},{"version_id":"816799499","version_name":"6.3.1","version_date":"","version_description":""},{"version_id":"817339840","version_name":"6.6.1","version_date":"","version_description":""},{"version_id":"817728839","version_name":"6.7.1","version_date":"","version_description":""},{"version_id":"818494595","version_name":"6.9.1","version_date":"","version_description":""},{"version_id":"819325889","version_name":"7.0.0.1","version_date":"","version_description":""},{"version_id":"819344280","version_name":"7.1.0.1","version_date":"","version_description":""},{"version_id":"820254387","version_name":"7.2.1","version_date":"","version_description":""},{"version_id":"820655143","version_name":"7.3.0.1","version_date":"","version_description":""},{"version_id":"820839939","version_name":"7.4.1","version_date":"","version_description":""},{"version_id":"820996405","version_name":"7.5.1","version_date":"","version_description":""},{"version_id":"821095270","version_name":"7.6.1","version_date":"2017-03-04 23:11:02.000 +0800","version_description":"HOME BUYERS<br><br>• ON - Toronto's Municipal Land Transfer Tax (MLTT) has increased effective March 1, 2017 and now matches with our Ontario Land transfer tax. Fortunately, the first time home buyer rebate has also increased up to a maximum of $4.475. Hurray?<br><br>• BC - More good news effective February 21, 2017: If you live in British Columbia and are a first-time home buyers, you'd be pleased to hear that you are now eligible to receive a full land transfer tax refund on homes purchased for $500,000 or less. On homes purchased between $500,000 - $525,000, you will be eligible for a partial refund.<br><br>• Apply - Not sure what rate you qualify for? Not a problem. We recently added an \"Apply\" button in the Home Screen. <br><br>When you complete the quick online application, we can connect you with a licensed expert in your area. The licensed mortgage professional sometimes has access to 40+ lenders (including your own bank) and can find you the best rate that actually applies to your situation. <br><br>Whether, you are looking for a pre-approval, refinance or even renewing your mortgage, it's always a good idea to check out your options. <br><br>It's fast, easy and you'll receive advice from a real professional at absolutely NO cost to you. Awesome huh?<br><br><br>EXPERTS (CMA PRO)<br><br>• We fixed the bug that didn't let you save changes to your office address<br><br>• Mortgage Professionals, you now get your \"Apply\" button right on the home screen. This allows your clients to apply with you and / or apply from one of your partner's apps.<br><br>• Added Group Code feature for Realtors PRO subscriptions. If you are a lucky Realtor who is sponsored by a mortgage partner or has received a group code from your brokerage, you can now redeem it.<br><br>As always, send us feedback via our online chat."},{"version_id":"821327182","version_name":"7.7.0.1","version_date":"","version_description":""},{"version_id":"821390489","version_name":"7.8.0.1","version_date":"","version_description":""},{"version_id":"821773351","version_name":"7.9.1","version_date":"2017-05-01 20:10:26.000 +0800","version_description":"This update was mainly dedicated to our PRO users.<br><br>You wouldn't believe it, but we have added some magic for you. An entire Partner Management System (PMS) has been introduced to let you search and add your trusted partners to your app and offer your clients a unique experience. <br><br>Even better, when you invite a partner, they'll receive a special treat when they connect with you. Check inside your admin console for more details. ;) <br><br>Other changes for PRO includes.<br><br>- New Branded Application Form<br>- New Partner Search and Invitation.<br>- Multi Partner selection pre-application.<br>- Smoother PRO setup without logo requirement<br>- New Rate Display feature for Realtors<br>- Restrictions on the contact email has been lifted<br><br>Other notable changes:<br><br>- Extra payment cap has been increased<br>- Accessibility improvements<br>- Image download performance improvements<br> <br>Lots of ground work for new features in the next couple updates"},{"version_id":"826024603","version_name":"8.6.1","version_date":"","version_description":""},{"version_id":"828025433","version_name":"9.5.0.1","version_date":"","version_description":""},{"version_id":"828139763","version_name":"9.6.1","version_date":"","version_description":""},{"version_id":"828375493","version_name":"9.7.1","version_date":"","version_description":""},{"version_id":"828686506","version_name":"9.8.1","version_date":"","version_description":""},{"version_id":"828989022","version_name":"9.9.1","version_date":"","version_description":""},{"version_id":"829612515","version_name":"9.10.0.1","version_date":"","version_description":""},{"version_id":"830336936","version_name":"10.0.0","version_date":"2019-06-23 03:25:52.000 +0800","version_description":"Get Pre-Qualified right on your phone<br><br>Answer a few simple questions and our world-class algorithm crunches the numbers and calculates your maximum home price.  You'll also receive a detailed report with all the bells and whistles. <br><br>Is it accurate?<br><br>It's Super accurate. We've consulted with some of the top mortgage experts in Canada and interviewed top lenders to understand the inner works of their underwriting techniques. Based on our findings we've developed a world-class algorithm with advanced techniques to account for complex mortgage rules, rental scenarios, complete B20 guidelines (stress test) and location-specific data to estimate heat, condo fees and property taxes.<br><br>You'll be impressed once you see what we believe is the most accurate pre-qualification in the world.<br><br>Other features in this version<br><br>•  New app on-boarding design to set you up for success<br>•  New login process using your email. We said bye bye to social login<br>•  New rate details when you click on any of the mortgage rates<br>•  Updates to Montreal's Taxe de Bienvenue<br>•  Ability to text message reports from any of the tools menus<br>•  Submit requests to speak to a professional is now much easier<br>•  You can inquire for any of the rates displayed on the app<br><br><br><br>This is by far the largest update of CMA since 2013 and we hope you'll love it !!<br><br>--<br>The CMA Team"},{"version_id":"831998304","version_name":"10.1.0","version_date":"2019-07-15 22:13:18.000 +0800","version_description":"• You can now share the mortgage rate you found with friends and family from the rate's detail screen<br>• You can see the mortgage insurance premiums in your pre-qualification report under the mortgage section<br>• When making a request to speak to an expert after hours, you get to pick a preferred callback time<br>• When you scroll to the slider's maximum value, the app will present you with the keyboard for quicker entry<br>• Fixed an issue that caused the slider in the payment screen to lose focus after picking a rate<br>• Fixed the tools header branding to be consistent across the entire app<br>• Fixed 136+ bugs that were reported as well as upgraded all internal libraries<br>• PRO - We fixed the UI in the admin console as it was blocking certain rows from viewing<br>• PRO - Added a forgot password and support chat button in the PRO login<br>• PRO - Internal enhancements including viewing the up to date Bank of Canada rate<br><br>Previously:<br><br>• Get Pre-Qualified right on your phone<br>• New app on-boarding design to set you up for success<br>• New login process using your email. We said bye bye to social login<br>• New rate details when you click on any of the mortgage rates<br>• Updates to Montreal's Taxe de Bienvenue<br>• Ability to text message reports from any of the tools menus<br>• Submit requests to speak to a professional is now much easier<br>• You can inquire for any of the rates displayed on the app<br><br>As always, you can send us feedback via our in-app support chat under the \"Extra\" tab.<br><br>--<br>The CMA Team"},{"version_id":"832217332","version_name":"10.2.4","version_date":"2019-08-06 04:20:31.000 +0800","version_description":"• Save Unlimited Scenarios<br>You can save an unlimited number of scenarios in the purchase calculator. You can also compare, duplicate and change their display order.<br><br>• Updates to Land Transfer Tax<br>Updated the land transfer tax settings to prevent conflicting conditions, like FTHB and foreign buyer tax.<br><br>• NOA Example in PREQ<br>Added an NOA example for self-employed users and how to look for their average 2-year income (Line 150) in the Pre-qualification wizard <br><br>• New Contact Sheet (PRO)<br>A beautiful new way for your clients to stay in touch with you.<br><br>FOR PRO ONLY<br><br>• Better Branded Reports<br>Reports got even better with a new header<br><br>• Branded Splash Screen<br>So you and your clients enjoy a beautiful display of your profile and branding everyone time they open your app.<br><br>OTHER TINY UPDATES<br><br>•  The amortization table has your brand colour<br>•  Default images when rates image not available.<br>•  Reset button when there are no results for rates<br>•  Compare tool has a new menu for choosing scenarios<br><br><br>As always, you can send us feedback via our in-app support chat under the \"Extra\" tab.<br><br>--<br>The CMA Team<br><br><br><br>IN CASE YOU MISSED IT<br>What we did in the last Version<br><br>• Get Pre-Qualified right on your phone<br>• Inquire about a rate<br>• New app onboarding<br>• New login process using your email<br>• New rate details when you tap on a rate<br>• Updated to Montreal's Taxe de Bienvenue<br>• SMS reports from any of the tools<br>• Share mortgage rates<br>• CMHC in the Pre-Qualification report<br>• Speak to an expert after-hours<br>• Keyboard popup at slider-max<br>• Tools header colours update<br>• Fixed the slider bug in loan<br>• Updated admin console UI<br>• Internal library updates"},{"version_id":"832504871","version_name":"10.3.3","version_date":"2019-09-05 18:41:43.000 +0800","version_description":"• Input Property Tax by %<br>Turn on advanced mode and start entering a percentage for your property tax. The app then automatically calculates your monthly and annual property tax amounts from the home price.<br><br>• New Rates filter reset<br>In case your filters don't produce a result, this reset button appears and helps you to revert back to the default filters.<br><br>• Improved overall speed and reliability with a number of updates. For instance, we fixed the rate filter bubbles that would show incorrectly in some cases. We also fixed the expert contact sheets UI, updated the menu icons to a higher resolution, improved the down payment and the property tax toolbars and many more tiny improvements that add up to a better experience.<br><br>As always, you can send us feedback via our in-app support chat under the \"Extra\" tab.<br><br>--<br>The CMA Team<br><br><br>IN CASE YOU MISSED IT<br>Here are some of the recent updates<br><br>• Get Pre-Qualified right on your phone<br>• Ability to inquire about a mortgage rate<br>• Save Unlimited Scenarios<br>• Create an account using your email<br>• New rate details when you tap on a rate<br>• Updated to Montreal's Taxe de Bienvenue<br>• SMS reports from any of the tools<br>• Fixed the slider bug in loan<br>• New Contact Sheet (PRO)<br>• Better Branded Reports (PRO)<br>• Branded Splash Screen (PRO)"},{"version_id":"833031504","version_name":"10.4.8","version_date":"","version_description":""},{"version_id":"833423156","version_name":"10.5.2","version_date":"","version_description":""},{"version_id":"833631839","version_name":"10.5.4","version_date":"2019-11-15 23:01:26.000 +0800","version_description":"HOTFIX!!!<br><br>This update resolves the crash you may have experienced when entering a location. <br>We deeply apologize for the inconvenience."},{"version_id":"834008284","version_name":"10.6.0","version_date":"2019-12-16 20:32:55.000 +0800","version_description":"Thank you for using CMA. <br><br>We want to take this opportunity to wish all our users an amazing holiday and all the best in the new year. 2020 will be magical because we have lots of new and exciting features on our road map.<br><br>Here is a new update<br><br>• Added the ability for PRO to switch between the classic or modern gradient colour scheme<br>• Set the default rate in the purchase calculator to be a \"fixed\" rate<br>• The default rates filter in the rate screen is now set to \"fixed\" rates<br>• The app will no longer appear to freeze during a logout event<br>• Other Code cleanup and minor optimizations<br><br>As always you can contact us from the in-app support chat under the \"Extra\" tab or email us contact@canadianmortgageapp.com<br><br>-<br>The CMA Team"},{"version_id":"835233186","version_name":"11.1.0","version_date":"2020-03-31 20:26:39.000 +0800","version_description":"Thank you for using CMA. This update includes:<br><br>• New 2020 Québec Taxe de Bienvenue (Land Transfer Tax) with algorithms for 30+ cities<br>• Fixed an issue with the amortization for certain scenarios with extra payments enabled<br>• Minor UI and performance enhancements<br><br>Previously:<br><br>• Brand New In-App Notification Inbox<br>• Updates to the Pre-Qualification Tool<br>• Property tax estimation support for 100+ cities<br>• Ge \"Pre-approved\" feature<br>• iCloud keychain passwords<br>• Many other UI enhancements<br><br>As always, you can send us feedback via our in-app support chat under the \"Extra\" tab.<br><br>--<br><br>The CMA Team"},{"version_id":"835658647","version_name":"11.2.1","version_date":"2020-04-29 14:58:21.000 +0800","version_description":"Thank you for using CMA. This update includes:<br><br>• Pre-Qualification On-Demand<br>PRO users can now generate personalized Pre-Q reports for their clients in less than 60 seconds. <br><br>• Advanced Payment Details<br>Control the relevant information you can see with each payment option. Switch between Basic, Term or Total view in the loan screen and only see details you care about.<br><br>• Extra Payment Enhancements<br>Increase payments by 10%/15%/20% and instantly view savings. Tap on the plus button \"+\" next to each payment frequency and simulate an increase in payment.<br><br>• New Mortgage Summary Report<br>Generate a beautiful mobile-friendly report &amp; PDF for a mortgage term. In the Purchase Calculator\" tap on the options menu \"top right\" and generate a beautiful summary report with PDF.<br><br>• New Payment Frequency Comparison Report<br>Generate a comparison table with all the payment amounts and extra payments and view differences in savings and time reductions for each payment frequency.<br><br>• New Land Transfer Tax Report with Details<br>You can now generate a report from the land transfer tax tool and include all the details as well. We support over 100 regions in Canada, each with its unique rules and algorithms.<br><br>• Dark Mode is finally here.<br>Do more with fewer distractions. Not only dark mode is known to reduce eye strain, blurred vision, dry eyes and maybe even headaches, but it also looks terrific. Another benefit is more power savings, thus keeping your battery going for longer.<br><br><br>Thank you for using CMA. This update includes:<br><br>Previously:<br><br>• New 2020 Québec Taxe de Bienvenue with algorithms for 30+ cities<br>• Brand New In-App Notification Inbox<br>• Property tax estimation support for 100+ cities<br>• Ge \"Pre-approved\" feature<br>• Many other UI enhancements<br><br>As always, you can send us feedback via our in-app support chat under the \"Extra\" tab.<br><br>--<br><br>The CMA Team"},{"version_id":"835995930","version_name":"11.3.1","version_date":"2020-06-03 14:34:21.000 +0800","version_description":"Thank you for using CMA<br><br>In this update:<br><br>• We support iPad landscape mode<br>• Added a new PREQ rule for secure LOC greater than $50K<br>• Introducing a unique rate input style in Stress Test and GDS/TDS<br>• Fixed an app onboarding when it fails to resolve a location<br>• Fixed a PDF Bug that caused blank report pages<br>• Fixed an issue in PREQ for users with a sizeable down payment<br>• Added tappable fields in PREQ notification to PRO<br>• Offering PRO users part of the CMA Referral Program a way to add notes<br>• Bringinging lots of tiny fixes and translation updates<br><br>Previously, we<br><br>• Introduced Pre-Qualification On-Demand<br>• Developed Advanced Payment Details<br>• Added Extra Payment Enhancements<br>• Added a new Mortgage Summary Report<br>• Added a new Payment Frequency Comparison Report<br>• Added a new Land Transfer Tax Report with Details<br>• Added support for Dark Mode<br>• Added new 2020 Québec Taxe de Bienvenue algorithms for 30+ cities<br>• Added property tax estimation support for 100+ cities<br>• Introduced a new Ge \"Pre-approved\" feature<br><br>As always, you can send us feedback via our in-app support chat under the \"Extra\" tab.<br><br>-<br>The CMA Team"},{"version_id":"836461995","version_name":"11.4.0","version_date":"2020-06-18 20:24:31.000 +0800","version_description":"In this update, we<br><br>• Tweaked our Pre-Qualification Algorithm<br>• Refined Mortgage Insurance Algorithm<br>• Updated Minimum Payment Rules for Quebec<br>• Fixed the iPad landscape mode<br>• Fixed location services in maps<br>• Increased input limits in Pre-Qualification Tool<br><br>Last but not least, we are finally launching our new Referral Program for Mortgage Brokers. If you are a PRO subscriber and interested to partner with us in our referral program. Contact us through the in-app support chat. Please keep in mind that this program is only available to PRO.<br><br><br>Previously, we<br><br>• Added a new PREQ rule for secure LOC greater than $50K<br>• Introduced a unique rate input style in Stress Test and GDS/TDS<br>• Fixed an app onboarding when it fails to resolve a location<br>• Fixed a PDF Bug that caused blank report pages<br>• Fixed an issue in PREQ for users with a sizeable down payment<br>• Added tappable fields in PREQ notification to PRO<br>• Offering PRO users part of the CMA Referral Program a way to add notes<br>• Bringinging lots of tiny fixes and translation updates<br>• Introduced Pre-Qualification On-Demand<br>• Developed Advanced Payment Details<br>• Added Extra Payment Enhancements<br>• Added a new Mortgage Summary Report<br>• Added a new Payment Frequency Comparison Report<br>• Added a new Land Transfer Tax Report with Details<br>• Added support for Dark Mode<br>• Added new 2020 Québec Taxe de Bienvenue algorithms for 30+ cities<br>• Added property tax estimation support for 100+ cities<br>• Introduced a new Ge \"Pre-approved\" feature<br><br>As always, you can send us feedback via our in-app support chat under the \"Extra\" tab.<br><br>-<br>The CMA Team"},{"version_id":"836483124","version_name":"11.5.1","version_date":"2020-07-28 20:02:21.000 +0800","version_description":"In this update, we are<br><br>• Introducing a new modern way to request to speak with one of our mortgage partners. Whether you need a pre-approval, looking to renew your mortgage or refinance your home, our new request form will save you time and provide your mortgage advisor with the right details they need to help you make one of the most significant investments of your life.<br><br>• Introducing Interest-only payments. Usually, mortgage payments have a principal and an interest component. However, some mortgage products allow interest-only payments (monthly compounded). This new feature is available to you when editing the **interest rate**; you can change the rate type to be interest-only <br><br>• Added some enhancements to the Land Transfer Tax summary report. It now shows all the rebate settings that you have enabled in the Land Transfer Tax tool. Details include but not limited to whether the First time home buyer rebate or the newly built home rebate were selected.<br><br>• PRO Brokers can put their rates display on autopilot and still maintain up to date without giving away the farm. The new feature is available only to PRO Broker subscribers and accessible from your admin console under Rate Settings.<br><br>• Lots of other UI and performance enhancements<br><br>As always, you can send us feedback via our in-app support chat under the \"Extra\" tab.<br><br>-<br>The CMA Team<br><br>--------------------------------<br>In case you missed it. Previously, we<br><br>• Tweaked our Pre-Qualification Algorithm<br>• Refined Mortgage Insurance Algorithm<br>• Updated Minimum Payment Rules for Quebec<br>• Introduced a unique rate input style in Stress Test and GDS/TDS<br>• Notes for PRO Brokers part of the CMA Referral Program<br>• Introduced Pre-Qualification On-Demand<br>• Developed Advanced Payment Details<br>• Added Extra Payment Enhancements<br>• New Summary Reports<br>• Dark Mode<br>• Added new 2020 Québec Taxe de Bienvenue algorithms for 30+ cities<br>• Property tax estimation support for 100+ cities"},{"version_id":"837530378","version_name":"11.6.3","version_date":"2020-08-27 21:20:43.000 +0800","version_description":"What's new:<br><br>• Compare with Extra Payments<br>It’s finally here. You can now use the compare tool to quickly compare mortgage scenarios with and without payment increase and annual pre-payment.<br><br>• Notification Search<br>Introducing a faster way to search for past notifications. Use the new search capability in the Notifications tab to quickly find what you are looking for.<br><br>• Dashboard Customization<br>You can now customize how your app’s dashboard looks and also get things done faster by ordering the tools you use the most. <br><br>• PREQ Refresh<br>Easily update your Pre-Qualification amount when the Bank of Canada’s qualifying rate changes. Use the mighty “Refresh” button and update your PREQ in an instant.<br><br>• Preferred Language<br>Add your preferred spoken language to your profile, so when you are ready to request a mortgage, our app can match you with one of our Mortgage Brokers in your area who also speaks your native tongue. How awesome is that?<br><br>• Support for Compounding​<br>Did you know that most fixed-rate mortgages have a semi-annual compounding, and most variable rates are compounded monthly? Of course, you did. However, this is not the case for all mortgages. Hence we are now supporting the ability to change compounding using the advanced rate settings.<br><br>• Show/hide Lenders (PRO)<br>PRO users can now customize which lender rates to display on their customer-facing app and which rates to hide. Accessible from the PRO Admin Console.<br><br>• New Contact Option (PRO)​<br>As a PRO user, when you receive a pre-qualification report, you can now tap on the phone number and choose to send a text response. No message templates yet, but we have it in our plan.<br><br>• Amortization UI Enhancements<br>We’ve taken a second look at our dynamic amortization table and made some UI adjustments. We organized the information better to get ready for some really awesome capability coming in the next few versions.<br><br>As always, you can send us feedback via our in-app support chat under the \"Extra\" tab.<br><br>-<br>The CMA Team<br><br><br><br>--------------------------------<br>In case you missed it. Here is what we did in the last version<br><br><br>• New way to connect with a Broker<br>• Introducing Interest-only payments.<br>• Land Transfer Tax summary report<br>• Rates on autopilot (PRO)<br>• Lots of other UI and performance enhancements"},{"version_id":"838507270","version_name":"11.7.5","version_date":"2020-11-09 13:07:51.000 +0800","version_description":"• Brand new scenarios management tool:<br><br>We improved the way you manage saved scenarios. It is now faster, more intuitive and way more accessible than before. Seamlessly work on your scenarios even when your phone is offline and synchronize across multiple devices when a connection is available. Access the Scenario Grid from any tool and tag them beautiful colours, rename, duplicate, load and edit the same scenario on multiple devices. Don't like the order they sit on your phone? Just drag them around to change their position.<br><br><br>• Enhancements to Pre-Qualification:<br><br>The Pre-Qualification tool was already smart but just got smarter. It automagically chooses the best case scenarios between insurable (20% down, less than $1M, 25 yr am) and uninsured (20% down, less than $1M, 30 yr am) along with an updated algorithm that reverse-engineers mortgage insurance right into your stress-tested loan amount.<br><br><br>• Enhancements to the Comparison tool:<br><br>Updated the comparison report with more details. The new expandable design lets you remove details when you don't need them. Compare tool also looks better in Dark mode.<br><br><br>• Enhancements to the Purchase Calculator:<br><br>New Condo Fee and Heat fields to get a better estimate of your total monthly cost. Improved layout on phones with large text sizes. Updated the Automatic Minimum Down Payment menu and can now gracefully handle all input types in every field on the app.<br><br><br>• Enhancements to Stress Test Tool:<br><br>Improved GDS/TDS and Rental Income Algorithm. We added more accuracy with decimal points in property taxes so you can get exact amounts back from the pre-qualification tool. Some major lenders support it, and now you can also exclude home expenses from GDS/TDS calculations. From the menu, you can change Loan Type and view the Custom Rental Income offset.<br><br><br>• Enhancements to Loan and Extra Payment:<br><br>The Advanced Rate Settings now shows the annual effective rate for each compounding period so you can compare apples with apples. We support 2 additional compounding periods. The app automagically updates compounding when toggling between fixed and variable rates. The extra payment now accepts decimal numbers to achieve more accurate amounts for 5%/10%/20% or 100% increased payments.<br><br><br>• Last but not least, iOS 14 Improvements and other housekeeping items<br><br>Fixed a permission issue when uploading profile photos from your photo library and iCloud. Support for the new iOS 14 system menu. We've added acknowledgements to fellow developers that can be viewed in the settings app<br><br><br><br>As always, you can send us feedback via our in-app support chat under the \"Extra\" tab.<br><br>• The CMA Team •"},{"version_id":"839232523","version_name":"11.8.0","version_date":"2020-11-17 17:45:06.000 +0800","version_description":"Minor bug fixes to support the last version.<br>See details by tapping on \"Version History\""},{"version_id":"839489492","version_name":"11.8.1","version_date":"2020-12-04 08:54:07.000 +0800","version_description":"This version:<br><br>• Minor refinements to the Pre-Qual algorithm for insured mortgages<br>• You can enter decimal points for Property taxes in the Purchase Calculator<br>• Fixes Monthly Total Cost calculations when entering heat or condo fee values<br><br>As always, you can send us feedback via our in-app support chat under the \"Extra\" tab.<br><br><br>• The CMA Team •"},{"version_id":"839713453","version_name":"12.0.0","version_date":"2021-03-26 15:52:51.000 +0800","version_description":"Refinance Analyzer is finally here.&nbsp;<br><br>This new premium tool will enable savvy industry professionals to assess&nbsp;their client's savings, cash flow, break-even point and generate a professional and sharable report with beautiful graphs and side-by-side comparisons.<br><br>If that wasn't enough, we have gone ahead and included one of the most incredible and easy-to-use debt consolidation tools in the industry. Advisors can also simulate amortization extensions, exercise \"keep same payment\" options or add custom capped roll-in amounts for more&nbsp;accuracy.&nbsp;<br><br>Refinance Analyzer is currently only available to professionals via CMA PRO, but we are working on a consumer version as we type up this What's new text."},{"version_id":"842476817","version_name":"12.1.0","version_date":"2021-06-03 18:33:24.000 +0800","version_description":"New Refinance Analyzer for existing homeowners<br><br>• Quickly understand whether it makes sense to break your existing mortgage for a lower rate and if your pre-payment penalty can be recovered with the savings of a  lower rate.<br>• Simulate Debt Consolidation and see how much interest you save and how much lower your payments will be if you were to pay off all your debt and combine the balance into a new mortgage<br>• When ready, you can start your refinance application on your phone. To speed up the data entry, you can attach an existing refinance scenario to your application.<br><br>New Dashboard Design<br><br>• The new dashboard design comes with a beautiful edit functionality so you can hide/show and prioritize tools you use most often<br>• New Consumers will now get a personalized Dashboard configuration depending on their goals, selected in the App Onboarding<br>• Your Dashboard Configuration will travel with you! Your dashboard configuration is now associated with your profile, so when you log in on a new device, you should see a familiar tool layout.<br><br>Enhancement to the Refinance Analyzer PRO<br>• Introducing the Anticipated Future Rate Analysis to offer professionals the ability to project savings beyond the end of the current term. <br>• Save option in the menu so that you can push changes on-demand when working with a client on a shared live report.<br>• Refinance Report is now also available in French<br>• Every report has a QR Code at the end so users can download the agent's app<br>• Interest Only New Mortgage when moving a current mortgage to a HELOC<br>• Optimized the Refinance algorithm to be more accurate in some special cases when penalty and fees are rolled in<br>• New Graphs in the Refinance Analysis to show interest and payment savings<br>• Lender input in the express setup<br><br>Enhancements to the Purchase Calculator<br><br>• Now supports the amortization and the rate input right from the first screen.<br>• Quick links to view the amortization schedule and <br>• Ability to add extra payment right from the main screen<br>• Added the ability to add one-time prepayment in the Extra payment feature<br>• The Amortization Schedule now shows the end of term summary when you first view it<br><br>Other Features, Fixes and Enhancements<br>• PRO Brokers on the referral program can import the refi deal's scenarios into their own scenario list after they accept the deal.<br>• Amortization fields to accept years and months for more accuracy<br>• The Compare Tool received some minor visual tweaks<br>• CMA colours have slightly changed<br>• CMA PRO app install pages have a new modern Phone Template and also added text for branding<br>• Fixed the navigation bar item so that it doesn't fade out after presenting the share sheet"},{"version_id":"842716698","version_name":"12.1.2","version_date":"2021-06-19 14:22:27.000 +0800","version_description":"Nothing major. Some final touches to the new Refinance Analyzer, including optimizations to make it a silky smooth experience."},{"version_id":"843117534","version_name":"12.2.3","version_date":"2021-07-18 01:03:26.000 +0800","version_description":"• Introducing the \"Simple\" Mortgage Calculator<br>We took all our experience and designed what we believe is the simplest mortgage calculator yet. Fortunately, Simple doesn't mean Basic. This new awesome tool and its stunning report are designed with some incredible features in mind. For instance, Power users can now reverse calculate any mortgage variable and instantly see its results via smart sliders.<br><br>• New \"Reports Notification\"<br>Mortgage Professionals can now receive push notifications and alerts on any newly generated reports, and their clients can download their app via an embedded QR code.<br><br>• New \"Anticipated Future Rate Analysis\"<br>You can now estimate the savings that are beyond the end of the current term. Using a slider, you can also find the lowest renewal rate needed or other bounds<br><br>Other Enhancement in this update<br><br>• A freshly re-designed Dashboard<br>• \"Interest-Only\" New Mortgages in the Refinance Analyzers<br>• New Graphs in the Refinance Analysis<br>• Updates to the Refinance Report in French<br>• New Amortization input that takes in years and months<br>• UI improvements, bug fixes and lots of optimizations to make the app silky smooth<br><br>As always, you can send us feedback via our in-app support chat under the \"Extra\" tab.<br><br><br>-<br><br>The CMA Team"},{"version_id":"843248467","version_name":"12.2.5","version_date":"2021-07-24 15:46:23.000 +0800","version_description":"We've freed up a few bugs from our code and returned them safely to mother nature."},{"version_id":"843752624","version_name":"12.3.2","version_date":"2021-08-26 15:01:35.000 +0800","version_description":"Tools Updates<br>----------------------------<br>•  Enhanced Rate Input Field to include a Rate Picker, Rate Type, Term, Compounding and a custom keyboard toolbar<br>•  Resolved an issue with picking rate or accessing compare tool from the Purchase Calculator quick view<br>•  Protecting amortization values to not become lower than term<br>•  Fixed an issue in compare tool when adding one-time pre-payments to the left scenario<br>•  Improved synchronization on iOS when using multiple devices<br>•  Updates to the Report in French in Simple Mtg<br>•  Enhanced the sliders when reaching maximum in Simple Mtg<br>•  Supporting no interest calculations in Simple Mtg<br>•  Resolved an issue with the legend when switching between payment/term/total in Simple Mtg<br>•  New Edit Button in PREQ<br>•  Relocated \"Start Over\" and \"Generate Report\" in PREQ<br>•  Added a new menu button in the navigation bar in PREQ<br>•  Updated the Image preview of the sample PREQ cert (A)<br>•  Updated NOA Sample Image in PREQ to show new Line 15000 in PREQ<br>•  Improved PREQ to capture the BOC value used<br>•  Resolved an issue with the Apply button (A)<br><br><br>PRO Enhancements<br>----------------------------<br>•  Updated Date Formats in Contact Export to allow standard date sorting<br>•  Introducing a set of new colour options<br>•  French logo update<br>•  Fixed Splash screen on some apps not showing the company's default colours<br>•  Updated the Image preview feature on Expert profile picture (A)<br><br><br>Fixes and UI Enhancements<br>----------------------------<br>•  Updated the Rate Screen UI to better support larger text sizes<br>•  Added a new label to indicate one-time prepayment in the Loan screen (A)<br>•  Pre-filling password when logging in with auto-fill<br>•  UI fix when working with the amortization row, it now highlights it as you would expect<br>•  Resolved an issue with generating a report directly from the scenario grid<br>•  Gradient colour fix in the Lead notification Screen<br>•  Fixed PDF preview when viewing sample reports"}]