[{"version_id":"14181640","version_name":"2.0","version_date":"2013-02-24 19:42:08.000 +0800","version_description":"We have rewritten half of the app's code to bring you even more features whilst increasing the app's by making it 3x as fast as before. We've also added completely new set of various graphical components while updating old elements. Furthermore we've added a bunch of new innovations by integrating great new services we think you'll love!<br><br>General Overview<br>- Major redesign<br>- Half of the app has been completely rewritten from the ground up<br>- HUD Progress integration<br>- Intelligent saving added so you never have to loose another file<br><br>Home &amp; Selection<br>- Added search functionality to the file list table view<br>- New graphical components added to the file list table view<br><br>Editing, Executing &amp; Previewing<br>- New graphical components<br>- Previewing now includes a debugging console<br>- Improved speeds of both HTML5 and JavaScript<br>- Sleep Enabler allows you to modify your work space by customizing font color and background<br><br>Happy coding from the RevBlaze team!"},{"version_id":"726972685","version_name":"5.0","version_date":"2016-05-23 23:36:33.000 +0800","version_description":"Introducing Code Master 5 Pro, your premium coding solution for a professional, on the go experience.<br><br>New Additions &amp; Features<br>• Updated to iOS 9<br>• Template Builder<br>• Added 60+ Templates<br>• iPhone 6 &amp; 6 Plus Support<br>• iPad Pro Support<br>• Major Graphical Overhaul<br>• Live Preview Editing<br>• Syntax Highlighting<br>• Row Numbering<br>• Create Folders &amp; Files<br><br>Stability &amp; Bug Updates<br>• Fixed Major Crash Issues"},{"version_id":"820306553","version_name":"5.3 – The Editor UpdateWelcome to Code Master Pro 5.3. In this update","version_date":"","version_description":""},{"version_id":"820306553","version_name":"5.1","version_date":"2017-01-03 19:15:59.000 +0800","version_description":"We're back! In this update we bring you a number of major improvements and bug fixes, as well as a complete backend redesign. We've implemented an entirely new File Management system that is both more efficient and will help us better prepare for the incoming Dropbox, Google Drive and FTP integration updates. We've also added some free, new HTML5 templates!<br><br>New Additions &amp; Features<br>• New HTML5 Templates<br>• New Backend Foundation<br>• New Local Storage System<br>• Updated for iOS 10 Compatibility<br><br>Stability &amp; Bug Updates<br>• Fixed Upgrade Popup Bug<br>• Fixed Major Crash Issues<br>• Fixed Major UI Optimizations Bug<br>• Fixed Multiple Stability Issues on iPad Devices<br><br>We realize that the app file size is a large one and we're working hard to compress the app's data and make it available OTA (as opposed to being packaged within the app)."},{"version_id":"820824888","version_name":"5.3","version_date":"2017-02-06 22:23:55.000 +0800","version_description":"Introducing Version 5.3 – The Editor Update<br><br>Welcome to Code Master Pro 5.3. In this update, I have decided to do a complete UI overhaul. With new graphics, controls, menus and an overall fluency upgrade for a more smooth experience. Most importantly, I am introducing the new editor to the Code Master Suite. Say hello to dedicated support for over 170 languages, as well as 70 differently coloured themes to match.<br><br>Furthermore, the project has officially been funded by Facebook! This will be an exciting year for Code Master and I intend on adding a slew of new features, as well as fluency updates. More on this soon.<br><br>New Features &amp; Additions<br>• New Code Editor (2.0)<br>• Support for 170+ Languages<br>• Added 70+ Syntax Themes<br>• Added New Website Templates<br>• UI Overhaul &amp; Graphical Updates<br><br>Stability &amp; Bug Updates<br>• Fixed Bluetooth Keyboard Bug<br>• Fixed UI Bug Blocking the TextView<br>• Fixed Preset File Defaults<br>• Minimized Crashing Potential<br>• Improved Compatibility for iOS 8<br>• Improved Compatibility for iOS 9<br>• Improved Compatibility for iOS 10<br>• Improved Compatibility for iPhone 7<br><br>Upcoming Updates: Dropbox, iCloud Drive, FTP and Web Publishing."}]