[{"version_id":"738832760","version_name":"1.3.1","version_date":"2015-06-09 18:32:19.000 +0800","version_description":"Universal App: Buy it once, and play it on your iPad or iPhone.<br><br>If a player's access to DLC becomes limited after installing the new patch, please select one of the two main game modes, then \"Store,\" and then \"Restore Purchase.\"<br><br>- Saved games can now be exported by long-tapping the Quick Save button during play<br>- Characters can now be opened in other applications during the Export Character process, including Baldur's Gate II: Enhanced Edition if it is installed<br>- The battle music now ends correctly after combat ends<br>- The kit description for the Wizard Slayer now correctly states that all of the Wizard Slayer’s attacks bestow spell failure, not just melee attacks<br>- The description of the Detect Illusion spell now correctly describes the radius of the effect as 30 feet, and that only enemies of the caster are affected by the spell’s effects<br>- The game will no longer crash when attempting to join a multiplayer game, with or without a password<br>- The side panels on the left and right sides of the screen can now be restored on iPhone by tapping the (enlarged) buttons in the bottom left and right corners of the screen<br>- The descriptions of innate abilities and spells can now be viewed from the gameplay screen by holding and releasing on the spell’s icon<br>- Double-tapping an item while purchasing equipment now displays a prompt to set a purchase quantity for that item"},{"version_id":"823636434","version_name":"2.4.71","version_date":"2017-09-28 15:57:04.000 +0800","version_description":"Platform fixes<br>Added 64 bit support<br>Added ipv6 support<br><br>Multiplayer fixes<br>Fixed a crash bug that occurs when in the inventory and an area transition occurs<br>All devices should be able to connect to the multiplayer lobby on IPv6<br>Players should no longer see a Password Required box in the main game screen<br>The on-screen keyboard doesn’t obscure the multiplayer password box any more<br>The quickbar no longer appears on the UI when user is in a menu and another player opens a conversation<br><br>Gameplay &amp; bug fixes<br>Fixed a crashing issue that sometimes occurred when importing characters from a save<br>Fixed a bug allowing for unlimited zoom out<br>Chapter text scroll no longer extends onto the background art<br>Long tapping then dragging party member portraits on the right sidebar now reorders the party<br>Double tapping an item in a store now brings up the \"Choose Amount\" pop up<br>Double tapping a save now loads that save<br>Double tapping a world map destination now invokes travel to the selected area<br>You can now rest while in the help section.<br>It’s now possible to export saves from the game<br><br>Find the full list of additional features and bug fixes at blog.beamdog.com!"},{"version_id":"828259502","version_name":"2.5.17","version_date":"2018-08-17 16:08:55.000 +0800","version_description":"This app has been updated by Apple to use the latest Apple signing certificate.<br><br>A fair wind favors the Sword Coast today as the 2.5 update arrives in Baldur’s Gate! After weeks of waiting on becalmed seas, our swashbuckling team of developers have released a patch filled with features and fixes."},{"version_id":"841952478","version_name":"2.5.17","version_date":"2018-08-17 16:08:55.000 +0800","version_description":"This app has been updated by Apple to use the latest Apple signing certificate.<br><br>A fair wind favors the Sword Coast today as the 2.5 update arrives in Baldur’s Gate! After weeks of waiting on becalmed seas, our swashbuckling team of developers have released a patch filled with features and fixes."}]