[{"version_id":"814010791","version_name":"3.7.5","version_date":"2015-11-01 16:35:54.000 +0800","version_description":"Thanks for reading these release notes ;-) You'd do us a huge favor by leaving a positive review on the App Store! If you already posted one for an older version of PocketCAS, please submit it again to make sure that it shows up for the latest version. A good App Store rating is extremely important to us :-)<br><br>This update fixes one more crash when the device was running low on memory.<br><br>The previous update improved support for iOS 9 and OS X El Capitan. It includes support for App Transport Security as well as using the new San Francisco font everywhere. Plus, the following things have been improved:<br><br>- Some plots that did not appear in the previous version should appear again now. In case you do still encounter plots that do not show up, please try appending \"//!dontDrawSpecialPoints\" to that plot's line and contact us.<br>- There now is an iCloud Drive folder for PocketCAS.<br>- Along with that, iCloud document syncing might be slightly more reliable now.<br>- You can now \"Handoff\" documents in iCloud between your devices. Just open a document on one device and it will automatically show up in the other's lock screen or Dock.<br>- Results of ifactor() will no longer be simplified back to the original input."},{"version_id":"816832867","version_name":"3.8 is one of the largest updates to PocketCAS to date","version_date":"","version_description":""},{"version_id":"816832867","version_name":"3.8","version_date":"2016-04-05 16:26:10.000 +0800","version_description":"This update accidentally removes the button to show the system keyboard on iPhone. We will fix this as soon as possible. Until then, you can still open the system keyboard by swiping up with one finger on the PocketCAS keyboard!<br>Thanks for reading these release notes ;-) You'd do us a huge favor by leaving a positive review on the App Store! If you already posted one for an older version of PocketCAS, please submit it again to make sure that it shows up for the latest version. A good App Store rating is extremely important to us :-)<br><br>This is one of the largest updates to PocketCAS to date, with more than 300 changes to the codebase. We hope you enjoy it!<br><br>New Feature: Support for split screen multitasking and iPad Pro! Sorry for the delay, but we had to reorganize quite a few things to support e.g. \"small\" mode in split screen mode. But it's finally here!<br>New Feature: Plot defaults. You can now change the default settings for plots in the menu (or in the app preferences on the Mac).<br>New Feature: Importing variables. You can now create new \"Import Document\" entries that will load all variables from the document you specify. This lets you e.g. create a \"function library\" that can be shared by multiple other documents.<br>New Feature: CSV Import (requires iCloud Drive). You can now load CSV files into variables to process them. See the new tutorial for an example.<br>New Feature: \"Chaining\" entries. You can now append \"//!next\" to the end of an entry to automatically recalculate the following one when the current one gets changes. (See the Scripting tutorial for an example.)<br>New Feature: Subfolders for documents. A few caveats: This only works with iCloud Drive enabled in PocketCAS and you have to manually create subfolders in the \"iCloud Drive\" app on your device.<br>Improvement: Documents, PDFs and images can now also be exported to other apps (not only via email).<br>Improvement: Improved the accuracy of drawing implicit plots (e.g. circles) when zooming in very far.<br>Improvement: You can now view the text editor's hotkeys by pressing and holding the Cmd button on Bluetooth keyboards.<br>Improvement: PocketCAS now supports Shared iPad for schools.<br>Improvement: Added planes and lines to the 3D plot tutorial.<br>Improvement: Even when a document causes the app to crash, it should not get stuck in a crash loop anymore.<br>Bugfix: Speaking of crashes, we fixed several possible crashes and other bugs. Let us know in case you still encounter problems!"},{"version_id":"816970875","version_name":"3.8.1","version_date":"2016-04-11 08:25:18.000 +0800","version_description":"Thank you for all the great reviews for version 3.8! As this is another update, could you please quickly post them again? That way they show up for the latest version which really helps with visibility on the App Store. Thanks a ton!<br><br>We have a few bug fixes for version 3.8 in this update:<br><br>Bugfix: The system keyboard shows up again in the 'Tools' menu of the iPhone version. Protip: You can show that keyboard more quickly by just swiping up with one finger on the PocketCAS keyboard.<br>Bugfix: Fixed the cursor jumping when typing at the beginning of very long entries.<br>Bugfix: Fixed a crash when deleting the \"X/Y Precision\" fields in the 3D plot settings.<br><br>Also, we have two responses to reviews for version 3.8. We can't respond to reviews directly, so we will post them here:<br>1. PocketCAS does _not_ require iCloud. You can use the app just fine without it. Only two minor features that are most useful to power users (subfolders and CSV import) who would probably enable iCloud anyway require it.<br>2. About \"New Entry\" mode being like writing a script: You can just enter a single line, press 'Calculate' and get the answer. How is this different from other CAS calculators? If you want an answer for other calculations, just create another new entry and calculate that separately - again, just like in other CAS calculators. If we are missing something, please send us an email via the app's support function and let us know!<br><br><br>Version 3.8 is one of the largest updates to PocketCAS to date, with more than 300 changes to the codebase. We hope you enjoy it!<br><br>New Feature: Support for split screen multitasking and iPad Pro! Sorry for the delay, but we had to reorganize quite a few things to support e.g. \"small\" mode in split screen mode. But it's finally here!<br>New Feature: Plot defaults. You can now change the default settings for plots in the menu (or in the app preferences on the Mac).<br>New Feature: Importing variables. You can now create new \"Import Document\" entries that will load all variables from the document you specify. This lets you e.g. create a \"function library\" that can be shared by multiple other documents.<br>New Feature: CSV Import (requires iCloud Drive). You can now load CSV files into variables to process them. See the new tutorial for an example.<br>New Feature: \"Chaining\" entries. You can now append \"//!next\" to the end of an entry to automatically recalculate the following one when the current one gets changes. (See the Scripting tutorial for an example.)<br>New Feature: Subfolders for documents. A few caveats: This only works with iCloud Drive enabled in PocketCAS and you have to manually create subfolders in the \"iCloud Drive\" app on your device.<br>Improvement: Documents, PDFs and images can now also be exported to other apps (not only via email).<br>Improvement: Improved the accuracy of drawing implicit plots (e.g. circles) when zooming in very far.<br>Improvement: You can now view the text editor's hotkeys by pressing and holding the Cmd button on Bluetooth keyboards.<br>Improvement: PocketCAS now supports Shared iPad for schools.<br>Improvement: Added planes and lines to the 3D plot tutorial.<br>Improvement: Even when a document causes the app to crash, it should not get stuck in a crash loop anymore.<br>Bugfix: Speaking of crashes, we fixed several possible crashes and other bugs. Let us know in case you still encounter problems!"},{"version_id":"818262906","version_name":"3.8.2","version_date":"2016-07-27 09:08:46.000 +0800","version_description":"Thanks for reading these release notes ;-) You'd do us a huge favor by leaving a positive review on the App Store! If you already posted one for an older version of PocketCAS, please submit it again to make sure that it shows up for the latest version. A good App Store rating is extremely important to us :-)<br><br>In this update, we have renamed the \"Time Graphing\" feature to \"Animated Graphs\" in order to avoid a possible copyright dispute. We also changed the name of the animated variable from \"T\" to \"anim\". However, we also took the opportunity to add a new feature: You can now customize the name of the animated variable yourself – this should help with maintaining compatibility with your existing documents.<br><br>In addition, this update fixes a few bugs:<br><br>- CSV files without a newline at the end will now be parsed properly.<br>- Indeterminate limits will now return an error when the limits from above and below differ.<br>- Printing plots has been fixed.<br>- Menus will no longer appear behind the math keyboard on iOS 8."},{"version_id":"818608204","version_name":"3.8.3","version_date":"2016-11-14 11:07:57.000 +0800","version_description":"Please do not update to this version yet - it only shows an \"Updating...\" screen when trying to load a tutorial. We have found a fix and will provide it as quickly as possible.<br>In case you did update already and are experiencing this issue - loading your existing documents from the menu should still work.<br>Thanks for reading these release notes :-) You'd do us a huge favor by leaving a positive review on the App Store! If you already posted one for an older version of PocketCAS, please submit it again to make sure that it shows up for the latest version. A good App Store rating is extremely important to us :-)<br><br>New feature: PocketCAS for Mac now supports the MacBook Pro's new touch bar.<br>Bugfix: Fixed some keyboard problems on iOS 10 when rotating the device."},{"version_id":"819745703","version_name":"3.8.4","version_date":"2016-11-16 09:48:13.000 +0800","version_description":"This update should fix PocketCAS being stuck on an \"Updating...\" screen when loading a tutorial. We are very very sorry about the inconvenience this has caused!<br>In case you left a negative review, please consider updating it according to how the new version works for you. App Store reviews have a significant impact on our business.<br><br>Changes in version 3.8.3:<br>New feature: PocketCAS for Mac now supports the MacBook Pro's new touch bar.<br>Bugfix: Fixed some keyboard problems on iOS 10 when rotating the device."},{"version_id":"820249114","version_name":"3.8.5","version_date":"2017-01-02 10:08:33.000 +0800","version_description":"This update fixes a crash under iOS 8 and earlier.<br>In case you left a review, please consider updating it according to how the new version works for you. App Store reviews are very important to use.<br><br>Changes in version 3.8.3:<br>New feature: PocketCAS for Mac now supports the MacBook Pro's new touch bar.<br>Bugfix: Fixed some keyboard problems on iOS 10 when rotating the device."},{"version_id":"820508101","version_name":"3.9.1 fixes a rare crash (mostly happening on macOS) when manipulating plots introduced in version 3.9.Version 3.9:This update switches PocketCAS to a different C++ library. This should have very little impact on you","version_date":"","version_description":""},{"version_id":"820508101","version_name":"3.9","version_date":"2017-01-13 10:09:38.000 +0800","version_description":"This update switches PocketCAS to a different C++ library. This should have very little impact on you, except for improved performance in some cases :-)<br>However, in case you notice anything weird, please let us know via the app's support form.<br><br>In addition, this version contains:<br><br>Improvement: Added a \"Safe Mode\" that doesn't load results and variables in documents, to avoid crashes. On iOS, this mode automatically activates when the app crashes during launch.<br>Bugfix: Fixed a crash on iPhone when trying to open the graph settings for a second time.<br><br>In case you left a review before, please consider updating (or reposting) it according to how the new version works for you. App Store reviews are very important to us."},{"version_id":"820549303","version_name":"3.9.1","version_date":"2017-01-16 16:21:18.000 +0800","version_description":"Version 3.9.1 fixes a rare crash (mostly happening on macOS) when manipulating plots introduced in version 3.9.<br><br>Version 3.9:<br><br>This update switches PocketCAS to a different C++ library. This should have very little impact on you, except for improved performance in some cases :-)<br>However, in case you notice anything weird, please let us know via the app's support form.<br><br>In addition, this version contains:<br><br>Improvement: Added a \"Safe Mode\" that doesn't load results and variables in documents, to avoid crashes. On iOS, this mode automatically activates when the app crashes during launch.<br>Bugfix: Fixed a crash on iPhone when trying to open the graph settings for a second time.<br><br>In case you left a review before, please consider updating (or reposting) it according to how the new version works for you. App Store reviews are very important to us."},{"version_id":"823565052","version_name":"3.10","version_date":"2017-09-29 08:00:08.000 +0800","version_description":"PLEASE NOTE: We had occasional reports where tapping buttons on PocketCAS' built-in math keyboards would open a new blank entry editor under iOS 11. For us, these issues disappeared completely once we rebooted our devices. Unfortunately, this also meant that we could no longer reproduce (nor fix) these issues. In case they still occur for you even after a reboot, please let us know so we can investigate them together!<br><br>New Feature (iOS 11): Drag-and-drop support! You can now:<br>- Use drag-and-drop on the sides of entries to re-order them.<br>- Drop text onto PocketCAS' entry list to create a new entry with that text.<br>- Drag-and-drop a formula inside PocketCAS to create a new entry with the formula's text.<br>- Drop an image onto a 'Calculation' entry to attach it to the calculation as an image annotation.<br>- Drag plots outside PocketCAS to export them in transparent PNG or PDF format. (The exported type can be configured in the application settings, but also depends on the receiving application.)<br>- Drag formulas outside PocketCAS to export them in transparent PNG, PDF, or text format. (The exported type can be configured in the application settings, but also depends on the receiving application.)<br><br>New Feature (iOS 11): File management! PocketCAS uses iOS 11's new document picker. This lets you create subfolders, save documents anywhere you like, tag them, browse them in the Files app, and more. The file browser will even show thumbnail previews of the first entry for documents that have been edited with PocketCAS 3.10 before.<br>New Feature (iPhone X): PocketCAS will fully support the iPhone X's display from day one.<br>Improvement: PocketCAS should now remember your last-opened document more reliably.<br>Improvement: Increased the default accuracy for 2D graphs.<br>Improvement: Slightly improved the quality of 3D graphs, especially when exporting them on macOS.<br>Improvement: PocketCAS will now display variables in the entry editor in italics as soon as you declare them with ':=', even before you actually execute the calculation that sets them.<br>Improvement (Mac): Added a hotkey to search the function list in the entry editor.<br>Bugfix: Fixed a few bugs in the computation kernel (CAS).<br>Bugfix (Mac): Fixed crashes under OS X Mavericks.<br><br>You might be wondering why there's no entry \"Added support for the 10.5-inch iPad Pro's display\" in here. Well, that display was supported by PocketCAS right out of the box!<br><br>In case you left a review before, please consider updating (or reposting) it according to how the new version works for you. App Store reviews are very important to us."},{"version_id":"823860807","version_name":"3.10.1","version_date":"2017-09-30 09:11:17.000 +0800","version_description":"Remember that issue we mentioned in yesterday's Release notes for PocketCAS 3.10 where tapping a keyboard button would open a new, blank editor? Guess what — we were able to reproduce and finally fix it :-)<br><br>So here comes PocketCAS 3.10.1 with a fix for that and the following improvements from PocketCAS 3.10:<br><br>New Feature (iOS 11): Drag-and-drop support! You can now:<br>- Use drag-and-drop on the sides of entries to re-order them.<br>- Drop text onto PocketCAS' entry list to create a new entry with that text.<br>- Drag-and-drop a formula inside PocketCAS to create a new entry with the formula's text.<br>- Drop an image onto a 'Calculation' entry to attach it to the calculation as an image annotation.<br>- Drag plots outside PocketCAS to export them in transparent PNG or PDF format. (The exported type can be configured in the application settings, but also depends on the receiving application.)<br>- Drag formulas outside PocketCAS to export them in transparent PNG, PDF, or text format. (The exported type can be configured in the application settings, but also depends on the receiving application.)<br><br>New Feature (iOS 11): File management! PocketCAS uses iOS 11's new document picker. This lets you create subfolders, save documents anywhere you like, tag them, browse them in the Files app, and more. The file browser will even show thumbnail previews of the first entry for documents that have been edited with PocketCAS 3.10 before.<br>New Feature (iPhone X): PocketCAS will fully support the iPhone X's display from day one.<br>Improvement: PocketCAS should now remember your last-opened document more reliably.<br>Improvement: Increased the default accuracy for 2D graphs.<br>Improvement: Slightly improved the quality of 3D graphs, especially when exporting them on macOS.<br>Improvement: PocketCAS will now display variables in the entry editor in italics as soon as you declare them with ':=', even before you actually execute the calculation that sets them.<br>Improvement (Mac): Added a hotkey to search the function list in the entry editor.<br>Bugfix: Fixed a few bugs in the computation kernel (CAS).<br>Bugfix (Mac): Fixed crashes under OS X Mavericks.<br><br>You might be wondering why there's no entry \"Added support for the 10.5-inch iPad Pro's display\" in here. Well, that display was supported by PocketCAS right out of the box!<br><br>In case you left a review before, please consider updating (or reposting) it according to how the new version works for you. App Store reviews are very important to us."},{"version_id":"823979757","version_name":"3.10.2","version_date":"2017-10-12 07:22:49.000 +0800","version_description":"The bad news: The previous version of PocketCAS had a few crashing bugs.<br>The good news: Our new crash-reporting system helped us find them more easily.<br>The better news: This update fixes them!<br><br>New Feature (iOS 11): Drag-and-drop support! You can now:<br>- Use drag-and-drop on the sides of entries to re-order them.<br>- Drop text onto PocketCAS' entry list to create a new entry with that text.<br>- Drag-and-drop a formula inside PocketCAS to create a new entry with the formula's text.<br>- Drop an image onto a 'Calculation' entry to attach it to the calculation as an image annotation.<br>- Drag plots outside PocketCAS to export them in transparent PNG or PDF format. (The exported type can be configured in the application settings, but also depends on the receiving application.)<br>- Drag formulas outside PocketCAS to export them in transparent PNG, PDF, or text format. (The exported type can be configured in the application settings, but also depends on the receiving application.)<br><br>New Feature (iOS 11): File management! PocketCAS uses iOS 11's new document picker. This lets you create subfolders, save documents anywhere you like, tag them, browse them in the Files app, and more. The file browser will even show thumbnail previews of the first entry for documents that have been edited with PocketCAS 3.10 before.<br>New Feature (iPhone X): PocketCAS will fully support the iPhone X's display from day one.<br>Improvement: PocketCAS should now remember your last-opened document more reliably.<br>Improvement: Increased the default accuracy for 2D graphs.<br>Improvement: Slightly improved the quality of 3D graphs, especially when exporting them on macOS.<br>Improvement: PocketCAS will now display variables in the entry editor in italics as soon as you declare them with ':=', even before you actually execute the calculation that sets them.<br>Improvement (Mac): Added a hotkey to search the function list in the entry editor.<br>Bugfix: Fixed a few bugs in the computation kernel (CAS).<br>Bugfix (Mac): Fixed crashes under OS X Mavericks.<br><br>You might be wondering why there's no entry \"Added support for the 10.5-inch iPad Pro's display\" in here. Well, that display was supported by PocketCAS right out of the box!<br><br>In case you left a review before, please consider updating (or reposting) it according to how the new version works for you. App Store reviews are very important to us."},{"version_id":"824777319","version_name":"3.10.3","version_date":"2017-11-27 15:42:07.000 +0800","version_description":"Bugfix: Fixed crashes when entering functions under iOS 11.2 beta.<br>Bugfix: Fixed a few calculation errors.<br>Improvement: Made 3D line graphs a bit thicker, for better visibility.<br>Improvement (Mac): Made the width of the \"expanded\" graph popover depend on the current window's width.<br><br>For the improvements in PocketCAS 3.10, please see https://pocketcas.com/changes.php.<br><br>In case you left a review before, please consider updating (or reposting) it according to how the new version works for you. App Store reviews are very important to us."},{"version_id":"828879178","version_name":"3.11","version_date":"2018-10-15 16:34:55.000 +0800","version_description":"New Feature (Mac): Added support for Dark Mode on macOS Mojave!<br>New Feature: You can now use the function domain() to find out the definition domain of a function. Example: domain(log(x-0.5)+asin(x))<br>Improvement: Improved support for iOS 12.<br>Improvement: Added support for surfacing PocketCAS documents as Siri suggestions.<br>Improvement: Added support for new iPhone screen sizes (e.g. for iPhone XS Max).<br>Improvement: Updated to the latest computation kernel (which includes the domain() function mentioned above).<br>Improvement: PocketCAS can now automatically detect issues with iCloud document storage and suggests disabling it.<br>Improvement: Added an _underscore_ option to the keyboard on iOS (press and hold the '.' key to access it).<br>Improvement (Mac): Disabled smart quotes in the entry editor.<br>Improvement (Mac): Improved the visuals of 3D line drawing.<br>Bugfix: Fixed a few minor calculation errors and crashes.<br>Bugfix (Mac): Better display when scrollbars set to always show."},{"version_id":"828940396","version_name":"3.11.1","version_date":"2018-10-16 20:42:32.000 +0800","version_description":"New Feature (Mac): Added support for Dark Mode on macOS Mojave!<br>New Feature: You can now use the function domain() to find out the definition domain of a function. Example: domain(log(x-0.5)+asin(x))<br>Improvement: Improved support for iOS 12.<br>Improvement: Added support for surfacing PocketCAS documents as Siri suggestions.<br>Improvement: Added support for new iPhone screen sizes (e.g. for iPhone XS Max).<br>Improvement: Updated to the latest computation kernel (which includes the domain() function mentioned above).<br>Improvement: PocketCAS can now automatically detect issues with iCloud document storage and suggests disabling it.<br>Improvement: Added an _underscore_ option to the keyboard on iOS (press and hold the '.' key to access it).<br>Improvement (Mac): Disabled smart quotes in the entry editor.<br>Improvement (Mac): Improved the visuals of 3D line drawing.<br>Bugfix: Fixed a few minor calculation errors and crashes.<br>Bugfix (Mac): Better display when scrollbars set to always show.<br>Bugfix: Fixed a crash in PocketCAS 3.11 under with old operation system versions."},{"version_id":"828962614","version_name":"3.11.2","version_date":"2018-10-18 17:19:46.000 +0800","version_description":"New Feature (Mac): Added support for Dark Mode on macOS Mojave!<br>New Feature: You can now use the function domain() to find out the definition domain of a function. Example: domain(log(x-0.5)+asin(x))<br>Improvement: Improved support for iOS 12.<br>Improvement: Added support for surfacing PocketCAS documents as Siri suggestions.<br>Improvement: Added support for new iPhone screen sizes (e.g. for iPhone XS Max).<br>Improvement: Updated to the latest computation kernel (which includes the domain() function mentioned above).<br>Improvement: PocketCAS can now automatically detect issues with iCloud document storage and suggests disabling it.<br>Improvement: Added an _underscore_ option to the keyboard on iOS (press and hold the '.' key to access it).<br>Improvement (Mac): Disabled smart quotes in the entry editor.<br>Improvement (Mac): Improved the visuals of 3D line drawing.<br>Bugfix: Fixed a few minor calculation errors and crashes.<br>Bugfix (Mac): Better display when scrollbars are set to always show.<br>Bugfix: Fixed a crash in PocketCAS 3.11 with old operation system versions.<br>Bugfix: Fixed a crash in PocketCAS 3.11 when e.g. moving quickly in plots."},{"version_id":"829131809","version_name":"3.12","version_date":"2018-10-31 23:54:03.000 +0800","version_description":"New Feature: Added support for new iPad screen resolutions.<br>Improvement: Reverted the \"blue\" graph color on Mac back to its previous value.<br><br>Changes in PocketCAS 3.11:<br><br>New Feature (Mac): Added support for Dark Mode on macOS Mojave!<br>New Feature: You can now use the function domain() to find out the definition domain of a function. Example: domain(log(x-0.5)+asin(x))<br>Improvement: Improved support for iOS 12.<br>Improvement: Added support for surfacing PocketCAS documents as Siri suggestions.<br>Improvement: Added support for new iPhone screen sizes (e.g. for iPhone XS Max).<br>Improvement: Updated to the latest computation kernel (which includes the domain() function mentioned above).<br>Improvement: PocketCAS can now automatically detect issues with iCloud document storage and suggests disabling it.<br>Improvement: Added an _underscore_ option to the keyboard on iOS (press and hold the '.' key to access it).<br>Improvement (Mac): Disabled smart quotes in the entry editor.<br>Improvement (Mac): Improved the visuals of 3D line drawing.<br>Bugfix: Fixed a few minor calculation errors and crashes.<br>Bugfix (Mac): Better display when scrollbars set to always show."}]