[{"version_id":"815922638","version_name":"5.0.1","version_date":"2016-01-16 09:44:09.000 +0800","version_description":"- fixed an issue with wrong activity stats display for the new year"},{"version_id":"816104423","version_name":"5.0.2","version_date":"2016-01-21 19:15:41.000 +0800","version_description":"- fixed an issue with location not updating with display off"},{"version_id":"817213278","version_name":"5.1.0","version_date":"2016-05-03 16:12:26.000 +0800","version_description":"What's new in version 5.1? A lot. <br>Not only the usual minor fixes this time. We got for you:<br>• The amazing Bike Citizens bike sharing mode: Calculates the best route (walking) to the next bike sharing station with free bikes and guides you to  your destination. Available for London, Vienna, Paris &amp; Hamburg (and many more cities in the future). Have fun trying!<br>• The brand-new Bike Computer widget, making it more comfortable to start and stop tracking from your lock-screen.<br>Have fun trying!"},{"version_id":"817419036","version_name":"5.1.1","version_date":"2016-05-24 16:34:16.000 +0800","version_description":"New feature: the Bike Benefit Model. In the cities of Graz, Vienna and Bremen you can now get rewarded for cycling. These rewards can be redeemed at participating companies in your city."},{"version_id":"817524191","version_name":"5.1.2","version_date":"2016-05-26 08:28:25.000 +0800","version_description":"New feature: the Bike Benefit Model. In the cities of Graz, Vienna and Bremen you can now get rewarded for cycling. These rewards can be redeemed at participating companies in your city."},{"version_id":"818051832","version_name":"5.2.0","version_date":"2016-07-17 16:11:01.000 +0800","version_description":"What's new in version 5.2?<br><br>- iPhone 6/6+: Enjoy the app fully adapted to iPhone 6 and 6+ resolutions<br>- Share your tracks and your activity heatmap with your friends and show them how much you ride your bike in your city!<br><br>Enjoy the summer!<br>Your Bike Citizens"},{"version_id":"819698308","version_name":"6.0.1","version_date":"2016-11-14 15:16:28.000 +0800","version_description":"Personal profile: quick access to your info and app personalisation <br>Bike Citizens Pro: Be part of the Bike Citizens community and subscribe to a Pro Account for a bunch of new features; including 25% off in our shop and  access to all city maps!<br>Happy riding!<br><br>Version 6.0.1 contains minor fixes."},{"version_id":"819942261","version_name":"6.1","version_date":"2016-12-05 20:18:23.000 +0800","version_description":"You stumbled over some little bugs lately? Well in that case this update comes just in time. We did some bug fixes that will improve your usability when cycling with the app. Apart from that there is still our Pro version with new features waiting for you. <br>Keep smiling and enjoy your rides!"},{"version_id":"820272371","version_name":"6.2","version_date":"2017-01-16 11:30:11.000 +0800","version_description":"Check out the new dashboard featuring the latest news about cycling, the activity screen and the track list. We also fixed some minor bugs for an easier handling. Enjoy your rides!"},{"version_id":"821276823","version_name":"7.0","version_date":"2017-03-18 05:22:30.000 +0800","version_description":"This version updates the look and feel by changing the menu bar to the iOS style. Easy navigation through the app with new sections such as the „community“ will increase your cycling fun. Join our „cycling campaigns“ in your country or city like the Bike Week in Australia, the Bike Benefit campaigns in German cities or get your local campaigns into the app. Enjoy your rides!"},{"version_id":"821621484","version_name":"7.0.1","version_date":"2017-04-07 07:17:21.000 +0800","version_description":"Bug Fixes: There were a few tiny issues after the last update that we have worked on. Check it out and enjoy your rides! If there are any questions get in touch via our user support: info@bikecitizens.net"},{"version_id":"821837894","version_name":"7.0.2","version_date":"2017-04-21 13:28:38.000 +0800","version_description":"Bug Fixes: There were a few tiny issues after the last update that we have worked on. Check it out and enjoy your rides! If there are any questions get in touch via our user support: info@bikecitizens.net"},{"version_id":"822256313","version_name":"7.1","version_date":"2017-05-30 08:50:56.000 +0800","version_description":"The „PINGifyoucare.eu“ campaign gives people in Brussels the possibility to communicate and engage directly with the Government of Brussels in order to make cycling more comfortable and safer."},{"version_id":"822350602","version_name":"7.1.1","version_date":"2017-06-01 06:46:36.000 +0800","version_description":"The „PINGifyoucare.brussels“ campaign gives people in Brussels the possibility to communicate and engage directly with the Government of Brussels in order to make cycling more comfortable and safer."},{"version_id":"822477993","version_name":"7.1.2","version_date":"2017-06-09 21:32:15.000 +0800","version_description":"The „PINGifyoucare.brussels“ campaign gives people in Brussels the possibility to communicate and engage directly with the Government of Brussels in order to make cycling more comfortable and safer."},{"version_id":"822525234","version_name":"7.1.3","version_date":"2017-07-06 21:43:42.000 +0800","version_description":"The „PINGifyoucare.brussels“ campaign gives people in Brussels the possibility to communicate and engage directly with the Government of Brussels in order to make cycling more comfortable and safer."},{"version_id":"822827030","version_name":"7.1.4","version_date":"2017-07-11 07:56:59.000 +0800","version_description":"The „PINGifyoucare.brussels“ campaign gives people in Brussels the possibility to communicate and engage directly with the Government of Brussels in order to make cycling more comfortable and safer."},{"version_id":"822976780","version_name":"7.1.5","version_date":"2017-08-22 19:46:56.000 +0800","version_description":"Good news: we fixed a bunch of small bugs that were kind of annoying such as the reloading of the global heatmap or the flatrate download. Also the lookup of Points of Interests has been improved. <br><br>For those who love to listen to music while cycling you can now easily ajust the volume of the voice guidedance."},{"version_id":"823828639","version_name":"7.1.6","version_date":"2017-09-29 03:49:34.000 +0800","version_description":"Minor fixes and updates"},{"version_id":"823903158","version_name":"7.1.7","version_date":"2017-10-05 07:58:48.000 +0800","version_description":"Minor fixes and updates"},{"version_id":"826908006","version_name":"7.2","version_date":"2018-05-04 11:16:28.000 +0800","version_description":"The Bike Citizens app now offers a bunch of new features and campaigns - like the new GPX export, finally ;-). If you are tired of switching on and off the tracking function for every ride, try our new Smart Tracking beta version. It starts and stops tracking automatically when riding your bike. Among small improvements some cities host exiting cycling campaigns such as the moon challenge in Bremen, Bike Benefit in Hamburg or Bike2Work in Austria and Hungary. You want to improve your language skills - try to navigate in Hungarian language. Menjünk és szórakozni ;-)"},{"version_id":"827084589","version_name":"7.2.1","version_date":"2018-05-25 17:46:18.000 +0800","version_description":"Small Update, including some bug fixes and informing you about our refined ToS and Privacy Policy. Of course, all the other news are still hot  :)<br><br>The Bike Citizens app now offers a bunch of new features and campaigns - like the new GPX export, finally ;-). If you are tired of switching on and off the tracking function for every ride, try our new Smart Tracking beta version. It starts and stops tracking automatically when riding your bike. Among small improvements some cities host exiting cycling campaigns such as the Moon Challenge in Bremen, the Bike Benefit System in Hamburg or Bike2Work in Austria and Hungary. You want to improve your language skills - try to navigate in Hungarian language. Menjünk és szórakozni ;-)"},{"version_id":"829206222","version_name":"7.2.2","version_date":"2018-11-22 09:01:53.000 +0800","version_description":"Did you already try smart tracking? We fixed some bugs to get smart tracking ready for the winter season. How it works? Simply leave your phone in your pocket and track your rides automatically - if you want to do so. Besides we fixed several minor bugs to increase your joy when cycling with Bike Citizens. Enjoy your rides!"},{"version_id":"829438662","version_name":"7.2.3","version_date":"2018-11-30 12:52:06.000 +0800","version_description":"Did you already try smart tracking? We fixed some bugs to get smart tracking ready for the winter season. How it works? Simply leave your phone in your pocket and track your rides automatically - if you want to do so. Besides we fixed several minor bugs to increase your joy when cycling with Bike Citizens. Enjoy your rides!"},{"version_id":"829986775","version_name":"7.3","version_date":"2019-01-20 23:00:37.000 +0800","version_description":"We did some magic and created a winter cycling challenge for you. No big surprise, it's all about cycling. Don't waste your time, get on the bike and earn you first winter cycling badges! Enjoy your rides #wintercyclingfun"},{"version_id":"830146399","version_name":"7.3.1","version_date":"2019-02-02 07:04:19.000 +0800","version_description":"We did some magic and created a winter cycling challenge for you. No big surprise, it's all about cycling. Don't waste your time, get on the bike and earn you first winter cycling badges! Enjoy your rides #wintercyclingfun<br>Updated: Major performance improvements for route calculation and track list."},{"version_id":"830429763","version_name":"7.3.2","version_date":"2019-03-21 05:54:13.000 +0800","version_description":"Spring is just around the corner, winter is slowly coming to an end in the northern hemisphere. So is our #wintercyclingfun. Last chance to show your hedgehog-quality, squirrel-skills and that you are weather-proofed like a arctic fox! Watch out for new cities, campaigns and challenges as well as new app-features to come. Keep on riding safely!<br>Updates: Minor bug fixes."},{"version_id":"830947601","version_name":"7.3.3","version_date":"2019-05-02 08:52:58.000 +0800","version_description":"Spring is here! If you have not done it already, fix your bike like we fixed some minor bugs in the app.<br>Get some fresh air, take a ride and look forward to our spring challenge.<br>Keep on riding safely!<br>Updates:<br>Minor bug fixes"},{"version_id":"832030244","version_name":"7.5.0","version_date":"2019-08-05 06:07:00.000 +0800","version_description":"Here‘s what‘s new with this update:<br>- New super cool map style<br>- Improved design<br>- Ongoing Summer Cycling Fun<br>- Minor bug fixes<br>We love to constantly improve the app for you. Therefore, we are now switching to a new way of displaying maps. It looks so much better, you will like it as much as we do.<br>The new worldwide online map is now available for tracking and orientation.<br>In addition, the maps are updated at shorter intervals.<br>To display the new map style offline, you have to download it just once.<br>For pastime and pleasure we continue our Summer Cycling Fun challenge with new hidden accomplishments! Look out for them!<br>This time it‘s all about Wegschatz – the total amount of all different routes cycled. <br>And finally our designer had some sleepless nights to make all these improvements looking great.<br>As always, this update comes with some minor bug fixes.<br>Keep on cycling."},{"version_id":"834676141","version_name":"7.6.2","version_date":"2020-02-19 12:54:30.000 +0800","version_description":"• Look forward to new offline region maps for France, Slovenia, Greece, Spain and Italy. <br>• For long-distance travelers, we're adding Australia and New Zealand, too.<br>• \"The early bird catches the worm\": Our early-bird promotion is currently running and you will receive the new region maps at a 25% discount. <br>• Until the end of February we also reduce the price of the flatrate from 19,99€ to 14,99€. <br>• Enjoy your rides, the cycling season has already started!"},{"version_id":"835330099","version_name":"7.6.4","version_date":"2020-04-16 09:34:13.000 +0800","version_description":"• This time we made some changes to our road bike routing, wishing you a save ride ahead!<br>• The maps of Stuttgart &amp; Essen are now available for free download. Once downloaded - a lifetime of cycling.<br>• USA promotion: 50 cities for free for a limited time! Additionally, maps of all US states are now available.<br>Stay fit and if it's allowed in your region, get on your bike and strengthen your defenses!"},{"version_id":"835840342","version_name":"7.6.5","version_date":"2020-07-07 14:41:48.000 +0800","version_description":"We have fixed a few small bugs for you and see no need to bore you with their details :-)<br>Ride on!"},{"version_id":"836821594","version_name":"7.6.6","version_date":"2020-09-03 07:32:37.000 +0800","version_description":"• \"Work-life balance\" was yesterday. With the launch of Play &amp; Bike to Work we will increase your \"work-life-BIKE balance\". Grab your colleagues, work as a team, face the challenges and save a lot of CO2. Challenge accepted?<br>• You live in the Hannover region? Then join the Bike Benefit campaign!<br>• The offline maps for Mainz and whole Schleswig-Holstein now to download for free"},{"version_id":"838939244","version_name":"7.7.0","version_date":"2020-11-11 22:32:46.000 +0800","version_description":"In this update there are again some small bug fixes - but that's not all: <br>- A new POI category is available: \"Cuisine\". Because cycling can make you very hungry and thirsty. <br>Have fun exploring!"}]