[{"version_id":"10595261","version_name":"1.05","version_date":"","version_description":""},{"version_id":"114112672","version_name":"1.500","version_date":"","version_description":""},{"version_id":"15704123","version_name":"1.301","version_date":"","version_description":""},{"version_id":"194592635","version_name":"1.600","version_date":"","version_description":""},{"version_id":"259942644","version_name":"1.700","version_date":"","version_description":""},{"version_id":"401832664","version_name":"1.800","version_date":"","version_description":""},{"version_id":"579532766","version_name":"1.950","version_date":"","version_description":""},{"version_id":"631202670","version_name":"1.996","version_date":"","version_description":""},{"version_id":"701692652","version_name":"1.9971","version_date":"2014-09-19 06:06:59.000 +0800","version_description":"This update solves the issues and crashes encountered on some devices. Download it now!<br><br>+ A new element to create very advanced contraptions: the Brainiac, a multipixel element that player can move to fit into several bodies. <br><br>The Brainiac allows the player to  <br>- Craft Dynamic Contraptions<br>- Use it with our interactive blueprints such as vehicles, robots and various machines<br>- Make your own multi-pixels combination with existing elements and assemble them, move them, transport materials or activate separate actions<br><br>+ 8 Interactive Bodies to connect with the Brainiac: Spaceship, Plane, Flying Car, UFO, Train, Drill, Mechcloud and Kamikaze Drone!<br>+ Make doors with Gate and Gate Control<br>+ Shoot Rockets with the Launcher to destroy your pixel worlds<br><br>+ Not one but TWO new Campaigns (including one free) : 17 levels in total ! <br><br>+ and several improvements<br>- UI changes for a more intuitive menu!<br>- New musics<br>- New icon<br><br>+ Many bug fixes"},{"version_id":"811972881","version_name":"1.99981","version_date":"2015-03-13 19:03:08.000 +0800","version_description":"Ready for a new exploration and action campaign? Control Jones, the new adventurer character, explore ancient temples, brave all the dangers of the Mayan jungle and discover new treasures!<br><br>Use over 15 new elements to create your own platform mini-games and craft worlds with unique features<br><br>+ 1 new platform-oriented campaign of 12 levels, featuring Arnold and Jones<br> <br>+ Over 15 new elements to make your retro platform game levels and other kind of mini-games, including:<br>- New Enemies: Snake, Mayan Guardian, Piranha and Killer Bees<br>- 3 colors of Keys and Doors for creating labyrinths and worlds with gates<br>- Power Ups: Whip, Rope, Boomerang, Torch<br>- Game design elements: Big Rock, Lever<br>- Weapons: Missile Launcher Turret and Power Cannon<br>- Special Items and Decorations: Treasure, Golden Idol, El Dorado Building, Mayan Magician, Giant Mayan Calendar, Quetzalcoatl Stone and Sacrifice Altar<br> <br>+ New Game Music<br>+ New App Icon<br>+ Various Optimizations and Bugs Fixes"},{"version_id":"812089121","version_name":"1.99983","version_date":"2015-04-16 05:43:09.000 +0800","version_description":"+ Over 15 new Daily Quests offering new challenges every day with mana rewards!<br>+ New Elements related to Ecology:<br>- A new Force of Nature, the Wind element, and a Sensor that makes electricity when affected by it, the Wind Sensor.<br>- Powerful but polluting energy sources: Uranium and Coal. <br>- Element Byproducts: Toxic Waste and Smog.<br>- New contamination Mechanics : Radioactivity and Smog Pollution.<br>- 2 Energy Generating Multipixels: Hydroelectric Turbine and Eolic Generator<br>+ New App Icon<br>+ Various Bugs Fixes"},{"version_id":"812237305","version_name":"1.99984","version_date":"2015-05-13 21:35:43.000 +0800","version_description":"+ 1 new Ecology 2 campaign of 17 levels where you will learn about powerful energy sources like Coal and Uranium, as well as some ecological energy sources like Wind (eolic energy) and Water (hydroelectric energy)!<br>+ New Elements related to Ecology:<br>       - Volcano: it will come from beneath the earth and erupt!<br>       - Solar Ray: it will come from top of the sky and burns everything to the ground!<br>+ New App Icon"},{"version_id":"812458847","version_name":"1.99985","version_date":"2015-06-30 07:54:44.000 +0800","version_description":"Have a taste of The Sandbox EDU game, playing this campaign adapted from it. Watch some basic interactions in a funny and didactical way!<br><br>• a campaign of 10 levels taken from the The Sandbox EDU, where you’ll learn some basic chemistry and element interactions.<br>• the Filter, an element that separates water from elements that absorb it (eg: Take the water from the Mud to leave Soil)<br>• 1 new animal, the Croc, that opens its mouth and tries to kill when living beings approach it.<br>• a teaser element for the upcoming Mutant Monsters Campaign: the DoomGrub, a giant worm capable of eating almost anything."},{"version_id":"812752584","version_name":"1.99986","version_date":"2015-07-04 16:47:49.000 +0800","version_description":"Update Now to receive 1,000 Mana for FREE for all players!<br><br>Fixed Compatibility Issue with iOS7, you can now play again with your iPhone 4, 4S or iPad 3, 4, iPad Mini or iPad Mini 2 on iOS7<br><br>Have suggestions? Send them to thesandbox@pixowl.com<br>Your feedback constantly helps us make The Sandbox the best game we can!"},{"version_id":"812787940","version_name":"1.99987","version_date":"2015-07-22 16:38:38.000 +0800","version_description":"Ever wanted to pit Giant Monsters against each other in a world you made yourself? Discover the power of the MutaGem, and experiment with it on living elements! You can even use the MindRay to control them and fight yourself!<br><br>- A new element, the MutaGem, that has the power to transform living beings into monsters.<br>- A campaign of 18 levels will begin when you discover the MutaGem, deep inside the devastated nuclear wasteland you find at the end of the Ecology 2 campaign. This adventure will transport you through many different places, as you learn to release the power of the MutaGem's capabilities, the Giant Monsters it can create, and take control of them with the help of the MindRay.<br>- The Aberrations: failed products of the MutaGem that hate the world and will try to crush anything that moves.<br>- 1 New Animal, the Earthworm. Usually found in soil or mud, ocasionally goes to the surface out of curiosity. He's the Catalyst for the DoomGrub Element.<br>- 1 New Enemy, the Robodrile. Behaves just like the Crocodile, but thanks to its enhanced durability and mechanical upgrades any target within range will be no match for the missiles it shoots from its mouth.<br>- 2 new Mutant Monsters that are born from the fusion between living elements and the MutaGem:<br>     - Haijira, the likable and gigantic grey Dinosaur, that strikes with its tail and lets off a deadly blue Atomic Breath.<br>     - MechaRex, the mechanical counterpart of Haijira, a Cyborg T-Rex that strikes with its mouth and fires a scorching red Laser Breath.<br>- The MindRay, a weapon that will allow you to take control of the Giant Monsters and fight the world (including other monsters!)"},{"version_id":"813170167","version_name":"1.99990","version_date":"2015-08-29 20:51:26.000 +0800","version_description":"- New Monster: Cutethulu. A giant flying Monster that can summon hordes of minions through portals and invoke a Meteor shower down to rain upon its foes.<br><br>- New Enemy: Spawn of Cutethulu: Flying minions that serve Cutethulu and die in its name with an explosive attack that turns most living elements into Aberrations."},{"version_id":"813737721","version_name":"1.99995","version_date":"2015-10-18 19:02:01.000 +0800","version_description":"Fixed touch control issues on iPhone 6S &amp; iPhone 6S Plus, you can now fully enjoy the game on your shiny new device!"},{"version_id":"813900706","version_name":"1.99996","version_date":"2015-10-28 06:30:25.000 +0800","version_description":"Halloween is upon us, and at The Sandbox we’ll celebrate it by adding monsters and decorations!<br>• 1 new controllable element, the Headless Horseman, a ghastly rider on a demon steed that can throw his pumpkin head as a projectile that explodes.<br>• 2 new enemies that can turn Humans into their kind:<br>    o The Vampire will seek and attack Humans, and occasionally move around by shapeshifting into a Bat. They cannot do this when under the effect of light.<br>    o The Werewolf will also seek and attack Humans, and will go back to Human Form after a while. However, it will turn back into a Werewolf unless affected by light.<br>• 4 new decorative elements to make your Halloween-themed levels:<br>    o Jack O’ Lantern, Cauldron, Haunted Tree and Tombstones."},{"version_id":"815102282","version_name":"1.99998","version_date":"2015-12-08 10:35:43.000 +0800","version_description":"The festivities continue, and we’ll now celebrate Christmas! This update will have the following new elements:<br>·         A special item, the Gift. It can appear in many different color patterns and Humans and Characters love them! They also upgrade your Gift Tree and can be used as a decoration.<br>·         Santa himself as a controllable character! He can double jump like Arnold, defeats his foes by jumping on them and can take out Gifts from his magical bag and drop them.<br>·         The Gift Tree, an upgradable tree with many states of decay and development. If it gets damaged it will wither and die, but if you give Gifts to it, it will heal back and develop!<br>·         Xmas Elf, a small humanoid that searches for Gifts and brings them to the Gift Tree. Other than that, they are friendly little fellows that jump enthusiastically to express their happiness!<br>·         The Grouch, a hateful creature that dresses as Santa but drops bad Gifts that explode on touch. They don’t explode when grabbed by Xmas Elves, however, and will damage the tree on destination. A sneaky foe with no friends!<br>·         4 new decorative elements to make your Christmas-themed levels: Happy Snowman, Candy Cane, Snow Globe, and a Decorated House."},{"version_id":"815853222","version_name":"1.99999","version_date":"2016-02-03 08:59:45.000 +0800","version_description":"Welcome to 2016! The future is now! Add new Tech elements which give powerful new effects to your world's creation:<br>•         Force Field, a versatile element that generates a protective field that breaks after 2 impacts (explosions, lasers or projectiles) but reactivates after a short while.<br>•         Teleporters! This 8x3 sized multipixel element functions in pairs and will allow you to teleport other multipixels from Teleporter A1 to A2 and so on… There can only be a limited amount of them present at the same time though.<br>•         Tech Trooper, a controllable element that shoots lasers, is protected by a personal Force Field and can float at will for a while with a Jetpack. His lasers change type every time he comes into contact with a Gem and can shoot in 4 directions.<br>•         E. Resonator is an element that generates lightning strikes towards other E. Resonators every few seconds when they are close enough and there are no obstacles in-between.<br>•         4 new decorative elements to make your Futuristic-themed levels: Tesla Coil, AutoTurret, Ultramodern Building and Headquarters"},{"version_id":"816379911","version_name":"1.999993","version_date":"2016-02-24 20:10:56.000 +0800","version_description":"Take control over our new monster: the Cyclops, a giant one-eyed humanoid monster with two attacks: a downwards swing with his spiked club, and the Seismic Shockwave attack."},{"version_id":"816632971","version_name":"1.999994","version_date":"2016-04-04 16:27:14.000 +0800","version_description":"Play our new \"Movie Adventures\" campaign featuring 10 levels where the Sandbox God plays at being a Movie director. You'll battle aliens with the Tech Trooper, smash humans with the Cyclops, terrify villagers with the Headless Horseman, and more!<br><br>Follow us on social networks:<br>•Instagram: http://instagram.com/thesandboxgame/<br>•Twitter: http://twitter.com/thesandboxgame <br>•Facebook: http://facebook.com/thesandboxgame"},{"version_id":"817454986","version_name":"1.999995","version_date":"2016-05-20 17:05:20.000 +0800","version_description":"Minor update with bugs fixes and iPhone SE support"},{"version_id":"820060886","version_name":"2.0","version_date":"2016-12-23 13:54:31.000 +0800","version_description":"Happy Holidays! We have a gift update for all you Sandboxers!<br><br>- Four Festive New Elements:<br>•Santa Powder: A magic powder that makes Humans dress and act like the legendary figure that brings gifts to the homes of kids around the world<br>•Reindeer: This docile animal lives in cold climates and avoids predators. During this special season, 1 out of every 9 of them will have a Red Nose!<br>•Polar Bear: These big carnivorous bears from the Arctic Circle can visit your game worlds!<br>•Xmas House: A brick house festooned with shiny Christmas lights!<br><br>- Fixed touch control issues on iPhone 7 &amp; iPhone 7 Plus. You can now fully enjoy the game on your shiny new device!"},{"version_id":"820060886","version_name":"2.1","version_date":"","version_description":""},{"version_id":"82233800","version_name":"1.450","version_date":"","version_description":""},{"version_id":"826137750","version_name":"2.3","version_date":"2018-03-07 21:41:33.000 +0800","version_description":"Happy Holidays! We have a gift update for all you Sandboxers!<br><br>- Four Festive New Elements:<br>•Santa Powder: A magic powder that makes Humans dress and act like the legendary figure that brings gifts to the homes of kids around the world<br>•Reindeer: This docile animal lives in cold climates and avoids predators. During this special season, 1 out of every 9 of them will have a Red Nose!<br>•Polar Bear: These big carnivorous bears from the Arctic Circle can visit your game worlds!<br>•Xmas House: A brick house festooned with shiny Christmas lights!<br><br>- Fixed touch control issues on iPhone 7 &amp; iPhone 7 Plus. You can now fully enjoy the game on your shiny new device!"},{"version_id":"841411494","version_name":"2.3","version_date":"2018-03-07 21:41:33.000 +0800","version_description":"Happy Holidays! We have a gift update for all you Sandboxers!<br><br>- Four Festive New Elements:<br>•Santa Powder: A magic powder that makes Humans dress and act like the legendary figure that brings gifts to the homes of kids around the world<br>•Reindeer: This docile animal lives in cold climates and avoids predators. During this special season, 1 out of every 9 of them will have a Red Nose!<br>•Polar Bear: These big carnivorous bears from the Arctic Circle can visit your game worlds!<br>•Xmas House: A brick house festooned with shiny Christmas lights!<br><br>- Fixed touch control issues on iPhone 7 &amp; iPhone 7 Plus. You can now fully enjoy the game on your shiny new device!"},{"version_id":"9001654","version_name":"1.04","version_date":"","version_description":""}]