[{"version_id":"816403442","version_name":"3.9","version_date":"","version_description":""},{"version_id":"816540869","version_name":"3.10","version_date":"","version_description":""},{"version_id":"816606857","version_name":"3.11","version_date":"","version_description":""},{"version_id":"816633833","version_name":"3.12","version_date":"","version_description":""},{"version_id":"817003125","version_name":"3.13","version_date":"","version_description":""},{"version_id":"817621813","version_name":"3.14","version_date":"2016-06-09 01:14:06.000 +0800","version_description":"Usage of our app has been growing by leaps and bounds. The leaps by which it's growing are like that scene in The Matrix where Neo doesn't quite make it. They're bigger than one would think possible to make. But you can do it... *if you believe*. There are two things that come from lots more people downloading our app: 1. we have more readers of the app change log, our favorite publishing platform! And 2. there's a lot more people emailing our support team with questions. We've been in that position ourselves and it's annoying to have to wait for someone to get to your question and respond. So this release includes some updates that make it easier for you to get answers without asking us, and also allows you to set a category of your question so we can prioritize things to get you answers faster. Just be sure to choose the \"deep thoughts\" category when you send us your \"what is The Matrix?\" question."},{"version_id":"817931098","version_name":"3.15","version_date":"2016-08-03 20:58:26.000 +0800","version_description":"In our last release we made some updates to how you send questions to our support team, and we also pondered the question: \"what, exactly, is the matrix?\" Unfortunately, no one can be told what the Matrix is. You have to see it for yourself. But we can tell you one thing it isn't: it isn't selecting \"send receipt\" in our app and being asked to choose a support category, one of which is \"send receipt.\" That's just silly."},{"version_id":"818750902","version_name":"3.16","version_date":"2016-09-06 20:30:19.000 +0800","version_description":"Bugs have been on our minds a lot lately here at Thanx HQ. We added some plants in the office and they're wonderful - really make the office feel like fertile ground for creative thinking. Unfortunately it also somehow ushered in a bunch of these little black flies that hover around the place, seemingly preferring the space directly between our monitors and our faces. Every half hour or so you'll hear, *SMACK* \"Got you, you $*@($!\" Then quiet resumes as we all focus on our work and then... *SMACK*. Another bug, quashed.<br><br>Also, we did the same thing with the Thanx app, just tidying up some stuff. If you try and sign up with an email account that's already registered, we'll bounce you over to the log in page now with a note about it. We added support for a few more barcode types. Invitations sent via Facebook and Twitter are now handled properly. We sorted the support categories properly. Nothing really big of course, but small, annoying, and hard to ignore. *SMACK*"},{"version_id":"819137025","version_name":"3.17","version_date":"2016-10-19 21:17:07.000 +0800","version_description":"For most people, more choices means getting exactly what you want, and that's a good thing. For those of you that fit this description, we have good news! Thanx now supports choices when you earn rewards. This new feature lets merchants offer more than one reward for you to choose from when you earn one. Do you want cake? Or ice cream? <br><br>This new feature is in the app now, but you won't see it until merchants start using it, which is up to them. Until then, nothing will really change, which will be a relief to those of you who can never make up your minds. Ice cream cake for everyone!"},{"version_id":"819519507","version_name":"3.18","version_date":"2016-11-01 03:10:40.000 +0800","version_description":"We think it's a pretty universal statement that pretty much everyone loves free stuff (well, unless it's stuff you don't want - we don't care for bee stings and paper cuts even if they are free). In this regard, Thanx is pretty magical. You sign up, you register a credit card, and then you get free stuff (that you want) just for shopping like you were going to do anyway. What's NOT a universal truth is that everyone prefers paying with credit cards, in which case, no magic for you when you pay with a sawbuck. In an effort to bring a little magic to people with this preference, we've completely revamped how you send us receipts in the app. Take a snapshot of the receipt, tap in how much you spend and hit send. We expect to be able to grant this progress way faster and more consistently. Magic!"},{"version_id":"819579149","version_name":"3.19","version_date":"2016-11-03 06:34:07.000 +0800","version_description":"We think it's a pretty universal statement that pretty much everyone loves free stuff (well, unless it's stuff you don't want - we don't care for bee stings and paper cuts even if they are free). In this regard, Thanx is pretty magical. You sign up, you register a credit card, and then you get free stuff (that you want) just for shopping like you were going to do anyway. What's NOT a universal truth is that everyone prefers paying with credit cards, in which case, no magic for you when you pay with a sawbuck. In an effort to bring a little magic to people with this preference, we've completely revamped how you send us receipts in the app. Take a snapshot of the receipt, tap in how much you spend and hit send. We expect to be able to grant this progress way faster and more consistently. Magic!"},{"version_id":"819630042","version_name":"3.20","version_date":"2016-11-09 22:56:02.000 +0800","version_description":"We think it's a pretty universal statement that pretty much everyone loves free stuff (well, unless it's stuff you don't want - we don't care for bee stings and paper cuts even if they are free). In this regard, Thanx is pretty magical. You sign up, you register a credit card, and then you get free stuff (that you want) just for shopping like you were going to do anyway. What's NOT a universal truth is that everyone prefers paying with credit cards, in which case, no magic for you when you pay with a sawbuck. In an effort to bring a little magic to people with this preference, we've completely revamped how you send us receipts in the app. Take a snapshot of the receipt, tap in how much you spend and hit send. We expect to be able to grant this progress way faster and more consistently. Magic!"},{"version_id":"819984251","version_name":"3.21","version_date":"2016-12-09 02:11:49.000 +0800","version_description":"The sawbuck. The Benjamins. Cold, hard cash. Doesn't it seem kinda odd that here we are in 2016, carrying around paper money, invented in 870 B.C., to barter for stuff? This is the future! We don't have flying cars yet, but paying ATM fees for something invented nearly 3,000 years ago seems kinda silly. Yet it endures, which is why we've been adding more functionality to the Thanx app for those of you who like the feel of a crisp, cool Hamilton when you shop at your favorite merchants. In our last update we refined how you send us receipts, while this release lets you quickly go see the status of those receipts. Just tap on the inbox icon to go to the message center to see what's what. Cash monies might have been invented by the Tang Dynasty, but effortless rewards belong to Thanx."},{"version_id":"821629052","version_name":"3.22","version_date":"2017-04-07 22:45:35.000 +0800","version_description":"There are two kinds of people in this world, those who are having their birthday today, and those who aren’t. Problem is, there’s a third kind of person in this world, and that’s the kind of person who is celebrating their birthday and Thanx can’t give them a gift because we don’t know it’s your birthday. Now that’s a sad state of affairs. This release fixes a lot of little things, one of them being that if one of your favorite merchants is offering a birthday reward we’ll just go ahead and ask you for your birthday to make sure you get it. And we’re highlighting rewards that are expiring soon to make sure you don’t miss out when that birthday cupcake is about to run out on you. No one should miss out on their birthday, especially you."},{"version_id":"821855297","version_name":"3.23","version_date":"2017-04-27 16:41:54.000 +0800","version_description":"Look, we'll be honest. This update is not something you'll probably much care about, but it represents literally two years of strife and effort from our organization to fix one little thing. It didn't take two years to actually write the code - that took like, a week - but it took two years to find a way for boring reasons we won't bore you with. And when we tell you what it is you'll be all, \"That's it? Two years you say? You need to find a better way to spend your time.\" And we'll admit you're right, which is why we're so excited about it, because we don't have to spend any more time on it. Ok. Are you ready? Are you ready for this awesome, amazing feature that our team is literally on the verge of tears to tell you about? ... From this day forward, when you add a Visa card to Thanx... *we won't ask you to type it in twice*. TADA."},{"version_id":"821960863","version_name":"3.24","version_date":"2017-05-02 16:48:56.000 +0800","version_description":"Look, we'll be honest. This update is not something you'll probably much care about, but it represents literally two years of strife and effort from our organization to fix one little thing. It didn't take two years to actually write the code - that took like, a week - but it took two years to find a way for boring reasons we won't bore you with. And when we tell you what it is you'll be all, \"That's it? Two years you say? You need to find a better way to spend your time.\" And we'll admit you're right, which is why we're so excited about it, because we don't have to spend any more time on it. Ok. Are you ready? Are you ready for this awesome, amazing feature that our team is literally on the verge of tears to tell you about? ... From this day forward, when you add a Visa card to Thanx... *we won't ask you to type it in twice*. TADA."},{"version_id":"822040158","version_name":"3.25","version_date":"2017-05-09 05:52:39.000 +0800","version_description":"Look, we'll be honest. This update is not something you'll probably much care about, but it represents literally two years of strife and effort from our organization to fix one little thing. It didn't take two years to actually write the code - that took like, a week - but it took two years to find a way for boring reasons we won't bore you with. And when we tell you what it is you'll be all, \"That's it? Two years you say? You need to find a better way to spend your time.\" And we'll admit you're right, which is why we're so excited about it, because we don't have to spend any more time on it. Ok. Are you ready? Are you ready for this awesome, amazing feature that our team is literally on the verge of tears to tell you about? ... From this day forward, when you add a Visa card to Thanx... *we won't ask you to type it in twice*. TADA."},{"version_id":"822116912","version_name":"3.26","version_date":"2017-06-14 21:35:01.000 +0800","version_description":"Look, we'll be honest. This update is not something you'll probably much care about, but it represents literally two years of strife and effort from our organization to fix one little thing. It didn't take two years to actually write the code - that took like, a week - but it took two years to find a way for boring reasons we won't bore you with. And when we tell you what it is you'll be all, \"That's it? Two years you say? You need to find a better way to spend your time.\" And we'll admit you're right, which is why we're so excited about it, because we don't have to spend any more time on it. Ok. Are you ready? Are you ready for this awesome, amazing feature that our team is literally on the verge of tears to tell you about? ... From this day forward, when you add a Visa card to Thanx... *we won't ask you to type it in twice*. TADA."},{"version_id":"822587122","version_name":"3.27","version_date":"2017-06-28 17:08:35.000 +0800","version_description":"No flying cars, no jet packs, no holodecks, no replicators. Instead we get Lyft and Uber, drones, VR, and Instacart. This modern life is one of compromises given the high hopes we all had for our retro-future. But living in the future certainly has its surprises. Mobile phones are yesterday's super computer, and who hasn't reveled in buying something on Amazon only to have it show up in a day or so like magic?<br><br>Thanx has its own magic of course. Make a few purchases with an enrolled credit card and SHAZAM you have a free sandwich waiting for you on your next visit. But up until now you had to make those purchases to get that awesome thing. Well now there's a new way:  Thanx Exclusive Deals. Starting with this release your favorite merchants can proffer you goods and services that you can purchase right in the app. Maybe it'll be 5 cupcakes for the price of 4, or a free juice shot upgrade to all your purchases. The point being that being a loyal customer has never been more awesome. A magical future we live in, isn't it?"},{"version_id":"822839171","version_name":"3.28","version_date":"2017-07-18 17:49:01.000 +0800","version_description":"No flying cars, no jet packs, no holodecks, no replicators. Instead we get Lyft and Uber, drones, VR, and Instacart. This modern life is one of compromises given the high hopes we all had for our retro-future. But living in the future certainly has its surprises. Mobile phones are yesterday's super computer, and who hasn't reveled in buying something on Amazon only to have it show up in a day or so like magic?<br><br>Thanx has its own magic of course. Make a few purchases with an enrolled credit card and SHAZAM you have a free sandwich waiting for you on your next visit. But up until now you had to make those purchases to get that awesome thing. Well now there's a new way:  Thanx Exclusive Deals. Starting with this release your favorite merchants can proffer you goods and services that you can purchase right in the app. Maybe it'll be 5 cupcakes for the price of 4, or a free juice shot upgrade to all your purchases. The point being that being a loyal customer has never been more awesome. A magical future we live in, isn't it?"},{"version_id":"822952293","version_name":"3.29","version_date":"2017-07-24 22:37:17.000 +0800","version_description":"It's kinda amazing that Thanx has been around for five years. FIVE! Some of you have gotten married. Had kids. Changed jobs. Gotten hair extensions. Grown beards. And in all that time, Thanx has been here for you. Like a rock. But all things change and Thanx is no exception. This release updates our terms of service and our privacy policies to accommodate several new features, including allowing merchants to sell exclusive deals in our app, as well as to send you personalized rewards based on your purchases. The end result is just more awesome free stuff at your favorite merchants. That'll never change."},{"version_id":"824192219","version_name":"3.30","version_date":"2017-10-29 22:14:59.000 +0800","version_description":"Sometimes things don't work out the way you'd planned. For instance, we built this app to inspire and reward loyalty to your favorite merchants, and it turns out some of you are *crazy* loyal. We just underestimated how much you love Thanx merchants, which, when we think about it, is a real lack of foresight on our part. An example of how underestimating you is that the app prompts you for feedback every time you make a purchase - did you have a good experience? Our merchants really want to know. But if you go there *EVERY DAY* it's annoying. Needy, even. We just never thought you'd go there that often, but, of course, some of you are. So we've toned it down a bit. Now, the app will only ask you this question when you open it once a month. You can still leave that feedback by going into the message center in the app, but the app won't be constantly begging you for feedback if you're going there every day. We don't need a rating to see that you're a happy customer."},{"version_id":"825241610","version_name":"3.31","version_date":"2017-12-08 17:10:04.000 +0800","version_description":"Happy holidays! This year, we hope you get some fantastic goodies under your tree, menorah, festivus pole, or wherever you keep your presents when you get them. Regardless of where you put them, here's one from Thanx. Nothing big to report here, just a few little performance improvements and bug fixes, an end-of-the-year housekeeping release to make sure that you start the year off with at least one snappy, easy to use app."},{"version_id":"825284101","version_name":"3.32","version_date":"2017-12-12 20:24:11.000 +0800","version_description":"Happy holidays! This year, we hope you get some fantastic goodies under your tree, menorah, festivus pole, or wherever you keep your presents when you get them. Regardless of where you put them, here's one from Thanx. Nothing big to report here, just a few little performance improvements and bug fixes, an end-of-the-year housekeeping release to make sure that you start the year off with at least one snappy, easy to use app."},{"version_id":"825327751","version_name":"3.33","version_date":"2017-12-19 07:18:29.000 +0800","version_description":"Happy holidays! This year, we hope you get some fantastic goodies under your tree, menorah, festivus pole, or wherever you keep your presents when you get them. Regardless of where you put them, here's one from Thanx. Nothing big to report here, just a few little performance improvements and bug fixes, an end-of-the-year housekeeping release to make sure that you start the year off with at least one snappy, easy to use app."},{"version_id":"826211280","version_name":"3.34","version_date":"2018-03-07 18:11:06.000 +0800","version_description":"You know that saying about how any technology that is significantly advanced is indistinguishable from magic? Well, this app release feels a bit like that to us. Our engineers, (henceforth \"code gnomes\") basically sneak into our offices in the middle of the night and work some arcane spellwork, turning the dark spirits they've imprisoned within their laptops to ends that we can't even speculate, and then they tell us they're done. \"With what pray tell? What miracles and/or abominations have you wrought with your dark arts?\" we ask. They respond with nonsense; as if statements like \"We standardized BridgingHeader\" has any meaning to the likes of you or us. \"Is that all?\" we ask flatly in jest, to which they reply in all seriousness, \"We also removed extra link binary build steps.\" Dear reader, perhaps there are things we are better not understanding. So long as they don't rend a tear in the fabrics between our realm and the next and unleash some tentacled nightmare upon our children, who are we to judge their murky machinations? We can tell you this though, it sure makes authoring the release notes damned near impossible. Best we can tell, this release brings us a small step closer to the apocalypse, despite our code gnomes' adamant protestations to the contrary."},{"version_id":"826470234","version_name":"3.35","version_date":"2018-03-28 20:01:35.000 +0800","version_description":"We update the app regularly to make it shinier!<br>Keep it updated to take advantage of the latest features and improvements.<br><br>• Like the app? Leave us a good rating!<br>• Questions? Email us at support@thanx.com"},{"version_id":"827879392","version_name":"3.37","version_date":"2018-07-18 21:25:07.000 +0800","version_description":"You know that episode of Looney Tunes where Bugs Bunny keeps finding giant gold nuggets and using them to buy carrot juice (if not, google 14 Carrot Rabbit)? Every time he is near gold he starts bouncing around to the sound of snare drums and cowbells like he's in his own personal earthquake. How cool would that be? Unless you're holding a cup of hot coffee... Anyway. Why, you ask, are we here at Thanx HQ thinking about this now? Because if you have this latest version of the Thanx app on your phone you might be holding your own chunk of gold! Starting today Thanx merchants can offer Bronze, Silver, and Gold rewards to awesome customers like you. If you started jiggering around to the sound of snare drums just now you should definitely open up the app and see. If not, don't worry, we'll send you a push notification when you earn these reward statuses. Just be careful not to check the app while holding a hot beverage or a sharp utensil."},{"version_id":"827994920","version_name":"3.38","version_date":"2018-07-26 20:16:47.000 +0800","version_description":"Way back in the day, connecting to the internet involved an almost tactile nails-on-a-chalkboard indicator that YOU WERE GETTING ONLINE. We are referring, of course, to the sound of a dial-up modem. For those of you who may not remember, just read this, verbatim, loudly and in a monotone: urrrr EEEE urrr NNNGGGG CRRRRcrrrr KEEEEEEE grrr nnnnnng. Aaaah. That brings back memories. Back then, downloading a song or watching a live image of a coffee pot (for real) took a stupid long time. Now, we walk around with these super computers in our pocket that send more data when they aren't doing *anything at all* than you could shift in a day on that old modem.<br><br>And yet. It's amazing how often it doesn't quite work as well as one would expect. You get an interminable spinner or an error and look at your device in frustration and think, \"I was expecting flying cars by now, and this thing can't even upload a receipt.\" Which brings us to what's new in this version of our app: We've updated how receipt uploads work. It seems like a mundane improvement, but trust us, the next time you need to snap a photo of a receipt and send it to us for reward credit because you paid cash or whatever (remember paying for things with cash!? Good times.), you'll notice something – it works! Like, *all the time*. Previously it worked *nearly* all of the time and, damnit, that's not good enough. Years from now, when your kids are complaining about how their implants occasionally drop a frame of their real time 360 VR data feed you'll be able to look back and say, \"I remember when I tried to upload a receipt and it failed once. But then they fixed it.\" Because that's the kind of future we want for you and your kids."},{"version_id":"828233583","version_name":"3.39","version_date":"2018-08-21 20:46:52.000 +0800","version_description":"Way back in the day, connecting to the internet involved an almost tactile nails-on-a-chalkboard indicator that YOU WERE GETTING ONLINE. We are referring, of course, to the sound of a dial-up modem. For those of you who may not remember, just read this, verbatim, loudly and in a monotone: urrrr EEEE urrr NNNGGGG CRRRRcrrrr KEEEEEEE grrr nnnnnng. Aaaah. That brings back memories. Back then, downloading a song or watching a live image of a coffee pot (for real) took a stupid long time. Now, we walk around with these super computers in our pocket that send more data when they aren't doing *anything at all* than you could shift in a day on that old modem.<br><br>And yet. It's amazing how often it doesn't quite work as well as one would expect. You get an interminable spinner or an error and look at your device in frustration and think, \"I was expecting flying cars by now, and this thing can't even upload a receipt.\" Which brings us to what's new in this version of our app: We've updated how receipt uploads work. It seems like a mundane improvement, but trust us, the next time you need to snap a photo of a receipt and send it to us for reward credit because you paid cash or whatever (remember paying for things with cash!? Good times.), you'll notice something – it works! Like, *all the time*. Previously it worked *nearly* all of the time and, damnit, that's not good enough. Years from now, when your kids are complaining about how their implants occasionally drop a frame of their real time 360 VR data feed you'll be able to look back and say, \"I remember when I tried to upload a receipt and it failed once. But then they fixed it.\" Because that's the kind of future we want for you and your kids."},{"version_id":"829953469","version_name":"3.41","version_date":"2019-01-21 22:09:55.000 +0800","version_description":"Way back in the day, connecting to the internet involved an almost tactile nails-on-a-chalkboard indicator that YOU WERE GETTING ONLINE. We are referring, of course, to the sound of a dial-up modem. For those of you who may not remember, just read this, verbatim, loudly and in a monotone: urrrr EEEE urrr NNNGGGG CRRRRcrrrr KEEEEEEE grrr nnnnnng. Aaaah. That brings back memories. Back then, downloading a song or watching a live image of a coffee pot (for real) took a stupid long time. Now, we walk around with these super computers in our pocket that send more data when they aren't doing *anything at all* than you could shift in a day on that old modem.<br><br>And yet. It's amazing how often it doesn't quite work as well as one would expect. You get an interminable spinner or an error and look at your device in frustration and think, \"I was expecting flying cars by now, and this thing can't even upload a receipt.\" Which brings us to what's new in this version of our app: We've updated how receipt uploads work. It seems like a mundane improvement, but trust us, the next time you need to snap a photo of a receipt and send it to us for reward credit because you paid cash or whatever (remember paying for things with cash!? Good times.), you'll notice something – it works! Like, *all the time*. Previously it worked *nearly* all of the time and, damnit, that's not good enough. Years from now, when your kids are complaining about how their implants occasionally drop a frame of their real time 360 VR data feed you'll be able to look back and say, \"I remember when I tried to upload a receipt and it failed once. But then they fixed it.\" Because that's the kind of future we want for you and your kids."},{"version_id":"830875431","version_name":"3.42","version_date":"2019-04-05 21:07:41.000 +0800","version_description":"You know what's great? Having a wide variety of screens to choose from when buying iPhones. But with great diversity, comes great development overhead. This build fixes layout issues on newer devices."},{"version_id":"833029773","version_name":"3.51","version_date":"2019-10-07 23:48:44.000 +0800","version_description":"We update the app regularly to make it shinier!<br>Keep it updated to take advantage of the latest features and improvements.<br>- This version contains small bug fixes and performance improvements.<br><br>• Like the app? Leave us a good rating!<br>• Questions? Email us at support@thanx.com"},{"version_id":"833168841","version_name":"3.52","version_date":"2019-10-15 11:35:28.000 +0800","version_description":"We update the app regularly to make it shinier!<br>Keep it updated to take advantage of the latest features and improvements.<br>- This version contains small bug fixes and performance improvements.<br><br>• Like the app? Leave us a good rating!<br>• Questions? Email us at support@thanx.com"},{"version_id":"833484645","version_name":"3.55","version_date":"2019-11-06 02:11:25.000 +0800","version_description":"We update the app regularly to make it shinier!<br>Keep it updated to take advantage of the latest features and improvements.<br>- This version contains small bug fixes and performance improvements.<br><br>• Like the app? Leave us a good rating!<br>• Questions? Email us at support@thanx.com"},{"version_id":"833569471","version_name":"3.56","version_date":"2019-11-12 14:06:39.000 +0800","version_description":"We update the app regularly to make it shinier!<br>Keep it updated to take advantage of the latest features and improvements.<br>- This version contains small bug fixes and performance improvements.<br><br>• Like the app? Leave us a good rating!<br>• Questions? Email us at support@thanx.com"},{"version_id":"833709154","version_name":"3.57","version_date":"2019-12-03 00:24:36.000 +0800","version_description":"We update the app regularly to make it shinier!<br>Keep it updated to take advantage of the latest features and improvements.<br>- This version contains small bug fixes and performance improvements.<br><br>• Like the app? Leave us a good rating!<br>• Questions? Email us at support@thanx.com"},{"version_id":"834710915","version_name":"3.68","version_date":"2020-02-14 08:08:48.000 +0800","version_description":"We update the app regularly to make it shinier!<br>Keep it updated to take advantage of the latest features and improvements.<br>- This version contains small bug fixes and performance improvements.<br><br>• Like the app? Leave us a good rating!<br>• Questions? Email us at support@thanx.com"},{"version_id":"835186158","version_name":"3.73","version_date":"2020-03-20 01:13:27.000 +0800","version_description":"We update the app regularly to make it shinier!<br>Keep it updated to take advantage of the latest features and improvements.<br>- This version contains small bug fixes and performance improvements.<br><br>• Like the app? Leave us a good rating!<br>• Questions? Email us at support@thanx.com"},{"version_id":"835353198","version_name":"3.74","version_date":"2020-04-01 17:00:24.000 +0800","version_description":"We update the app regularly to make it shinier!<br>Keep it updated to take advantage of the latest features and improvements.<br>- This version contains small bug fixes and performance improvements.<br><br>• Like the app? Leave us a good rating!<br>• Questions? Email us at support@thanx.com"},{"version_id":"835386113","version_name":"3.75","version_date":"2020-04-02 23:47:54.000 +0800","version_description":"We update the app regularly to make it shinier!<br>Keep it updated to take advantage of the latest features and improvements.<br>- This version contains small bug fixes and performance improvements.<br><br>• Like the app? Leave us a good rating!<br>• Questions? Email us at support@thanx.com"}]