[{"version_id":"811613150","version_name":"1.6","version_date":"2015-09-03 11:24:18.000 +0800","version_description":"Speed limits MEMORY. 8 speed limits option. SPEEDING TOLERANCE settings. IMPORT speed and red light camera data from one of the many poi providers (poi-factory, poi-plaza, scdb). ALERT on speed and red light cameras.  Separate SOUND and VOICE alert volumes. Improvements in offline maps, heads-up/full screen modes and cpu/memory consumption. And more!<br><br>As always, new options will not come into your way unless you want to use them!<br><br>‣‣ REMEMBER speed limit<br>Apply speed limits once as you drive and let speedometer store them to re-apply automatically for you! Short instruction and video tutorial in a documentation section  will show you how to become a speed limits master :).<br><br>‣‣ 8 speed limits option<br>Once speedometer started to remember speed limits it became obvious that it needs more than 4 values for that. Hold your finger on “Limit presets” button above the presets until the customization options open and chose “8 speed limits” option. This will also hopefully make all Australian users happy!!<br><br>‣‣ SPEEDING TOLERANCE settings<br>It was a common request to have a 25 mph speed limit value, but be alerted on 30 mph let’s say. Now this is possible! Set it up in \"Advanced Settings\" &gt; \"Speed Colors &amp; Buffer\". A percentage value can be applied for a buffer value in addition to an absolute value in mph or km/h (and knots). Tap on a blue mph or km/h button there to switch to %.<br><br>‣‣ ALERT on speed and red light cameras (or any other kind of a waypoint/poi)<br>Speedometer can now alert you on approaching any type of a waypoint. You can create and edit your own speed and red light cameras within the app or just feed speedometer a file from poi-factory, poi-plaza or many other poi sites that might have very fresh and local to you data. A handy proximity monitor will show the nearest waypoints on your way and will alert you with beep, voice and vibration options. Collected waypoints can be shared via email in iGO, Navitel or GARMIN csv formats.<br><br>‣‣ New options for HEADS-UP/FULL screen<br>Now speedometer remembers if you used a mirrored heads-up for the last time or a full screen mode and will let you open that recently used mode with one button. Also vows for remembering the orientation lock settings in hud/full screen have been fulfilled.<br>You can pick from 5 extra options to be shown in hud/full screen. That includes time, altitude, total trip distance, current distance counter and GPS course. Any two of extra options can be shown at once.<br><br>‣‣ Separate SOUND and VOICE alert volumes<br>For voice and sound alerts you can now set a different, from system, volume. \"Advanced Settings\" &gt; \"Alert Sounds\", bottom of a list.<br><br>‣‣ MISCELLANIA<br>‣ Google map upgraded to the latest version.<br>‣ Map now has two full screen modes - the partial full screen, still showing iPod or waypoint proximity monitor and a full-full screen.<br>‣ All maps now show a scale ruler.<br>‣ Track can now be exported in GPX GARMIN format, including speed information.<br><br>∙ Speedo never prompts you for a review. We value your attention to driving too much to interrupt it. If you feel generous and have a couple of minutes, please leave a review as it makes a huge difference to us. Thank you in advance!"},{"version_id":"813289307","version_name":"1.6.1","version_date":"2015-09-26 21:25:58.000 +0800","version_description":"iOS 9 ready (!! also means iPad screen multitasking !!). New ALERT SOUNDS - Chime and Ping.  Fixes for speed cameras import and alerting. Fixes for speed limits MEMORY. Updated Google map.<br><br>‣‣ iOS 9. <br>Not only we updated the app to play nice with the new and gorgeous Apple system font, but we also made sure speedo works well with the iPad MULTITASKING (screen split view or slide over) feature. We are holding our breath until we hear from cellular iPads owners  if they like it!<br><br>‣‣ Chime and Ping alert sounds. <br>We've been hurting your ears with alert sounds for quite a long time now! Now we are adding two new sounds - Chime and Ping (you'll find them in the \"Advanced Settings\" &gt; \"Alert sounds\", bottom of a list), they should be a bit softer  and we hope you'll like them!<br><br>‣‣ Google map has been updated to the newest version so you can use all of the memory and performance benefits coming from the Google’s continuous work.<br><br>‣‣ Range of fixes for iOS 9<br>Fixed crash on waypoint editing in iOS9. Fixed speed limit preset values over 100 being truncated due to the new system font.<br><br>‣‣‣‣ If you feel generous and have a minute to write a review or just rate the app, you can be sure it helps us tremendously in keeping up the good (late night) work! Otherwise we are lost not knowing if you like the updates and would like to see more of them coming :).<br><br>New features in version 1.6:<br>‣‣ Speed limits MEMORY. Allows you to teach speedometer speed limits so it can re-apply them automatically for you.<br>‣‣ 8 speed limits option. <br>‣‣ SPEEDING TOLERANCE settings. <br>‣‣ IMPORT speed and red light camera data from one of the many poi providers (poi-factory, poi-plaza, scdb). <br>‣‣ ALERT on speed and red light cameras.  <br>‣‣ Separate SOUND and VOICE alert volumes. <br>‣‣ New options for the heads-up/full screen.<br>And more!"},{"version_id":"814691250","version_name":"1.6.2","version_date":"2016-05-19 11:43:22.000 +0800","version_description":"‣&nbsp;5 new alert sounds<br>Plink, Till beep, Buzz, Fast beeps and Four high beeps. You can set them in \"Advanced Settings\" &gt; \"Alert Sounds”. The intent was to provide more merciful sounds when compared to the current ones.<br><br>‣&nbsp;3D touch options for the app icon<br>Allows to start or stop the track, create new waypoint or change the mode.<br><br>‣&nbsp;Modes<br>The fast and straightforward way to transform speedometer to a tool of your choice.&nbsp;Heads-up, Taximeter, Rally Computer, Map, Waypoints monitor (e.g. speed cameras), Full screen map or speed, G-Force monitor or you can resort to a Default at any moment - that's all available via force touch on the app icon or MENU&gt;MODES. 9 modes in total are available in this release!<br><br>‣&nbsp;Rally computer improvements<br>This version adds off perfect time monitor and handy controls to adjust distance or reset/pause counters. Put together, it all created a foundation for the new rally computer experience. To get to all of this, just do MENU&gt;MODES&gt;\"Rally computer\". Hope speedometer will see more rallies now and will help you win, of course!<br><br>‣&nbsp;G-Force acceleration monitor<br>Use MENU&gt;MODES&gt;\"G-Force monitor\" (or force touch on the app icon). G-Force monitor calibrates itself as you drive to deduce what is the horizontal force and which direction is forward and back.<br><br>‣&nbsp;Waypoints improvements<br>This release brings a lot for waypoints: <br>* Multiple active waypoint collections. <br>* \"Nearby\" filter for waypoints list. <br>* URL waypoint collections. Know the url of the file with pois is or maintain your very own one? Add a url based collection to speedo and have it synchronized (bi)weekly, monthly or manually.<br>* Waypoints list now shows an icon for every known waypoint type<br><br>‣&nbsp;Waypoints monitor improvements<br>Now you can grab waypoints from the speedo's library and the whole alerting setup process has become easier! You'll see for yourself after choosing MENU&gt;MODES&gt;\"Waypoints monitor\"<br><br>‣&nbsp;Fixes and maintenance! iOS9 related and not only<br>To mention major ones here:<br>+ Navigation to waypoints via Waze, Google, Navigon and others.<br>+ MapQuest map and downloading offline maps from providers that are not supporting ssl<br>+ Showing weather information in infotainment.<br>+ Improved compatibility of export files in KMZ and GPX format with other apps.<br>+&nbsp;Apple map can now show traffic information.<br>+&nbsp;Updated Google map to the latest version.<br><br>A lot of small bugs were exterminated and memory/performance improvements have been made.<br><br>We work hard but never ask you for a review when you work with the app! We value your attention to driving too much to interrupt it. If you feel generous and have a minute, please review or rate the app as it makes a HUGE difference to us. Thank you!"},{"version_id":"817463227","version_name":"1.6.3","version_date":"2016-05-25 05:02:21.000 +0800","version_description":"Thank you for the feedback for version 1.6.2! Really helped us to identify a crash condition and find some bugs, mostly in the new features of version 1.6.2. Fixed now! We hope you'll support our effort with your kind reviews and ratings. Also don't not miss new features from short-lived, but aspiring version 1.6.2:<br>‣&nbsp;Modes<br>The fast and straightforward way to transform speedometer to a tool of your choice.&nbsp;Heads-up, Taximeter, Rally Computer, Map, Waypoints monitor (e.g. speed cameras), Full screen map or speed, G-Force monitor or you can resort to a Default at any moment - that's all available via force touch on the app icon or MENU&gt;MODES. 9 modes in total are available in this release!<br><br>‣&nbsp;5 new alert sounds<br>Plink, Till beep, Buzz, Fast beeps and Four high beeps. You can set them in \"Advanced Settings\" &gt; \"Alert Sounds”. The intent was to provide more merciful sounds when compared to the current ones.<br><br>‣&nbsp;3D touch options for the app icon<br>Allows to start or stop the track, create new waypoint or change the mode.<br><br>‣&nbsp;Rally computer improvements<br>This version adds off perfect time monitor and handy controls to adjust distance or reset/pause counters. Put together, it all created a foundation for the new rally computer experience. To get to all of this, just do MENU&gt;MODES&gt;\"Rally computer\". Hope speedometer will see more rallies now and will help you win, of course!<br><br>‣&nbsp;G-Force acceleration monitor<br>Use MENU&gt;MODES&gt;\"G-Force monitor\" (or force touch on the app icon). G-Force monitor calibrates itself as you drive to deduce what is the horizontal force and which direction is forward and back.<br><br>‣&nbsp;Waypoints improvements<br>This release brings a lot for waypoints: <br>* Multiple active waypoint collections. <br>* \"Nearby\" filter for waypoints list. <br>* URL waypoint collections. Know the url of the file with pois is or maintain your very own one? Add a url based collection to speedo and have it synchronized (bi)weekly, monthly or manually.<br>* Waypoints list now shows an icon for every known waypoint type<br><br>‣&nbsp;Waypoints monitor improvements<br>Now you can grab waypoints from the speedo's library and the whole alerting setup process has become easier! You'll see for yourself after choosing MENU&gt;MODES&gt;\"Waypoints monitor\"<br><br>‣&nbsp;Fixes and maintenance! iOS9 related and not only<br>To mention major ones here:<br>+ Navigation to waypoints via Waze, Google, Navigon and others.<br>+ MapQuest map and downloading offline maps from providers that are not supporting ssl<br>+ Showing weather information in infotainment.<br>+ Improved compatibility of export files in KMZ and GPX format with other apps.<br>+&nbsp;Apple map can now show traffic information.<br>+&nbsp;Updated Google map to the latest version.<br><br>A lot of small bugs were exterminated and memory/performance improvements have been made.<br><br>We work hard but never ask you for a review when you work with the app! We value your attention to driving too much to interrupt it. If you feel generous and have a minute, please review or rate the app as it makes a HUGE difference to us. Thank you!"},{"version_id":"817559192","version_name":"1.7","version_date":"2016-09-17 18:19:32.000 +0800","version_description":"• Brushed and polished for iOS 10!<br>• Land navigation mode. Arrow pointing to your target, compass and coordinate.<br>• UTM + MGRS coordinates. Advanced Settings &gt; Coordinate format. Degrees, Dm and Dms formats for showing latitude and longitude.<br>• One-stop waypoint and target editor.<br>• Using GPS course or compass automatically for best heading accuracy. Use Advanced Settings &gt; Compass or Course to change the preference.<br>• Zoom in and out buttons for maps, tap on the map to show.<br>• NATO mils support for compass. Advanced Settings &gt; Compass &amp; Course.<br>And more!<br><br>We will never distract you from driving by asking for a review. If you have a minute and want to support the app, please write us a kind review. It really makes a difference!"},{"version_id":"819372699","version_name":"1.8","version_date":"2017-08-25 06:06:07.000 +0800","version_description":"・ Fixes for iOS 11<br>・ Visual proof of your speed with a new 'visualize and explore' black box screen. Save your black box for later review.<br>・ Track explorer with charts and map to focus on any time range or point<br>・ Night mode for the Google map<br>・ Overspeed screen flash option<br>・ 'Idle timer and alert' mode<br>・ 'Water sports boat' mode. Screen flash, time and countdown to sunset<br>・ GPX import/export for waypoints, tracks, routes<br>・ Import Rmaps, mbtiles, sqlitedb maps (MOBAC, TileMill)<br>+ a whole lot more!<br>We would be honored if you find a minute to support the app with your kind review or rating!"},{"version_id":"823519662","version_name":"1.8.1","version_date":"2017-09-14 06:02:12.000 +0800","version_description":"Polished and optimized for iOS 11! <br>Change of name and icon to Speedometer 55 Pro to avoid confusion as we changed the free version name and icon to Speedometer 55 Start.<br>Fixed speed limits shown on a Google map in U.S. style even if you'd have EU style selected in settings.<br>-- Don't miss updates in version 1.8! --<br>・ Visual proof of your speed with a new 'visualize and explore' black box screen. Save your black box for later review.<br>・ Track explorer with charts and map to focus on any time range or point<br>・ Night mode for the Google map<br>・ Overspeed screen flash option<br>・ 'Idle timer and alert' mode<br>・ 'Water sports boat' mode. Screen flash, time and countdown to sunset<br>・ GPX import/export for waypoints, tracks, routes<br>・ Import Rmaps, mbtiles, sqlitedb maps (MOBAC, TileMill)<br>+ a whole lot more!<br>We would be honored if you find a minute to support the app with your kind review or rating!"},{"version_id":"823794852","version_name":"1.8.2","version_date":"2018-01-24 08:30:36.000 +0800","version_description":"Optimized for iPhone X. New cost/fuel options. New sound and alert options. Return of a map only track view. And a lot more ...<br>New cost/fuel options:<br>・'Miles Per Liter' and 'Kilometers per Liter'.<br>・Configurable currency symbol.<br>・Optional driving range monitoring.<br>New sound options:<br>・Play alert and messages via Hands Free.<br>・ Show mute/unmute button on main screen.<br>・Continuous (default) or single alert for over speed.<br>Miscellany:<br>・ Tapping on a speed units switch on the main screen now shows a confirmation menu for speed units change - should avoid accidental units change/tickets.<br>・ Tracks list has been reworked. Looks almost the same, though track and trips names should be now easier to see. <br>・ You can make a URL waypoints collection a default and move waypoints to it from other collections, but this requires URL collection to have sync frequency as None/Manual - so your manually added waypoints are not overwritten during the next sync. This should support scenarios when you keep camera files on Dropbox, update it manually at times and then sync back to the app.<br>・ Made \"extras\" in HUD/Full screen brighter. You can always adjust the overall brightness of HUD, so making these a bit dimmed was not the best idea from me.<br>・ Made customization of speed limit and iPod areas more available by turning the \"customization button\" into standard blue buttons with a single tap to open the customization options.<br>We would be honored if you find a minute to support the app with your kind review or rating!"},{"version_id":"826057799","version_name":"1.9","version_date":"2018-09-27 21:07:00.000 +0800","version_description":"・Optimized for iOS 12.・Siri shortcuts: New Track, Stop Track, Speed limits.<br>・Barometric vertical speed indicator.・Voice coach.<br>・Option to cancel map centering by simply moving the map. Option to return back to centering automatically.<br>・Google map for all map screens (Track view, point editor).<br>・Custom color for HUD/Full screen extra fields.<br>・Units of measurement allow to set when to switch to kilometers and miles from meters and feet. Independent units for altitude.<br>・Whole active track on the main map.<br>・Photo GPX export for tracks.<br>+ And a whole lot more"},{"version_id":"828753270","version_name":"1.9.1","version_date":"2018-10-01 21:36:27.000 +0800","version_description":"・Optimized for new iPhones and iOS 12.・Siri shortcuts: New Track, Stop Track, Speed limits.<br>・Barometric vertical speed indicator.・Voice coach.<br>・Option to cancel map centering by simply moving the map. Option to return back to centering automatically.<br>・Google map for all map screens (Track view, point editor).<br>・Custom color for HUD/Full screen extra fields.<br>・Units of measurement allow to set when to switch to kilometers and miles from meters and feet. Independent units for altitude.<br>・Whole active track on the main map.<br>・Photo GPX export for tracks.<br>+ And a whole lot more"},{"version_id":"828793315","version_name":"1.9.2","version_date":"2018-10-10 16:38:49.000 +0800","version_description":"Bug fixes and optimizations. Don't miss cool new features from major version 1.9:<br>・Optimizations for new iPhones and iOS 12.・Siri shortcuts: New Track, Stop Track, Speed limits.<br>・Barometric vertical speed indicator.・Voice coach.<br>・Option to cancel map centering by simply moving the map. Option to return back to centering automatically.<br>・Google map for all map screens (Track view, point editor).<br>・Custom color for HUD/Full screen extra fields.<br>・Units of measurement allow to set when to switch to kilometers and miles from meters and feet. Independent units for altitude.<br>・Whole active track on the main map.<br>・Photo GPX export for tracks.<br>+ And a whole lot more"},{"version_id":"828885794","version_name":"1.9.3","version_date":"2019-04-17 09:07:54.000 +0800","version_description":"・Optimized for iOS 12.2: faster start, lower memory consumption.<br>・Paragliding mode with map, arrow to target, options for barometric altitude or height, vertical and horizontal speed, compass.<br>・Optional barometric altitude or height indicator on the small map screen.<br>・Camera button inside a NEW WAYPOINT menu item allows to take photos overlaid with location, date and notes.<br>・Making waypoints in the app more useful with new workflows and tools for their images.<br>+ Bug fixes."},{"version_id":"831013802","version_name":"1.9.6","version_date":"2019-09-19 15:47:11.000 +0800","version_description":"・Optimized for iOS 13.<br>・Night mode for the Apple map (needs iOS 13 and higher). This is not controlled by iPhone's dark or light mode - you control map appearance in the settings just as it is done for the Google map.<br>・Supporting iPhone's dark mode by showing darker popups/dialogs when in the dark mode.<br>・Adding 'Pin to live map' to track row swipe options.<br>・Avoiding deletion of a track/trip row on a long swipe (needs iOS 11 and higher).<br>・Reworked feedback &amp; support screen.<br>・Newest Google maps with lower memory and CPU consumption."},{"version_id":"832852325","version_name":"1.9.7","version_date":"2019-10-01 19:56:58.000 +0800","version_description":"・Optimized for iOS 13.1.<br>・Diagnose and solve GPS issues with a GPS troubleshooting screen (MENU &gt; Feedback &amp; Support &gt; GPS troubleshooting)<br>・Improved handling of weak/strong GPS accuracy for iOS 13.<br>・Fixing the issue when the app might not be offered as \"Import with\" choice for kmz files or .sqlitedb/.mbtiles maps on iOS 13."},{"version_id":"833003652","version_name":"1.9.8","version_date":"2019-10-23 10:26:06.000 +0800","version_description":"More optimisations and fixes for iOS 13(1.3).<br>Fixed GPX export for waypoints (Huge thanks to Robert for reporting the problem)."},{"version_id":"833299188","version_name":"1.9.9","version_date":"2019-10-31 07:30:38.000 +0800","version_description":"More fixes and optimizations for iOS 13.0-13.2:<br>Fixing a very rare crash in the app in iOS 13 when using offline maps. Huge thanks to Roman for reporting this (a very hard to reproduce one!) and helping with testing the fix."},{"version_id":"833411784","version_name":"1.9.10","version_date":"2019-11-25 07:46:46.000 +0800","version_description":"・Optimized for iOS 13.2+.<br>・You can now customize upper screen corners (left and right). Look for ⋮ buttons and tap on them to see the options. Options for the main screen and map corners are independent on each other. Different corner panels can be shown when map follows your location or when you browse/move the map.<br>+ A few options are provided for these new corners, please let us know via Feedback what else you'd like to add.<br>Bon voyage!"},{"version_id":"833743286","version_name":"2.0","version_date":"2020-06-12 12:59:50.000 +0800","version_description":"・ Optimized for iOS 13.5.<br>・ Personal GPS Locator Beacon:<br>  - Option to create your personal GPS Beacon and provide your loved ones with a web link to follow your location in a web browser.<br>  - Your location breadcrumb is only sent to your personal GPS beacon when it is enabled and you record a track.<br>  - You can protect access to your GPS Beacon web link with a password or disable access at any moment.<br>・ Option to order points list by the date of creation (descending), instead of a date of the last update. (MENU &gt; Waypoints &gt; Tap on a filter).<br>・ Option to show route connection points as small dots (Map Settings &gt; Common settings &gt; Annotations).<br>・ Better track points approximation for the Google map.<br>・ Better import of GPX tracks, especially from drones where speed is often present inside the trkpt element.<br>・ Bug fixes and optimizations."},{"version_id":"836391702","version_name":"2.0.1","version_date":"2020-06-17 05:22:17.000 +0800","version_description":"・ More optimizations for iOS 13.5 (better handling for low speed and accuracy cases).<br>・ Personal GPS Locator Beacon:<br>  - Option to create your personal GPS Beacon and provide your loved ones with a web link to follow your location in a web browser.<br>  - Your location breadcrumb is only sent to your personal GPS beacon when it is enabled and you record a track.<br>  - You can protect access to your GPS Beacon web link with a password or disable access at any moment.<br>・ Option to order points list by the date of creation (descending), instead of a date of the last update. (MENU &gt; Waypoints &gt; Tap on a filter).<br>・ Option to show route connection points as small dots (Map Settings &gt; Common settings &gt; Annotations).<br>・ Better track points approximation for the Google map.<br>・ Better import of GPX tracks, especially from drones where speed is often present inside the trkpt element.<br>・ Bug fixes and optimizations."},{"version_id":"836448929","version_name":"2.0.2","version_date":"2020-07-02 15:18:09.000 +0800","version_description":"・ Google maps updated to version 3.9.0.<br>・ Bug fixes and optimizations:<br>\t‣ Option to set activity type to further optimize GPS tracking accuracy: Automotive, Fitness, Airborne, Other (boat, train). Settings &gt; Advanced settings &gt; GPS Tracking &gt; Activity type.<br>\t‣ Fixed visibility of place and address search for the dark mode.<br>\t‣ Optimized handling of speed and distance for low GPS accuracy."},{"version_id":"836686439","version_name":"2.0.3","version_date":"2020-07-28 07:04:48.000 +0800","version_description":"・ Bug fixes and optimizations:<br>‣ Optimized for iOS 13.6.<br>‣ Fixes for users that are using 12 hours (AM/PM) time format.<br>Please, everyone stay safe!"},{"version_id":"837504876","version_name":"2.1","version_date":"2020-09-24 20:53:23.000 +0800","version_description":"・ Optimized for iOS 14.<br>・ Updated airplane map pointer.<br>・ Added helicopter map pointer.<br>・ Bug fixes and optimizations."},{"version_id":"838000607","version_name":"2.1.1","version_date":"2020-09-29 20:06:52.000 +0800","version_description":"Fixed the issue when route and target lines would not be shown on the offline maps for iOS 14."},{"version_id":"838151498","version_name":"2.2","version_date":"2021-05-16 10:20:37.000 +0800","version_description":"◆Optimized for iOS 14.5.<br>◆Import/Export:<br>・The app should now always be offered as 'Open In' option for GPX files.<br>・Tracks (gx:track and Geometry) can now be imported from KMZ files (only one kml file is supported inside the kmz archive, but it may contain multiple tracks).<br>・Added GPX export option for the whole trip export (with all tracks). Please note that empty tracks are not exported as Garmin Connect can't import empty tracks anyway. GPX export also generates quite bigger files, compared to KMZ.<br>・New option to convert route point collection to a track.<br>◆Point editor:<br>・Note text field is moved to its own section at the bottom of a point editor screen.<br>・Point notes now support multiple lines.<br>・Fixed the bug in point editor when subsequent record/play sessions would play the first recording played, not the most recently recorded audio note.<br>◆Offline and custom maps:<br>・Fixed crash when selecting offline map area in iOS 9.<br>・Refreshed Custom map source editor screen.<br>◆Voice coach:<br>・Fixed an issue when new voice coach can't be added after deleting all existing voice coaches.<br>◆Camera, photo and audio attachments:<br>・Using downscaled image thumbnails where image previews are shown, e.g. in the points list.<br>◆Other improvements and fixes:<br>・New Maintenance screen in the settings allows to delete temporary files in the app.<br>・All import/export and sharing operations were reviewed to only create temporary files in the system's temporary folder that is being cleaned by iOS automatically after some period of time."},{"version_id":"842232588","version_name":"3.0","version_date":"2021-07-15 09:30:35.000 +0800","version_description":"◆ Waypoint collections:<br>・MENU &gt; WAYPOINT COLLECTIONS. Tap on a collection row now shows collection action menu.<br>・The above mentioned menu adds option to clone the whole collection.<br>◆ Camera, photo and audio attachments:<br>・Added option to pick the camera device/type for iPhones/iPads with multiple cameras.<br>・Manual exposure adjustment now uses target exposure bias. This should correspond to how exposure adjustment works in the stock camera app.<br>◆ Other improvements and fixes:<br>・Triangle map cursor is now bigger and has white border added.<br>・Fixed the rare crash when track recording was so long that recording was switching from detailed to stats only.<br>・Fixed the crash during KML/KMZ import when Point element would not have a coordinates sub element. Now kml points with no coordinates are ignored on import.<br>・Removed support for iOS 9-11."},{"version_id":"843111000","version_name":"3.1","version_date":"2021-09-22 15:13:04.000 +0800","version_description":"・Optimized for iOS 15.<br>・Google maps updated to version 5.1.0.<br>◆ MENU &gt; NEW TRACK:<br>・Menu button now shows current tracking settings and includes a settings button to change these settings.<br>◆ MENU &gt; TRIPS:<br>・Menu button now shows the active trip.<br>◆ MENU &gt; WAYPOINT COLLECTIONS:<br>・Shows the default collection name.<br>◆ Changes to GPS tracking workflow:<br>・You can now change the active trip while tracking. The app will ask if you want to create a new track under the newly active trip.<br>・If you try to disable the background mode while GPS track is being recorded - the app will give you a warning.<br>◆ Other improvements and fixes:<br>・Added help for individual counters reset in the trip editor.<br>・Added help for trips and tracks screens.<br>・Fixed the rare crash when built-in iPod player was trying to show an artwork for the song."}]