[{"version_id":"815226536","version_name":"10.31","version_date":"2015-12-11 22:20:13.000 +0800","version_description":"Remember...High ratings keep us motivated to keep adding features. :)<br><br>CRITICAL UPDATE–PLEAES READ!  THIS UPDATE FIXES THE PROBLEM WITH WEB SEARCHES not brining up any results.  Please read this to learn how the new version works.  <br><br>WHAT HAPPENED?  WHY DID THE APP STOP WORKING?  Our app used Google's free Image Search feature for the web library searches.  3rd party apps use what is called an \"API\" to communicate with the Google image feature.  On December 1st, Google deprecated (discontinued support for) their free image search API and turned it off, breaking our app's web searches, causing any web image searches to stop working.  <br><br>HOW DID YOU FIX IT?  Google has replaced their free API with a paid version.  However, using Google's new paid API was not an option for us, as it would cost way more than what we charge for the app, so that was not feasible.  So, What we did was to actually embed the Google Image search web page right into the app.  This restores the complete web search functionality to the app, but behaves a little differently. Please keep reading to understand how the new system works:<br><br>- The Web Library tab has been renamed the Web Search tab and the My Library tab has been renamed to Favorites.<br><br>- You perform web searches just as before, by either selecting one of the \"featured\" searches (i.e. Happy Birthday, Good Morning, I Miss You, etc.) or entering in what you're looking for (i.e. red corvette, funny baby, etc.).<br><br>- Now, however, instead of the results showing up in the normal thumbnail view like it was before (and how it still works on the Library tab), it will actually show you the search results in a Google web page.  Scroll down to see the thumbnails, which look better in many ways, as they keep the aspect ratio of the image and show them larger.  When you find one you like, tap on it, and swipe right and left as usual.  HOWEVER, and this is the important part, to use one of the images (to customize, share, crop, etc.), you HOLD YOUR FINGER DOWN ON THE IMAGE FOR A SECOND and it will pull that image into the app, so you can customize it, share it, save it, etc.<br><br>- IMPORTANT!  If you hold your finger down on one of the thumbnails, it will only bring in a low resolution version of the image, and any animations will not play, so be sure and tap on the thumbnail first, so it enlarges to full resolution, and then hold your finger on that image to pull it into the app.  (NOTE:  It may take a second or two for the full resolution version of the image to download, and you can't pull the image into the app until it has, so if you hold your finger down for a second or two, and it doesn't pull in, it is likely still getting the high res version, so just lift your finger and try again.)<br><br>- Here is a video that shows how this works, if you need help with this:  http://tinyurl.com/clipishwebsearch<br><br>Sorry for any inconvenience to you that was caused by Google discontinuing their free image API, but we hope you'll continue to enjoy the app as always with the changes we've made.  Thanks!"},{"version_id":"816151412","version_name":"10.32","version_date":"2016-01-23 06:41:32.000 +0800","version_description":"Remember...High ratings keep us motivated to keep adding features. :)<br>- Fixed slowness issues with Recents tab images.<br>- Fixed crashing issues on iPad.<br>- Misc. bug fixes."},{"version_id":"816441848","version_name":"10.33","version_date":"2016-02-19 00:45:01.000 +0800","version_description":"Remember...High ratings keep us motivated to keep adding features. :)<br><br>- BUG FIXED:  The app won't reset every time it's restarted, allowing you to leave the app to paste an image, then return to the app were it left off.  (It will, however, reset after 10 minutes of being away from the app.)<br><br>- BUG FIXED:  Fixed an issue where the user sometimes couldn't save a video or sound file to their photo library.<br><br>- iOS 9.x has a bug where sometimes the Copy and Paste feature won't work (it will not move a copied item to the keyboard to be pasted).  We have coded in a work-around into our app to avoid this issue.<br><br>- Misc. crashing when staring app and other bug fixes."},{"version_id":"818075357","version_name":"10.34","version_date":"2016-07-21 17:59:41.000 +0800","version_description":"Remember...High ratings keep us motivated to keep adding features. :)<br><br>- Fixed an issue when rendering scrolling text to video that it wouldn't show the progress bar unless you tapped Cancel.<br>- Misc. bug fixes."},{"version_id":"819558358","version_name":"10.35","version_date":"2016-12-02 13:44:11.000 +0800","version_description":"IMPORTANT WARNING!  ***DO NOT INSTALL THIS UPDATE*** This update introduced a bug that would crash the app when going to the Favorites tab on certain devices.  We would recommend that you do NOT update to this version.  We have already submitted the next version that corrects this problem and it is awaiting Apple's review and should be available soon.  Sorry for the problems."},{"version_id":"820000920","version_name":"10.36","version_date":"2016-12-02 22:35:14.000 +0800","version_description":"Remember...High ratings keep us motivated to keep adding features. :)<br><br>- Fixed crashing issue when going to Favorites tab and other areas of app.<br>- Renamed from CLIPish Pro 2 to just CLIPish Pro<br>- Fixed an issue where sometimes holding your finger down on an image in Web Search did not return the correct image.<br>- Misc. bug and crash fixes."},{"version_id":"820236994","version_name":"10.37","version_date":"2017-01-19 23:59:38.000 +0800","version_description":"Remember...High ratings keep us motivated to keep adding features. :)<br><br>- Fixed issue where sometimes when rendering video for a scrolling credit the progress bar would not be visible.<br>- Misc. bug and crash fixes."},{"version_id":"822159784","version_name":"10.38","version_date":"2017-05-17 23:41:37.000 +0800","version_description":"Remember...High ratings keep us motivated to keep adding features. :)<br><br>• NEW!  Daily Image widget added.  You can now go to the More tab, then to Settings, and select a keyword for a daily image to appear in your iPhone's widgets section."},{"version_id":"824395682","version_name":"11.01","version_date":"2017-11-21 19:12:12.000 +0800","version_description":"* Added support for your groovy new iPhone X.<br>* New, cleaner interface.<br>* Due to issues with inappropriate images appearing on the Recents tab, we have been required by Apple to remove the Recently Used by Others section.  The Recent tab now only shows YOUR recently used images (not OTHERS).<br>* Streamlined the app and features to make CLIPish Pro faster and easier to use.  Removed old legacy features that were rarely used, such as skins, frames, shelves, and the slide show.<br>* Web searches now filter out many of the more popular stock image companies, helping avoid watermarks.  This will improve over time even more.<br>* Fixed a bug where if you went to the More tab too quickly after starting the app, nothing would appear.<br>* Several other misc. bug fixes and enhancements.<br><br>Remember...High ratings keep us motivated to keep adding features. :)"},{"version_id":"824738416","version_name":"11.02","version_date":"2017-11-28 19:08:24.000 +0800","version_description":"* Fixed a bug for the iPhone X when adding text and selecting the font color (couldn’t exit page).<br><br>Remember...High ratings keep us motivated to keep adding features. :)"},{"version_id":"825044806","version_name":"11.03","version_date":"2017-11-30 19:48:43.000 +0800","version_description":"* Fixed a bug for the iPhone X when adding text and selecting the font color (couldn’t exit page).<br><br>Remember...High ratings keep us motivated to keep adding features. :)"},{"version_id":"825225802","version_name":"11.05","version_date":"2018-01-04 23:48:18.000 +0800","version_description":"- Fixed some issues for some users with the Premium Access Pass subscriptions.  Things should now work correctly, and you should still have your subscription if you delete and re-install the app.  You can now also run the app on multiple devices and your subscription will work on new device, provided you're logged in with the same iTunes account.<br><br>Remember...High ratings keep us motivated to keep adding features. :)"},{"version_id":"826387721","version_name":"11.06","version_date":"2018-03-26 18:32:27.000 +0800","version_description":"- We removed the button to play or not play animations in the thumbnails.  It now always plays the animations in thumbnails.<br>- Misc. bug fixes.  <br><br>Remember...High ratings keep us motivated to keep adding features. :)"},{"version_id":"827214887","version_name":"11.07","version_date":"2018-05-20 23:09:54.000 +0800","version_description":"Remember...High ratings keep us motivated to keep adding features. :)<br><br>* Misc. bug fixes.<br>* New images."},{"version_id":"832966017","version_name":"11.08","version_date":"2019-10-01 22:27:44.000 +0800","version_description":"Remember...High ratings keep us motivated to keep adding features. :)<br><br>* Updated for iOS 13.<br>* Misc. bug fixes and enhancements."},{"version_id":"833044546","version_name":"11.09","version_date":"2019-10-07 19:20:57.000 +0800","version_description":"Remember...High ratings keep us motivated to keep adding features. :)<br><br>* Fixed compatibility issues with iOS 13, including: problems when running in Dark Mode (“invisible” text in search field, etc.), passcode not working correctly when starting app, and problems adding scrolling text to an image.<br>* Misc. bug fixes and enhancements."},{"version_id":"833100145","version_name":"11.11","version_date":"2019-10-10 14:27:07.000 +0800","version_description":"Remember...High ratings keep us motivated to keep adding features. :)<br><br>* Fixed compatibility issues with iOS 13, including: problems when running in Dark Mode (“invisible” text in search field, etc.), passcode not working correctly when starting app, and problems adding scrolling text to an image.<br>* Misc. bug fixes and enhancements."},{"version_id":"833144292","version_name":"11.13","version_date":"2019-10-12 14:54:31.000 +0800","version_description":"Remember...High ratings keep us motivated to keep adding features. :)<br><br>* Fixed crash when trying to “Save ALL” images from a Favorites folder.<br>* Misc. bug fixes and enhancements."},{"version_id":"833147983","version_name":"11.14","version_date":"2019-10-13 13:47:39.000 +0800","version_description":"Remember...High ratings keep us motivated to keep adding features. :)<br><br>* Fixed colors of media selector on iPad.<br>* Misc. bug fixes and enhancements."},{"version_id":"833424737","version_name":"11.15","version_date":"2019-11-01 03:24:10.000 +0800","version_description":"Remember...High ratings keep us motivated to keep adding features. :)<br><br>* Fixed issue with Draw feature for iOS 13 users.<br>* Misc. bug fixes and enhancements."},{"version_id":"834014221","version_name":"11.16","version_date":"2019-12-14 23:05:58.000 +0800","version_description":"Remember...High ratings keep us motivated to keep adding features. :)<br><br>* Fixed an issue rendering videos from Favorites tab.<br>* Misc. bug fixes and enhancements."},{"version_id":"841084556","version_name":"11.17","version_date":"2021-03-27 21:01:00.000 +0800","version_description":"Remember...High ratings keep us motivated to keep adding features. :)<br><br>- Fixed a bug when using the Eraser tool to erase portions of clip art that you are adding to an image.<br>- Made swiping through images on the Web Search page smoother.<br>- App now requires iOS 12 or later.<br>- Misc. bug fixes and enhancements."},{"version_id":"841180626","version_name":"11.21","version_date":"2021-04-02 17:25:34.000 +0800","version_description":"Remember...High ratings keep us motivated to keep adding features. :)<br><br>- Fixed an issue with not being able to change font colors and add a shadow to text.<br>- Fixed an issue that would prevent adding sound to some images.<br>- Fixed crashing issue for some users when starting the app.<br>- Fixed issue on Web Search tab to display more images (vs only a few and then requiring a Next button to view more).<br>- Fixed a bug when using the Eraser tool to erase portions of clip art that you are adding to an image.<br>- Made swiping through images on the Web Search page smoother.<br>- Fixed issue when adding scrolling text that user couldn't see the image had finished rendering.<br>- App now requires iOS 12 or later.<br>- Misc. bug fixes and enhancements."}]