[{"version_id":"814975143","version_name":"3.0","version_date":"2015-12-03 10:08:01.000 +0800","version_description":"We doubled EVERYTHING. It's the biggest Beardify update EVER! Now:\n - 2x MORE BEARDS (Details below)\n - Beards are TWICE the original resolution - For EVEN HIGHER follicle accuracy! \n - Every original beard style has been upgraded, HAIR by HAIR. \n - The \"Stache Pack\" unlocks double the Stache-beard combos (available when you have Stacheify)\n - Premium \"More Beards\" pack now unlocks twice the special beard styles (including Mutton Chops, Bat Beards, AND CAT Beards!)\n\nNEW Beard styles:\n - Stubble: Since even the most majestic beards started as stubble.\n - Garibaldi: Wide, rounded and BIG. The more natural… the better.\n - Beardsman: Gloriously full, natural beard. More than a beard… a lifestyle.\n - Verdi: Full beard, short and rounded at bottom with a stylish mustache.\n - Hulihee: HUGE, fearsome mutton chops. “Hulihee” means “Turn and flee” in Hawaiian.\n - Friendly Hulihee: Add a Handlebar Mustache to connect Hulihee chops! \n - Shenandoah: Poised without a Mustache, grown full and long over the jaw and chin.\n - Old Dutch: Large, long, flared outwards at the bottom, and favored by Lumberjacks!\n\nNEW FEATURES: \n - iPad Support! Also, native iPhone 6 & 6+ interface support\n - Completely reworked beard hair colors: NOW match your hair with Black, Dark Brown, Light Brown, and Gray beards\n - Share videos of the “Beard Drop”, “Beard Smack” and “Beard Sneeze” animations \n\nAs always, if you love the new content we appreciate your reviews on the App Store. If you have any issues at all, feel free to get in touch with us directly at support@apptl.ly.\n\nBeard on! \n- The Apptly Team"},{"version_id":"815855362","version_name":"3.0.1","version_date":"2016-01-13 07:14:47.000 +0800","version_description":"Bug fixes"},{"version_id":"819581157","version_name":"3.1","version_date":"2016-11-06 03:32:47.000 +0800","version_description":"- Voice recording is BACK!\n- iOS 10 support\n- Stability and performance improvements"},{"version_id":"821183359","version_name":"3.1.1","version_date":"2018-10-29 21:02:01.000 +0800","version_description":"Added links to our apps."},{"version_id":"821183359","version_name":"3.1.1","version_date":"2018-10-29 21:02:01.000 +0800","version_description":"Added links to our apps."}]