[{"version_id":"13678697","version_name":"1.0.0","version_date":"","version_description":""},{"version_id":"15828356","version_name":"1.1.0","version_date":"","version_description":""},{"version_id":"16480037","version_name":"1.2.1","version_date":"","version_description":""},{"version_id":"16719831","version_name":"1.2.1","version_date":"","version_description":""},{"version_id":"200972639","version_name":"1.5.0","version_date":"","version_description":""},{"version_id":"327572633","version_name":"1.6.0","version_date":"","version_description":""},{"version_id":"458512744","version_name":"1.7.1","version_date":"","version_description":""},{"version_id":"476822674","version_name":"1.7.2","version_date":"","version_description":""},{"version_id":"572292671","version_name":"1.8.0","version_date":"","version_description":""},{"version_id":"588892782","version_name":"1.8.1","version_date":"","version_description":""},{"version_id":"63612645","version_name":"1.3.0","version_date":"","version_description":""},{"version_id":"637862692","version_name":"2.0.1","version_date":"","version_description":""},{"version_id":"694962662","version_name":"2.1.1","version_date":"","version_description":""},{"version_id":"781332682","version_name":"2.4.1","version_date":"","version_description":""},{"version_id":"811136514","version_name":"2.5.0","version_date":"2014-12-08 08:54:34.000 +0800","version_description":"THE ARCTIC BASE! This new area is full of snow, speed, and science! Take on cool new levels with unique obstacles and discover the TOP SECRET area: The Arctic Base interior! \n- Join a special holiday quest to help Dr. Nefario and recover lost decorations and gifts as you run through The Arctic Base\n- Unlock the Snowboard mini-game by completing the holiday quest\n- 12 Days of Deals: Check back every day for holiday promotions and login rewards"},{"version_id":"811689442","version_name":"2.6.1","version_date":"2015-02-04 11:07:08.000 +0800","version_description":"LOVE IS IN THE AIR! Celebrate Valentine’s Day with Despicable Me: Minion Rush and go for a run in Minion Park! \n- Help Dr. Nefario organize the Wedding Party for Lucy and Gru: Prepare the cake and collect flowers to make everything perfect for the big day!\n- Hop on a skateboard, grind some rails and perform tricks in the new mini-game! \n- Cupid Minion costume returns to spread the love!"},{"version_id":"811732213","version_name":"2.6.2","version_date":"2015-02-10 11:00:30.000 +0800","version_description":"LOVE IS IN THE AIR! Celebrate Valentine’s Day with Despicable Me: Minion Rush and go for a run in Minion Park! \n- Help Dr. Nefario organize the Wedding Party for Lucy and Gru: Prepare the cake and collect flowers to make everything perfect for the big day!\n- Hop on a skateboard, grind some rails and perform tricks in the new mini-game! \n- Cupid Minion costume returns to spread the love!"},{"version_id":"812025213","version_name":"2.7.1","version_date":"2015-03-25 08:31:08.000 +0800","version_description":"WELCOME CARL to Minion Rush! He is now a permanent runner option in the game.\nChoose between Dave and Carl to run in Eduardo's spectacular Mexican abode! Discover the secret areas inside his house, all atop a rocky mountain! Crash Eduardo's Party and be mischievous for April Fools' Day while helping Dr. Nefario set up the seasonal event! Do tricks with a BMX bike on the canyon! \n- New BMX Bike Mini-Game\n- Play in Eduardo's House, the newest location\n- New seasonal Event for April Fools' Day\n\n"},{"version_id":"812306947","version_name":"2.8.1","version_date":"2015-05-06 08:22:11.000 +0800","version_description":"SPRING HAS SPRUNG, so make a clean sweep of this new event!\nNEW MINION\n- Give a big welcome to Jerry!\n- Jerry’s skills allow him to use Power-Ups longer than other Minions.\nSPRING EVENT\n- Collect Flowers, Umbrellas & Butterflies for fresh rewards.\n- Watch a hilarious new video starring Jerry.\nHIGH-FLYIN’ MINI-GAME\n- Keep Jerry afloat as he drifts across the sky.\n MORE COOL STUFF\n- Complete sub-objectives for each Milestone to earn Perks or Tokens."},{"version_id":"812397941","version_name":"2.8.2","version_date":"2015-05-18 10:01:55.000 +0800","version_description":"SPRING HAS SPRUNG, so make a clean sweep of this new event!\nNEW MINION\n- Give a big welcome to Jerry!\n- Jerry’s skills allow him to use Power-Ups longer than other Minions.\nSPRING EVENT\n- Collect Flowers, Umbrellas & Butterflies for fresh rewards.\n- Watch a hilarious new video starring Jerry.\nHIGH-FLYIN’ MINI-GAME\n- Keep Jerry afloat as he drifts across the sky.\n MORE COOL STUFF\n- Complete sub-objectives for each Milestone to earn Perks or Tokens."},{"version_id":"812652229","version_name":"3.0.0","version_date":"2015-06-23 07:01:13.000 +0800","version_description":"Race into exciting and friendly competition with this new update for Despicable Me: Minion Rush. In Minion Race mode, you can:\n• Choose between Dave, Carl or Jerry to be your racer\n• Compete against 2 other Minions in Super Silly Fun Land\n• Sabotage your rivals or avoid their attacks by using cool gadgets\n• Outrun other players' Minions and reach the top of the leaderboard to earn awesome rewards\n"},{"version_id":"812967753","version_name":"3.1.0","version_date":"2015-08-05 07:39:31.000 +0800","version_description":"Get ready for the BOOM! Because we’re bringing the Volcano and an explosion of new features in this update to Minion Rush!\n• The Volcano: Race through this new hot spot in 15 additional Jelly Lab levels!\n• Seasonal Event: Join the Minion Safari and explore the tropics -- win cool prizes, including the Hunter costume.\n• New Gadgets: Maximize the mayhem in your Minion Races!\n• Motocross Bike Mini-Game: Sail through the sky and pull off amazing stunts!"},{"version_id":"813292191","version_name":"3.2.0","version_date":"2015-09-17 07:36:15.000 +0800","version_description":"Go back to school with the Minions in this new update for Despicable Me: Minion Rush!\n• Now 4 MORE COSTUMES will power up your Gadgets\n• Outrun the clock in the challenging new TIME-ATTACK MODE in Minion Races\n• MINION RACES are now headed to the Mall\n• BACK-TO-SCHOOL SPECIAL EVENT: Gear up for class by grabbing Backpacks, Notebooks, and Lunchboxes\n• SCOOTER MINI-GAME: Pull off some speedy stunts and collect bonus back-to-school items\n• 15 NEW LEVELS in the Jelly Lab"},{"version_id":"814060500","version_name":"3.3.0","version_date":"2015-11-04 09:05:40.000 +0800","version_description":"Join the Horror Night Party and don't miss out on what's new in Minion Races or the Minion Submarine mini-game!\n- Complete the Special Mission: Horror Night Party and get the Vampire Minion costume\n- When you finish the Special Mission, compete in new leaderboards to win the brand-new Disco Minion costume\n- Get your hands on two brand-new gadgets for Minion Races: the Shrink Ray and the Laser Poles\n- Now compete in Minion Races set in the Anti-Villain League Submarine"},{"version_id":"814819571","version_name":"3.4.0","version_date":"2015-12-14 08:10:09.000 +0800","version_description":"Catch the spirit of the holidays with Minion Rush in this festive new update!\n - Collect Holiday-themed items such as the Holiday Bell, Santa Hat and Bag of Gifts to win Dave's Snowboarder costume in the new Special Mission!\n - Don't miss out on festive treats such as the re-decorated Jelly Lab and the new Bobsleigh mini-game!\n - Race against other players in the Arctic and take advantage of new costume skills available for Dave's Santa and Firefighter costumes in Minion Races!"},{"version_id":"815033490","version_name":"3.4.0","version_date":"2015-12-14 08:10:09.000 +0800","version_description":"Catch the spirit of the holidays with Minion Rush in this festive new update!\n - Collect Holiday-themed items such as the Holiday Bell, Santa Hat and Bag of Gifts to win Dave's Snowboarder costume in the new Special Mission!\n - Don't miss out on festive treats such as the re-decorated Jelly Lab and the new Bobsleigh mini-game!\n - Race against other players in the Arctic and take advantage of new costume skills available for Dave's Santa and Firefighter costumes in Minion Races!"},{"version_id":"815192674","version_name":"3.4.0","version_date":"2015-12-14 08:10:09.000 +0800","version_description":"Catch the spirit of the holidays with Minion Rush in this festive new update!\n - Collect Holiday-themed items such as the Holiday Bell, Santa Hat and Bag of Gifts to win Dave's Snowboarder costume in the new Special Mission!\n - Don't miss out on festive treats such as the re-decorated Jelly Lab and the new Bobsleigh mini-game!\n - Race against other players in the Arctic and take advantage of new costume skills available for Dave's Santa and Firefighter costumes in Minion Races!"},{"version_id":"816206814","version_name":"3.5.0","version_date":"2016-01-27 13:06:00.000 +0800","version_description":"Despicable Me: Minion Rush has lots to celebrate in February with Rio's Carnival and Valentine's Day!\n- Fall in love with the new Romance for All Special Mission and win the Cupid Minion Costume \n- Unlock the new Skater Minion Costume with Blueprints \n- Go rollerblading, do tricks & evade obstacles in the new mini-game\n- Dress up with Carl and Jerry's Carnival Hats – wearing them improves your Minion's ability  \n- Play the Carnival-themed Minion Races to win great rewards and more!"},{"version_id":"816208274","version_name":"3.5.0","version_date":"2016-01-27 13:06:00.000 +0800","version_description":"Despicable Me: Minion Rush has lots to celebrate in February with Rio's Carnival and Valentine's Day!\n- Fall in love with the new Romance for All Special Mission and win the Cupid Minion Costume \n- Unlock the new Skater Minion Costume with Blueprints \n- Go rollerblading, do tricks & evade obstacles in the new mini-game\n- Dress up with Carl and Jerry's Carnival Hats – wearing them improves your Minion's ability  \n- Play the Carnival-themed Minion Races to win great rewards and more!"},{"version_id":"816211008","version_name":"3.5.0","version_date":"2016-01-27 13:06:00.000 +0800","version_description":"Despicable Me: Minion Rush has lots to celebrate in February with Rio's Carnival and Valentine's Day!\n- Fall in love with the new Romance for All Special Mission and win the Cupid Minion Costume \n- Unlock the new Skater Minion Costume with Blueprints \n- Go rollerblading, do tricks & evade obstacles in the new mini-game\n- Dress up with Carl and Jerry's Carnival Hats – wearing them improves your Minion's ability  \n- Play the Carnival-themed Minion Races to win great rewards and more!"},{"version_id":"816738141","version_name":"3.6.0","version_date":"2016-03-23 08:56:14.000 +0800","version_description":"Explore our biggest update of the year, including the Pier 12 location, the new Jelly Jobs feature and more!\n- Run through Pier 12, a new location inspired by Despicable Me 2, and avoid exciting new obstacles\n- Sign up for Jelly Jobs! Get awesome job titles and rewards by finding new collectibles, then earn a well-deserved promotion\n- Play the Trickster Stories Special Mission and collect hilarious items to win the Surfer Minion Costume\n- Conquer the waves on a Rocket Ski in the new mini-game\n- Enjoy an exclusive gift only available for new players on iOS - includes a free costume and more!"},{"version_id":"817238699","version_name":"3.7.0","version_date":"2016-05-11 08:15:43.000 +0800","version_description":"It’s time for sports in this new update! Play the Soccer mini-game, get the brand-new Soccer Costume for Dave and join our ReplayKit contest!\n- Run through the Residential Area, collect sports equipment for Dr. Nefario, and win the Quarterback Costume. \n- Collect enough Blueprints to unlock the Soccer Costume.\n- Take the Minions to the soccer field in the Soccer mini-game.\n- Record and share your videos -- they could be featured on our YouTube channel!"},{"version_id":"817845100","version_name":"3.8.0","version_date":"2016-06-29 07:02:43.000 +0800","version_description":"Go on a trip fit for a pharaoh in the next Despicable Me: Minion Rush update!\n- Run in the Pyramids location and discover the new secret area\n- Collect all of the Cameras, Water Canteens and Souvenirs during the new special mission: Family Vacation\n- Glide through an Egyptian oasis in the new Kite Ski mini-game\n- Get the new Cleopatra costume for Dave and rule the land"},{"version_id":"818400927","version_name":"3.9.0","version_date":"2016-08-10 20:46:37.000 +0800","version_description":"The Minion Games have arrived in the new Despicable Me: Minion Rush update!\n- Summer is here and the Minion Beach is filling up with Minions! This location is now available for Minion Races!\n- Collect all of the Torches, Dumbbells and Laurel Wreaths during the new Special Mission: Minion Games.\n- Get the new Athenian costume for extra Near-Misses.\n- Submerge yourself in the new Diving Mini-Game."},{"version_id":"818874629","version_name":"4.0.0","version_date":"2016-09-21 15:06:50.000 +0800","version_description":"It’s time to mow some lawns and mess things up in the new Despicable Me: Minion Rush update!\n- Upgrade your Costumes to add new Golden Skills to them with Dr. Nefario's Fabulous Costume Improver.\n- New Rush Avoiding mode! Run while avoiding certain actions, from collecting Bananas to performing Despicable Actions!\n- Collect all of the Garden Shovels, Gnomes and Piggy Banks during the new Special Mission: Mower Minions!\n- Get the new Hazmat Costume and get free Revives in certain locations.\n- Perform cool tricks with the Minion Mower in the new mini-game!"},{"version_id":"819237866","version_name":"4.1.0","version_date":"2016-10-17 16:00:05.000 +0800","version_description":"Race into Halloween hijinks in the new Despicable Me: Minion Rush update!\n- The Halloween Residential Area is here! Celebrate Halloween and perform more despicable deeds than anyone else!\n- Dave is wearing two new Costumes this Halloween season! Get the Bride of Frankenstein and Ghost Costumes.\n- Collect all of the spooky Toy Spiders, Toy Skulls and Halloween Candy during the new Special Mission: Haunted Hustle.\n- Save the Minions from alien abduction by playing the new UFO mini-game.\n- Go live with ReplayKit on iOS 10 and broadcast your despicable game sessions now."},{"version_id":"819966537","version_name":"4.2.1","version_date":"","version_description":""},{"version_id":"820685370","version_name":"4.3.0","version_date":"2017-02-01 15:12:48.000 +0800","version_description":"We've got an all-new Despicable Me: Minion Rush update! \n- Join the NEW Special Mission, HUNTING FOR LOVE, where you run through beautiful MINION PARK.\n- Collect Perfumes, Teddy Bears and Cupid Arrows to complete this special Valentine's Day-themed mission.\n- Get the FAIRY PRINCESS COSTUME, inspired by the Despicable Me 2 movie.\n- Go for a joy ride in the new LOVE SCOOTER mini-game to pick up even more items!"},{"version_id":"821150759","version_name":"4.4.0","version_date":"2017-03-15 17:32:11.000 +0800","version_description":"Time for a thrilling adventure in the new Despicable Me: Minion Rush update!\n- Explore SUPER SILLY FUN LAND in the new Special Mission: TRIP TO THE THEME PARK.\n- Collect BALLOONS, FIREWORKS and COTTON CANDY while enjoying your day out.\n- Get the brand-new BARKER COSTUME and Power-Up!\n- Fly above the clouds in the new AIRPLANE mini-game."},{"version_id":"821449917","version_name":"4.4.1","version_date":"2017-03-24 17:05:44.000 +0800","version_description":"Minor bugs fixed"},{"version_id":"821768249","version_name":"4.5.0","version_date":"2017-04-26 20:02:30.000 +0800","version_description":"Go back to the 80’s in the rad new Despicable Me: Minion Rush update! \nDiscover awesome content from Illumination’s upcoming movie, Despicable Me 3, in theaters June 30 in the U.S.\n- Travel back in time in the new Special Mission: BUBBLE GUM INVASION EPISODE 1: BACK TO THE 80’s.\n- For the first time in the game, help Gru and Lucy collect cool 80’s items: CASSETTE TAPES, SNEAKERS and CELL PHONES.\n- Be righteously fluorescent with the new STEREO COSTUME.\n- Play the new FEVER MODE while running in GRU’S LAB.\n- To be continued..."},{"version_id":"821859293","version_name":"4.5.0","version_date":"2017-04-26 20:02:30.000 +0800","version_description":"Go back to the 80’s in the rad new Despicable Me: Minion Rush update! \nDiscover awesome content from Illumination’s upcoming movie, Despicable Me 3, in theaters June 30 in the U.S.\n- Travel back in time in the new Special Mission: BUBBLE GUM INVASION EPISODE 1: BACK TO THE 80’s.\n- For the first time in the game, help Gru and Lucy collect cool 80’s items: CASSETTE TAPES, SNEAKERS and CELL PHONES.\n- Be righteously fluorescent with the new STEREO COSTUME.\n- Play the new FEVER MODE while running in GRU’S LAB.\n- To be continued..."},{"version_id":"822101644","version_name":"4.6.0","version_date":"2017-05-24 16:20:58.000 +0800","version_description":"Bubble Gum is taking over Downtown! Who’s behind this despicable deed?\nFind out more in the new Despicable Me: Minion Rush update, featuring exclusive content from Illumination’s Despicable Me 3, in theaters June 30 in the U.S.\n- Investigate with the Minions in the new Special Mission, BUBBLE GUM INVASION -- EPISODE 2: OPERATION BUBBLE GUM.\n- Keep the 80’s vibe alive by collecting CARTRIDGES, CALCULATOR WATCHES and TAPE PLAYERS.\n- Go undercover with the new SPY MINION COSTUME.\n- More to come..."},{"version_id":"822642742","version_name":"4.7.0","version_date":"2017-06-28 16:00:56.000 +0800","version_description":"Solve the mystery behind the Bubble Gum in the new Despicable Me: Minion Rush update which features exclusive content from Illumination's Despicable Me 3, in theaters June 30 in the U.S.\n- Play new Special Mission BUBBLE GUM INVASION -- EPISODE 3: ATTACK OF THE BUBBLES.\n- Explore a BRAND-NEW location, BRATT'S LAIR, inspired by the criminal mastermind of Despicable Me 3.\n- Get the new ISLAND HOPPER Costume for a limited time only by logging into the game daily. \n- Complete the Special Mission by collecting awesome new items: YO-YOS, KEYTARS and RUBIK'S CUBES.\n- Get physical wearing the new BRATT'S WORKOUT Costume."},{"version_id":"823092322","version_name":"4.8.0","version_date":"2017-08-09 18:10:40.000 +0800","version_description":"The Minions miss being bad, so they go on strike to convince Gru to go back to his despicable ways. In the meantime, other Minions get promoted and head to the beach with the family.\nGo on strike with the Minions in the new update for Despicable Me: Minion Rush!\n- For the first time ever, play two Special Missions in one update: \"MINIONS ON STRIKE\" and \"MINION VACATION.\"\n- Start collecting MEL CARDS so you can run with Mel, an all-new Minion from Despicable Me 3!\n- Get the new STRIKER COSTUME and show your support for Mel's cause.\n- Learn how to upgrade the Island Hopper Costume."},{"version_id":"823608875","version_name":"4.9.0","version_date":"2017-09-20 17:02:47.000 +0800","version_description":"The Minions’ strike was unsuccessful, so they’ve decided to leave Gru and seek villainy elsewhere. After an unexpected turn of events, the Minions end up on stage in this all-new update for Minion Rush! \n- Perform your heart out in the “SHOWTIME MINIONS” Special Mission.\n- Get the new CANCAN DANCER Costume and be the star of the show.\n- Keep collecting MEL CARDS to unlock Mel, the all-new Minion from Despicable Me 3.\n- Play the spooky Halloween-themed Special Mission “GOOD TO BE BAD” -- going live on October 13."},{"version_id":"823777848","version_name":"4.9.1","version_date":"2017-09-25 21:24:14.000 +0800","version_description":"Minor bugs fixed"},{"version_id":"823919546","version_name":"4.9.2","version_date":"2017-10-13 19:51:13.000 +0800","version_description":"Halloween has never been so despicable in Minion Rush! The spookiest time of the year is here and the Minions are ready to make the most of it. \n- Join the Special Mission, “GOOD TO BE BAD,” and cause a stir in the Residential Area at night!\n- Help the Minions perform mischievous deeds by collecting VAMPIRE TEETH, CAULDRONS and JACK-O’-LANTERNS.\n- Use the new VAMPIRE COSTUME Golden Skill to be wickedly victorious.\n- And don’t forget to collect MEL CARDS to get the brand-new character from Despicable Me 3!"},{"version_id":"824141337","version_name":"5.0.0","version_date":"2017-11-01 17:30:40.000 +0800","version_description":"The Minions have been temporarily detained… but not for long. Help them stage a prison break in the new update for Minion Rush!\n- NEW MISSION: Join the “MINION BREAK” Special Mission and collect TOILETS, PRISON UNIFORMS and BATTERIES.\n- NEW LOCATION: Explore the PRISON location straight out of Despicable Me 3.\n- NEW COSTUME: Wear the PRISONER Costume and break free from the competition.\n- NEW MINION: Keep collecting MEL CARDS to unlock Mel from Despicable Me 3."},{"version_id":"824779814","version_name":"5.0.1","version_date":"2017-11-28 22:11:40.000 +0800","version_description":"Minor bugs fixed"},{"version_id":"825071317","version_name":"5.1.0","version_date":"2017-12-06 18:01:04.000 +0800","version_description":"Minion Rush is going all out for the holidays with a festive new update! Are you ready to unwrap the fun?\n\n***WHAT’S NEW***\n\n- CHRISTMAS CAPER: Join the new holiday-themed Special Mission and make the season merrier for the Minions.\n- NEW COSTUME: Get that warm fuzzy feeling with the Holiday Sweater.\n- SEASONAL LOCATION: Gru’s Lab is now full of holiday decorations.\n- HOLIDAY COLLECTIBLES: Bring on the holiday cheer with CHRISTMAS STOCKINGS, GINGERBREAD MEN and CHRISTMAS BELLS."},{"version_id":"825112272","version_name":"5.3.0","version_date":"2018-03-07 17:33:36.000 +0800","version_description":"Spring into action with the fresh new update of Minion Rush! Enjoy the blooming flowers while running with your friends, the Minions!\n\n***WHAT’S NEW***\n\n- Join the SPRING FLING Special Mission and decorate MINION PARK!\n- Find new collectibles scattered around the park, such as WATERING CANS, BUTTERFLIES and FLOWERS.\n- Unleash your flower power with the new PEACE & LOVE Minion costume!"},{"version_id":"825112272","version_name":"5.1.0","version_date":"2017-12-06 18:01:04.000 +0800","version_description":"Minion Rush is going all out for the holidays with a festive new update! Are you ready to unwrap the fun?\n\n***WHAT’S NEW***\n\n- CHRISTMAS CAPER: Join the new holiday-themed Special Mission and make the season merrier for the Minions.\n- NEW COSTUME: Get that warm fuzzy feeling with the Holiday Sweater.\n- SEASONAL LOCATION: Gru’s Lab is now full of holiday decorations.\n- HOLIDAY COLLECTIBLES: Bring on the holiday cheer with CHRISTMAS STOCKINGS, GINGERBREAD MEN and CHRISTMAS BELLS."},{"version_id":"825681317","version_name":"5.2.0","version_date":"2018-01-24 17:00:39.000 +0800","version_description":"Bratt’s back and the Minions are here to thwart his diabolical plans in the new update for Minion Rush!\n\n***WHAT’S NEW***\n\n- Don’t let Bratt upstage your despicableness -- join the new Special Mission: BRATT’S COMEBACK.\n- Collect all the BRATT DOLLS, BUBBLEGUM and RUBIK’S CUBES before Bratt can use them.\n- Expand your wardrobe with the NEW LAB COAT COSTUME.\n- Run again in the iconic location, BRATT’S LAIR, straight out of Illumination’s Despicable Me 3 movie."},{"version_id":"825926315","version_name":"5.2.1","version_date":"2018-02-14 15:02:06.000 +0800","version_description":"Love is in the air! Make the Minions your valentine this year in the new Minion Rush update!\n\n***WHAT'S NEW***\n- Help Lucy spread love in the new Special Mission: THE MINIONS' VALENTINE.\n- Collect all the MILKSHAKES, RED VELVET CAKES and VALENTINE'S DAY CARDS to show Lucy how despicably lovely you are!\n- Fall in love with the Fluffy Unicorn decorations all around Pier 12."},{"version_id":"826124905","version_name":"5.3.0","version_date":"2018-03-07 17:33:36.000 +0800","version_description":"Spring into action with the fresh new update of Minion Rush! Enjoy the blooming flowers while running with your friends, the Minions!\n\n***WHAT’S NEW***\n\n- Join the SPRING FLING Special Mission and decorate MINION PARK!\n- Find new collectibles scattered around the park, such as WATERING CANS, BUTTERFLIES and FLOWERS.\n- Unleash your flower power with the new PEACE & LOVE Minion costume!"},{"version_id":"826594001","version_name":"5.4.0","version_date":"2018-04-18 16:35:12.000 +0800","version_description":"Minions love one thing above all: BANANAS! So no day is more sacred to our fruit-loving friends than Global Banana Day. Join them for a limited-time celebration in an exotic location!\n\n***WHAT’S NEW***\n\n- The Minions are on a delicious Banana Day Special Mission in THE VOLCANO!\n- Grab ceremonial collectibles including RITUAL MASKS, BASKETS and BANANA SKEWERS to bring the celebration to life.\n- Commemorate BANANA DAY forever with the exclusive JUNGLE costume!"},{"version_id":"827195585","version_name":"5.5.0","version_date":"2018-05-30 14:04:32.000 +0800","version_description":"Play the most mischievous soccer match of the year with the Minions in the brand-new Minion Rush Special Mission: SOCCER TOURNAMENT.\n\n***WHAT'S NEW***\n\n- Collect all of the soccer gear for the Minions' match: SOCCER BALLS, CLEATS and GOALIE GLOVES. \n- Cheer as loud as you can with the new SOCCER FAN Costume that you can get by using Market Tickets.\n- The fun never ends! When the \"Soccer Tournament\" Special Mission is over, don't miss the second Special Mission inside the Pyramids!"},{"version_id":"827692808","version_name":"5.6.0","version_date":"2018-07-11 14:00:35.000 +0800","version_description":"Prepare to take your running adventures over the ocean blue in this new update of Minion Rush!\n\nNEW MISSION #1: SECRET OF THE DEEP SEA.\n- Set sail from PIER 12 and search the briny deep for a mysterious sea monster!\n- Gather 3 new sea-themed collectibles: SHIP WHEELS, ANCHORS and PLUNGERS.\n- Get in the high-sea spirit with the brand new SEA DOG Minion costume.\n\nNEW MISSION #2: BEACH BOOM.\n- After your nautical mission, head to MINION BEACH to create a private vacation resort."},{"version_id":"827942442","version_name":"5.6.1","version_date":"2018-07-20 18:23:21.000 +0800","version_description":"Prepare to take your running adventures over the ocean blue in this new update for Minion Rush!\n\nNEW MISSION #1: SECRET OF THE DEEP SEA\n- Set sail from PIER 12 and search the briny deep for a mysterious sea monster!\n- Gather 3 new sea-themed collectibles: SHIP WHEELS, ANCHORS and PLUNGERS.\n- Get into the high-seas spirit with the brand-new SEA DOG Minion costume.\n\nNEW MISSION #2: BEACH PARTY\n- After your nautical mission, head to MINION BEACH to create a private vacation resort."},{"version_id":"828230177","version_name":"5.7.0","version_date":"2018-08-22 16:58:58.000 +0800","version_description":"The Minions want more... legitimate ways of getting rich, and need your help to get new ventures up and running!\n\n***WHAT’S NEW***\n\nNEW MISSION #1: ANCIENT TROVE\n- El Macho’s Lair is teeming with treasure for the taking... and tons of traps!\n- Collect 3 new items: VASES, CALENDARS & STATUES.\n- Flaunt your honest earnings with the new MINIONAIRE costume!\n\nNEW MISSION #2: TICKET TO SPACE\n- Shoot for the stars as the Minions launch paying customers into space!"},{"version_id":"828230296","version_name":"5.7.0","version_date":"2018-08-22 16:58:58.000 +0800","version_description":"The Minions want more... legitimate ways of getting rich, and need your help to get new ventures up and running!\n\n***WHAT’S NEW***\n\nNEW MISSION #1: ANCIENT TROVE\n- El Macho’s Lair is teeming with treasure for the taking... and tons of traps!\n- Collect 3 new items: VASES, CALENDARS & STATUES.\n- Flaunt your honest earnings with the new MINIONAIRE costume!\n\nNEW MISSION #2: TICKET TO SPACE\n- Shoot for the stars as the Minions launch paying customers into space!"},{"version_id":"828784881","version_name":"6.1.0","version_date":"2018-10-11 00:40:29.000 +0800","version_description":"Join the 5-Year Celebration of Minion Rush with a MASSIVE update!\n\n***NEW FEATURES***\n\nNEW SPECIAL MISSION\n- Run through a specially decorated AVL to grab GIFTS, CAKES & PARTY HATS!\n\nNEW STORY\n- Become the top Minion secret agent as you take on clandestine quests from Gru’s Lair.\n \nDRESS TO IMPRESS\n- Grab the new Costume Cards to unlock outfits, PLUS potent power-ups.\n- Kick off your collection with the Partier Costume as our gift to you!"},{"version_id":"828996527","version_name":"6.9.0","version_date":"2019-12-03 19:01:16.000 +0800","version_description":"MERRY CHRISTMAS! The Minions have been invited to the Arctic to lend Santa a hand. Nothing could go wrong in a magical workshop, right?\n \n**WHAT'S NEW**\n \nNEW SPECIAL MISSIONS\nMERRY MINION MAKERS: The Minions try being Santa's elves, and the workshop will never be the same… \nARCTIC VACATION (Coming Soon): The Minions are building a sports resort! Just make sure they don't turn into ice sculptures! \n \nNEW CONTENT\nMINION ELF COSTUME: Specially crafted with holiday magic!"},{"version_id":"828996527","version_name":"6.8.0","version_date":"2019-10-15 16:02:45.000 +0800","version_description":"Halloween is here, and the Minions are ready for some serious trick-or-treating. If you're ready to help feed some \"\"sweet tooths,\"\" put on your best costume and join them!\n\n**WHAT'S NEW**\n\nNEW SPECIAL MISSIONS\nSPOOKY NIGHT: The Minions are on a mission to make Gru's house more spook-tacular. Help 'em scare up some decorations!\nMOON MAROONED (Coming Soon): The first Minion has landed on the Moon! But… how do we get him back?\n\nNEW CONTENT\nMUMMY COSTUME: Is it an ancient relic, or just a bandage-wrapped Minion? Who can tell the difference, really?"},{"version_id":"828996527","version_name":"6.7.0","version_date":"2019-08-20 15:14:06.000 +0800","version_description":"The Minions are all packed for camping, but you’ll need to keep the great outdoors from becoming a great disaster! \n*WHAT’S NEW*\nNEW SPECIAL MISSIONS\nMINION SCOUTS: Test your wilderness skills & help the Minions become true scouts. Be sure to put out that fire! \nUNDERCOVER (Upcoming): Minions have gone missing under strange circumstances… Go undercover & get them back! \n\nNEW CONTENT\nSCOUT COSTUME: Straight from the Minion Scouts mini-movie, part of The Secret Life of Pets 2!"},{"version_id":"828996527","version_name":"6.7.1","version_date":"2019-09-18 21:28:01.000 +0800","version_description":"The Minions are all packed for camping, but you’ll need to keep the great outdoors from becoming a great disaster! \n*WHAT’S NEW*\nNEW SPECIAL MISSIONS\nMINION SCOUTS: Test your wilderness skills & help the Minions become true scouts. Be sure to put out that fire! \nUNDERCOVER (Upcoming): Minions have gone missing under strange circumstances… Go undercover & get them back! \n\nNEW CONTENT\nSCOUT COSTUME: Straight from the Minion Scouts mini-movie, part of The Secret Life of Pets 2!"},{"version_id":"828996527","version_name":"6.5.0","version_date":"2019-05-07 15:09:53.000 +0800","version_description":"The Secret Life of Pets 2 is snuggling up to the Minions! Help them open a Pet Shop and take care of Max, Duke, Snowball and more!\n\n**WHAT’S NEW**\n\nNEW SPECIAL MISSIONS\n• KYLE’S SECRET LIFE: Help Agnes create a pet-sitting service to care for critters in need.\n• PET SHOP (Coming Soon): Join Dru in expanding operations with a full pet shop!\n\nNEW CONTENT\n• Unlock the SUPERHERO COSTUME, inspired by the heroic Snowball!\n• The Residential Area and Mall are both covered in adorable pet decorations."},{"version_id":"828996527","version_name":"6.6.1","version_date":"2019-07-01 20:02:56.000 +0800","version_description":"It’s Cheese Festival time in Freedonia! Visit the new location & join the run!\n\n**WHAT’S NEW**\nNEW SPECIAL MISSIONS\nCHEESE FESTIVAL: Help the Minions create the most fabulous cheese statue! \nPIGGY RUN (coming soon): Join Lucy in training pigs to beat Gru’s team!\n\nNEW CONTENT\nNEW LOCATION: FREEDONIA. Join the celebration & get candy for yourself!\nNEW COSTUME: NIKO. Straight out of Despicable Me 3!\nNEW FEATURE: PIGGY BANK. Accumulate some extra Tokens!\n\nSome UI optimizations & bug fixes."},{"version_id":"828996527","version_name":"6.2.1","version_date":"2018-12-13 16:15:00.000 +0800","version_description":"MERRY CHRISTMAS! Celebrate the season with more Missions for your Minions.\n\n***WHAT’S NEW***\n\n- Bratt’s back and spreading bad gifts. We gotta get rid of ‘em NOW in a new Special Mission!\n- Run through a delightfully decorated Christmas Lab to collect Bratt Pack, Floppy Disk and Trouble Gum collectibles.\n- Look for a second Special Mission coming around New Year’s, and take the battle to Bratt.\n\nDON YOUR NEW APPAREL\n- Treat yourself to an early Christmas present with the new CODER Costume!\n\nMinor bugs fixed."},{"version_id":"828996527","version_name":"6.3.0","version_date":"2019-01-29 16:05:39.000 +0800","version_description":"Launch into the Chinese New Year with a new Minion Rush update loaded with characters and more from the Despicable Me movies. \n\nSPECIAL MISSION #1\n- Villains are stirring up trouble by trying to hypnotize everyone during the Chinese New Year festivities.\n- Fight back and light up the night with LANTERN, FIREWORKS and DRAGON MASK collectibles!\n- Become a real super-secret agent with the new SPY GRU Costume.\n\nSPECIAL MISSION #2\n- Stand tall against Vector’s Shrink Ray in another upcoming mission."},{"version_id":"828996527","version_name":"6.4.0","version_date":"2019-03-19 16:02:22.000 +0800","version_description":"Spring is in the air, and the Minions are on the run! Clean up in the new season of Minion Rush!\n\nNEW EVENTS\n• SPRING BREAK: Complete the first special mission to get the new BUNNY COSTUME.\n• GLOBAL BANANA DAY (Apr. 9): Venture into the Volcano and earn prizes in this new limited-time event!\n• HAPPY EASTER (Apr. 16): Catch the Easter Bunny for Agnes.\n\nNEW FEATURES\n• DAILY TASKS: Earn prizes by completing daily goals.\n• RECOMMENDED COSTUMES SYSTEM: Easily pick the best costume for a run!"},{"version_id":"828996527","version_name":"6.1.1","version_date":"2018-10-22 21:50:56.000 +0800","version_description":"Hey, Minion Rush runners! We've got news for you. Update the game now!\n\n- No more Red Zones!\n- Fixed a bug that prevented runners from advancing in Minion Leagues\n- Progress Conversion is well explained in a brand-new video tutorial: http://gmlft.co/MR_ConverTut \n- Revives are no longer consumed when you complete a mission\n- Daily Login should now appear for all users\n- Invulnerability now lasts longer after the Fever Mode effect is over\n- Special Missions: Progress is now properly shown"},{"version_id":"829432821","version_name":"6.2.0","version_date":"2018-12-04 16:04:53.000 +0800","version_description":"MERRY CHRISTMAS! Celebrate the season with more Missions for your Minions.\n\n***WHAT’S NEW***\n\n- Bratt’s back and spreading bad gifts. We gotta get rid of ‘em NOW in a new Special Mission!\n- Run through a delightfully decorated Christmas Lab to collect Bratt Pack, Floppy Disk and Trouble Gum collectibles.\n- Look for a second Special Mission coming around New Year’s, and take the battle to Bratt.\n\nDON YOUR NEW APPAREL\n- Treat yourself to an early Christmas present with the new CODER Costume!"},{"version_id":"829607278","version_name":"6.2.1","version_date":"2018-12-13 16:15:00.000 +0800","version_description":"MERRY CHRISTMAS! Celebrate the season with more Missions for your Minions.\n\n***WHAT’S NEW***\n\n- Bratt’s back and spreading bad gifts. We gotta get rid of ‘em NOW in a new Special Mission!\n- Run through a delightfully decorated Christmas Lab to collect Bratt Pack, Floppy Disk and Trouble Gum collectibles.\n- Look for a second Special Mission coming around New Year’s, and take the battle to Bratt.\n\nDON YOUR NEW APPAREL\n- Treat yourself to an early Christmas present with the new CODER Costume!\n\nMinor bugs fixed."},{"version_id":"830050217","version_name":"6.3.0","version_date":"2019-01-29 16:05:39.000 +0800","version_description":"Launch into the Chinese New Year with a new Minion Rush update loaded with characters and more from the Despicable Me movies. \n\nSPECIAL MISSION #1\n- Villains are stirring up trouble by trying to hypnotize everyone during the Chinese New Year festivities.\n- Fight back and light up the night with LANTERN, FIREWORKS and DRAGON MASK collectibles!\n- Become a real super-secret agent with the new SPY GRU Costume.\n\nSPECIAL MISSION #2\n- Stand tall against Vector’s Shrink Ray in another upcoming mission."},{"version_id":"830592179","version_name":"6.4.0","version_date":"2019-03-19 16:02:22.000 +0800","version_description":"Spring is in the air, and the Minions are on the run! Clean up in the new season of Minion Rush!\n\nNEW EVENTS\n• SPRING BREAK: Complete the first special mission to get the new BUNNY COSTUME.\n• GLOBAL BANANA DAY (Apr. 9): Venture into the Volcano and earn prizes in this new limited-time event!\n• HAPPY EASTER (Apr. 16): Catch the Easter Bunny for Agnes.\n\nNEW FEATURES\n• DAILY TASKS: Earn prizes by completing daily goals.\n• RECOMMENDED COSTUMES SYSTEM: Easily pick the best costume for a run!"},{"version_id":"831110331","version_name":"6.5.0","version_date":"2019-05-07 15:09:53.000 +0800","version_description":"The Secret Life of Pets 2 is snuggling up to the Minions! Help them open a Pet Shop and take care of Max, Duke, Snowball and more!\n\n**WHAT’S NEW**\n\nNEW SPECIAL MISSIONS\n• KYLE’S SECRET LIFE: Help Agnes create a pet-sitting service to care for critters in need.\n• PET SHOP (Coming Soon): Join Dru in expanding operations with a full pet shop!\n\nNEW CONTENT\n• Unlock the SUPERHERO COSTUME, inspired by the heroic Snowball!\n• The Residential Area and Mall are both covered in adorable pet decorations."},{"version_id":"831740202","version_name":"6.6.0","version_date":"2019-06-25 17:04:56.000 +0800","version_description":"It’s Cheese Festival time in Freedonia! Visit the new location & join the run!\n\n**WHAT’S NEW**\nNEW SPECIAL MISSIONS\nCHEESE FESTIVAL: Help the Minions create the most fabulous cheese statue! \nPIGGY RUN (coming soon): Join Lucy in training pigs to beat Gru’s team!\n\nNEW CONTENT\nNEW LOCATION: FREEDONIA. Join the celebration & get candy for yourself!\nNEW COSTUME: NIKO. Straight out of Despicable Me 3!\nNEW FEATURE: PIGGY BANK. Accumulate some extra Tokens!\n\nSome UI optimizations & bug fixes."},{"version_id":"831823626","version_name":"6.6.1","version_date":"2019-07-01 20:02:56.000 +0800","version_description":"It’s Cheese Festival time in Freedonia! Visit the new location & join the run!\n\n**WHAT’S NEW**\nNEW SPECIAL MISSIONS\nCHEESE FESTIVAL: Help the Minions create the most fabulous cheese statue! \nPIGGY RUN (coming soon): Join Lucy in training pigs to beat Gru’s team!\n\nNEW CONTENT\nNEW LOCATION: FREEDONIA. Join the celebration & get candy for yourself!\nNEW COSTUME: NIKO. Straight out of Despicable Me 3!\nNEW FEATURE: PIGGY BANK. Accumulate some extra Tokens!\n\nSome UI optimizations & bug fixes."},{"version_id":"832397968","version_name":"6.7.0","version_date":"2019-08-20 15:14:06.000 +0800","version_description":"The Minions are all packed for camping, but you’ll need to keep the great outdoors from becoming a great disaster! \n*WHAT’S NEW*\nNEW SPECIAL MISSIONS\nMINION SCOUTS: Test your wilderness skills & help the Minions become true scouts. Be sure to put out that fire! \nUNDERCOVER (Upcoming): Minions have gone missing under strange circumstances… Go undercover & get them back! \n\nNEW CONTENT\nSCOUT COSTUME: Straight from the Minion Scouts mini-movie, part of The Secret Life of Pets 2!"},{"version_id":"832784504","version_name":"6.7.1","version_date":"2019-09-18 21:28:01.000 +0800","version_description":"The Minions are all packed for camping, but you’ll need to keep the great outdoors from becoming a great disaster! \n*WHAT’S NEW*\nNEW SPECIAL MISSIONS\nMINION SCOUTS: Test your wilderness skills & help the Minions become true scouts. Be sure to put out that fire! \nUNDERCOVER (Upcoming): Minions have gone missing under strange circumstances… Go undercover & get them back! \n\nNEW CONTENT\nSCOUT COSTUME: Straight from the Minion Scouts mini-movie, part of The Secret Life of Pets 2!"},{"version_id":"833007791","version_name":"6.8.0","version_date":"2019-10-15 16:02:45.000 +0800","version_description":"Halloween is here, and the Minions are ready for some serious trick-or-treating. If you're ready to help feed some \"\"sweet tooths,\"\" put on your best costume and join them!\n\n**WHAT'S NEW**\n\nNEW SPECIAL MISSIONS\nSPOOKY NIGHT: The Minions are on a mission to make Gru's house more spook-tacular. Help 'em scare up some decorations!\nMOON MAROONED (Coming Soon): The first Minion has landed on the Moon! But… how do we get him back?\n\nNEW CONTENT\nMUMMY COSTUME: Is it an ancient relic, or just a bandage-wrapped Minion? Who can tell the difference, really?"},{"version_id":"833586368","version_name":"6.8.1","version_date":"2019-11-18 19:11:33.000 +0800","version_description":"Hey Runners! It’s time to really dress to impress, because we’ve revamped the entire Costume system to give you more control over your powers during a run!\n\n**WHAT’S NEW**\n\nCOSTUME ABILITIES\n• Costumes now have built-in Power-Ups in the form of new Abilities!\n• Charge your Costume’s Ability during a run to unleash it when needed most.\n• Pick the best Costume Ability to overcome any challenge.\n\nPOWER-OPS EVENT\n• Complete special missions to test new Costume Abilities and unlock rewards!"},{"version_id":"833776586","version_name":"6.9.0","version_date":"2019-12-03 19:01:16.000 +0800","version_description":"MERRY CHRISTMAS! The Minions have been invited to the Arctic to lend Santa a hand. Nothing could go wrong in a magical workshop, right?\n \n**WHAT'S NEW**\n \nNEW SPECIAL MISSIONS\nMERRY MINION MAKERS: The Minions try being Santa's elves, and the workshop will never be the same… \nARCTIC VACATION (Coming Soon): The Minions are building a sports resort! Just make sure they don't turn into ice sculptures! \n \nNEW CONTENT\nMINION ELF COSTUME: Specially crafted with holiday magic!"},{"version_id":"834369776","version_name":"7.0.0","version_date":"2020-01-21 19:01:35.000 +0800","version_description":"Lanterns, dragons, ACTION! The Minions are making a festive movie between their mad science experiments.\n \n**WHAT’S NEW**\nNEW SPECIAL MISSIONS\nDANCE OF THE DRAGON: The Minions are making a Chinese New Year movie, and they're shooting for nothing less than the Best Movie Award! Do you have the star power they need to succeed?\nMEGA BANANA (Coming Soon): All bananas are great, but a giant banana would be amazing! Help the Minions make one in this massively fun mission.\n \nNEW CONTENT\nEMPEROR COSTUME: Let’s hope this regal warrior doesn't hurt anybody, especially himself!"},{"version_id":"834503918","version_name":"7.0.1","version_date":"2020-01-28 19:05:20.000 +0800","version_description":"Lanterns, dragons, ACTION! The Minions are making a festive movie between their mad science experiments.\n \n**WHAT’S NEW**\nNEW SPECIAL MISSIONS\nDANCE OF THE DRAGON: The Minions are making a Chinese New Year movie, and they're shooting for nothing less than the Best Movie Award! Do you have the star power they need to succeed?\nMEGA BANANA (Coming Soon): All bananas are great, but a giant banana would be amazing! Help the Minions make one in this massively fun mission.\n \nNEW CONTENT\nEMPEROR COSTUME: Let’s hope this regal warrior doesn't hurt anybody, especially himself!"},{"version_id":"834977396","version_name":"7.1.0","version_date":"2020-03-17 19:07:41.000 +0800","version_description":"The cold, drab winter is finally over. Now it's super silly fun time! Get running with the Minions to finally come out of hibernation and celebrate SPRING BREAK!\n**WHAT'S NEW**\nNEW SPECIAL MISSIONS:\nPIRATES, AHOY!: The Minions are going to a new pirate-themed park. Dare to join them for some swashbuckling fun?\n+ PIRATE COSTUME: Shiver me timbers! This Minion is ready to raid the high seas.\n\nSPRINGTIME (Coming Soon): The girls are turning their backyard into an Easter haven. Help them whip up some seasonal magic!\n+ SPRING COSTUME: Butterflies are pretty and flowers are colorful, but they got nuttin' on this cute-as-a-button Minion!"},{"version_id":"835733343","version_name":"7.2.0","version_date":"2020-05-05 18:05:42.000 +0800","version_description":"Get ready for the big Cinco de Mayo fiesta coming up at Eduardo's House!\n**WHAT'S NEW**\nNEW SPECIAL MISSIONS\nTHE TROJAN PIÑATA: The Minions are building a massive piñata to sneak inside Eduardo's House. Help them out so everyone can enjoy the despicable fun!\nCAMPING TIME (Coming Soon): Spring is in the air and the Minions are ready to venture into the wild!\n \nNEW CONTENT\nLUCHADOR COSTUME: Specially made for Eduardo's party, it fits so perfectly the Minions refuse to wear anything else now!"},{"version_id":"836296359","version_name":"7.2.1","version_date":"2020-06-11 18:06:35.000 +0800","version_description":"Bug fixes and improvements"},{"version_id":"836585143","version_name":"7.3.0","version_date":"2020-06-30 18:10:48.000 +0800","version_description":"Hey Minion Runners!\n\nThe Summer Run update is finally here, and the Minions are ready for some fun in the sun!\n\n**WHAT’S NEW**\nNEW SPECIAL MISSIONS\nSummer Contest: The Minions have entered a sand castle contest, but Vector is laying siege to their surf & turf! Help them fend off his attacks while sculpting a first-place creation!\n\nPrehistoric Tales (coming soon): Why visit a dusty old museum when you can travel back to the age of cave Minions?! Dare to check it out yourself?\n\nNEW COSTUMES\nBeachgoer: Hang ten with this sun-loving Minion who never seems to tan.\nCro-Minion: Cave drawings show these ancient Minions hunting wild bananas across the wilderness. \n\nAND MORE\nIntroducing Apple Sign-In: This easy log-in option keeps your progress up to date across all iOS devices that you’ve linked to your Apple ID."},{"version_id":"837562726","version_name":"7.4.0","version_date":"2020-09-01 16:01:28.000 +0800","version_description":"Hello Minion Runners!\n\nThe Minions are saddling up for exciting new adventures and more in this Festival update of Minion Rush. Get ready for some galloping fun!\n\nINTRODUCING THE FESTIVAL\nThe Festival is a brand-new feature with a wide array of fun missions to rack up points and earn unique rewards! The further you advance through it, the better the prizes you unlock!\n\nNEW SPECIAL MISSIONS\nLegions of Minions: Margo takes the Minions on a trip through history as they relive some of the most famous battles of the Roman legionaries!\nBanana Bank (Coming Soon): Lights, camera, action! The Minions are filming a classic Western movie about a bank heist. Care to join the show?\n\nNEW COSTUMES\nLegionary: Crafted strong enough for an empire... small enough for a Minion.\nCowboy: Or should we say CowMinion? Ride off into the sunset with this rootin’ tootin’ costume!"},{"version_id":"837803292","version_name":"7.4.1","version_date":"2020-09-23 18:05:57.000 +0800","version_description":"Hello Minion Runners!\n\nThe Minions are saddling up for exciting new adventures and more in this Festival update of Minion Rush. Get ready for some galloping fun!\n\nINTRODUCING THE FESTIVAL\nThe Festival is a brand-new feature with a wide array of fun missions to rack up points and earn unique rewards! The further you advance through it, the better the prizes you unlock!\n\nNEW SPECIAL MISSIONS\nLegions of Minions: Margo takes the Minions on a trip through history as they relive some of the most famous battles of the Roman legionaries!\nBanana Bank (Coming Soon): Lights, camera, action! The Minions are filming a classic Western movie about a bank heist. Care to join the show?\n\nNEW COSTUMES\nLegionary: Crafted strong enough for an empire... small enough for a Minion.\nCowboy: Or should we say CowMinion? Ride off into the sunset with this rootin’ tootin’ costume!"},{"version_id":"838483255","version_name":"7.5.0","version_date":"2020-11-03 19:42:16.000 +0800","version_description":"Put on your Halloween costume—the Minions are going trick-or-treating!\n\nNEW SPECIAL MISSIONS\nGingerbread House: The Minions accidentally ate the gingerbread house of the scariest witch in town. Now they have to rebuild it with some Halloween candy if they don’t want to turn into pumpkins at midnight!\nBreak In? Break Out! (Coming soon): Help the Minions execute the sweetest heist they ever planned!\n\nNEW COSTUMES:\nWitch: Check for some bats in the pockets before trying it on!\nThief: Beware! It’s so cute it can steal your heart!\nMime: Become a master of invisible tricks! Available only in the Minion Festival!\n\nNEW FEATURE:\nPrize Wheel: Introducing a new way to get some extra rewards. Spin it to see for yourself!"},{"version_id":"839307186","version_name":"7.5.1","version_date":"2020-11-24 20:14:38.000 +0800","version_description":"Put on your Halloween costume—the Minions are going trick-or-treating!\n\nNEW SPECIAL MISSIONS\nGingerbread House: The Minions accidentally ate the gingerbread house of the scariest witch in town. Now they have to rebuild it with some Halloween candy if they don’t want to turn into pumpkins at midnight!\nBreak In? Break Out! (Coming soon): Help the Minions execute the sweetest heist they ever planned!\n\nNEW COSTUMES:\nWitch: Check for some bats in the pockets before trying it on!\nThief: Beware! It’s so cute it can steal your heart!\nMime: Become a master of invisible tricks! Available only in the Minion Festival!\n\nNEW FEATURE:\nPrize Wheel: Introducing a new way to get some extra rewards. Spin it to see for yourself!"},{"version_id":"839709697","version_name":"7.6.0","version_date":"2020-12-22 19:17:39.000 +0800","version_description":"Ready to run with the Minions during the winter holidays?\n\nNEW SPECIAL MISSIONS\nHoliday for the Girls: Have fun with the Minions as they try to build a snowman for the holiday celebration! \nPolar Expedition (coming soon): The Minions just heard about the mammoths and are ready to go to the Arctic Base to find some! \n\nNEW COSTUMES:\nReindeer: Cheer along with this cute reindeer!\nPolar Explorer: Find out how to get that warm fuzzy feeling even on the Arctic Base!\nDoctor: A banana a day will keep the Minion dressed as a doctor nearby!\n\nHappy Holidays!\nXOXO, the Minion Rush team"},{"version_id":"840583102","version_name":"7.7.0","version_date":"2021-02-23 21:10:54.000 +0800","version_description":"Hey, runners!\nThe new FAMILY FUN TIME update is here!\n\nNEW SPECIAL MISSIONS:\nGru and Dru's Competition: A new challenge for the Minions to win the Golden Trophy!\nDance Battle (coming soon): A dance show with the most talented Minions!\n\nNEW COSTUMES:\nHockey Player: Always ready for a game of hockey!\nDJ: Knows all the best songs!\nGrenadier: Explosively cute! \n\nOTHER: \nIntroducing CRATES in the Minion Festival!\nAdventure beta test has ended!\n\nJoin the run!"},{"version_id":"840872299","version_name":"7.7.1","version_date":"2021-03-15 19:05:36.000 +0800","version_description":"Hey, runners!\nThe new FAMILY FUN TIME update is here!\n\nNEW SPECIAL MISSIONS:\nGru and Dru's Competition: A new challenge for the Minions to win the Golden Trophy!\nDance Battle (coming soon): A dance show with the most talented Minions!\n\nNEW COSTUMES:\nHockey Player: Always ready for a game of hockey!\nDJ: Knows all the best songs!\nGrenadier: Explosively cute! \n\nOTHER: \nIntroducing CRATES in the Minion Festival!\nAdventure beta test has ended!\n\nJoin the run!"},{"version_id":"841004826","version_name":"7.7.2","version_date":"2021-03-23 22:23:04.000 +0800","version_description":"Hey, runners!\nThe new FAMILY FUN TIME update is here!\n\nNEW SPECIAL MISSIONS:\nGru and Dru's Competition: A new challenge for the Minions to win the Golden Trophy!\nDance Battle (coming soon): A dance show with the most talented Minions!\n\nNEW COSTUMES:\nHockey Player: Always ready for a game of hockey!\nDJ: Knows all the best songs!\nGrenadier: Explosively cute! \n\nOTHER: \nIntroducing CRATES in the Minion Festival!\nAdventure beta test has ended!\n\nJoin the run!"},{"version_id":"841286704","version_name":"7.8.0","version_date":"2021-04-14 20:07:56.000 +0800","version_description":"Hello, Runners!\nThe new TEAM BUILDING update of Minion Rush is here!\n\nNEW SPECIAL MISSIONS:\nViking Story: The Minions are spending time on a beach rebuilding the Viking ship!\nLucha de Mayo (coming soon): The Minions are selling tacos to help Agnes get to the wrestling event!\n\nNEW COSTUMES:\nViking: Cutest barbarian you know!\nFluffycorn: Ready for every pajama party!\n\nJoin the run!"},{"version_id":"842023085","version_name":"7.8.1","version_date":"2021-05-05 18:05:47.000 +0800","version_description":"Hello, Runners!\nThe new TEAM BUILDING update of Minion Rush is here!\n\nNEW SPECIAL MISSIONS:\nViking Story: The Minions are spending time on a beach rebuilding the Viking ship!\nLucha de Mayo (coming soon): The Minions are selling tacos to help Agnes get to the wrestling event!\n\nNEW COSTUMES:\nViking: Cutest barbarian you know!\nFluffycorn: Ready for every pajama party!\n\nJoin the run!"},{"version_id":"842353209","version_name":"7.8.2","version_date":"2021-05-25 19:02:01.000 +0800","version_description":"Hello, Runners!\nThe new TEAM BUILDING update of Minion Rush is here!\n\nNEW SPECIAL MISSIONS:\nViking Story: The Minions are spending time on a beach rebuilding the Viking ship!\nLucha de Mayo (coming soon): The Minions are selling tacos to help Agnes get to the wrestling event!\n\nNEW COSTUMES:\nViking: Cutest barbarian you know!\nFluffycorn: Ready for every pajama party!\n\nJoin the run!"},{"version_id":"842404927","version_name":"7.9.0","version_date":"2021-06-01 18:18:51.000 +0800","version_description":"Hello, Runners!\nJoin the Minions as they run and party in the new 1 BILLION DOWNLOADS CELEBRATION update full of fun new content!\n\nCELEBRATION RUN: Run in the game to collect bananas and contribute your part in a cumulative goal to unlock a special gift for EVERYONE!\n\nNEW SPECIAL MISSIONS:\n- Billion Downloads Party: Help the Minions build an ice cream machine to throw the coolest party!\n- Zen Garden (coming soon): Agnes and the Minions are making a beautiful Japanese garden near the house!\n\nNEW COSTUMES:\nIce Cream Stuart: Welcome Stuart to the game! Also, he already ate his ice cream...\nGreen Thumb: Ready for gardening!\n\nJoin the run!"},{"version_id":"842929225","version_name":"7.9.1","version_date":"2021-07-07 18:01:13.000 +0800","version_description":"Hello, Runners!\nJoin the Minions as they run and party in the new 1 BILLION DOWNLOADS CELEBRATION update full of fun new content!\n\nCELEBRATION RUN: Run in the game to collect bananas and contribute your part in a cumulative goal to unlock a special gift for EVERYONE!\n\nNEW SPECIAL MISSIONS:\n- Billion Downloads Party: Help the Minions build an ice cream machine to throw the coolest party!\n- Zen Garden (coming soon): Agnes and the Minions are making a beautiful Japanese garden near the house!\n\nNEW COSTUMES:\nIce Cream Stuart: Welcome Stuart to the game! Also, he already ate his ice cream...\nGreen Thumb: Ready for gardening!\n\nJoin the run!"},{"version_id":"843395916","version_name":"8.0.0","version_date":"2021-08-04 18:39:01.000 +0800","version_description":"Hello, Runners!\nJoin the Minions as they run and party in the new ENDLESS SUMMER VACATION update full of awesome content!\n\nNEW SPECIAL MISSIONS: \n- Gru’s First Lair: Help the Minions recreate Gru’s First Lair with LEGO® bricks.\n- Super Summer Games (coming soon): Join the Minions while they’re having fun at the beach.\n\nNEW COSTUMES:\nEngineer Bob: The cutest engineer has arrived.\nEgyptian: Always ready for a hot day.\nShortstop Stuart: Ready to play baseball.\n\nJoin the run!"},{"version_id":"843473337","version_name":"8.0.1","version_date":"2021-08-09 15:06:29.000 +0800","version_description":"Hello, Runners!\nJoin the Minions as they run and party in the new ENDLESS SUMMER VACATION update full of awesome content!\n\nNEW SPECIAL MISSIONS: \n- Gru’s First Lair: Help the Minions recreate Gru’s First Lair with LEGO® bricks.\n- Super Summer Games (coming soon): Join the Minions while they’re having fun at the beach.\n\nNEW COSTUMES:\nEngineer Bob: The cutest engineer has arrived.\nEgyptian: Always ready for a hot day.\nShortstop Stuart: Ready to play baseball.\n\nJoin the run!"},{"version_id":"843898774","version_name":"8.0.2","version_date":"2021-09-10 20:35:31.000 +0800","version_description":"Minions, assemble! Today you begin bootcamp for Top Bananas.\nTraining consists of a new Endless Run mode where you’ll chase down bunches of Robonanas built to test your limits. Be sure to grab lots to top your Class Leaderboard, so everyone around the world can see your skills. For only the most truly talented Agents will graduate to a more advanced Class! The higher your Class, the more rewards you’ll earn at the end of each session.\nYou’ll find this fun and competitive mode in the new Top Bananas Room, so be sure to check it out!"},{"version_id":"844060241","version_name":"8.0.3","version_date":"2021-09-13 16:25:05.000 +0800","version_description":"Minions, assemble! Today you begin bootcamp for Top Bananas.\nTraining consists of a new Endless Run mode where you’ll chase down bunches of Robonanas built to test your limits. Be sure to grab lots to top your Class Leaderboard, so everyone around the world can see your skills. For only the most truly talented Agents will graduate to a more advanced Class! The higher your Class, the more rewards you’ll earn at the end of each session.\nYou’ll find this fun and competitive mode in the new Top Bananas Room, so be sure to check it out!"},{"version_id":"844115387","version_name":"8.1.0","version_date":"2021-10-05 19:04:35.000 +0800","version_description":"The leaves are turning and the fish are biting in the latest update for your favorite endless runner! \nIf you haven’t already, now is the perfect time to give the Top Bananas Room a try. Show the world your skills in this competitive endless-run mode, and collect lots of Robonanas in your quest to be the top of your class!\nAnd when you need to cool off, dip your toes in the newest Special Mission: Photo Fishing. You’ll dive deep to visit an underwater base and help the Minions host an exhibit of the most marvelous marine life."},{"version_id":"844765892","version_name":"8.1.1","version_date":"2021-10-26 18:03:29.000 +0800","version_description":"Darkness descends, ghouls gather, and pumpkins parade across the neighborhood in this special Halloween update for Minion Rush!\nIt’s time to trick or trek in the new Special Mission: Pumpkin Parade! The Minions are building a most spooktacular float for a midnight ride through town. But they’ll have to scare up some supplies fast!\nAnd what’s Halloween without cute and creepy costumes? So be sure to give Skeleton Bob a try, complete with a treat basket and the ability to score more Bananas when the Evil Minion is unleashed."},{"version_id":"845165648","version_name":"8.2.0","version_date":"2021-11-24 19:07:49.000 +0800","version_description":"Hello, agents! Thanksgiving is coming and the Minions want to celebrate it their own way. Behold! It’s Thanksminion Day! \n\nEvery party needs its arena and the Thanksminion arena will be a tree house – a place where all the Minions can have some banana-banana fun. But you have to help them to build a tree house where everyone will gather.\n\nDuring the event, you must COLLECT:\n - HAMMERS – to help the Minions construct a tree house to feast in\n - WOOD – for the campfire \n - WATERING CANS – to help the Minions grow the most delicious and yellow bananas"},{"version_id":"845854196","version_name":"8.2.1","version_date":"2021-12-15 19:01:06.000 +0800","version_description":"Cold weather is no match for warm hearts and heated competition! So join the new holiday-themed Special Mission while honing your skills to be the best runner around.\n\nCHRISTMAS CAMPING\nDeck the halls in a new Special Mission! Gru wants to start a new tradition of camping for the holiday. But when a blizzard hits, this winter wonderland might become too cold for comfort.\n\nREGIONAL & FRIENDS LEADERBOARDS\nRack up the best score you can in a single run to claim the top spot in your region, or simply prove you're the best among your friends!"},{"version_id":"846016814","version_name":"8.2.2","version_date":"2021-12-20 19:01:05.000 +0800","version_description":"Cold weather is no match for warm hearts and heated competition! So join the new holiday-themed Special Mission while honing your skills to be the best runner around.\n\nCHRISTMAS CAMPING\nDeck the halls in a new Special Mission! Gru wants to start a new tradition of camping for the holiday. But when a blizzard hits, this winter wonderland might become too cold for comfort.\n\nREGIONAL & FRIENDS LEADERBOARDS\nRack up the best score you can in a single run to claim the top spot in your region, or simply prove you're the best among your friends!"},{"version_id":"846748111","version_name":"8.3.0","version_date":"2022-01-27 20:55:17.000 +0800","version_description":"Hello, Runners!\nJoin the Minions in the latest update!\n\nNEW FEATURES:\nRent-a-Costume: You can now rent a new selection of costumes every day. Just watch an ad to unlock the one you want for a single run!\nVIP Perks: Want to rent even more costumes, including rare and epic ones? Want to skip ads (and still get the rewards)? Then unlock VIP status to gain these and other great perks!\n\nNEW COSTUMES:\nPajama Bob: The cutest Minion has arrived!\nStooart: Ready for despicable fun!\n\nNEW SPECIAL MISSION:\nCold Days, Warm Hearts: Gru and the Minions want to make the cuddliest gifts imaginable for Valentine’s Day."},{"version_id":"846964171","version_name":"8.3.1","version_date":"2022-02-03 18:12:04.000 +0800","version_description":"Hello, Runners!\nJoin the Minions in the latest update!\n\nNEW FEATURES:\nRent-a-Costume: You can now rent a new selection of costumes every day. Just watch an ad to unlock the one you want for a single run!\nVIP Perks: Want to rent even more costumes, including rare and epic ones? Want to skip ads (and still get the rewards)? Then unlock VIP status to gain these and other great perks!\n\nNEW COSTUMES:\nPajama Bob: The cutest Minion has arrived!\nStooart: Ready for despicable fun!\n\nNEW SPECIAL MISSION:\nCold Days, Warm Hearts: Gru and the Minions want to make the cuddliest gifts imaginable for Valentine’s Day."},{"version_id":"90902657","version_name":"1.4.0","version_date":"","version_description":""}]