[{"version_id":"817454456","version_name":"3.8.6","version_date":"2016-05-24 12:07:38.000 +0800","version_description":"Maintenance update"},{"version_id":"819461021","version_name":"3.9.2","version_date":"2016-11-04 15:05:30.000 +0800","version_description":"This update contains performance improvements and some minor fixes. <br>Love using this app? Please give us a review! We are reading every comment, review and tweet, and your thoughts and suggestions will definitely be taken into consideration as we continue to improve it. <br>Need help or want to send us feedback? Please contact us via the feedback option within the apps slide menu."},{"version_id":"819799419","version_name":"3.9.4","version_date":"2016-11-29 19:07:30.000 +0800","version_description":"Added various performance improvements and minor bug fixes."},{"version_id":"823773321","version_name":"4.5.7","version_date":"2017-12-01 12:09:56.000 +0800","version_description":"We’ve been hard at work to bring you the best experience to date! This update contains a new modern interface and a myriad of new tools to help you find a great job: <br>• “Swipe Gestures” - Ability to sort through job results by swiping left to remove a result from the list of swiping right to mark interest in a post. <br>• Improved List/Map result integration <br>• Improved Search - Combining advanced search and quick search to create a touch driven interface that stores user selections and requires less typing to initiate searches. <br>• Synced Data - Previous searches, recently viewed post and favorites synced between devices. <br>• Improved User Manual - Now more informative and search-able. <br>• User-interface updates - New icons, cleaner layout and full screen.<br>• Résumé Builder - Build a new résumé, edit an existing résumé, and apply to jobs with your résumé.<br>• Employer Research - Read information about employers, view all of an employer’s current job posts, and explore an employer’s social media.<br><br>Love using our app? Please leave us a review! We read every comment, review, and tweet. Your thoughts and suggestions will definitely be taken into consideration as we continue to improve the app. Need help or want to send us feedback? Please contact us via the feedback option within the app’s slide menu."},{"version_id":"831421165","version_name":"5.1.4","version_date":"2019-05-25 18:28:34.000 +0800","version_description":"Improved performance and enhancements."},{"version_id":"831487504","version_name":"5.1.5","version_date":"2019-05-31 01:14:43.000 +0800","version_description":"Improved performance and enhancements."}]