[{"version_id":"811373150","version_name":"2.3","version_date":"2014-12-19 22:44:49.000 +0800","version_description":"Junk Jack X 2.3 Christmas update is here!<br><br>This version brings Christmas mood back into the game with many new craftable items, and a themed Terra world. But that’s not all, a whole new planet named Lilith has been added! Discover more than 25 new mobs, new items, new weapons, new armors, placeable objects and blocks, new craftable and rares, and finally a new ore which will be used in the future for something really unique!<br><br>As usual, we also packed a bunch of bug fixed to improve the overall game experience and solve nasty problems!<br><br>Merry Christmas and happy new year by the Pixbits Duo!<br><br>Changelog:<br><br>New features:<br><br>- Terra is now Christmas themed, with many christmas gifts on ground!<br>- All the christmas presents from previous year have been added again, plus much more!<br>- New end-game Lilith planet that can be reached from Xeno!<br>- New Silicium ore, which will be used in the future in a very unique way. More news coming!<br>- Fish more than 10 new fish types in the new planet<br>- 10 new replantable plant types with relative fruits<br>- More than 30 new mobs with their relative drops and crafts<br>- Many new alchemy reagents!<br>- Many new Lilith placeable blocks<br>- Lots of new placeable Lilith objects, including 6 columns<br>- New Moonstone material<br>- New Rare throwable bomb<br>- 6 New Rare placeable statues<br>- New moonstone blocks and column crafts<br>- 5 New Lilith pocket pets<br>- 4 Lilith armor sets<br>- 4 Lilith weapon sets<br>- 1 Rare Craftable Armor Set<br>- Many new trinkets, craftable or dropped from mobs<br>- Many new rare weapons <br>- More than 15 new crafts<br>- New Christmas Zombie mob<br>- New Placeable Hanging Tinsel<br>- New Placeable Hanging Snowflakes<br>- New Placeable Christmas Sleigh, you can sleep on it<br>- New Rare “weapon” (again!) dropped from Christmas Zombie Mob<br>- New Pocket Falling Star pet<br>- New Pocket Frosty pet<br><br>Bug Fixes:<br><br>- Falling star will now spawn more often.<br>- Removed a graphic glitch from mineshaft bridge<br>- Fixed a crash that occurred when opening chests/forges/etc in multiplayer with a laggy connection<br>- Fixed dyable blocks and items that weren’t displaying correctly in super mini map<br>- Fixed a bug the didn’t allow some ladders to be placed on trapdoors<br>- Fixed a crash that could occur while taking a portal<br>- Fixed a crash that occurred when multiplayer was canceled halfway through connection<br>- Fixed a crash that occurred randomly when having stables with at least 2 mobs in the world<br>- Fixed wrong flags set on yuca side objects<br>- Added Night Owl to the creative eggs<br>- Fixed some wrong mob particles<br>- Enriched save check routines to minimize crashes during save operations<br>- Fixed a crash related to the update lighting algorithm on blocks of the world<br>- Many minor tweaks and fixes"},{"version_id":"811723980","version_name":"2.3.1","version_date":"2015-02-13 20:46:04.000 +0800","version_description":"Welcome to the Junk Jack X 2.3.1 St. Valentine update! This update adds more love to the game, including two themed mobs, new pets, treasures and many themed placeable objects dropped from a new special themed chest.<br><br>Check out the changelog below!<br><br>CHANGELOG<br><br>- new Pink Valentine rabbit mob added<br>- new Pink Valentine pocket pet added<br>- new Cupid Zombie mob!<br>- two new trinkets have been added<br>- a new themed chest equip piece has been added<br>- a new St. Valentine themed chest can be found on terra ground<br>- new Themed bows and arrows<br>- new plant: Red Rose!<br>- new placeable Glowing Heart<br>- new rare Pocket Heart pet<br>- new Hanging Hearts decoration<br>- new placeable Red Rose Bucket<br>- many new St. Valentine themed treasures have been added<br>- two new themed paintings have been added<br>- fixed a wrong sound on Lilith monolith object<br>- now pet entity light is correctly set after a warp<br>- fixed a bug that caused a performance issue when a pet wanted to reach a player unreachable (on a ladder or in liquid)<br>- fixed a crash that occurred sometimes when unwrapping a gift<br>- fixed a memory leak that occurred every time you entered a world<br>- added Citrine Block to creative<br>- fixed Dromium Spores placement issues<br>- added world chests to Lilith<br><br>More updates coming soon, stay tuned!"},{"version_id":"812376372","version_name":"2.4.1 contains all the features below plus fixes to some annoying bugs including: multiplayer crash when connecting","version_date":"","version_description":""},{"version_id":"813410092","version_name":"2.4.4","version_date":"2015-09-29 15:22:01.000 +0800","version_description":"Welcome to Junk Jack X 2.4.4! <br><br>This version introduces a new gardening system: discover new flower types by combining their seeds and get more than 15000 unique plants! We also added a new planet called Mykon with new monsters, rare weapon drops, equip pieces, placeable objects and blocks. A new Tone Emitter device has been introduced to let you compose music directly inside the game! Last but not least we’re adding many bug fixes and tweaks which hopefully will improve your experience with Junk Jack X.<br><br>Check out the changelog below:<br><br>• the game is now optimized for 64 bit architecture<br>• new procedural plants: combine plants by mixing their seeds and obtain more than 15000 unique flowers!<br>• 3 new IAPs<br>• new Planet: Mykon!<br>• more than 35 new mobs<br>• more than 15 new weapons<br>• more than 25 new equip pieces<br>• many new plants with their relative fruits<br>• new rare pocket pets<br>• 10 new fishes<br>• new rare king slime pet craftable from monster drops<br>• new mushroom wood<br>• sloped blocks can now be rotated even upside-down<br>• the normal minimap is now a live view of the world (and not a static snapshot anymore)<br>• new craftable tone emitter blocks, make music with them!<br>• new truth table device<br>• 7 different musical instruments can be set for tone emitter blocks, including chiptune sounds!<br>• new spider web graphics<br>• new king slime mobs!<br>• tweaked dye colors<br>• tweaked ground plants spawn rate on terra<br>• each flower will drop its relative colored petal which can be used to craft dyes<br>• new craftable gem torches which make colored light<br>• statues are now flippable with the spanner! (more things will be flippable in the future)<br>• new world generator allows props to be rotated into all directions making every biome much more immersive<br>• fixed (hopefully) fishing as clients in multiplayer<br>• fixed a crash related to spawner eggs thrown by an item dispenser<br>• fixed a bug that didn’t allow players to tap a near addon to craft things with it<br>• fixed crashes occurred when tapping a camp fire<br>• lighting on rotated blocks is now properly calculated<br>• fixed a crash that occurred when a client exited from a multiplayer game<br>• fixed lighting issues around world map wrap<br>• sloped blocks now respect their placement rules<br>• sloped blocks have been added to creative again<br>• colored lights are now properly shown on zoomed minimap<br>• fixed a crash that occurred while opening the in-game shop<br>• loading a world from an obsolete game version (&lt; 2.3) now could work properly, don’t forget to always update your game and worlds!<br>• fixed sky appearing black on world load<br>• many more fixes and tweaks!"},{"version_id":"815242834","version_name":"2.4.8","version_date":"2015-12-17 22:25:41.000 +0800","version_description":"Ho Ho Ho! Welcome to Junk Jack X 2.4.8 Christmas update! This version adds a new planet called Umbra with new mobs, treasures to discover and many mobs with unique drops, a new physics engine, a new fancy equip system, completely revamped player graphics and equip pieces, a new user interface and many fixes throughout the whole game. Zombies will also throw snowballs to you in the new Christmas themed Terra!<br><br>Merry Christmas by Pixbits!<br><br>Changelog:<br><br>- A new spooky planet called Umbra with new mobs, weapons, equip pieces, blocks and objects has been added<br>- The new planet portal chests can be found in new generated Terra worlds<br>- A new special flying type of monster has been added, bats!<br>- Terra is now christmas themed, with themed objects, treasures and a new christmas zombie mob<br>- more than 20 new monsters<br>- many new placeable objects and blocks<br>- many weapons to discover<br>- many equip pieces to discover<br>- 4 new unique music tracks<br>- fancy equip system, to dress like how you want while wearing the best armor pieces!<br>- physics engine has been completely rewritten to be more accurate and believable<br>- the new flying behavior for monsters, bat is just the first one, more will come in the future!<br>- the User Interface has been completely redrawn<br>- new more modern Junk Jack logo<br>- streamlined block and object removal rules accordingly to their appropriate tools<br>- new energy bar system which opens many possibilities for the future (currently used for underwater breath reserve)<br>- chest interface now has the color of the opened chest<br>- the main player sprite has been redrawn, with new appearance and animations<br>- all equip pieces are new, better looking with more details<br>- many small things are changed, enhanced or removed to keep consistency with the ongoing desktop version of the game<br>- fixed broken trading system<br>- fixed a multiplayer craft related to client crashing after exiting from the game<br>- added missing objects and mobs to creative<br>- added some missing crafts<br>- many bug fixes throughout the whole game, too many to list here!<br><br>We hope you’ll enjoy this patch! We didn’t have time to add more features but we’re working hard on the cross-platform engine for the release of the game on desktop platforms and, since we want to keep the iOS version as much coherent as possible with the other upcoming version,  we had to focus a lot on things “behind the scenes”!"},{"version_id":"817521631","version_name":"2.4.9","version_date":"2016-05-25 16:24:42.000 +0800","version_description":"Hello everyone!<br>We reverted the game icon and world theme to its natural, non-Christmassy, state! <br><br>We're sorry for the lack of updates/news in the previous months but we were busy launching Junk Jack on PC/Mac platforms!<br><br>We're now trying to integrate all the enhancements we did on the PC/Mac version back to the iOS version whenever possible, stay tuned and expect major changes in the future!"},{"version_id":"819593633","version_name":"3.0.0","version_date":"2016-11-04 17:15:12.000 +0800","version_description":"Welcome to Junk Jack X 3.0!<br><br>This is our biggest update yet, it includes months of work and brings all the new features and improvements from our PC/Mac version to iOS. The changes are too many to list here, but we’ll try to mention at least the major changes below here!<br><br>There is a downside though: unfortunately we had to change the whole engine, this makes actual worlds and player incompatible, forcing you to start a new game to experience the new patch. Old worlds and players won’t be deleted but they’ll become unaccessible from the game.<br><br>** PLEASE NOTE THAT UPDATING THE GAME WILL MEAN A FRESH START WITH NEW PLAYERS AND NEW WORLDS **<br><br>We sincerely hope you understand, sorry for any trouble this may cause.<br>This is the only choice we had, the only alternative would have been to sell a different game under the same brand which wasn’t acceptable for us. <br><br>Happy mining!<br><br>Changelog:<br>• All new Junk Jack logo!<br>• More than 250 new rare treasures: happy hunting!<br>• All planets have been overhauled with new graphics, content, biomes and tweaks to make them more fun and varied.<br>• New planet reachable from Mykon: Tor! <br>• More than 20 new Tor monsters! <br>• More than 40 new slimes different for each planet<br>• Added a collections view which will track all the things you gathered while playing: rare treasures, fancy equips, fish, cooking recipes<br>• Added scrolling to super minimap <br>• Super mini map will only show discovered areas<br>• New procedural part engine for mobs: many mobs will now have random parts attached!<br>• Explosive arrows!<br>• Each slime type has its own unique behavior <br>• New king slime mobs! <br>• Many mobs have been redrawn from scratch<br>• New weapons, armor, trinkets can be found in Tor<br>• New pocket pets, statues, fish, objects, blocks and so on!<br>• New world sizes options<br>• Added customisation options for world creations also for adventure mode <br>• Tweaked treasures and ores distribution<br>• Dozens of new placeable blocks and objects! <br>• Added objects and blocks to creative <br>• Added a new actuator: piston block! It's able to push players, mobs and items by extending and also behaves as a bridge or one-way door according to rotation <br>• Added a new actuator: advanced pressure pad! It's like the normal pressure pad but it's able to detect mobs too <br>• Added a new actuator: retractable block! it's a block that becomes solid when activated and blocks light, movement and liquids <br>• Trapdoors now behave as devices and can be opened and closed with electronics signal<br>• Health bars of creatures have been added<br>• Improved overall game difficulty balance<br>• Rebalanced food heal values <br>• Rebalanced potions heal values <br>• Tweaked treasures drop rates on all planets <br>• Tweaked chest treasures drop rate <br>• Tweaked portal chests spawn rate <br>• Tweaked crates seeds drop rate <br>• Tweaked mobs health and hit values <br>• Added many utility crates in the world<br>• Added dangerous spikes on end game planets <br>• Portal chests now emit light<br>• Two new types of wood have been added<br>• Additionally tweaked light thresholds for mob spawning <br>• Add-ons now have default crafts available<br>• 6 new wood crossbows, each one with different bullet and fire speed stats <br>• New craftable slingshot which throws tiny rocks <br>• New detailed tool and weapons graphics, with custom animations<br>• New bows graphics<br>• New craftable colored goo torches<br>• Objects and blocks can now be placed on small objects without the need to break them first <br>• It is now possible to place blocks behind objects without breaking them first<br>• Fancy trinket slot is now considered for pet summon and will take priority if a pocket pet trinket is present in that slot <br>• Added Ninja Potion which alters throw speed and power <br>• New ambient sounds and sound effects<br>• New music tracks have been added to Terra<br>• A new manly hurt sound has been added<br>• New liquid graphics <br><br>That's not all! We made dozens of other tweaks and bug fixes to improve the game experience, we hope you will enjoy the new Junk Jack X 3.0!"},{"version_id":"819749928","version_name":"3.0.1","version_date":"2016-11-16 02:07:37.000 +0800","version_description":"Hello miners! This patch fixes many reported issues and crashes, making the experience better and hopefully crash-free. Thanks everyone for the support, we always appreciate constructive feedback.<br><br>Now the game is named Junk Jack, as it’s our flagship product! The old Junk Jack became Junk Jack Retro.<br><br>Have a nice day!<br><br>Changelog<br>• In-App purchases now are saved correctly between sessions.<br>• Fixed a crash on opening stats after using forge/chest/etc<br>• Fixed wrong doors behavior<br>• Explosive arrows won’t explode anymore in protected worlds<br>• Fixed a crash involving extending a piston on top of the world<br>• Fixed a crash happened when attacking monsters<br>• Long tap on backpack now toggles item tooltips on/off<br>• It is now possible to attack creatures with placeable items<br>• Fixed trap-door issues with object placements<br>• Added default chest treasures to Tor chests<br>• Tweaked pickup “pop” sounds<br>• Tweaked mini item stack arrow in inventory labels<br>• Tree leaves can now be broken with any tool effectively<br>• Removed life leech from some weapons<br>• Polearms are now held correctly in your hand<br>• Fixed minor graphical issues on some blocks"},{"version_id":"820152913","version_name":"3.0.2","version_date":"2016-12-15 00:52:49.000 +0800","version_description":"Ho Ho Ho, it’s Christmas time! Terra is now Christmas themed with snow, presents filled with treasures and themed mobs. Decorate your home with the new ornaments, treasures, lights and much more.<br><br>By popular request we have increased tools and weapons range starting from iron and fixed many reported bugs. Thanks for your support!<br><br>Merry Christmas by the Pixbits duo!<br><br>Changelog:<br><br>• Terra is now christmas themed!<br>• zombies and skeletons are now christmas themed<br>• added presents with many cool treasures!<br>• increased range of tools/weapons<br>• reduced hardness of some blocks<br>• fixed wrong offset on some mobs<br>• decreased forge build time in Simple Craft mode<br>• slightly increased crossbow dart damage<br>• fixed crashes when interacting with blocks with potions which enables you tool effects<br>• fixed rotation of top objects which was incorrectly reset when placing a rear block<br>• added missing chat sound<br>• fixed minor bugs"},{"version_id":"820172394","version_name":"3.0.21","version_date":"2016-12-16 02:39:42.000 +0800","version_description":"Ho Ho Ho, it’s Christmas time! Terra is now Christmas themed with snow, presents filled with treasures and themed mobs. Decorate your home with the new ornaments, treasures, lights and much more.<br><br>By popular request we have increased tools and weapons range starting from iron and fixed many reported bugs. Thanks for your support!<br><br>Merry Christmas by the Pixbits duo!<br><br>Changelog:<br><br>• Terra is now christmas themed!<br>• zombies and skeletons are now christmas themed<br>• added presents with many cool treasures!<br>• increased range of tools/weapons<br>• reduced hardness of some blocks<br>• fixed wrong offset on some mobs<br>• decreased forge build time in Simple Craft mode<br>• slightly increased crossbow dart damage<br>• fixed crashes when interacting with blocks with potions which enables you tool effects<br>• fixed rotation of top objects which was incorrectly reset when placing a rear block<br>• added missing chat sound<br>• fixed minor bugs"},{"version_id":"821534998","version_name":"3.1","version_date":"2017-03-31 13:27:45.000 +0800","version_description":"Welcome to Junk Jack 3.1!<br>This patch adds Uber Mobs, powerful monsters that can be summoned by destroying Altars in each world. Defeat them and gather unique powerful equip and weapon sets!<br><br>We have also added new treasures such as weapons, pocket pets, new essence swords and revamped trinkets! Worlds are more varied now with new rare biomes with chests and everything has also been fine tuned once again.<br><br>You will also find Totem pieces in all the planets which can be assembled to form a huge totem tower! Many other features and fixes have been added too. Remember to generate new worlds or you won’t find Altars or Totems.<br><br>Changelog<br>• revamped swing and hit sounds<br>• tweaked weapon animations<br>• each planet will now spawn Altars: destroy them to summon powerful Uber Mobs!<br>• collect 12 new unique looking armor sets which are dropped from Uber Mobs!<br>• collect 12 new unique and powerful weapons which are dropped from Uber Mobs!<br>• 30 new rate pocket pets!<br>• totems have been added! Collect and assemble totems from all the planets<br>• some rare treasures became pocket pets<br>• some rare treasures now became fancy weapons<br>• new essences treasure graphics<br>• revamped ethereal essence trinkets with improved stats<br>• craft ethereal swords by forging them with precious metals and essences<br>• every planet surface will now have rare biomes with chests from the nearest planets!<br>• new rare chests have been added on all planet surfaces<br>• pocket pets icons are now integrated in the inventory just like encrusted weapons<br>• tweaked gem variety and density on all worlds<br>• tweaked mob spawning algorithm and max mob quantity<br>• slight tweaks to ore distributions<br>• added missing colored goo to craft equivalence<br>• added some crafts to default available crafts<br>• tweaked some mobs health values<br>• some loot table tweaks<br>• zombies and skeletons will now wear various helmets!<br>• added generic songs to all planets<br>• tweaked music vs ambient sound occurrence<br>• revamped campfire graphics<br>• improved terra surface variety with new biomes<br>• added trap chest to all planets<br>• fixed various reported graphical issues<br>• small graphical tweaks<br>• various bug fixes<br><br>Happy Uber Slaughtering!"},{"version_id":"822574327","version_name":"3.1.2","version_date":"2017-06-19 17:11:31.000 +0800","version_description":"Welcome to Junk Jack 3.1.2!<br> <br>This version adds preliminary multiplayer based on direct connections between devices! It works for local networks and over internet for reachable connections. It’s cross-platform between all kind and versions of devices which support the game!<br> <br>We also gave the game a new coat of paint with many tweaks, new craftable items, huge monsters, weapons, ancient craftable pick-shovels, revamped graphics and lots of features and refinements to improve the game balance and polish. <br> <br>Happy mining and thanks for your continued support!<br> <br>• new network advertiser to find games over local networks!<br>• more than 40 mobs have been redrawn from scratch!<br>• 12 new entirely revamped and much bigger golems!<br>• 12 new wearable golem heads<br>• new unique antique shards have been added on each planet<br>• use the new antique shards to craft 12 new powerful pickshovels!<br>• new wood and stone pedestals, use them to display your precious treasures!<br>• new craftable glass showcase<br>• new craftable glass shelf<br>• new craftable flower supports<br>• new craftable golem pets<br>• new utility crates added on all worlds!<br>• added rotting pocket pig and sheep pets<br>• many balance tweaks to weapon damages<br>• many balance tweaks to mobs damage and health<br>• tweaked loot tables and general balance<br>• tweaked mobs health and general damage<br>• tweaked essential soul sword crafts<br>• tweaked uber mobs damage and mobs damages<br>• tweaked music and ambient sounds distribution on all planets<br>• improved statues graphics<br>• improved addons graphics<br>• improved gem torches graphics, they glow now!<br>• improved gardening plants graphics<br>• improved vases graphics<br>• improved furniture sets graphics <br>• modified crafts available by default<br>• new reagents have been added to alchemy<br>• fixed duplicate drops on some objects<br>• old chair can now be flipped<br>• gem blocks are now translucent!<br>• many craft tweaks and balances<br>• new item gather animation<br>• all tools and weapons have had their graphics improved<br>• all mobs have been revamped with new shading<br>• fixed pocket king slime not appearing. Now it has new graphics too!<br>• fully redrawn equip pieces with new shading<br>• player graphics have been improved<br>• fixed some crossbows and bows not correctly appearing when equipped<br>• new craftable rare golem smashers<br>• new craftable rare gorlem armor pieces!<br>• revamped craftable chests graphics<br>• tweaked some blocks graphics<br>• new library block<br>• new rain sound<br>• improved overall Terra biomes density and quality<br>• added rare palms in the desert biome<br>• added large bricks column in the stone biome on terra<br>• added craftable large stone bricks!<br>• sugar canes will now appear in Terra<br>• revamped stone merlons<br>• tweaked maximum allowed hostile mobs<br>• tweaked ground chests spawn rate<br>• new rare flowers added in the stone biome<br>• tweaked rare biomes occurrence on all planets<br>• increased default music volume<br>• fixed some minor graphical issues"},{"version_id":"825257414","version_name":"3.1.5","version_date":"2017-12-14 01:55:20.000 +0800","version_description":"Hello miners, it's Christmas once again! This update adds rare fossils on all planets which can be combined to form unique creations by assembling their pieces!<br><br>Terra is now Christmas themed with presents all over the surface which contain unique loot! Capture and breed the new reindeers, fight Christmas themed zombies and skeletons and find the new Pocket Santa pet! Last but not least Junk Jack now supports the new iPhone X screen format!<br><br>Merry Christmas by the Pixbits duo!<br><br>Changelog:<br>• Game is now optimized for iPhone X display<br>• Terra is now christmas themed!<br>• zombies and skeletons are now Christmas themed<br>• added presents on Terra surface which contain many cool treasures!<br>• new Pocket Santa pet!<br>• new discoverable fossils have been added on all planets!<br>• new breedable reindeers!<br>• new craftable reindeer stable!<br>• fixed wrong offset on some mobs<br>• fixed doors which weren’t blocking player in certain situations<br>• fixed a crash while holding on specific items in creative inventory<br>• fixed Pixbits Shirt and Tiny Jack which didn’t stay in inventory after quitting<br>• fixed minor bugs<br>• fixed some stability issues which could lead to random crashes while playing<br>• fixed some pocket pets not working correctly"},{"version_id":"825832644","version_name":"3.1.6","version_date":"2018-02-07 03:46:56.000 +0800","version_description":"Hello everyone! This version removes the Christmas theme from the game and adds St. Valentine chests in Terra that contain cool themed loot! We have also tweaked loot and utility chests distribution on all planets to improve game balance. Happy mining!"},{"version_id":"827899776","version_name":"3.2","version_date":"2018-07-18 16:35:30.000 +0800","version_description":"Welcome to Junk Jack 3.2 Pet Hunt Update!<br><br>This patch adds 75 fancy rare pocket pets in all worlds which can be captured, hunt ‘em all! We’ve also added the Junk Machine, used to recycle your crafts and get new items and rare loot. Plus there are now new breedable chihuahua and hamster pets, many new features and cool items to discover, an habanero plant used to craft habanero bombs and soup, craftable concussion bombs and new rare cards used to craft pocket uber mob pets are included too. Plus many more cool things to discover and small tweaks!<br><br>Happy mining (and hunting!)<br><br>New features:<br><br>Added 75 Rare fancy pets on all planets, hunt ‘em all!<br>New craftable sharpening stones, use them to repair your tools!<br>New hamster cage<br>New hamster pets, capture and breed them!<br>Added breedable chihuahua pets!<br>More blocks can now be painted<br>Uber mob altars will now drop rare cards<br>Combine the cards to craft unique uber mob pets<br>You can also use cards as trinkets which will give you unique powers<br>Valentine chests have been removed from planets<br>Junk machine! Use it to recycle your crafts to get new materials and items!<br>Totem spawn chance has been increased on all planets<br>New habanero orange plant<br>New habanero soup recipe<br>New craftable habanero bombs!<br>New craftable concussion bombs!<br>New pocket Crosshair pet, paying homage to Junk Jack Original graphics!<br>Animals will now create dung, which you can use to fertilize plants<br>New craftable Pickaxe of the Giants!<br>Craftable torch in a bottle which can be placed underwater<br>New rare blocks can now be found on all planets<br>New homage pixelated stone block which pays homage to a very known sandbox game!<br>New CGA retro block<br>New Tretis block!<br>Added craftable vine ladders<br>Added rare outline armor to give Jack an unique look!<br>Added rare retro armor to give Jack a retro look!<br>New droppable baseball bat weapon<br>New poo head fancy equip piece<br>New eye head fancy equip piece"},{"version_id":"830859153","version_name":"3.2.1","version_date":"2019-04-22 10:00:41.000 +0800","version_description":"Welcome to Junk Jack 3.2.1!<br>This version contains a lot of bug fixes and some quality of life enhancements that we're sure you will like! Support for newest iPhone models has been added too!<br><br>Changelog:<br>• Added haptic effects! (you can toggle them from Options-&gt;Interface)<br>• Chest Interface now is twice as big for better organization (on devices which fit it)<br>• Items are now continuously moved while inside flowing fluids<br>• Added iPhone XR and iPhone XS Max support for larger displays!<br>• Health regen from equip now triggers after 5 second without taking damage from monsters<br>• Implemented item sets bonuses: this features allows to give specific bonuses (and effects) when a specific set of items is equipped<br>• Created a set for each Uber boss equip drop, now the single equip pieces give less light value, equipping the full set gives the full light value<br>• Added light value to tooltips of armor pieces<br>• Added tooltips to some unclear potions<br>• Some mobs are now able to see through player invisibility<br>• Thorns damage on monsters is now mitigated by their defense<br>• Thorns related potions have been buffed<br>• Adjusted some thorns bonuses from equip<br>• Fixed critical chance of weapons which wasn’t working (all had 0% critical)<br>• Fixed bug which wasn’t updating collections when equipping items or pets<br>• Fixed bug which didn’t consume proper amount of items when using simple craft<br>• Fixed bug which allowed instant forge crafting<br>• Fixed a crash when dropping an item stack into an occupied space in some circumstances<br>• Fixed a rare issue which could corrupt your player save (this fix is retroactive, it could repair corrupted players too)<br>• Fixed quick stack from forge which didn’t properly move items<br>• Fixed craftbook key which was working in creative and crashing the game<br>• Fixed Metal Feet potion, now it properly makes you immune to spikes<br>• Fixed open save folder option which wasn’t working<br>• Fixed a random crash when browsing collections<br>• Fixed a crash that occurred when destroying some growing plants<br>• Fixed truth table device which wasn’t working as intended<br>• Changed Bottomless Chest UI color to match the graphics<br>• Fixed some weapons which had wrong animations<br>• Fixed some graphical glitches<br>• Fixed hacked item stacks larger than 999 items which could crash the game<br>• Added an option to show help for some items in their tooltips<br>• Changed double confirmation dialogs to be more secure"},{"version_id":"839624312","version_name":"3.3","version_date":"2020-12-14 09:56:02.000 +0800","version_description":"Hello fellow miners! This version includes tenths of stability fixes and improvements which have been made over last months on the game engine to provide a more stable and rewarding experience!"},{"version_id":"839868464","version_name":"3.3.1","version_date":"2021-01-05 00:13:23.000 +0800","version_description":"This small update addresses issues with newer iOS devices on which controls didn't work properly!"}]