[{"version_id":"818419200","version_name":"3.4.1","version_date":"","version_description":""},{"version_id":"818571151","version_name":"3.5","version_date":"","version_description":""},{"version_id":"818845071","version_name":"3.6","version_date":"","version_description":""},{"version_id":"819068330","version_name":"3.6.1","version_date":"","version_description":""},{"version_id":"819213035","version_name":"3.7","version_date":"","version_description":""},{"version_id":"819466222","version_name":"3.8","version_date":"","version_description":""},{"version_id":"819701444","version_name":"3.8.1","version_date":"","version_description":""},{"version_id":"819817013","version_name":"3.9","version_date":"","version_description":""},{"version_id":"819952400","version_name":"3.10","version_date":"","version_description":""},{"version_id":"820449920","version_name":"3.11","version_date":"","version_description":""},{"version_id":"820521169","version_name":"3.11.1","version_date":"","version_description":""},{"version_id":"820637588","version_name":"3.12","version_date":"","version_description":""},{"version_id":"820818381","version_name":"3.12.1","version_date":"","version_description":""},{"version_id":"820915239","version_name":"3.13","version_date":"","version_description":""},{"version_id":"821153869","version_name":"3.14","version_date":"","version_description":""},{"version_id":"821282745","version_name":"3.15","version_date":"","version_description":""},{"version_id":"821375016","version_name":"3.15.1","version_date":"","version_description":""},{"version_id":"821391748","version_name":"3.15.2","version_date":"","version_description":""},{"version_id":"821501692","version_name":"3.16","version_date":"","version_description":""},{"version_id":"821610793","version_name":"3.16.1","version_date":"","version_description":""},{"version_id":"821626326","version_name":"3.16.2","version_date":"","version_description":""},{"version_id":"821677769","version_name":"3.17","version_date":"","version_description":""},{"version_id":"821868501","version_name":"3.18","version_date":"","version_description":""},{"version_id":"821962141","version_name":"3.18.1","version_date":"","version_description":""},{"version_id":"822121386","version_name":"3.19","version_date":"","version_description":""},{"version_id":"822395360","version_name":"3.20","version_date":"","version_description":""},{"version_id":"822467138","version_name":"3.20.1","version_date":"","version_description":""},{"version_id":"822575879","version_name":"3.22","version_date":"","version_description":""},{"version_id":"822759842","version_name":"3.23","version_date":"","version_description":""},{"version_id":"822809481","version_name":"3.23.1","version_date":"","version_description":""},{"version_id":"822874508","version_name":"3.23.2","version_date":"","version_description":""},{"version_id":"823073287","version_name":"3.25","version_date":"","version_description":""},{"version_id":"823290490","version_name":"3.26","version_date":"","version_description":""},{"version_id":"823471386","version_name":"3.27","version_date":"2017-08-31 22:02:50.000 +0800","version_description":"- Fixed: Bot avatars were sometimes not appearing. This was not a menacing indication of a stealth AI uprising, it was a bug. They will now once again show themselves. <br>- Fixed: In a complex series of events, if you took a screenshot, and you had no previous photos in your photo library, the app would sometimes crash. <br>- Fixed: VoiceOver users in threads can now use the scrub gesture to exit back into the channel. So there were no scrubs, but having received some love from us, there now are. <br>- Fixed: Private channels were missing from the channel list in some users accounts. Apologies for this. They’re meant to be private, but not that private.<br><br>Want to see *your* favorite bug featured in this list? We would too. Send along any feedback to feedback@slack.com, and we’ll see what we can do."},{"version_id":"823528948","version_name":"3.28","version_date":"2017-09-12 01:13:31.000 +0800","version_description":"• Slack is now fully available in French, Spanish and German, down to the very last emoji.<br>• Support also added for a brand new way of working with external companies from within Slack.<br>• And, while we’re at it, a whole new way of handling name tagging in order to handle the exciting world of challenges brought by the two things above.<br>• Fixed: The numeric keyboard was proving sticky, refusing to disappear after signing into an account with 2FA. It has now been unstuck.<br>• Fixed: Large emoji — or, “jumbomoji” — will no longer overlap the message below.<br>• Fixed: When displaying certain images in attachments, the app would sometimes crash. That’s certain types of images, rather than images of certain things. We think. Either way, it no longer does that.<br><br>Want to see *your* favorite bug featured in this list? We would too. Send along any feedback to feedback@slack.com, and we’ll see what we can do."},{"version_id":"823566935","version_name":"3.28","version_date":"2017-09-12 01:13:31.000 +0800","version_description":"• Slack is now fully available in French, Spanish and German, down to the very last emoji.<br>• Support also added for a brand new way of working with external companies from within Slack.<br>• And, while we’re at it, a whole new way of handling name tagging in order to handle the exciting world of challenges brought by the two things above.<br>• Fixed: The numeric keyboard was proving sticky, refusing to disappear after signing into an account with 2FA. It has now been unstuck.<br>• Fixed: Large emoji — or, “jumbomoji” — will no longer overlap the message below.<br>• Fixed: When displaying certain images in attachments, the app would sometimes crash. That’s certain types of images, rather than images of certain things. We think. Either way, it no longer does that.<br><br>Want to see *your* favorite bug featured in this list? We would too. Send along any feedback to feedback@slack.com, and we’ll see what we can do."},{"version_id":"823823415","version_name":"3.29","version_date":"2017-09-28 20:38:40.000 +0800","version_description":"• Oh happy day: A tricksy bug was finally squished, and audio files now work over bluetooth. Because it is 2017 after all.<br>• Fixed: Copy and pasting text in the message input now, thankfully, works on devices running iOS 11. Apologies for any frustration caused.<br>• Fixed: You can, once again, switch workspaces on your watch, as long as it is the right kind of Watch.<br>• Fixed: The 24-hour-clock preference had been resetting itself after app updates, and regressing to AM/PM mode even though you’d clearly made your position clear. We fixed it, so now you’ll always know (precisely) what time it is.<br><br>Want to see *your* favorite bug featured in this list? We would too. Send along any feedback to feedback@slack.com, and we’ll see what we can do."},{"version_id":"823986660","version_name":"3.30","version_date":"2017-10-13 18:59:11.000 +0800","version_description":"• We added a new, simpler way to sign into all workspaces associated with one email address.<br>• Fixed: When viewing Dropbox files from iOS the content should now, hopefully, always be up to date.<br>• Fixed: The keyboard was popping up when using 3D Touch to preview a channel. We have instructed the keyboard to stop that, because it was annoying. You can now preview from the channel list without it getting in the way.<br>• Fixed: The act of signing back into a workspace immediately after signing out was being hampered by an obstructive bug — which has been dispatched. Come and go as you please.<br><br>Want to see *your* favorite bug featured in this list? We would too. Send along any feedback to feedback@slack.com, and we’ll see what we can do."},{"version_id":"824057092","version_name":"3.31","version_date":"2017-11-01 21:59:13.000 +0800","version_description":"• Fixed: When updating your profile picture, the “done” button couldn’t be tapped. This may have made it seem like your new picture wasn’t saved which is fair. It really was saved, and now the “done” button is properly tappable.<br>• Fixed: With VoiceOver enabled, some users were unable to load previous channel history. The pathway to a more complete aural history is now reestablished (it loads, basically).<br>• Also fixed: VO users couldn’t swipe the message input buttons (like `/` and `@`) when the keyboard was raised. Instead, they had to tap. We’re sorry for the accidental game of whack-a-mole — you can now swipe to your heart’s content.<br>• Fixed: A crash loop was occurring for some users. Turns out, it was an emoji based problem. Our feelings about this, best conveyed in emoji form, will not render here, which is probably for the best. It’s now fixed.<br><br>Want to see *your* favorite bug featured in this list? We would too. Send along any feedback to feedback@slack.com, and we’ll see what we can do."},{"version_id":"824280542","version_name":"3.32","version_date":"2017-11-10 01:49:50.000 +0800","version_description":"• The main message view, where you read channels and all other messages, has been given a thorough overhaul, with a whole bunch of performance improvements and bug fixes for various long-standing issues. This will roll out slowly to users in the coming week (and more performance improvements are on the way).<br>• Fixed: The small number of users unable to sign in using SSO/2FA now can, once more.<br>• Fixed: On iOS 9 devices the “@” button below the message input field was not correctly positioned. We scooched it, and are now satisfied by its situation.<br><br>Want to see *your* favorite bug featured in this list? We would too. Send along any feedback to feedback@slack.com, and we’ll see what we can do."},{"version_id":"824370563","version_name":"3.32.1","version_date":"2017-11-17 01:01:52.000 +0800","version_description":"Slack now officially, and fully, supports Japanese. Along with the already available French, German, Spanish, and, of course, English (of the US variety)."},{"version_id":"824660257","version_name":"3.33","version_date":"2017-12-01 19:49:44.000 +0800","version_description":"Bug Fixes<br>• The direct message list stopped sorting correctly in 3.32. It now, once again, sorts alphabetically.<br>• The autocomplete menu wasn’t working when viewing the messages on some older phones. This is now fixed.<br>• When reading a thread in a channel you were not a member of, but simply previewing, the join button was blocking your view of the last messages. This complex combination of conflated conditions will no longer cause consternation. As we fixed it."},{"version_id":"825155015","version_name":"3.34","version_date":"2017-12-14 23:00:50.000 +0800","version_description":"Bug Fixes<br>• Tapping the status bar to scroll to the top on an iPhone X was previously jerky and jumpy, which was funky, but not in a good way.<br>• Fixed: File previewing - particularly full screen - on the iPhone X needed a little fine-tuning. It is closer to fine now.<br>• Fixed: When viewing posts on an iPhone X, the text from the post was spreading itself about more than was polite, or necessary. It now tucks itself in, as intended.<br>• Fixed: The app was disrespecting the “Mark as Read Immediately” preference, by not immediately marking as read. Respect was due. Respect now given.<br>• Fixed: After swiping between a thread and channel there was very occasional sluggishness. No more.<br>• Fixed: A couple of rare crashes, caused by such things as: A button, no longer visible, attempting to use itself, and random messages somehow imagining themselves to have negative height, therefore creating a kind of mini black hole into which they collapsed. You won’t have seen these problems, because as mentioned, they were either invisible, or occupied theoretical negative space. Regardless, the things that no longer were have ceased to be, leading to a sharp uptick in crashes that no longer happen, and a mild philosophical headache."},{"version_id":"825631309","version_name":"3.35","version_date":"2018-01-18 22:39:31.000 +0800","version_description":"In order to keep supporting the growing capabilities of newer operating systems, this will be the last version of Slack that supports iOS 9, and hence, the last update for the iPhone 4S and several other classic devices.<br><br>Bug Fixes<br>• For the newer older devices (from the ones mentioned above onward), the performance of the Quick Switcher has been much improved.<br>• Fixed: Sharing from certain apps to Slack had the unfortunate side effect - or rather, effect - of causing the app to crash. This effect, which was more of a defect, should no longer affect you.<br>• Fixed: Signing out of an account with many teams took a long time. Now it takes less.<br>• Fixed: A layout problem that happened when opening a push notification from a thread (which sent the checkbox to “Send to main conversation” scuttling to the wrong part of the screen), has been fixed, and everything returned to its rightful place."},{"version_id":"825791818","version_name":"3.36","version_date":"2018-01-31 22:03:36.000 +0800","version_description":"Apple Watch users, there's now one iOS app for all of your needs. We've removed the standalone Watch App, but rest assured, receiving and replying to messages from your wrist works the same as before. It’s like two for the price of one, but with apps.<br><br>Bug Fixes<br><br>• Fixed: The app could get into a state where it would ask for permission to turn on notifications every time it was launched, even if you had, very reasonably, said you did not want them. This was frustrating, and will no longer happen. <br>• Fixed: Entering the same custom emoji twice in a row would sometimes only show one copy of the emoji. We cannot apologize enough.<br>• Fixed: When pasting very large chunks of text into the message box, Slack sometimes crashed. It no longer will. A tendency toward mellifluous over-verbosity is not, after all, a proclivity we should take the high road on."},{"version_id":"825959806","version_name":"3.37","version_date":"2018-02-14 22:10:12.000 +0800","version_description":"Bug Fixes <br>• Fixed: Uploading a large video or image file would fail silently. Now it generally succeeds, and if it doesn’t, has the decency to let you know. <br>• Fixed: When sharing multiple photos from the Photos app, one or more would silently slip away into the void. We’ve plugged that hole, and they should all now upload as intended.<br>• Fixed: The buttons for some bots and apps that had stopped working now work once more."},{"version_id":"826089894","version_name":"3.38","version_date":"2018-02-28 21:47:43.000 +0800","version_description":"• Fixed: Two-factor authentication would occasionally become four-, six-, or eight-factor authentication. We’ve fixed this: you’ll now only be asked to authenticate your login once.<br>• Fixed: The option to send replies to a thread back to the channel wasn’t working. You might even say it was stringing you along. We’ve tied up our loose ends and this is now fixed.<br>• Fixed: When testing notifications while using Slack in Japanese, an error message would sometimes appear even if everything was working. Our notifications can now tell right from wrong."},{"version_id":"826252559","version_name":"3.39","version_date":"2018-03-14 18:13:08.000 +0800","version_description":"What’s New <br>• When you share something in Slack, we’ll use the last channel you shared a file as the default destination as is logical. Or at least more logical. <br>• Sending messages in poor connection conditions is now a little more reliable. Because neither snow nor rain nor heat nor dearth of signal should stand between you and us trying to send your message.<br><br>Bug Fixes <br>• Fixed: A faulty link that prevented some owners and admins from managing their workspace. <br>• Fixed: Emoji reactions in threads were starting to crowd one another. The gaggle has dispersed and threads should look orderly once again."},{"version_id":"826426700","version_name":"3.40","version_date":"2018-03-28 18:40:27.000 +0800","version_description":"What’s New <br>• It's now easier to change the name of file uploads, due to a darling little X button that will clear the field so you can rename it. <br><br>Bug Fixes <br>• Fixed: When sharing something from Slack to another app via the “Open In...” Button, we'll now preserve the original file name."},{"version_id":"826602527","version_name":"3.41","version_date":"2018-04-11 20:19:34.000 +0800","version_description":"What’s New <br>• Videos can, once more, be saved, by way of the “Open In...” menu item.<br><br>Bug Fixes <br>• Fixed: When you tapped on a notification caused by one of your keywords, we weren't highlighting the keyword when you got there. Confusing. These keywords will now be highlighted (highlit?) once more. Better.<br>• Fixed: Channel names were sometimes unreadable on iPads when using the Hoth sidebar theme, due to being white text on a white background. We have eschewed minimalist aesthetic in favor of readability."},{"version_id":"826792927","version_name":"3.42","version_date":"2018-04-24 18:40:23.000 +0800","version_description":"Bug Fixes <br>• Fixed: When replying to a thread and sending your reply to the channel, the text snuggled up with the \"number of replies\" indicator, muddying the view and muddling everything. It's all clear now. <br>• Fixed: When filtering group conversations, we now also search for people typed after a comma. So if you're looking for that conversation with \"Alvin, Simon, Theodore\" we won't just return all results for \"Alvin\". <br>• Fixed: Improved reliability for uploading large videos, from share sheet, and from within Slack.<br>• Fixed: On the German version of the Welcome screen, there were layout issues, because the intersection of language and technology is a beautiful, complex, exciting challenge to deal with. In this one place, and one language, though, it is a problem that has been surmounted. For now."},{"version_id":"826880327","version_name":"3.43","version_date":"2018-05-09 18:51:32.000 +0800","version_description":"• Fixed: Videos uploaded from Slack on newer iPhones and iPads now play back seamlessly and correctly (and just as you might have always expected) on the Desktop app.<br>• Fixed: After tapping on a notification to read a message in a thread, the \"All Threads\" header remained bold, as if there was an unread message. Which there wasn't (or if there was, it wasn't the one you just read, because you just read it). We know. You read it. It all makes sense now."},{"version_id":"827285869","version_name":"3.44","version_date":"2018-05-29 19:05:18.000 +0800","version_description":"Bug Fixes <br>• Fixed: It's now, once more, possible to edit comments on images or files.<br>• Fixed: Slack should no longer crash when you're sharing from certain popular news apps. That's all from the team here — and now, the weather."},{"version_id":"827401816","version_name":"3.45","version_date":"2018-06-05 18:46:04.000 +0800","version_description":"What’s New <br>• If you're having trouble with notifications, a new tool (found under Settings -&gt; Notifications -&gt; Troubleshoot Notifications) can help diagnose problems. In fact, opening the tool alone can occasionally fix problems. Which seems like wizardry, but is, in fact, technology. <br><br>Bug Fixes <br>• Fixed: Sometimes, opening a notification from a thread would cause older messages in the thread to vanish (paf!) and only the most recent message to appear (ta-da!). A kind of magic, but not a good kind. So we fixed it.<br>• Fixed: Usually-clickable links inside tweets became unclickable when certain apps were set as preferred ones for Twitter links. Now, they're clickable once more."},{"version_id":"827433961","version_name":"3.45.1","version_date":"2018-06-06 16:47:09.000 +0800","version_description":"What’s New <br>• If you're having trouble with notifications, a new tool (found under Settings -&gt; Notifications -&gt; Troubleshoot Notifications) can help diagnose problems. In fact, opening the tool alone can occasionally fix problems. Which seems like wizardry, but is, in fact, technology. <br><br>Bug Fixes <br>• Fixed: Sometimes, opening a notification from a thread would cause older messages in the thread to vanish (paf!) and only the most recent message to appear (ta-da!). A kind of magic, but not a good kind. So we fixed it.<br>• Fixed: Usually-clickable links inside tweets became unclickable when certain apps were set as preferred ones for Twitter links. Now, they're clickable once more."},{"version_id":"827519984","version_name":"3.46","version_date":"2018-06-21 19:46:23.000 +0800","version_description":"Bug Fixes <br>• Fixed: Editing a message in a thread will now edit the original message, as is right and proper, rather than sending a new one, which was not. <br>• Fixed: When trying to share an image or link to Slack, some people (who were signed in), encountered an erroneous error about being “not signed in”. We will no longer fib about this fact. <br>• Fixed: People a) using Slack in Japanese who wanted to b) send a single word message that c) happened to match the name of an emoji (but was not written with colons like our emoji) were perplexed when we would automatically translate the word into English upon sending it. Technology is weird, friends. We're doing our best."},{"version_id":"827679611","version_name":"3.46.1","version_date":"2018-06-28 21:49:32.000 +0800","version_description":"Bug Fixes <br>• We tuned up the engine and gave the interiors a thorough clean. Everything is now running smoothly again."},{"version_id":"827725199","version_name":"3.47","version_date":"2018-07-09 21:01:06.000 +0800","version_description":"Bug Fixes <br>• Fixed: Large files will now upload better, and succeed more often (or notify you if, for some reason, they don't). <br>• Fixed: The button to show additional attachments was broken, stopping users from being able to see more than 20 attachments in a single message. 20! In a single message! You can do that! (Now!) <br>• Fixed: Users who had selected a non-English language would see an incorrectly-escaped ampersand (\"Cosette &amp; Fantine\" instead of \"Cosette &amp; Fantine\")… but only, weirdly, when two users were typing."},{"version_id":"827880210","version_name":"3.48","version_date":"2018-07-17 17:07:22.000 +0800","version_description":"What’s New <br>• Move your workspaces around in the Workspace Switcher into the order that makes sense to you, rather than to us. Tap the edit button at the top of that screen, and move them all, using only the power of your finger (on the screen). <br>• And if there's a workspace you no longer need to be in, you can sign out of it from the Workspace Switcher, too.<br><br>Bug Fixes <br>• Fixed: Tapping on a channel name will now, once more, highlight the channel name. (It will also still take you to the channel, but that bit wasn't broken)."},{"version_id":"828038169","version_name":"3.49","version_date":"2018-08-08 22:26:31.000 +0800","version_description":"What’s New <br>• Threads support files — and files support threads. Images and files can now be uploaded directly to threads — you can do it by adding files as you normally would. When you comment on a file, it now appears as a thread reply. And, just like message threads, your file reply stays nested in a thread attached to the file. Finally."},{"version_id":"828196235","version_name":"3.50","version_date":"2018-08-13 20:58:15.000 +0800","version_description":"Bug Fixes <br>• Fixed: A layout issue in the \"Do Not Disturb\" menu was causing gray squares to appear at the top of the settings in that menu. Apologies if you liked them: they're now gone. <br>• Fixed: The notifications preferences for channels were appearing to be the default, even if you'd chosen different notification settings. We were still only sending the notifications you had chosen; it was just the display was wrong. Phew."},{"version_id":"828339151","version_name":"3.51","version_date":"2018-08-27 19:03:13.000 +0800","version_description":"What’s New <br>• Message actions come to iOS: It's now easier to create tasks, comment on tickets, or follow-up on things while on the move. So if you have important tools like Asana, Zendesk and Jira connected to Slack, you can now long press any message and create a follow up without needing to log into those tools. It's very good. We recommend it.<br>• Fixed: A lag in the graphical interface was causing a gap when generating /giphy previews. Going forward, they'll appear in a jiffy, which is a gift, when GIFing. <br>• Fixed: Should you wish to respond to a notification from a channel right from the notification screen (just like in the good old days) you now can, once more."},{"version_id":"828514423","version_name":"3.52","version_date":"2018-09-10 19:29:48.000 +0800","version_description":"• When you set your status, you can now also set a time (or date) for it to expire. No longer will people question how you're \"Working remotely on Tuesday\" when it's Thursday, or wonder why you've been \"At the dentist\" for 19 consecutive hours.<br>• Fixed: If someone else changed their status while your app was offline, we would sometimes still show the old status after you came back online. This was confusing for everyone, frankly. Thankfully, it no longer happens."},{"version_id":"828657135","version_name":"3.53.1","version_date":"","version_description":""},{"version_id":"828750048","version_name":"3.60","version_date":"2019-01-16 18:01:01.000 +0800","version_description":"• From today, you'll notice a shiny new app button that matches our new logo. You can read more about it, should you wish to, on our blog at SlackHQ.com. Change! Everyone loves it. (Having said that, nothing about Slack or how you use it has changed. Just the button.)"},{"version_id":"828750048","version_name":"19.3.1","version_date":"2019-03-11 18:15:36.000 +0800","version_description":"What’s New<br>• Dark Mode can now be switched on (or off) in the Settings menu. Yes, it’s been a long road, but there’s finally dark at the end of the tunnel. NB: This is mobile only for now, with desktop coming later — thank you for both bearing with us, and for continuing to expect more of us.<br><br>Bug Fixes<br>• Fixed: The text welcoming you to Slack the very first time you launched the app didn’t quite fit the screen on smaller devices. Not the biggest problem in the world (literally), but first impressions count."},{"version_id":"828750048","version_name":"19.2.1","version_date":"2019-02-11 20:11:45.000 +0800","version_description":"What’s New <br>• The way that messages are displayed in channels and threads has been given an injection of fresh code, leading to better scrolling, improved accessibility, and more chance of tapping the bit of the screen you meant to tap.<br>• For users of VoiceOver, myriad improvements: Messages now read with a more human tone, and message structure has been harmonized across the main channel and threads views. The messages view is now easier to read and to navigate, complete with custom actions for each message. The threads view, meanwhile, contains more information, and message actions like starring or sharing messages to another channel. Phew.<br>• For the eagle-eyed: Yes, the last release was numbered 3.61. This one is 19.2.1. You haven't missed anything, or been asleep for a decade. We just changed the way we number releases."},{"version_id":"828750048","version_name":"3.57","version_date":"2018-11-26 20:32:49.000 +0800","version_description":"What’s New <br>• Need to pause notifications? Thinking of going on vacation for more than 24 hours? Good news. You can pause them beyond a single day, or until a specific date or time. And we’ve also added two new presets to our existing list: “Until tomorrow” and “Until next week”. There! A veritable panoply of new options for pausing notifications! Or, at the very least, \"more than before\"!"},{"version_id":"828750048","version_name":"3.54","version_date":"2018-10-08 18:32:34.000 +0800","version_description":"• Fixed: tfw uploading .png images via the share sheet no longer converts them to .jpg format, or any other three-letter collection of letters, like, idk, omg bbq etc. Yay! <br>• Fixed: Users in workspaces requiring single sign-on were unable to use the magic email link, and could only complete the setup process if they chose to \"sign in manually\". This should be all better now."},{"version_id":"828872389","version_name":"3.55","version_date":"2018-10-20 16:54:05.000 +0800","version_description":"• Fixed: If you received a notification then went to read the channel the notification was from, the Slack icon in top-left of the app would sometimes stay red-dotted until you closed and reopened the app. Even though you had read the message. Even when you were in the channel, reading the message and replying to it. Not always. Not 100% of the time. Just often enough that it confused the heck out of everyone. Sorry about that. It's fixed now."},{"version_id":"829021699","version_name":"3.56","version_date":"2018-11-05 19:58:36.000 +0800","version_description":"What’s New <br>• Now, after you confirm your email, you’ll see a list of your workspaces, and pick which ones you’d like to sign into. And then sign into them!<br>• You can now receive notifications while using the app, so If you're catching up on a channel and you receive a DM you won't miss it (and if that doesn't sound like something you'd want, you'll find this in the notification settings menu).<br><br>Bug Fixes <br>• Fixed: Sometimes, using “quick reply” to send a message from a notification would report as “failed to send”, even though it had, in fact, successfully sent. Truth will now prevail."},{"version_id":"829229890","version_name":"3.57","version_date":"2018-11-26 20:32:49.000 +0800","version_description":"What’s New <br>• Need to pause notifications? Thinking of going on vacation for more than 24 hours? Good news. You can pause them beyond a single day, or until a specific date or time. And we’ve also added two new presets to our existing list: “Until tomorrow” and “Until next week”. There! A veritable panoply of new options for pausing notifications! Or, at the very least, \"more than before\"!"},{"version_id":"829455670","version_name":"3.58","version_date":"2018-12-11 18:11:56.000 +0800","version_description":"Bug Fixes <br>• Fixed: If you have a DM conversation containing only one message, you can, once more, long press to mark that message as unread, and come back to it later. Or not. Up to you. <br>• Fixed: Changing status was proving inconceivably tricky for people whose workspace had customized the list of statuses. Now you can select, deselect, reselect, and customize your status as you wish. <br>• Everything else is fine. (We hope.)"},{"version_id":"829751503","version_name":"3.59","version_date":"2019-01-07 20:00:45.000 +0800","version_description":"What’s New <br>• We now compress jpeg images while uploading them, so image uploads should be quicker and more reliable. If you're happy to sacrifice a little time for a less compressed image, that's fine too: you can toggle this setting in Settings &gt; Advanced. <br><br>Bug Fixes <br>• Fixed: When using an external keyboard with an iPad, some keyboard shortcuts were not behaving as they should — or, in fact, at all. They have been brought back in line, and should now function just as you'd expect. <br>• Fixed: You can now use the quick switcher to switch to a DM session with someone no longer on your team. Because people may leave, but knowledge remains. It's a very useful thing that way."},{"version_id":"829884793","version_name":"3.60","version_date":"2019-01-16 18:01:01.000 +0800","version_description":"• From today, you'll notice a shiny new app button that matches our new logo. You can read more about it, should you wish to, on our blog at SlackHQ.com. Change! Everyone loves it. (Having said that, nothing about Slack or how you use it has changed. Just the button.)"},{"version_id":"830097203","version_name":"3.61","version_date":"2019-01-28 20:25:19.000 +0800","version_description":"Bug Fixes <br>• Fixed: Scrolling through the Activity feed could feel quite jumpy, getting worse the further down you scrolled. We tweaked some things and made scrolling smoother; no longer will we persecute you for being popular."},{"version_id":"830148578","version_name":"19.2.1","version_date":"2019-02-11 20:11:45.000 +0800","version_description":"What’s New <br>• The way that messages are displayed in channels and threads has been given an injection of fresh code, leading to better scrolling, improved accessibility, and more chance of tapping the bit of the screen you meant to tap.<br>• For users of VoiceOver, myriad improvements: Messages now read with a more human tone, and message structure has been harmonized across the main channel and threads views. The messages view is now easier to read and to navigate, complete with custom actions for each message. The threads view, meanwhile, contains more information, and message actions like starring or sharing messages to another channel. Phew.<br>• For the eagle-eyed: Yes, the last release was numbered 3.61. This one is 19.2.1. You haven't missed anything, or been asleep for a decade. We just changed the way we number releases."},{"version_id":"830378136","version_name":"19.2.2","version_date":"2019-02-26 19:01:12.000 +0800","version_description":"What’s New <br>• We’ve updated the background color of the app icon, to make it easier to see.<br><br>Bug Fixes <br>• Fixed: If you left a channel then quit the app in rapid succession, sometimes the channel would still show up in the sidebar claiming to have new messages. After a thorough investigation, we have confirmed that, fascinatingly, when a user leaves a channel, they do not want to see messages in it. So we’ve discontinued this behavior."},{"version_id":"830551190","version_name":"19.3.1","version_date":"2019-03-11 18:15:36.000 +0800","version_description":"What’s New<br>• Dark Mode can now be switched on (or off) in the Settings menu. Yes, it’s been a long road, but there’s finally dark at the end of the tunnel. NB: This is mobile only for now, with desktop coming later — thank you for both bearing with us, and for continuing to expect more of us.<br><br>Bug Fixes<br>• Fixed: The text welcoming you to Slack the very first time you launched the app didn’t quite fit the screen on smaller devices. Not the biggest problem in the world (literally), but first impressions count."},{"version_id":"830674621","version_name":"19.3.2","version_date":"2019-03-25 20:15:00.000 +0800","version_description":"Bug Fixes<br>• Fixed: Screenshots and other .png images sent over Slack were looking blurry. We applied a little focus, and we're now in the clear. If the blurriness persists, please contact your optician."},{"version_id":"830886897","version_name":"19.4.1","version_date":"2019-04-10 20:48:07.000 +0800","version_description":"Bug Fixes<br>• Links in some Slack App buttons were not working , taking you nowhere, instead of the expected somewhere. They now whisk you away to the url you thought they would take you to in the first place."},{"version_id":"830955397","version_name":"19.4.2","version_date":"2019-04-23 19:52:37.000 +0800","version_description":"What's new<br>• Olá, Hola, and Nice to see you (to see you nice): From today, Slack supports three new languages — Brazilian Portuguese, Latin American Spanish and UK English. You can change this in the settings menu under, not unexpectedly, \"Language\". Jolly good! Carry on, everyone."},{"version_id":"831192664","version_name":"19.5.1","version_date":"2019-05-06 19:00:20.000 +0800","version_description":"What’s New<br>• This is the last release that will support iOS 10, and thus the last version that will run on 32-bit devices such as the iPhone 5, iPhone 5c, and fourth-generation iPad. To continue receiving Slack updates, please upgrade to iOS 11.1 or later."},{"version_id":"831258291","version_name":"19.05.20","version_date":"2019-05-20 23:53:29.000 +0800","version_description":"What’s New<br>• Want to upload multiple images at the same time from the message box? In both channels and threads? Of course you do. And now, you can! Hurrah. <br><br>Bug Fixes<br>• Fixed: In some fonts, using asterisks to make part of a sentence bold would result in all of the text after the bold words to *also* be bold. While we like to believe the fortune favors the bold, it has come to our attention that that is not what that phrase means. So we fixed it."},{"version_id":"831438200","version_name":"19.05.21","version_date":"2019-05-28 19:52:09.000 +0800","version_description":"Bug Fixes<br>• We’ve tinkered with the internal workings and polished some rough edges. The app is now better than it was."},{"version_id":"831543710","version_name":"19.06.10","version_date":"2019-06-04 21:10:24.000 +0800","version_description":"What’s New<br>• Typing Russian (Cyrillic) characters now allows you to find users or channels containing those characters as easily on iOS as it has been for a while on desktop. <br><br>Bug Fixes<br>• Fixed: When starting a group conversation that included one or more single-channel or multi-channel guest users sometimes previously selected users were being de-selected. No more. Now you're all in that together."},{"version_id":"831679199","version_name":"19.06.20","version_date":"2019-06-17 19:51:29.000 +0800","version_description":"Bug Fixes<br>• Fixed: Where, through the Slack API, you were promised the ability to add a link to an emoji so that people could tap that emoji and be transported to the link, we were not following through on that promise. We fixed the bug preventing it from working, and everything is peachy now. <br>• Fixed: Some custom bot names were not being displayed correctly, and now are. <br>• Fixed: The list of apps in a group conversation would sometimes show the list of users instead of apps, apps are not people. People are people. <br>• Fixed: Some message buttons would not display a confirmation dialog when tapped, which was mysterious and slightly confusing. And now, fixed."},{"version_id":"831794074","version_name":"19.07.10","version_date":"2019-07-01 19:19:42.000 +0800","version_description":"What’s New<br>• The first message in a channel or direct message now includes a date header, so you can tell what day it is. Or was, depending. <br><br>Bug Fixes<br>• Fixed: Where sharing a file from Slack to another app did not, on occasion, work; it now works.<br>• Fixed: …And sometimes, when sharing a file did work, it would change the file name from words to a series of numbers. Great for robots; terrible for humans.<br>• Fixed: Messages that included the same custom emoji more than once, with no space between them were only displaying that emoji once. So :emoji::emoji: was only appearing as :emoji:. You now receive all the emoji you desire, and no less than you deserve."},{"version_id":"831862267","version_name":"19.07.20","version_date":"2019-07-15 19:39:36.000 +0800","version_description":"What’s New<br>• As of this update, we've removed 3D Touch functionality from a couple of places inside the app — channel names and DMs — where, frankly, it was simply not doing what it should. 3D touch works still on the icon on home screen, and when quick-replying to a notification as there, it's perfectly up to scratch. (NB: \"Scratch\" is not a valid touch, please do not scratch your device on our behest.)<br><br>Bug Fixes<br>• Fixed: When viewing the channel details screen in dark mode, the area that showing the channel title is now, like everything else, also in dark mode. <br>• Fixed: Where two channels or users had the same name, they will no longer erratically switch places with each other in the channel/DM list.<br>• Fixed: Opening a thread that contained a message with a link that contained certain characters… led to a crash. And yes, since you ask; that one was satisfying to sniff out. And to fix."},{"version_id":"832162755","version_name":"19.07.30","version_date":"2019-07-29 17:35:18.000 +0800","version_description":"Bug Fixes<br>• Occasionally, some users were unable to sign in. Given that that's the very first thing we want people to be able to do, we squished the bugs we knew about… but if you ever find more, let us know.<br>• Fixed: Many Slack apps that use BlockKit show confirmation dialogs to allow you to confirm your action, and in some cases, those weren't working. They now are. <br>• Fixed: Users who attempt to confirm their email after their original email link expired can now resend that email… and then confirm it, and thus log in. Again; people being able to log in to an app is a very important part of the user experience. We’re committed to keep allowing them to do that. Business!"},{"version_id":"832332447","version_name":"19.08.10","version_date":"2019-08-12 19:48:19.000 +0800","version_description":"Bug Fixes<br>• Fixed: When viewing your Starred Items, unstarring an item will now remove it from the view rather than making you close and reopen the list.<br>• Fixed: A crash that could occur when a message contained a highlight word, an @-mention, and certain non-English characters. We fixed it, for certain."},{"version_id":"832472633","version_name":"19.08.20","version_date":"2019-08-26 19:19:08.000 +0800","version_description":"What’s New<br>If you, like all rational people, arrange your phone screens by color, you’ll now be in quite the quandary, as we’ve added a couple of extra background hues for the app icon. It’s to be found under Settings -&gt; App Icon — just under Dark Mode, which is useful, as the new shades work particularly well with that. <br><br>Bug Fixes<br>• Fixed: When selecting a new profile picture, users were being asked to confirm that picture twice. We now respect your ability to recognize your own face the first time around, and will not ask you again.<br>• Fixed: It’s now actually possible to successfully <br>• Fixed: … upload <br>• Fixed: slow motion… wait for it…<br>• Fixed: Custom emoji uploaded on desktop are now, vitally, transferred lightning-fast through the tubes, and therefore immediately available in the iOS app. <br>• Fixed: …videos."},{"version_id":"832649378","version_name":"19.08.21","version_date":"2019-09-10 19:10:43.000 +0800","version_description":"Bug Fixes<br>• We tuned up the engine and gave the interiors a thorough clean. Everything is now running smoothly again."},{"version_id":"832731794","version_name":"19.09.10","version_date":"2019-09-16 19:39:28.000 +0800","version_description":"Bug Fixes<br>• Fixed: Replying to a notification works much more often than it used to. 99% of the time, in fact, which is so close to 100% we can almost smell it. <br>• Fixed: Swiping between channels with two fingers now will now include the “Threads”view, but only, smartly, if you’ve used that view recently.<br>• Fixed: Custom emoji weren’t always rendering correctly in bots and attachments sent via the Slack API. Now? Emoji = :100:."},{"version_id":"832866566","version_name":"19.09.20","version_date":"2019-09-23 19:49:37.000 +0800","version_description":"What’s New<br>• The app now fully supports iOS 13. In particular, and most pleasingly, we now follow the system settings for dark mode, so the app will automatically “go dark” at the same time as your other apps. Good news in dark times.<br><br>Bug Fixes<br>• Fixed: Notifications were, somewhat bizarrely, only clearing when you’d read *all* of your mentions. The ones you’ve read will now be the only ones cleared from the notification center when you launch the app, leaving the ones you haven’t to be read at leisure."},{"version_id":"832924590","version_name":"19.10.10","version_date":"2019-10-07 21:13:41.000 +0800","version_description":"What’s New<br>• Dark mode users who launched the app for the first time were met with a bright white screen. That was… not optimal. Our sign-in screens now match the rest of the app.<br>• All the default sidebar themes are now dark mode compatible — so when you shift into dark mode, your default theme will subtly shift to complement it.<br><br>Bug Fixes<br>• Fixed: Uploading multiple files at the same time is now more reliable than it was.<br>• Fixed: In an act of over-enthusiastic ennui, sending “/shrug” without any text following it was causing the app to crash. Utterly ridiculous. If there was ever a message that could stand alone, it was this. For the good of all humanity, it now works once more."},{"version_id":"833185682","version_name":"19.10.20","version_date":"2019-10-21 18:56:22.000 +0800","version_description":"Bug Fixes:<br>•Fixed: The “Aubergine Classic” theme was using the color scheme for the new, (perhaps future-classic) Aubergine theme. We have reverted to classic-classic.<br>•Fixed: Sometimes, when we tried to show a long message in a dialog window, it would show a blank window instead, which is basically the opposite. Sometimes things are said best when one says nothing at all. This, however, was not one of those times. So we fixed it."},{"version_id":"833327262","version_name":"19.11.10","version_date":"2019-11-04 20:49:55.000 +0800","version_description":"What’s New<br>• A natty new icon in the top left corner of the app will show the number of notifications you have in your current workspace, as well as taking you to the sidebar, where you can swipe between your channels and conversations, as before.<br><br>Bug Fixes<br>• Fixed: Sometimes, attempting to delete a message that had failed to send (due, usually, to low connectivity) in was itself, failing. Doubling down on things is great — but not, perhaps, when that thing is “failure”. Now when some things don’t work, the other thing will."},{"version_id":"833633182","version_name":"19.11.20","version_date":"2019-11-18 20:29:00.000 +0800","version_description":"What’s New<br>• The size of text is now controlled in the Accessibility settings of your iOS device rather than inside Slack. We used to have a separate preference for it inside the app, but it makes a lot more sense that you would want to have the same size text whatever you’re reading.<br><br>Bug Fixes<br>• Fixed: Attempting to reorder your workspaces would occasionally result in them ending up in a completely different order than the one you put them in. The order in which you put them? Either way, they no longer belie your reasonable commands, and will fall into line as requested, no longer out of order."},{"version_id":"833911099","version_name":"19.12.10","version_date":"2019-12-09 20:18:53.000 +0800","version_description":"What’s New<br>• For those who love to format their messages on the move, good news, you can now get that done in a few clicks using the new formatting tool in the message field.<br><br>Bug Fixes<br>• Fixed: When loading messages containing a lot of custom emoji, the app was sometimes getting overexcited to the point of paralysis. We have chilled the app out, and this should no longer happen. Emoji away.<br>• Saving a file from Slack, and then attempting to open it from the Files app was occasionally causing the app to crash (which was bad). It is now causing the file to open (which is better)."},{"version_id":"833938001","version_name":"20.01.10","version_date":"2020-01-06 20:43:58.000 +0800","version_description":"Bug Fixes<br>• Fixed: Workspaces were sometimes showing a default workspace icon (a letter on a colored background) instead of the nice custom icon they had been given. Behold: they are beautiful once more. Or, at the very least, correct. Which is sometimes all we can aspire to.<br>• Fixed: Some complex URLs were incorrectly being treated like email addresses. They will now be treated… wait for it… like URLs.<br>• Fixed: In a message from a bot, buttons and menus configured to respond to a user’s actions weren’t actually doing that. This was not the first stage in a robot uprising: it was merely a bug. And is no more."},{"version_id":"834258364","version_name":"20.01.20","version_date":"2020-01-21 20:37:35.000 +0800","version_description":"Bug Fixes<br>• Fixed: @-mentioning a user in some languages caused that mention to show up twice. In any language, one mention per message is enough.<br>• Fixed: Translations for @channel and @here were broken in non-English languages. They now work once more in those languages, and continue to work in English. Just remember, everyone — if you’re going to @channel, please @channel responsibly.<br>• Fixed: Attempting to send a message that exceeded the character limit would show an error, and then delete all of the entered text. This was both hard to trigger (those limits are high!) but very frustrating. The limits still exist, but we now no longer clear everything in the message box.<br>• Fixed: After leaving a workspace, some users were unable to convince that workspace to leave their sidebar. It will now, gracefully, take its leave when asked to.<br>• Fixed: Trying to sign up with a password too similar to your email address resulted in a message that simply read “Error joining team”. We still want you to have a good password… but that error message will now be clearer about pointing that out.<br>• Fixed: It came to pass that typing, pasting, or otherwise entering a large amount of text into the app (the app in this case meaning “the Slack app”, hereafter referred to as “the app”) might cause that app to undergo issues that would take on the appearance of disappearance or dissolution or, in common parlance, it would appear to crash, and need to be restarted. This abdication of our sworn responsibility to take messages of differing length, from the very shortest (eg “k.”) to the very longest (albeit with an error explaining the imposed character limits of messages and the need to curtail said message), was careless, if not derelict, in our duty, and we have thereby rectified it with an application of technological code that will forthwith allow the entering of large amounts of written matter in the message box of Slack, the app, without risk of unexpected app closure, thus giving free rein to the celebrated verbosity and eloquence of our users in allowing them to enter as large an amount of text as their heart desires, albeit with the expectation that one too long may result in the error message listed several items (perhaps screens?) above this one. TL;DR: The app was previously sometimes crashing like we had some kind of problem with long pieces of text. We really don’t."},{"version_id":"834449357","version_name":"20.02.10","version_date":"2020-02-03 20:48:06.000 +0800","version_description":"Bug Fixes<br>• Fixed: While on a call, people using bluetooth sometimes heard a loud noise not generated by the other people on their call. This was not a ghost, it was a bug (and is now fixed).<br>• Fixed: the /msg and /dm commands were not acting as they should, now work as expected. For those who didn’t know they existed or worked in the first place, they do, and weren’t, but now are.<br>• Fixed: When uploading an image or file from your camera roll to a channel, multiple channels appeared to be selected. Then you couldn’t deselect them. These shenanigans have been shut-down, and sharing works as it should."},{"version_id":"834728135","version_name":"20.02.20","version_date":"2020-02-18 20:36:35.000 +0800","version_description":"Bug Fixes<br>• Fixed: Sending a “/me” command that contains an emoji resulted in a crash. /me had no idea this was a thing, but is glad that it’s fixed :relieved:"},{"version_id":"834784363","version_name":"20.03.10","version_date":"2020-03-02 20:40:48.000 +0800","version_description":"Bug Fixes<br>• Fixed: Sometimes, when sharing a file to Slack, some usernames appeared, very unhelpfully, as blanks in the list of Direct Messages, identifying your colleagues as “@ “, instead of say, “@jane”. This is now fixed.<br>• Fixed: Sometimes an app or bot would send a long message containing beautiful formatting and links. And sometimes, the formatting didn’t render correctly, or the links were untappable and that, we feared, risked angering the bots, as well as not being very helpful for the user. Now, the formatting is honored, tapping the links works perfectly, and the bots are, for now, placated."},{"version_id":"835110611","version_name":"20.03.20","version_date":"2020-03-16 19:35:43.000 +0800","version_description":"Bug Fixes<br>• Tapping the “Tap to expand image” button was sometimes not, wait for it… expanding the image. It will now do the thing it promises. No more, no less.<br>• Using two-factor authentication, which is a brilliant idea in general for all things, was occasionally not working if multiple types of authentication had been enabled (app, sms, etc). Let nothing dissuade the security-minded: it now works seamlessly once more."},{"version_id":"835246934","version_name":"20.03.30","version_date":"2020-03-30 19:10:38.000 +0800","version_description":"What’s New<br>• Minor improvements have been made, and bug fixes taken place, but they’re the kind that are out of sight, behind closed doors, and quietly just doing their job, deep in the inner workings of the app, making things just a little bit better."},{"version_id":"835498368","version_name":"20.04.10","version_date":"2020-04-13 19:59:10.000 +0800","version_description":"Bug Fixes<br>• Fixed: When a message held more than 5 images, a button telling you how many more images were included but hidden (+3, for example) was… not making them any less hidden. Basically it wasn’t working. It now works.<br>• Fixed: When sharing a file you will now only be able to share with users or channels that are active in the selected workspace (and not deactivated users, which could occasionally be selected before)<br>• Fixed: On an iPad, tapping “Archive Channel” will now archive the channel. Instead of crashing the app. Right impulse, overenthusiastic execution."},{"version_id":"835558421","version_name":"20.04.20","version_date":"2020-04-27 19:23:21.000 +0800","version_description":"What’s New<br>• All bugs that were fixed in this release were too small for the eye to see or too fiddly for human words to describe. Nevertheless, work was done, things tinkered with and the app became subtly better."},{"version_id":"835827639","version_name":"20.05.10","version_date":"2020-05-11 19:00:25.000 +0800","version_description":"TL;DR: We’ve redesigned the layout of the app. Read more about the improvements on our blog at SlackHQ.com or in our help center. Here though, we’ll stick to what’s new, and what has been fixed.<br><br>What’s New<br>• What’s new? Most things. We changed almost all of the things. So many things! Much change.<br><br>Bug Fixes<br>• Previously, it was complicated to get to the four main things people do on mobile. We’ve fixed this with a new nifty navigation bar at the bottom of the app containing: a Home view for your sidebar, DMs, (still listed most recent first), Mentions (for quickly catching up), and You (because you’re great) (and also because setting your status/preferences on mobile needed to be easier).<br>• The quickswitcher on the desktop app is wonderful, but we discovered an issue where people weren’t using it as much on mobile. So we made the Jump To box more prominent (and smarter) to fix this. Fingers crossed!<br>• It seemed bizarrely hard to create a new message in a channel or DM without finding that precise location first. With an application of logic, software engineering, and a new “Compose” button in the bottom right corner, this has been rectified.<br>• Our apologies to people who have been wanting to easily set reminders, start workflows or access favourite apps in channels and conversations — it was hard to work out how to do that on the move. A new lightning bolt under the message box now gives quick access to shortcuts, and thereby solves this age-old problem.<br>• And finally, it came to pass, as time went by, that in the old version of the app, there was a lot of swiping back and forth to get places. We’ve simplified that: Now,swiping right will reveal your workspace and preferences, and swiping left will get you back to the last conversation you were in. With this change in behavior, we hope to give you the powers of both omniscience and time travel. nbd.<br>• And yes. We know. Change is hard! All our fingers have all built up muscle memory, but after continually adding features and functionality over the years, we needed to step back and make sure things made sense. You can find more about these improvements in our blog post, and as always, we welcome your feedback. Thank you for reading all the way to the bottom. We appreciate it, and you."},{"version_id":"836076924","version_name":"20.05.20","version_date":"2020-05-26 19:09:14.000 +0800","version_description":"Bug Fixes<br>• Fixed: If you were in a workspace that required secondary authentication, then previews of notifications from that workspace were always hidden (even if you wanted to be able to see them). Now, the previews will show up like normal — as long as you’re currently authenticated. (You can also, as always, choose not to show previews of the messages)."},{"version_id":"836264496","version_name":"20.06.10","version_date":"2020-06-10 18:31:54.000 +0800","version_description":"Bug Fixes<br>• Fixed: The /remove command is now working properly, so those with permission can once again remove people from channels if they need to.<br>• Fixed: A pesky bug tried to cut your messages short. We’ve restored the limit to the intended 12,000 characters per message. Write on!"},{"version_id":"836464212","version_name":"20.06.20","version_date":"2020-06-22 21:26:37.000 +0800","version_description":"What’s New<br>• This is the last version of Slack that will work on iOS 11. To get updates in the future, you’ll need to update your device to iOS 12.2 (or newer).<br><br>Bug Fixes<br>• Fixed: December 31, 1969 was a fine day (we’re pretty sure). It was not, however, a day in which you received any direct messages, regardless of what our app previously claimed.<br>• Fixed: Some files could not be deleted, and not for lack of trying — the option to delete those files was missing from the menu. This has been fixed and all files can be deleted as desired."},{"version_id":"836636139","version_name":"20.07.10","version_date":"2020-07-06 20:04:03.000 +0800","version_description":"What’s New<br>• You can now customize your notification preferences on a per-day basis, which is a fancy way of saying that you can now pause interruptions with Do Not Disturb down to the day. (Looking for a feature to pause interruptions from pets, kids, or package deliveries? We feel you.)<br><br>Bug Fixes<br>• Fixed: On mobile, some messages from apps would display with missing text. It certainly was not our intention to pull a vanishing act, so we’ve fixed that."},{"version_id":"836833157","version_name":"20.07.20","version_date":"2020-07-21 16:20:00.000 +0800","version_description":"Bug Fixes<br>• Fixed: A few of our sidebar themes were taking dark mode a bit too seriously and obscuring the status bar. You’ll no longer have to choose between the comfort of your retinas and being able to check the time.<br>• Fixed: iPad users noticed that long-pressing on a pinned or starred item in the Channel Details section caused the app to take an unforeseen nap. It’s better-rested now, so hopefully that won’t be happening again."},{"version_id":"837185922","version_name":"20.08.10","version_date":"2020-08-03 19:22:02.000 +0800","version_description":"What’s New<br>• New: For something you’ve read but need to come back to later, you can now mark a thread as unread! Hurrah! Long-press on the message you’d like to start from, and then select the option to mark unread from the menu. Yes, you’ve been able to do it with channel messages for a long time, but now, you can do it in threads too. Useful!"},{"version_id":"837355379","version_name":"20.08.20","version_date":"2020-08-17 19:14:11.000 +0800","version_description":"What’s New<br>• We can’t think of any references, cultural or otherwise, that involve swiping left or swiping right. But now, if a message has more than one image, you can tap one of them and swipe left or right to browse between images.<br><br>Bug Fixes<br>• Fixed: Ever tapped a search result or a saved message and ended up in the right channel, but not at the right message? No? That’s good to hear. But if you have, we’ve fixed it. No more surprise endings — now you’ll always end up exactly where you planned."},{"version_id":"837591285","version_name":"20.08.30","version_date":"2020-09-02 15:58:18.000 +0800","version_description":"Bug Fixes<br>• Fixed: If you’ve been using an external keyboard with your iPad, you might have tried to accept an auto-correct suggestion and found that Slack sent your message-in-progress instead. Hitting enter at times like these will now accept the suggestion without sending your message early, as you’d want it to.<br>• Fixed: When an image was viewed full-screen, swiping did not dismiss it properly. You may now swipe and dismiss images with confidence."},{"version_id":"837758880","version_name":"20.09.10","version_date":"2020-09-14 19:29:01.000 +0800","version_description":"What’s New<br>• Bugs were squished, performance was improved, work was done, and the result was good. Please enjoy Slack responsibly."},{"version_id":"837949698","version_name":"20.09.20","version_date":"2020-10-05 19:50:04.000 +0800","version_description":"What’s New<br>• Maybe you’ve heard of Slack Connect, which reduces countless back-and-forth emails by letting you add partners, clients or vendors to a channel. Now, if your organization allows it, you can add another company to a new channel straightaway in the mobile app.<br><br>Bug Fixes<br>• Fixed: A picture is worth a thousand words. None of those words should be “This content can’t be displayed,” which was the case for some linked images in Slack. Images should now appear as intended, their word count fully intact.<br>• Fixed: Sometimes Slackbot or an app will send a message that is for your eyes only. A secret missive from the cybersphere. For some users, they were unable to copy the text of that message. This is now fixed, and you’re all free to copy the ephemera as you see fit.<br>• Fixed: Before, when you set a channel’s topic, we notified everyone with a message that ended with an extra period. We shouldn’t change punctuation rules just for kicks, and will no longer pepper these messages with prolific periods."},{"version_id":"838149394","version_name":"20.10.10","version_date":"2020-10-19 20:09:34.000 +0800","version_description":"What’s New<br>• Slack is now available in Korean, which means you can finally DM your favorite BTS member! That was a joke, please do not do that.<br><br>Bug Fixes<br>• We came up with custom emoji so you could express yourself in Slack. What we did not mean to do was cut off the end of a message from a bot if it contained a custom emoji. We’ve fixed that—so express away!"},{"version_id":"838356684","version_name":"20.10.20","version_date":"2020-10-27 17:28:09.000 +0800","version_description":"Bug Fixes<br>• Fixed: We can’t think of any references, cultural or otherwise, that involve swiping left. But now that it’s working properly again, you can swipe left to see the most recent channel.<br>• Fixed: On some phones, the emoji keyboard blocked the message input field, which was very frowny face. We’ve remedied the situation so now you can both write and emote in your input field, which is very smiley face."},{"version_id":"838572634","version_name":"20.11.10","version_date":"2020-11-09 20:21:17.000 +0800","version_description":"Bug Fixes<br>• Fixed: If you were invited to an audio chat and accepted the invite on desktop, sometimes the mobile app continued to ring. It’s not your alarm, that was us. We’re very sorry for the extra ringing in your ears, and now things are back to normal.<br>• Fixed: Your app may have crashed while you were in the middle of formatting a message that had hyphens and spaces. We fixed this, so you can practice proper punctuation without pesky interruptions."},{"version_id":"839126480","version_name":"20.11.20","version_date":"2020-11-30 20:43:38.000 +0800","version_description":"Bug Fixes<br>• Fixed: For the briefest of moments after opening Slack, DMs would sometimes appear unread even if there wasn’t a new message. It was so quick, you might not have noticed, but we fixed it anyway.<br>• Fixed: Sometimes, if you opened the description of an app in Slack, you might encounter some ~strangely~ *formatted* _text_. These app descriptions now appear beautifully formatted, as the developers intended.<br>• Fixed: When you step away from your computer to enjoy a sandwich, drink some water, or just stare into the middle distance for a while, you can now tell Slack how long to wait before sending your notifications to your mobile device. Take your time."},{"version_id":"839511566","version_name":"20.11.21","version_date":"2020-12-07 18:06:21.000 +0800","version_description":"Bug Fixes<br>• We tweaked some things too small to notice or too difficult to explain. We’ll return you to your regular, more interesting types of release next time (we hope)."},{"version_id":"839563062","version_name":"20.12.10","version_date":"2020-12-16 18:51:31.000 +0800","version_description":"What’s New<br>• Sharing files into Slack from outside Slack — say, from your photos app — is now much nicer than before. You’ll see your teammates’ pictures, and their full names, so it’s easy to make sure you’re sending the right file to the right person. Should things have always been this way? Yes! And so they are.<br><br>Bug Fixes<br>• Fixed: The “Add a File” button will now work as you might have expected it to, adding files aplenty to your channels and DMs.<br>• Fixed: Folks who choose to auto-collapse images in Slack were occasionally seeing black squares in the place of delightful GIFs. No more! Now your GIFs will surprise, delight, and inspire, at least as much as any one GIF can.<br>• Fixed: Tapping and holding on emoji reactions now shows you the list of people who reacted. This is an improvement on its previous behavior, which was to crash the Slack app entirely."},{"version_id":"839964872","version_name":"21.01.10","version_date":"2021-01-11 22:29:28.000 +0800","version_description":"Bug Fixes<br>• Fixed: Previously, tapping on a link from an app in Slack might have taken you to an unsettling place: nowhere. We fixed that, so now you’ll land in the right place at the right time."},{"version_id":"840174522","version_name":"21.01.20","version_date":"2021-01-26 21:55:05.000 +0800","version_description":"Bug Fixes<br>• Fixed: Custom emoji appear in the picker, right where they should — as opposed to not appearing at all.<br>• Fixed: When using one of your team’s homemade workflows, entering Japanese or Korean characters no longer adds bonus, unintended Japanese or Korean characters.<br>• Fixed: App messages were missing the colorful line that appears alongside their buttons and forms. No longer! Color has been returned to all the places it should be.<br>• Fixed: When you’re reacting to a message, Slack puts your most-used emoji up front — because that’s a helpful thing to do. Recently, and in very specific circumstances, Slack has been showing blank spaces instead of emoji. This is much less helpful. And now it’s fixed."},{"version_id":"840281415","version_name":"21.02.10","version_date":"2021-02-08 21:19:00.000 +0800","version_description":"Bug Fixes<br>• If you were to select “People” in the workspace menu, pick someone, click “Message,” and then try to send the message, well, this used to be too much for Slack. Not anymore. Send away!"},{"version_id":"840557679","version_name":"21.02.20","version_date":"2021-02-22 20:01:40.000 +0800","version_description":"What’s New<br>• Fans of the workspace switcher, take note: First of all, we are flattered you consider yourself a fan of the workspace switcher. Chuffed, even. Second, we’re giving it a refresh, so you can better distinguish your workspaces and switch between them more easily.<br>• For some, search is the heart of Slack. Now, it’s also the feet, because search is moving to its own tab at the bottom of the app.<br><br>Bug Fixes<br>• Fixed: If a message from an app had a button, and that button had an emoji in it, the emoji would appear like :this: instead of showing the emoji itself. This bug was very :woman-gesturing-no:, and is now fixed."},{"version_id":"840646833","version_name":"21.03.10","version_date":"2021-03-08 21:10:03.000 +0800","version_description":"Bug Fixes<br>• Fixed: You can once again reorder the workspace switcher with a tap, hold and drag. Everything is in its right place, including your workspaces."},{"version_id":"840963435","version_name":"21.03.20","version_date":"2021-03-22 19:24:45.000 +0800","version_description":"Bug Fixes<br>• Fixed: Sometimes, setting your status to “Away” didn’t work, and your teammates thought you were screening their messages. We’ve fixed that, so now you can safely go away and be “Away.”<br>• Fixed: It used to be that if you opened an image in Slack in full-screen mode, rotated your device to landscape, and dismissed the image, Slack would get stuck there. We’ve finally mastered going back the way we came, so dismissing the image should now take you back to good old portrait mode."},{"version_id":"841145753","version_name":"21.04.10","version_date":"2021-04-05 20:55:49.000 +0800","version_description":"What’s New<br>• Put the people you work with at the top of your list. Now, when you tap the “share” icon in any iOS app, your Slack DMs and MPDMs will appear right up top."},{"version_id":"841400338","version_name":"21.04.20","version_date":"2021-04-19 19:42:21.000 +0800","version_description":"What’s New<br>• If you’re well versed in Simplified or Traditional Chinese — or aspire to be one day — you can now use Slack in those languages. Set your language preferences in You &gt; Preferences &gt; Language.<br>• A bit daft, but drafts are now available everywhere you use Slack. Start a message on your computer and finish it on your phone. Snap a photo of a whiteboard sketch, attach it on your phone and finish the message on your computer.<br>• We’ve made it easier to express emotions or, to put it more accurately, send an emoji in Slack. The message input is now accompanied by an emoji button for you to find and select an emoji that best fits the situation.<br><br>Bug Fixes<br>• Fixed: An unfortunate bug caused the /invite slash command to crash the iPad app. You can now quickly invite people without ending the party.<br>• Fixed: The /giphy slash command stopped working in threads. This may have left your train of thought in tatters as you were unable to weave the right GIF into the conversation at the right time. The bug has been mended and you can “/giphy thimble” in threads to your heart’s content."},{"version_id":"841722280","version_name":"21.05.10","version_date":"2021-05-03 19:12:16.000 +0800","version_description":"What’s New<br>• We’ve improved support for dynamic type in key iOS screens, meaning that if you’re using larger text or font settings, Slack will do a better job of making those readable. Fun fact: written language is most useful when people are able to read it.<br><br>Bug Fixes<br>• Fixed: However you choose to pronounce GIF, you can once again paste them into Slack. Let the memes flow."},{"version_id":"842102411","version_name":"21.05.11","version_date":"2021-05-06 21:45:02.000 +0800","version_description":"Bug Fixes<br>• We tuned up the engine and gave the interiors a thorough clean. Everything is now running smoothly again."},{"version_id":"842205843","version_name":"21.05.20","version_date":"2021-05-17 21:41:37.000 +0800","version_description":"What’s New<br>• We’ve spruced up the channel list for your enjoyment. You’ll now see profile photos alongside direct messages and all the names associated with a group DM. We’ve also improved accessibility, adding support for larger text sizes, more accommodating tap targets for your fingers, and additional actions when using the VoiceOver rotor.<br>• Small thumb update (er, the update is small, but it applies to any size of thumb or appendage) — if you follow a link from one channel to another, swiping to the right will now take you back to the previous channel instead of the channel list.<br><br>Bug Fixes<br>• Fixed: For some people, channels remained bold and unread-looking despite being very read. This was rather unpleasant and is now fixed."},{"version_id":"842428799","version_name":"21.06.10","version_date":"2021-06-01 19:13:13.000 +0800","version_description":"Bug Fixes<br>• Fixed: Attempting to send a message via Quick Reply (replying to the notification) would sometimes not send a message at all. This was frustrating for the sender, embarrassing for us, and not befitting at all of the moniker “quick.” Replies of all velocities shall now be supported.<br>• Fixed: Previously, attempting to start a new thread would simply kick you back to the main channel view without so much as an apology or explanation. This has been rectified so that no matter where you go, there you can thread."},{"version_id":"842510868","version_name":"21.06.11","version_date":"2021-06-07 16:10:53.000 +0800","version_description":"Bug Fixes<br>• We’ve tinkered with the internal workings and polished some rough edges. The app is now better than it was."},{"version_id":"842630951","version_name":"21.06.20","version_date":"2021-06-14 19:14:19.000 +0800","version_description":"Bug Fixes<br>• Fixed: Tapping on an empty input field used to show the options for “cut” and “copy,” but there was nothing to select. What do you copy when there is no text? If you copy text that isn't there, does it even exist?<br>• Fixed: When editing a channel’s topic, changes were being saved even if you tapped “cancel,” essentially telling the app, “Yes, absolutely do that right now” instead of “Undo.” This bug has now been undone.<br>• Fixed: Beginning a message with a “slash” would cause the shortcuts menu to open, which then had to be dismissed before you could return to composing your message. Shortcuts are for saving time, not adding to it, so our inadvertent “longcut” has been whittled down.<br>• Fixed: Sometimes your workspace would indicate “-1” new users had joined, which was pretty spooky. While our terms of service do not have a specific clause against nonexistent individuals using Slack, we have made the executive decision to limit all workspace members to those denoted by positive integers."},{"version_id":"842813262","version_name":"21.06.30","version_date":"2021-06-28 20:08:29.000 +0800","version_description":"Bug Fixes<br>• Fixed: Those who had VoiceOver enabled were not able to access URLs within messages. It’s pretty frustrating when an Accessibility option makes an app less accessible, so we’ve made sure this works now."},{"version_id":"842898369","version_name":"21.06.32","version_date":"2021-07-01 17:08:47.000 +0800","version_description":"Bug Fixes<br>• We tweaked some things too small to notice or too difficult to explain. We’ll return you to your regular, more interesting types of release next time (we hope)."},{"version_id":"843015598","version_name":"21.07.10","version_date":"2021-07-12 19:30:29.000 +0800","version_description":"Bug Fixes<br>• Fixed: Copying text from a Slack message and then pasting back into Slack sometimes resulted in a crash and/or a rift in the known universe. We’ve patched this bug (as well as any outstanding wormholes), and our scientists assure us the app is once again safe to use in this timeline.<br>• Fixed: For users of the Japanese Kana Flick keyboard, the “Smart Full width spaces” setting should now work as expected, as well as inserting new text into the middle of a message. You might say we flicked both of those bugs off the table."},{"version_id":"843249116","version_name":"21.07.20","version_date":"2021-07-26 18:48:47.000 +0800","version_description":"What’s New<br>• How’s everybody doing out there? Are you getting enough sleep? Drinking enough water? Eating some vegetables here and there? We don’t have any big updates this time around, so we wanted to use this space to remind you to be kind to yourself and those around you. That’s all. Love ya."},{"version_id":"843485559","version_name":"21.08.10","version_date":"2021-08-09 21:26:54.000 +0800","version_description":"What’s New<br>• This will be the last version of Slack that supports iOS 12, which means this is the last version that supports devices such as iPhone 5s and 6, iPad Mini 2 and 3, iPad Air (1st generation), and iPod Touch (6th generation). In addition, starting on September 1st, you’ll need to be running iOS 13.3 or later in order to connect to Slack. We know this is potentially frustrating news, but these minimum requirements are necessary in order to ensure Slack remains as secure and seamless as we built it to be. Thank you for your understanding.<br><br>Bug Fixes<br>• Fixed: When using markup, adding a closing backtick after a period would not end the code section. You may now punctuate to your hearts’ content, safe in the knowledge that code blocks will not continue ad infinitum.<br>• Fixed: Those of you using VoiceOver may have noticed that a recent update made it much more difficult to swipe between messages. The reasons why are about as exciting as trying to navigate through the bug itself, so suffice it to say that things should just be better now.<br>• Fixed: A memory issue was causing the app to crash more often, primarily on older devices. There’s no way around it — crashes are frustrating. We’re doing our best to minimize their frequency, and we appreciate your patience."},{"version_id":"843694363","version_name":"21.08.20","version_date":"2021-08-23 21:46:29.000 +0800","version_description":"Bug Fixes<br>• Fixed: A gnarly little bug caused a crash for some people trying to mention others in a message. We carefully captured the bug in a metaphorical paper cup and released it out the metaphorical front door, at which point our metaphorical neighbor walked by and offered us a real slice of blueberry pie, which was incredible.<br>• Fixed: If you poked around in the settings of a Slack app, you may have seen emoji displayed as text like :this: instead of looking like the intended emoji. This has been fixed, and emoji should appear correctly. :thumbs-up: all around."}]