[{"version_id":"615672676","version_name":"1.6","version_date":"2014-07-10 10:02:07.000 +0800","version_description":"•NEW: Connectivity with Apple TV means you can now enjoy this visually spectacular weather app on a big TV screen.<br>•IMPRESSIVE: Offering access to the best HD content, Apple TV will let you truly appreciate how MeteoEarth brings the weather to life using high-end gaming technology and extraordinary graphics. Spin effortlessly around the globe and appreciate the stunning images from the comfort of your sofa.<br>•FUN: MeteoEarth and the big screen are made for each other – so have fun and enjoy this revolutionary 3D globe weather app through Apple TV Airplay.<br>•Some minor improvements have been made to keep the app up-to-date.<br><br>Your opinion is valued, so if you like the app, then please take a moment to review it."},{"version_id":"812065171","version_name":"2.0","version_date":"2015-04-13 12:01:09.000 +0800","version_description":"Thanks for downloading MeteoEarth! We are delighted to offer our users many of our Premium features for free, such as use of the storm tracker, multiple layer combination and more. To provide you with this additional data we’ve included ads which can easily be switched off, by all users who have already purchased MeteoEarth, accepting that the free premium features are disabled simultaneously.<br>•FREE premium features including the great option of combining multiple layers for the full weather experience<br>•Now also free: the water temperatures layer in climate view and the storm tracker<br>•Premium MeteoEarth users benefit from having an ad-free experience, viewing a forecast animation for 5 days ahead, and more.<br>•Greater zoom level – zoom in much deeper for extra detail<br>•Thanks to greater zoom, you can now view more live global webcams!<br><br>Your opinion is valued, so if you like the app, then please take a moment to review it."},{"version_id":"812938791","version_name":"2.0.1","version_date":"2015-09-02 08:54:17.000 +0800","version_description":"MeteoGroup is dedicated to creating the best quality weather products. Based on your feedback:<br>• we fixed the bug causing the app to crash,<br>• we improved the share function (by adding a timestamp to the screenshots),<br>• we enhanced the usability by offering easy access to the settings and a tutorial.<br><br>If you experience any problems please email us at support@meteoearth.com. We value your opinion, so if you like our app, please take a moment to review it in the App Store. We hope you enjoy MeteoEarth and thank you for your feedback!"},{"version_id":"815338928","version_name":"2.1.1","version_date":"2015-12-16 10:48:22.000 +0800","version_description":"We have fixed some minor bugs which can be reported to support@weatherpro.eu.<br><br>Feel free to email us in case you experience any problems, and please rate our app in the App Store if you like MeteoEarth. We thank you for your feedback!"},{"version_id":"817232822","version_name":"2.2","version_date":"2016-05-24 12:34:35.000 +0800","version_description":"• We have improved our app usability, and hope you guys like the changes!<br>• We have also fixed minor bugs which were reported via our help center (accessible via the help button).<br><br>Feel free to email us in case you experience any problems, and please rate our app in the App Store. We thank you for your feedback!"},{"version_id":"818694184","version_name":"2.2.1","version_date":"2016-09-01 08:36:02.000 +0800","version_description":"• We have fixed minor bugs which were reported via our help center.<br><br>We hope you enjoy using MeteoEarth and we thank you for any feedback!"},{"version_id":"822402547","version_name":"2.2.2","version_date":"2017-09-20 07:59:58.000 +0800","version_description":"• We have fixed minor bugs which were reported via our help center.<br><br>We hope you enjoy using MeteoEarth and we thank you for any feedback!"},{"version_id":"825857274","version_name":"2.3.1","version_date":"2018-04-04 22:01:06.000 +0800","version_description":"• We have fixed minor bugs which were reported via our help center.<br><br>We hope you enjoy using MeteoEarth and we thank you for any feedback!"},{"version_id":"825857274","version_name":"2.3","version_date":"2018-03-01 00:07:08.000 +0800","version_description":"• MeteoEarth now supports the iPhone X<br>• We have fixed minor bugs which were reported via our help center.<br><br>We hope you enjoy using MeteoEarth and we thank you for any feedback!"},{"version_id":"826202750","version_name":"2.3.1","version_date":"2018-04-04 22:01:06.000 +0800","version_description":"• We have fixed minor bugs which were reported via our help center.<br><br>We hope you enjoy using MeteoEarth and we thank you for any feedback!"},{"version_id":"841950767","version_name":"2.3.1","version_date":"2018-04-04 22:01:06.000 +0800","version_description":"• We have fixed minor bugs which were reported via our help center.<br><br>We hope you enjoy using MeteoEarth and we thank you for any feedback!"},{"version_id":"841950769","version_name":"2.4.0","version_date":"2021-04-28 03:35:48.000 +0800","version_description":"· Rebuilding compatibility up to the latest iOS14.5. <br><br>· Resolving bugs and crashes affecting some users."}]