[{"version_id":"811828029","version_name":"2.0 kinda big. Can't wait to share more.                                                                                                                                                                                Released Apr 10","version_date":"","version_description":""},{"version_id":"813247530","version_name":"1.5.2","version_date":"","version_description":""},{"version_id":"815119984","version_name":"2.0.3","version_date":"","version_description":""},{"version_id":"815822312","version_name":"2.1","version_date":"","version_description":""},{"version_id":"815976422","version_name":"2.1.1","version_date":"","version_description":""},{"version_id":"816180501","version_name":"2.1.2","version_date":"","version_description":""},{"version_id":"816310323","version_name":"2.1.3","version_date":"","version_description":""},{"version_id":"816410044","version_name":"2.2","version_date":"","version_description":""},{"version_id":"816679374","version_name":"2.2.1","version_date":"","version_description":""},{"version_id":"816873611","version_name":"2.2.2","version_date":"","version_description":""},{"version_id":"817062895","version_name":"2.2.3","version_date":"","version_description":""},{"version_id":"817893092","version_name":"2.3","version_date":"","version_description":""},{"version_id":"818743091","version_name":"2.4","version_date":"","version_description":""},{"version_id":"818893721","version_name":"2.4.1","version_date":"","version_description":""},{"version_id":"818953556","version_name":"2.4.2","version_date":"","version_description":""},{"version_id":"819917893","version_name":"2.4.3","version_date":"","version_description":""},{"version_id":"820668814","version_name":"2.5","version_date":"","version_description":""},{"version_id":"820685203","version_name":"2.5.1","version_date":"","version_description":""},{"version_id":"820750500","version_name":"2.5.2","version_date":"","version_description":""},{"version_id":"820979915","version_name":"2.5.3","version_date":"","version_description":""},{"version_id":"821042852","version_name":"2.5.4","version_date":"2017-02-23 18:00:30.000 +0800","version_description":"- Fix for some Trace imports getting hung up on timezone lookup.<br>- Performance improvements for importing GPX files created when using a Trace puck."},{"version_id":"821137657","version_name":"2.6","version_date":"2017-03-28 01:37:47.000 +0800","version_description":"The season might be winding down, but I'm squeezing one last awesome update in while I can.<br><br>#New<br>- Support for Siri on Apple Watch. Start / pause / resume / and end your workouts, hands-free!<br>- Passholders: when a resort supports lift naming (over 200 world-wide and counting!), the terrain map now shows all lifts at a resort not just the ones you took. This really helps orient your day on the mountain like tree-lines do on the satellite map.<br><br>#Improved<br>- Tweaked the Watch resort select screen to bring focus to resorts you frequent.<br>- In adding Siri support on Apple Watch, overall syncing with the phone has been improved.<br>- International users: Slopes will now use \"5min\" instead of \"5m\" so times without an hour or second component don't look like meter measurements.<br>- Tapping on the Today Widget now launches Slopes.<br><br>#Fixed<br>- Fixed cases where lifts that ran close to each other would cause incorrect matches.<br>- Fixed merging to make sure it stops earlier if it looks like could be an error leading to data loss.<br>- Made save logic more resilient to protect against data corruption / loss.<br>- Fixed a case where after a merge you'd be taken back to the activity list instead of the activity itself."},{"version_id":"822729266","version_name":"2017.7","version_date":"2017-11-20 17:42:32.000 +0800","version_description":"Slopes is starting the season with a bang! This is a big update, containing 4 awesome new features:<br><br>- 3D Flyover: The 3D view just got a complete rewrite and upgrade! Pass holders can replay their runs on awesome new virtual 3D mountains. This 3D mode now includes the ability to zoom / pan around the mountain to scope out your run, and uses the great timeline scrubber from the 2D mode to move through your day.<br><br>- Free online backup: Slopes will now automatically back up your data to my servers too keep it safe. Just sign up for a free Slopes account to get started.<br><br>- Photo library integration: Instead of having to manually import a day's worth of photos into Slopes to see them, Slopes can now automatically show photos from your photo library. You can still import and attach a single photo as the highlight photo. If you're worried about privacy, don't worry; photos that are displayed from your library automatically do not get copied into Slopes (or onto its servers as part of backup). Also, if you had previously imported more than one photo for a day, Slopes will copy it back to your photo library if needed when you run this update.<br><br>- Enhanced replay controls: Replaying now uses the timeline scrubber, so you can more easily move around to specific times during replay. With this new interface replaying a run now works in 2D mode, too! Lastly, replays now include a graph of your speed and vertical as you play back your run. Hit the play button to give it a spin!<br><br>Plus a ton of other smaller but important features and improvements:<br>- iPhone X support.<br>- The daily summary screen got a facelift.<br>- The photo browser got support for zooming in on photos, and support for Live Photos and videos.<br>- Updated the Lifts &amp; Runs view to always show your current location as you scroll through your day, even if Slopes had categorized that time as “other” (vs a lift or run).<br>- You can now change your Slopes account email in-app.<br>- Added two new GPX export options.<br>- Fixed jumping to exactly where you tap on the timeline map view.<br>- Enhanced heat map color logic to better highlight variations in speed.<br>- Plus the normal \"bug fixes and improvements\" everyone loves to see."},{"version_id":"824650691","version_name":"2017.8","version_date":"2017-11-22 02:02:40.000 +0800","version_description":"2017.8 is a quick fix for some bugs that got through for the big 2017.7 update.<br><br>Slopes is starting the season with a bang! This is a big update, containing 4 awesome new features:<br><br>- 3D Flyover: The 3D view just got a complete rewrite and upgrade! Pass holders can replay their runs on awesome new virtual 3D mountains. This 3D mode now includes the ability to zoom / pan around the mountain to scope out your run, and uses the great timeline scrubber from the 2D mode to move through your day.<br><br>- Free online backup: Slopes will now automatically back up your data to my servers too keep it safe. Just sign up for a free Slopes account to get started.<br><br>- Photo library integration: Instead of having to manually import a day's worth of photos into Slopes to see them, Slopes can now automatically show photos from your photo library. You can still import and attach a single photo as the highlight photo. If you're worried about privacy, don't worry; photos that are displayed from your library automatically do not get copied into Slopes (or onto its servers as part of backup). Also, if you had previously imported more than one photo for a day, Slopes will copy it back to your photo library if needed when you run this update.<br><br>- Enhanced replay controls: Replaying now uses the timeline scrubber, so you can more easily move around to specific times during replay. With this new interface replaying a run now works in 2D mode, too! Lastly, replays now include a graph of your speed and vertical as you play back your run. Hit the play button to give it a spin!<br><br>Plus a ton of other smaller but important features and improvements:<br>- iPhone X support.<br>- The daily summary screen got a facelift.<br>- The photo browser got support for zooming in on photos, and support for Live Photos and videos.<br>- Updated the Lifts &amp; Runs view to always show your current location as you scroll through your day, even if Slopes had categorized that time as “other” (vs a lift or run).<br>- You can now change your Slopes account email in-app.<br>- Added two new GPX export options.<br>- Fixed jumping to exactly where you tap on the timeline map view.<br>- Enhanced heat map color logic to better highlight variations in speed.<br>- Plus the normal \"bug fixes and improvements\" everyone loves to see."},{"version_id":"825034834","version_name":"2017.9","version_date":"2017-11-30 18:53:46.000 +0800","version_description":"- Updated the 3D share card to use the new 3D virtual mountains. These cards are available to everyone, not just Pass holders!<br>- New share card generation screen with a ton more customizability!<br>- Adaptive playback speed: Slopes will adjust how fast it plays back runs based on the size of the resort you were at.<br>- Fixed a case where Live Photos wouldn't show.<br>- Fixed a crash when trying to edit your weight on the settings screen.<br>- A half-dozen other obscure / rare crash fixes."},{"version_id":"825255590","version_name":"2017.10","version_date":"2017-12-19 00:49:42.000 +0800","version_description":"- You can now set a profile photo for your Slopes account.<br>- Cleaned up and centralized account and Slopes Pass management screens. Tap your profile image anywhere you see it to access your account information.<br>- Support for saving alpine skiing metadata (vertical, speeds) to HealthKit on iOS 11.2 and newer.<br>- You can now view .Slopes files without having to fully import them into your activity list.<br>- Fixed a case where Slopes wasn't asking for photo library permission, leading to photos not attaching to days.<br>- Subtle UI tweaks."},{"version_id":"825380006","version_name":"2017.11","version_date":"2017-12-22 18:10:33.000 +0800","version_description":"Hope you have a rocking holiday weekend out there!<br><br>- Fixed a case where receipt validation was reporting an error when there was none."},{"version_id":"825502084","version_name":"2018.1","version_date":"2018-01-03 14:58:41.000 +0800","version_description":"A few small bug fixes to start the year off right while I work on something pretty big.<br><br>- Fixed a case where the summary screen wouldn't finish animating in on older devices, leading to stats looking wrong.<br>- Prevent an case where a day might disappear after saving, even though it was still there on the server (if this happened to you log out and back in).<br>- Fixed some miscellaneous crashes for people still running iOS 10."},{"version_id":"825601273","version_name":"2018.2","version_date":"2018-01-14 14:42:59.000 +0800","version_description":"Woah, Slopes was App of the Day over the weekend. Hey there new skiers and riders! This is another quick round of small fixes while bigger things are being worked on.<br><br>- Tweaked GPS accuracy settings to make Slopes more forgiving of weaker GPS signals on the iPhone X.<br>- Prompt for HealthKit access when you launch the Watch app for the first time. This will make sure first-day saves via Watch add the workout data properly (instead of relying for access prompts just on the phone).<br>- Fixed a case where it looked like you couldn't attach a photo to a day.<br>- Fixed a crash when trying to save a share card to your photo library before having granted Slopes photo access.<br>- Other various crash and bug fixes."},{"version_id":"825665627","version_name":"2018.3","version_date":"2018-02-07 21:00:35.000 +0800","version_description":"- Recording Reminders. You can now create location-based or time-based alerts to ping you to check Slopes:<br>    - Location-based reminders can be created around an entire resort, or you can customize them much smaller (to go off just when you get to the parking lot, for example).<br>    - Location-based reminders can be triggered when you get near a location or when you leave a specific location.<br>    - Reminders are kept simple: you'll get an alert when the condition is met, regardless of if you forgot to record or not.<br>- You can now set it so screenshots are no longer shown along side your other photos."},{"version_id":"825930216","version_name":"2018.4","version_date":"2018-02-28 01:01:03.000 +0800","version_description":"Oh boy, this is a major update: a brand new Watch app! It has been rewritten from the ground up to take advantage of all the improvements we've seen to Watch in the last two years. This update addresses many of the top requests of Watch users (fun fact: 25% of skiers and riders start recording with Slopes via Watch, so this update will make 25% of you all *very* happy).<br><br>- Starting your recording via the Watch means Slopes is now a full workout app:<br>    - You'll get live ring credit throughout the day, no more waiting until you save.<br>    - Slopes will be the default app to show when you raise your wrist throughout the day, similar to the native Workout app.<br>    - The heart rate sensor is now automatically enabled during recording.<br>    - Calorie estimates are now based on Apple's workout algorithms, which account for heart rate (so you get more credit for those moguls of doom, and less credit than before if you are just cruising the groomers).<br>- Brand new UI which makes it easier to check out your stats during the day (use the Digital Crown to pick the stat you want to focus on).<br>- Lots of speed improvements in using the Watch app.<br>- While you technically can leave your phone behind now, you'll see much better battery life and improved accuracy if you keep your phone in your pocket still (Watch uses your phone's GPS if it is nearby). I highly recommend this.<br>- On the Series 3 Slopes can optionally take advantage of the new watchOS 4.2 features to auto-pause on lifts. This can double the already amazing battery life of the Watch app, but does mean you don't get lift information as the GPS is paused on lifts. Turn it on if you expect to be out for more than 12hrs in a day.<br>- If you want to record via your phone (how Slopes + Watch used to work), start your day via the phone. The Watch app will still give you easy access to the stats being gathered on your phone.<br><br>Other miscellaneous improvements to the iPhone app:<br>- Slopes now saves off Winter Sports Distance to HealthKit on iOS 11.2+ and watchOS 4.2+.<br>- Fixed a crash when creating a location-based reminder.<br>- Fixed maps to prevent showing locations that had been previously trimmed out.<br>- Fixed the photo viewer to jump to the right photo when completing a 3D Touch from the previews.<br>- Fixed a memory leak on the share screen."},{"version_id":"826129874","version_name":"2018.5","version_date":"2018-03-04 23:26:10.000 +0800","version_description":"- Multi-day share cards. As the season wraps up for some of you, share your favorite trip or those big stats for the entire season.<br>    - A new heatmap map of your visits to resorts world-wide is available as a background for most cards.<br>    - A new \"totals\" card type is available when sharing multiple days at once that highlight a new set of stats.<br>- Love Slopes? There's a new merch store with stickers, tees, and hoodies. Check it out under the More tab. (Fun fact: only 2% of Slopes users have recorded enough vertical to unlock the black t-shirt. Have you?)<br>- Added a water lock option to the Watch app.<br>- Moved the delete recording option onto the edit screen, making it harder to accidentally delete a day.<br>- Slopes will now prompt you to re-login if you password becomes invalid (for example if you changed it on another device).<br>- European users: sorry, Slopes will now say \"km/h\" instead of \"kph\". Silly American developer, amiright?<br>- Fixed a sync bug that made it look like activities weren't syncing when they did.<br>- Fixed initial display of location reminder map when creating a new one.<br>- Fixed 0 calories issue for recordings from iPhone.<br>- Fixed a crash on saving on Watch that occured when Slopes was originally denied rights to save HealthKit data."},{"version_id":"826194910","version_name":"2018.7","version_date":"2018-03-15 20:38:54.000 +0800","version_description":"- Now that y'all are recording via Apple Watch and getting heart rate data, I figured it'd be really cool if you could see that in Slopes. Hit the new \"vitals\" tab to see just how hard each run was pushing you.<br>- As part of making the heart rate graph, I moved the \"speed vs altitude\" graph into its own tab. No longer is it kinda hidden under replay mode.<br>- You can now hit play in any of the 3 timeline modes.<br>- The runs vs lifts screens is getting even more love: Slopes Pass holders can now see their photos clustered on the map of the day.<br>    - This will use the photo's GPS metadata by default to place it on the map.<br>    - If your photos are missing GPS metadata Slopes will use your recording to fill in the gaps as best as its can based on time/date.<br>    - I found out my GoPro had its clock set incorrectly when I was at Whistler thanks to this, oops.<br>    - This is off by default. Hit the map options button in the top right to enable it.<br>- Added swipe gestures to dismiss the photo viewer.<br>- UI tweaks to make some features more discoverable.<br>- Slopes will now try to re-send completed days from your Watch later if they originally didn't make it.<br>- Fixed a case where share card previews were blank / white.<br>- Fixed a case where your day wouldn't transfer from your Watch to your phone after saving."},{"version_id":"826194910","version_name":"2018.6","version_date":"2018-03-08 22:17:50.000 +0800","version_description":"- Share cards now say \"riding\" when sharing multiple days in which you both skied and snowboarded.<br>- Fixed a second crash-on-save for the new Watch app (thanks for the crash log Anders!)<br>- I think I finally tracked down the source of the rare merge crash and fixed it. Fingers crossed. (yay race conditions)<br>- Fixed a crash on iOS when importing a day from your Watch if you're running iOS 10.<br>- Fixed a case where trims would save and then get reset."},{"version_id":"826261621","version_name":"2018.7","version_date":"2018-03-15 20:38:54.000 +0800","version_description":"- Now that y'all are recording via Apple Watch and getting heart rate data, I figured it'd be really cool if you could see that in Slopes. Hit the new \"vitals\" tab to see just how hard each run was pushing you.<br>- As part of making the heart rate graph, I moved the \"speed vs altitude\" graph into its own tab. No longer is it kinda hidden under replay mode.<br>- You can now hit play in any of the 3 timeline modes.<br>- The runs vs lifts screens is getting even more love: Slopes Pass holders can now see their photos clustered on the map of the day.<br>    - This will use the photo's GPS metadata by default to place it on the map.<br>    - If your photos are missing GPS metadata Slopes will use your recording to fill in the gaps as best as its can based on time/date.<br>    - I found out my GoPro had its clock set incorrectly when I was at Whistler thanks to this, oops.<br>    - This is off by default. Hit the map options button in the top right to enable it.<br>- Added swipe gestures to dismiss the photo viewer.<br>- UI tweaks to make some features more discoverable.<br>- Slopes will now try to re-send completed days from your Watch later if they originally didn't make it.<br>- Fixed a case where share card previews were blank / white.<br>- Fixed a case where your day wouldn't transfer from your Watch to your phone after saving."},{"version_id":"826410556","version_name":"2018.8","version_date":"2018-04-03 18:06:26.000 +0800","version_description":"- You can now backdate Trip and Day passes (well, this was always possible, but now you can do it without emailing me!) from within the App. Head to your account screen after you buy one to backdate it.<br>- Slopes on iPhone will let you know when Watch is recording so you don't think things are broken (since to save battery Watch stats stay on Watch until you're done for the day).<br>- Speed improvements on ending your day on Watch.<br>- Added timezones to HealthKit data (thanks Stéphane).<br>- Fixed text cutoff for multi-day share cards when you have over 1 million feet of vertical.<br>- Fixed a crash when trying to select a resort via search when editing an activity (thanks Andy for the report to help me finally track this down!).<br>- Fixed some of the other top crashers. While they might have been obscure but I hate crashers, and love tracking them down.<br>- MapBox (my mapping provider) fixed a crasher where scrolling through the lifts vs runs screen really fast with photos displayed could randomly crash Slopes.<br>- Working on fixing some HealthKit and Slopes Watch -&gt; iPhone transfer issues. This update has some initial attempts at a fix. Sorry to the ~5 people per week it seems to effect, it is a super rare and weird issue that didn't come up during the 2 months of beta testing."},{"version_id":"826607713","version_name":"2018.9","version_date":"2018-04-20 00:29:53.000 +0800","version_description":"- Lots of awesome new 3D stuff for Slopes Pass holders:<br>    - The 2D map on the summary screen has been replaced with a 3D rendering of your day. Looks so much cooler, and more informative.<br>    - You can expand that 3D view of your day and go full-screen to play around with it.<br>    - You can also hit play in this new 3D view to see yourself move around the mountain.<br>    - iOS 11+ users: the new expanded 3D view also supports ARKit. You can place your virtual mountain on a surface in real life and get some awesome pics (protip: use the camera button at the bottom of the AR view to get some clean screenshots without UI in the way).<br>    - The new 3D views, and the existing ones, now use your account avatar when showing your position during replays.<br>- Increased clarity of lift and run lines on the 3D share card for larger mountains.<br>- Improved download speed of 3D map satellite textures, and improved caching so you can store more at a time for offline viewing.<br>- Fix a case where 3D maps reported as unable to download, even though they downloaded OK."},{"version_id":"826778118","version_name":"2018.10","version_date":"2018-04-25 15:29:01.000 +0800","version_description":"AKA The GDPR Release<br><br>- You can now delete all of your data from the Slopes servers if you wish. You can do so under More -&gt; My Account -&gt; Delete.<br>- At the bottom of the More screen is a new option \"Slopes and Your Data\" where I explain in plain English how your data is stored, used, and shared. Spoilers: I charge for Slopes Passes so I don't have to do anything creepy with your data just to make a profit and stay in business.<br>- Ever notice that blue line at the top of the activity list when you open the app? That sync progress bar won't show up anymore unless there is actually new data to sync (it was bugging the heck out of me!).<br>- A few other bug fixes."},{"version_id":"827283707","version_name":"2018.11","version_date":"2018-05-30 00:24:56.000 +0800","version_description":"- Had a little fun and designed some alternate icons for Slopes. Pick the one that works best for your home screen under More -&gt; Settings.<br>- Vastly improved support for people who ride in both hemispheres. Slopes will now automatically split out northern vs southern hemisphere recordings into separate seasons.<br>- Your season totals will be displayed in the today widget when you aren't recording.<br>- Added support for viewing burst photos.<br>- Fixed a case where 3D mountains were failing to render in some places in Europe.<br>- Fixed a case where a slow internet connection would cause 3D mountains to not render.<br>- Fixed a crasher on multi-day share cards using the resort heat map image."},{"version_id":"827360928","version_name":"2018.12","version_date":"2018-05-30 23:51:48.000 +0800","version_description":"- Quick fix for a crash that got through as part of a larger cleanup of old code."},{"version_id":"827593987","version_name":"2018.13","version_date":"2018-07-13 19:47:34.000 +0800","version_description":"- For the privacy-focused: you can now disable sync which will let you keep your location data private and off of the Slopes servers. You can disable sync via the account screen. Note if you do disable sync you must use iTunes / iCloud backups to ensure your recordings transfer over to new phones.<br>- Defaulted to a nicer voice for the start/pause/resume/end announcements.<br>- Logging out when you have a lot of activities should be a *lot* faster now.<br>- The mountains in AR mode won't be quite as dark.<br>- Fixed the choppy animation that happened when bringing up the share card generator.<br>- Fixed being able to pick Slopes to open .Slopes and .GPX files.<br>- Fixed a crash for new users who are starting to record via their phone while also having the Watch app installed."},{"version_id":"827960242","version_name":"2018.14","version_date":"2018-07-22 04:14:45.000 +0800","version_description":"- Fixed a confusing case where Slopes would say you don't have an active pass, even though you did, and days were still being unlocked for you."},{"version_id":"828523413","version_name":"2018.15","version_date":"2018-09-14 22:43:11.000 +0800","version_description":"- A powerful new run &amp; lift editor. The old trim tool has been replaced with a brand new timeline editor:<br>  - Remove any lifts or runs Slopes detected inaccurately, like when you leave Slopes running when you hop on a shuttle back to the lodge.<br>  - Tweak the start / end of a detected lift or run.<br>  - Swap a run for a lift and visa versa. Great for when you rode a lift down but Slopes said it was a run.<br>  - Add any runs or lifts Slopes missed, useful for tinier resorts where there isn't enough vertical to auto-detect them.<br>- Media playback control in the Watch app. Swipe right when recording to access playback controls.<br>- Improved and larger layouts on the new series of Watches.<br>- New complications for the new watch faces.<br>- Siri shortcut support on iOS 12. Use Apple's Shortcut app to start skiing and kick off your favorite music at the same time. (Might I recommend \"It's go time!\" as your custom phrase for that?)<br>- Improvements to tracking in AR after you've placed the mountain.<br><br>Note: this version drops support for iOS 10. Slopes now requires iOS 11 and watchOS 4."},{"version_id":"828606677","version_name":"2018.16","version_date":"2018-09-15 22:15:05.000 +0800","version_description":"2018.16 is a quick fix for a crash on launch if you had recorded at certain resorts.<br><br>What's new in 2018.15:<br>- A powerful new run &amp; lift editor. The old trim tool has been replaced with a brand new timeline editor:<br>    - Remove any lifts or runs Slopes detected inaccurately, like when you leave Slopes running when you hop on a shuttle back to the lodge.<br>    - Tweak the start / end of a detected lift or run.<br>    - Swap a run for a lift and visa versa. Great for when you rode a lift down but Slopes said it was a run.<br>    - Add any runs or lifts Slopes missed, useful for tinier resorts where there isn't enough vertical to auto-detect them.<br>- Media playback control in the Watch app. Swipe right when recording to access playback controls.<br>- Improved and larger layouts on the new series of Watches.<br>- New complications for the new watch faces.<br>- Siri shortcut support on iOS 12. Use Apple's Shortcut app to start skiing and kick off your favorite music at the same time. (Might I recommend \"It's go time!\" as your custom phrase for that?)<br>- Improvements to tracking in AR after you've placed the mountain.<br><br>Note: this version drops support for iOS 10. Slopes now requires iOS 11 and watchOS 4."},{"version_id":"828686279","version_name":"2018.17","version_date":"2018-09-23 00:40:06.000 +0800","version_description":"- Fixed a crash on the new editor screen.<br>- Fixed a crash on watchOS 4.<br>- Fixed a case where the Digital Crown wouldn't cycle through stats as expected."},{"version_id":"828693296","version_name":"2018.18","version_date":"2018-10-01 04:14:37.000 +0800","version_description":"- Improved reliability of Watch transfers."},{"version_id":"829094976","version_name":"2018.19","version_date":"2018-11-12 14:23:33.000 +0800","version_description":"- A new bundle of day passes replaces the trip pass! This is much more flexible allowing you to use each day pass from the bundle at any time. So you can still use the days back to back on a single trip, but now you can also spread them out over multiple trips or even seasons (they won't expire). A lot of you had written in asking for this flexibility, so here it is!<br>- Don't be confused -- \"Slopes Premium\" is a subtle cleanup / rebrand of the old \"Slopes Pass\" terminology. Nothing has changed in terms of what you get for free, or what you get if you pay for it.<br>- A new winter-themed map has been added for Slopes Premium users, and is now their default.<br>- The user avatar now shows the Slopes Premium logo when you're either subscribed or have some passes still left on your account.<br>- A ton of UI polish, including but not limited to the about screen, the account screen, and all of the Slopes Premium screens.<br>- Slopes will no longer nag you for HealthKit permissions when you're not actively using the Watch app, but have it installed.<br>- Moved the ability to enable / disable the free online backup to the settings screen.<br>- Fixed display of your Premium status when launching Slopes for the first time on a new phone, when your login information was copied from your old phone.<br>- Fixed 3D mountains failing to load in rare cases, and now falls back to trying to request terrain data with less detail as needed.<br>- Fixed a case where a super large area skied could crash Slopes when going to render it in 3D. Mountains will now degrade in resolution instead of crashing.<br>- Fixed a crash on the lifts &amp; runs edit screen for freshly recorded activities.<br>- Fixed a case where there could be duplicate runs after using the lift &amp; run edit screen. Updating will clean up your old edits to fix duplicates, too."},{"version_id":"829265738","version_name":"2018.20","version_date":"2018-11-17 03:18:26.000 +0800","version_description":"- Switched to donating Siri Shortcuts on initial launch, so you shouldn't have to record a day to get it them to appear in the shortcuts app.<br>- Removed the sample day from the app to save some space, instead Slopes now loads its sample from the server as needed.<br>- Fixed the little quotation mark next to your notes on the summary screen. Poor guy was getting squished.<br>- Fixed required fields on first save not being red.<br>- Fixed a case where the Slopes complication might not show up on your Watch.<br>- Fixed an error with cleaning up assets used for 3D rendering which would sometimes cause it not to render.<br><br>Excited for Slopes this season? There's a lot more coming! Ya know what? 5-star ratings really keep me motivated while coding, mind throwing me one? ;)"},{"version_id":"829330370","version_name":"2018.21","version_date":"2018-11-21 21:09:59.000 +0800","version_description":"- Fixed a case where a corrupted import from the Watch would perpetually crash the iPhone app as it tried to import.<br>- Fixed a crash when you were prompted to complete your profile and you tried to.<br>- Fixed a crash that could happen when re-opening Slopes mid-recording.<br>- I *think* I fixed a really rare case where Watch saves were getting corrupted. This was like a 1 in 1,000 bug, so it's been a lot of detective work, thanks for your patience."},{"version_id":"829380565","version_name":"2018.22","version_date":"2018-11-29 18:38:33.000 +0800","version_description":"- Fixed a case where stats could sometimes show as \"0\" after pausing for lunch and then resuming.<br>- Fixed the login screen automatically closing before you have a chance to log in when restoring purchases.<br>- More hunting down of that pesky watch bug where recordings aren't showing up. I think it ended up being related to that \"0\" stat bug. Fingers crossed!"},{"version_id":"829469169","version_name":"2018.23","version_date":"2018-12-05 17:58:25.000 +0800","version_description":"- A new pass type: Household Annual Passes! I've gotten tons of emails every season asking for a way for families that ride together to all go in on Slopes Premium together and save some money. Similar to other apps introducing family plans, this Household Pass is a subscription that unlocks Slopes Premium for you and four other family members in the same house.<br>- If you're currently an Annual Pass holder, you can upgrade to the Household Pass today, no need to wait for your existing Annual Pass to expire! Head to the purchase screen for Premium (More -&gt; Premium Learn More -&gt; Grab) to upgrade.<br>- Slopes can now directly post share cards to your Instagram Story. Look for the Instagram Story icon in the list of share destinations!<br>- New Slopes merchandise to help you stay warm, exclusive to the 2018/19 season.<br>- Improved the process of moving to a new device: login information is now synced to iCloud Keychain if you have that enabled. If you don't, Slopes will detect a new device upon first launch after a restore, and helpfully remind you to you to sign in if you had a Slopes account before.<br>- Fixed a login loop when trying to restore purchases.<br>- Fixed a crash on the recording screen that could happen after buying a pass mid-recording."},{"version_id":"829538427","version_name":"2018.24","version_date":"2018-12-10 04:58:57.000 +0800","version_description":"- Improved the Help &amp; Support area with new UI from HelpScout. This will also help people send feedback when they don't use Mail.app for email.<br>- Fix a case where Slopes might prompt you to create an account when you were already logged in.<br>- Fixed a case where 3D maps could get stuck loading.<br>- Fixed text cutoff on an iPhone SE in the Slopes merch store.<br><br>What was new in 2018.24:<br>- A new pass type: Household Annual Passes! I've gotten tons of emails every season asking for a way for families that ride together to all go in on Slopes Premium together and save some money. Similar to other apps introducing family plans, this Household Pass is a subscription that unlocks Slopes Premium for you and four other family members in the same house.<br>- If you're currently an Annual Pass holder, you can upgrade to the Household Pass today, no need to wait for your existing Annual Pass to expire! Head to the purchase screen for Premium (More -&gt; Premium Learn More -&gt; Grab) to upgrade.<br>- Slopes can now directly post share cards to your Instagram Story. Look for the Instagram Story icon in the list of share destinations!<br>- New Slopes merchandise to help you stay warm, exclusive to the 2018/19 season.<br>- Improved the process of moving to a new device: login information is now synced to iCloud Keychain if you have that enabled. If you don't, Slopes will detect a new device upon first launch after a restore, and helpfully remind you to you to sign in if you had a Slopes account before.<br>- Fixed a login loop when trying to restore purchases.<br>- Fixed a crash on the recording screen that could happen after buying a pass mid-recording."},{"version_id":"829583023","version_name":"2018.25","version_date":"2018-12-19 17:47:01.000 +0800","version_description":"I know the last thing you need is for Slopes to encourage you to \"find your friends on Slopes!\" so you can manage followers here, too. You've got enough social networks! I believe it's more important to help you share your awesome days where you're already hanging. So, I'm back with another integration to help you share your days riding, and this is a big one ... 35 million athletes world-wide big.<br><br>- Strava has Partnered with Slopes!<br>    - Slopes can now automatically upload your recordings to Strava for your friends over there to see.<br>    - Strava has customized how uploaded activities from Slopes appear, so they'll highlight the stats we care about as skiers and riders.<br>    - Uploaded activities will also include a map of your day using Slopes's new winter map theme. That'll help your activities stand out over there!<br>    - To get started head to More -&gt; Settings -&gt; Strava to connect your accounts.<br><br>- The new winter map theme is now available as a share card background (for all users, not just Slopes Premium users).<br>- The share card creator will now remember how you shared (which share card type, which background, and which color tint), and will default to that same setup next time.<br>- When Slopes is syncing a lot of activities from the server the recording screen will be a lot less dramatic while trying to count up totals as activities keep downloading."},{"version_id":"829714759","version_name":"2018.26","version_date":"2018-12-21 20:24:05.000 +0800","version_description":"- Fixed message history inside of the Help &amp; Support screen. It should now persist your messages even if you're logged out.<br>- Fixed a UI freeze when trying to view lifts and runs in free mode on Plus-sized devices.<br>- Fixed a rare race condition where activities from the Watch could be duplicated on import.<br>- Fixed a case where merging recordings from the Watch could delete the workout in Apple Health.<br><br>Hope you're looking forward to Slopes 2019.1, it's going to be another great release if all goes as planned. <br>See ya in 2019, have a great New Years.<br><br>What was new in 2018.25:<br>- Strava has Partnered with Slopes!<br>    - Slopes can now automatically upload your recordings to Strava for your friends over there to see.<br>    - Strava has customized how uploaded activities from Slopes appear, so they'll highlight the stats we care about as skiers and riders.<br>    - Uploaded activities will also include a map of your day using Slopes's new winter map theme. That'll help your activities stand out over there!<br>    - To get started head to More -&gt; Settings -&gt; Strava to connect your accounts.<br>- The new winter map theme is now available as a share card background (for all users, not just Slopes Premium users).<br>- The share card creator will now remember how you shared (which share card type, which background, and which color tint), and will default to that same setup next time.<br>- When Slopes is syncing a lot of activities from the server the recording screen will be a lot less dramatic while trying to count up totals as activities keep downloading."},{"version_id":"829751356","version_name":"2018.27","version_date":"2018-12-28 21:03:20.000 +0800","version_description":"I'm bad at taking vacations, even during holidays. Instead I was making a few small improvements before 2018 is over...<br><br>- Improved the clarity of the dialog on the Strava connect screen about a Slopes account being required.<br>- Added clarifications on the Household Pass purchase screen about how the upgrade from Annual Pass process works.<br>- Fixed a case where adding a photo to your day could cause the day to not save.<br>- Fixed a case where transfers coming from the Watch would fail.<br>- Fixed a crash when trying to launch Slopes via the Strava deep link."},{"version_id":"829751356","version_name":"2018.27","version_date":"2018-12-28 21:03:20.000 +0800","version_description":"I'm bad at taking vacations, even during holidays. Instead I was making a few small improvements before 2018 is over...<br><br>- Improved the clarity of the dialog on the Strava connect screen about a Slopes account being required.<br>- Added clarifications on the Household Pass purchase screen about how the upgrade from Annual Pass process works.<br>- Fixed a case where adding a photo to your day could cause the day to not save.<br>- Fixed a case where transfers coming from the Watch would fail.<br>- Fixed a crash when trying to launch Slopes via the Strava deep link."},{"version_id":"829794708","version_name":"2019.1","version_date":"2019-01-03 14:46:35.000 +0800","version_description":"New year, who 'dis?<br><br>- Day Passes are now transferable! <br>    - Any Day Pass you buy, including those from the 5 Pass Bundle, can be sent to another Slopes rider if you haven't used it yet.<br>    - You can start the transfer from the My Account screen.<br>    - This makes the bundle of passes a great way to save a little money as a group of friends riding for just the weekend.<br>- 3D replays have had speed heatmaps since Slopes launched in 2013, and now the heatmaps are finally making their way to the 2D maps! Riders who purchased Slopes Premium will now see their runs colored dynamically based on how fast they were going.<br>- In syncing up the appearance of 2D maps with the 3D virtual mountains, your user avatar is now shown on premium 2D maps instead of a generic blue location dot. It's the little things, 'ya know?<br>- Improved the Slopes Premium status messaging to always include how many unused passes are on your account. Sorry for the confusion the expiration wording caused to Day Pass holders.<br>- Added the ability to manually (re)upload activities to Strava, via the action button in the top right of the day's summary screen.<br>- Removed water lock option from the Watch app when you're recording via your phone, since it could only work if you started the activity from your Watch an anyway. <br>- Fixed a rare cash while recording on Watch."},{"version_id":"829794708","version_name":"2019.1","version_date":"2019-01-03 14:46:35.000 +0800","version_description":"New year, who 'dis?<br><br>- Day Passes are now transferable! <br>    - Any Day Pass you buy, including those from the 5 Pass Bundle, can be sent to another Slopes rider if you haven't used it yet.<br>    - You can start the transfer from the My Account screen.<br>    - This makes the bundle of passes a great way to save a little money as a group of friends riding for just the weekend.<br>- 3D replays have had speed heatmaps since Slopes launched in 2013, and now the heatmaps are finally making their way to the 2D maps! Riders who purchased Slopes Premium will now see their runs colored dynamically based on how fast they were going.<br>- In syncing up the appearance of 2D maps with the 3D virtual mountains, your user avatar is now shown on premium 2D maps instead of a generic blue location dot. It's the little things, 'ya know?<br>- Improved the Slopes Premium status messaging to always include how many unused passes are on your account. Sorry for the confusion the expiration wording caused to Day Pass holders.<br>- Added the ability to manually (re)upload activities to Strava, via the action button in the top right of the day's summary screen.<br>- Removed water lock option from the Watch app when you're recording via your phone, since it could only work if you started the activity from your Watch an anyway. <br>- Fixed a rare cash while recording on Watch."},{"version_id":"829833436","version_name":"2019.2","version_date":"2019-01-09 17:25:21.000 +0800","version_description":"- Watch users rejoice! If you record multiple times in a day at the same resort, the recordings will now automatically merge as they sync to your iPhone. No more having to hop through the edit screen manually to make that happen.<br>- Reworked a lot of logic around Watch-to-iPhone sync to get a lot more aggressive with making sure recordings make their way to the phone in a timely fashion.<br>- Improved the heart rate graph in the case where the HR samples aren't frequent enough to make a full graph.<br>- The user avatar icon was way too tiny in AR mode. It is now back to a normal, visible, size.<br>- Fixed a crash on the share card generator when sharing using the \"Visits\" background.<br>- Spent a few days playing Sherlock Holmes in my crash reporter; 99.5% crash-free wasn't good enough for me! Fixed a lot of other rare random crashes that most people never reported or noticed but that were bugging me knowing they were there."},{"version_id":"830012854","version_name":"2019.3","version_date":"2019-01-21 19:57:54.000 +0800","version_description":"- Fixed calorie count under \"How'd You Do?\" being lower than it should when the activity had been merged with another one.<br>- Fixed the photos screen to allow landscape rotation.<br>- Fixed a race condition where sync to the server could sometimes get stuck if you had edited an activity on another device."},{"version_id":"830150606","version_name":"2019.4","version_date":"2019-02-20 19:59:21.000 +0800","version_description":"This update has been in the works since before Christmas. I brought the history screen kicking and screaming from its 2013 design into 2019. It's been totally redesigned from the ground up! But this isn't just a fresh coat of paint: the redesign allowed me to add in some popular feature requests.<br><br>- Now shows photos from your Photo Library, if you've opted into that, along with the key photo you manually attached.<br>- \"X runs in the morning\" has been replaced with a visual representation of how long you recorded (one dot per hour).<br>- The activity type (skiing vs snowboarding) is now displayed as part of each activity.<br>- Trips: you can now group activities together.<br>    - This will visually highlight activities as a related group.<br>    - Trips show cumulative stats for all activities in it, right in the timeline.<br>    - To create a trip, hit the \"+\" button on the history tab.<br>    - After creating a trip, it will automatically add future recordings to it as appropriate (within 50 miles and no more than 3 days after the most recent activity in the trip). So start a trip in Slopes after you save your first day on a new trip, and Slopes will take care of the rest automatically!<br>- A details screen for trips and season: more stats than ever before.<br>    - See totals for all the related activities, and also the records like top speed, longest run, etc.<br>    - Tap either the season or trip stat row within the timeline to dig in.<br>- Manually entered activities.<br>    - If you forgot to record you can now add an activity manually via the history screen.<br>    - You won't get any stats since there is no GPS data associated with it, but you can still add notes, favorite it, and see photos for the activity.<br>    - To create an activity, hit the \"+\" button on the history tab.<br>- Added a reminder after joining a family to cancel auto-renew on your individual Annual Pass if you had one. (Did you join a family? Make sure you canceled your individual Annual Pass! Apple doesn't give me a way to cancel those automatically for you.)<br>- Added the ability to sign up for the Slopes Newsletter on the More tab (they got a preview of this design last week!).<br>- Fixed a case where lift names might not show up when they should.<br>- Fixed calorie count under \"How'd You Do?\" being lower than it should when the activity had been merged with another one. For real this time!<br>- Fixed a case where v1 users weren't getting the unlocks they should (might have to do a restore purchases after installing the update if it doesn't automatically fix itself).<br>- Fixed a few other crashers (for those curious after the release notes two versions ago, I've gone from 99.5% crash free to 99.76% ;) ).<br><br>By the way: Slopes just crossed 10,000 ratings in the US App Store this weekend. Thanks for all the support, it means a ton!"},{"version_id":"830364538","version_name":"2019.5","version_date":"2019-02-24 17:07:41.000 +0800","version_description":"Trying to get in a quick update or two before staring my next ambitious feature...<br><br>- Season stats comparisons! Head to the bottom of that new season details screen to see how you stack up to your previous seasons. Thank you to the Slopes fans I met in the gondola at Park City last week for inspiring the idea.<br>- Added the ability to control the playback speed on the Lift &amp; Runs screen.<br>- Added day count to the season / trip details screen.<br>- Moved the daily summary from the sentence format at the top to a new broken out stats section below the pics (same as the new trip / season screens) to increase readability.<br>- Sometimes Watch -&gt; iPhone file transfers can take a while, so I added an indicator on the start screen of the Watch app to let you know when it is still trying to get the recording over to your phone.<br>- Fixed a crash when viewing the new history screen because of a fun bug with auto-merge and attached photos.<br>- Fixed a crash on boot on secondary devices as it tried to download new activities before the database migration completed.<br>- Fixed the date range on the multi-day share cards being reversed for trips.<br>- Fixed the heart rate graph being a little higher than it should (Thanks Phil, good eye!).<br>- Fixed Siri Shortcuts (turns out when they say something is deprecated, that doesn't mean the new way works).<br>- Fixed the metric/imperial setting not syncing to Watch. Toggle the setting once more your iPhone to get it to resync. <br><br>What was new in 2019.4: Totally redesigned history screen with photo library integration, trips, manual activities, new season details screen. You should probably just check the What's New screen (in the More Tab).<br><br>Enjoying Slopes this season? A five-star rating, or even better a five-star review, helps keeps me motivated as I work those huge updates (got another one planned after this)."},{"version_id":"830459083","version_name":"2019.6","version_date":"2019-03-12 21:05:53.000 +0800","version_description":"- Dynamic type support, which means Slopes now works with the system's custom font size settings. For 40% of you this will be a very welcome improvement, and for the other 60% things won't look any different (if I did my job right), ha.<br>- If you don't want to use Dynamic Type for Slopes, you can turn it off in More -&gt; Settings.<br>- I commissioned some unique app icons exclusively for all of you who have supported me by grabbing Slopes Premium, and have included the first batch in this release. Check 'em out in the settings!<br>- Everyone makes mistakes, right? Yeah, those new dots on this history screen didn't work as well as I hoped. Back to a good old text label!<br>- If you attach a photo to an activity that photo will now stand out a better on the history screen.<br>- Photos on the history screen from your Photo Library should load a bit faster when you launch Slopes.<br>- In the last update the vertical summary for the day, when in metric, flipped from meters to kilometers. It is now back to meters.<br>- The history redesign introduced a bug where a recording might not show up until you force-quit and restarted Slopes. It made some people (rightfully) worry that their data had been lost, but it was there! I've fixed that display bug so the UI won't lag behind saves now."},{"version_id":"830602084","version_name":"2019.7","version_date":"2019-03-15 05:47:18.000 +0800","version_description":"- Fixed those new app icons not unlocking when they should.<br>- Fixed a fun thread crash related to photos attached to an activity. <br>- Fixed share cards showing \"Killington\" when you skied somewhere else. (Thanks again for the bug report video Brian!)<br>- Further UI tweaks for Dynamic Type support."},{"version_id":"830659313","version_name":"2019.8","version_date":"2019-03-23 20:12:07.000 +0800","version_description":"A lot of small goodies in this one, including some popular requests from all of you!<br><br>- Exclusive to the Watch app: auto-resume. When you pause, you can ask the Watch app automatically resume after 30 or 60 minutes. It is a great safety net incase you occasionally forget to hit resume after a long break.<br>- \"Brit mode.\" Why do y'all over there use the metric system, but then also use MPH? Who knows! But now you'll see speeds the way you want them (customizable under More -&gt; Settings).<br>- A new split tool. You can split activities at any given time into two separate ones. You can find this under the Edit options when checking out your day.<br>- Added 4 more alternate icons for Premium users. Make sure you check out the skier and snowboarder variants!<br>- Added a known lifts overlay to the map in the timeline editor, and a subtle haptic feedback when you're editing a lift and you near the start/end of a known lift.<br>- Added the ability to bulk-delete lifts/runs in the timeline editor, very useful for removing those car rides.<br>- Along with the split tool, the merge tool has been made a separate option on the edit screen. So instead of just prompting you if you'd like to merge when you go to save, you now explicitly trigger it, which is a lot cleaner / easier to find.<br>- Slopes will now auto-pause if you record past midnight, just incase you left it running. Slopes will also force you to start a new recording in this case,  as activities aren't supposed to span multiple days (trips are for that!).<br>- If Slopes somehow crashes while recording it will now resume as soon as it relaunches. This will prevent some rare cases where Slopes seemed to be mysteriously pausing because of a crash.<br>- HealthKit entries will now only be made for activities recorded via Slopes. They will no longer be created for manual activities or imports.<br>- Further improvements to the Watch -&gt; iPhone save transfer process. Should get that \"may take a while\" spinner to go away much quicker.<br>- Lots of other little UX improvements, including some fixes for iPhone SE + Dynamic Type."},{"version_id":"830742625","version_name":"2019.9","version_date":"2019-03-29 18:46:21.000 +0800","version_description":"- Slopes will be a good bit smaller (on disk and to download) on iOS 12.2 and newer.<br>- You are no longer limited in having to manually add lifts / runs only during the time you recorded. Helpful for when you forgot to record a run or two. (No stats for lifts / runs created outside of the time you recorded, because there is no GPS data, of course)<br>- Slopes should launch noticeably faster, especially for those with a lot of activities saved.<br>- Fixed the What's New link on the What's New popup screen to not claim you're running an outdated build.<br>- Fixed a layout issue with the reset password form.<br>- Fixed cases where searching for resorts named \"Mount ...\" wouldn't match when you type \"Mt. ...\", and some other permutations.<br>- Fixed a crash on iOS 11 on the about screen.<br><br>AKA \"Bug fixes and performance improvements\""},{"version_id":"830803712","version_name":"2019.10","version_date":"2019-04-05 14:36:46.000 +0800","version_description":"- Fix for a crash that could happen when uploading new activities for sync (which was also preventing Strava sync).<br>- Fix for a crash related to photo permissions on the history screen.<br><br>Please note: if you recorded over the weekend, and have Background Refresh turned off for Slopes, make sure you open Slopes at least once after this update so your activities can sync / be backed up to your Slopes account. Otherwise when you move phones you risk loosing them. If you have Background Refresh enabled they'll auto upload in the next 24hrs or so."},{"version_id":"830895293","version_name":"2019.11","version_date":"2019-04-08 13:08:11.000 +0800","version_description":"- Fixed a crash when Slopes would try to free up some memory if a lot of other apps were running."},{"version_id":"831081040","version_name":"2019.12","version_date":"2019-04-24 15:58:38.000 +0800","version_description":"- Removed the Facebook SDK. I only ever used it because I advertised Slopes on Instagram and you need it to help with that. I never gave them your private data or anything, but I'm no longer comfortable letting that creepy company have *any* hooks in my code to do who-knows-what secretly behind the scenes. #privacy"},{"version_id":"833167568","version_name":"2019.16","version_date":"2019-10-17 23:08:48.000 +0800","version_description":"- Improved how the new start recording screen handles things when you deny location permissions.<br>- Fixed the pass transfer popup on iPad.<br>- Fixed a crash when creating a location-based reminder from the welcome screen.<br>- Fixed a crash on launch caused by recursive lock when Slopes is checking for updates to a resort's lifts.<br>- Continuing to search for a workaround on the crash-on-launched caused by iOS 13 in the sync engine, trying a new approach. If you have the crash-on-launch issue after this update, please reach out (hello@getslopes.com). It's a rare bug and it'd help a lot to be able to test my fixes on someone with the issue.<br>- Open In and Airdrop is a hot mess in 13 when you have multiple apps that can open the same file type installed. Lots of other outdoor GPS apps are having a hard time with it (stuff changed between the last beta and the final release). I've updated the Importing Data FAQ with more info. TL;DR: for now, Open With for GPX files has a good chance to be borked for Slopes if you have other GPS apps installed, but AirDrop and the \"+\" button to import (on the logbook screen) should work again."},{"version_id":"833269157","version_name":"2019.17","version_date":"2019-11-12 01:20:14.000 +0800","version_description":"This release is the beginning of a more social era of Slopes, one all about friends and groups who ride together. But don't worry: Slopes going social is about your real life friends, focusing on privacy + reflecting your real experience on the mountain. There are no public profiles, no public leaderboard to game, no \"find me on Slopes\" usernames or email lookup. No stalkers or \"engagement hacks\" here!<br><br>- Add your real-life friends on Slopes to have some friendly competitions with private season and monthly leaderboards.<br><br>- Who you rode with is an important part of the story of a day, so now you can tag your friends in recordings. Doing so will let you compare stats for that day in-app (these comparisons are aggregated on a daily basis, so if you made two recordings they're summed together). If you organize your recordings into trips these stat comparisons are rolled up there, too.<br><br>- Tagging between friends happens automatically when you're online. Once both of you sync your activity to the Slopes servers they'll notice if you both shared a lift together (+/- a few chairs), and automatically do the tagging for you. Best of all this automatic lift detection is also done when you initially friend someone in Slopes, too. It'll check your histories for overlap and apply the tags (will take a minutes to process).<br><br>- A new \"versus\" share card to show off your victory against a tagged friend for the day.<br><br>- New feature for Slopes Premium users: when you've tagged someone in a day their avatar will zip around along side yours in the timeline view and 3d view. Note: reasonable privacy checks are in play here so you can't make a manual activity for a day just to spy on one of your friends that actually did record.<br><br>- People sharing a Household Pass are automatically friended (and while you share the pass you've gotta remain friends).<br><br>- You can search activities by people you've tagged.<br><br>- By popular request the Trip Pass is back. The flexibility of the Day Pass Bundle just didn't prove as useful as I had hoped it would be. My bad.<br><br>- Individual Annual Passes and the individual Trip Pass now get 2 free Day Passes to share with a friend. Share the love!<br><br>- There are new bundles of Trip Passes; save some money by going in together with friends. Pick up a 4-pack to share and 3 friends will owe you some drinks at dinner. Check out the new Group Discounts section of the buy pass screen.<br><br>- Gave the Account screen some TLC. Refreshed the Slopes Premium section to make your current pass status and remaining unused passes clearer and easier to manage.<br><br>- New merchandise: color enamel pins, a double-diamond shirt, refreshed black hoodie, and a 2019/20 season exclusive -- a sticker of that retro Slopes icon y'all love so much.<br><br>- Improved the UX when using a pass to unlock a past recording &amp; you had multiple types of passes (trip + day) to pick from to use.<br><br>- Added support for fraction (ex: +4.5HR GMT) timezones. TIL that was even a thing."},{"version_id":"833614826","version_name":"2019.18","version_date":"2019-11-16 08:42:30.000 +0800","version_description":"- You can now disable the \"jump to the next run\" behavior during playback on the timeline screen, under the map options (top right).<br>- You can now prevent your avatar + location from showing on friends' maps that you rode with. You can find this option under Account -&gt; Manage Friends.<br>- You can now also remove family members as friends.<br>- Improved link sharing via AirDrop for friending / pass sharing / etc.<br>- Fixed link share issues on WhatsApp and Facebook Messenger.<br>- Fixed a case where daily comparisons for an activity might not show after initial save, requiring you to leave and come back to see them.<br>- Fixed a crash when trying to invite people to your family via iPad.<br>- Fixed a crash when trying to transfer a pass.<br>- Fixed a crash on the logbook screen which would happen immediately after creating a manual activity, and then on subsequent re-opens of Slopes.<br>- My Helpdesk provider fixed a bug in their SDK where you couldn't do anything to pick or escape from an image when picking Choose Image to attach a screenshot."},{"version_id":"833728204","version_name":"2019.19","version_date":"2019-11-23 16:34:04.000 +0800","version_description":"- A little iOS-flavored UI love: Slopes now uses large titles for the root screens. Feels much nicer IMO.<br>- Slopes Premium users can now toggle the auto-skipping of lifts during playback for the 3D timeline mode, and free users can now toggle it too.<br>- Fixed dark mode text issue on the resort selector for making a manual activity.<br>- Fixed a race condition when launching Slopes from a URL.<br>- Fixed a crash on the playback screen."},{"version_id":"833937229","version_name":"2019.21","version_date":"2019-12-14 15:43:14.000 +0800","version_description":"- Big improvement to Instagram Story sharing formatting. You can have a lot of fun with this in IG's create mode now.<br>- Added support for sharing to FB Stories, incase anyone actually uses that. ¯\\_(ツ)_/¯<br>- Y'all really liked those resort visit maps from Instagram last week! I made some tweaks to the existing season share cards so you can make something pretty close to that yourselves.<br>- Added backcountry / off-piste recordings to the share card heat maps.<br>- You can now hide individual photos in Slopes. Head to the photos for a day in Slopes and use the new \"...\" option in the top right to hide 'em.<br>- You can also set / change the photo you'd like to attach to the activity via that menu.<br>- When you start recording, if you have multiple unused pass types (ex Day + Trip) on your account you can now pick which type you want to use.<br>- When recording via Watch, passes no longer auto-activate to cover the recording. You'll get to choose if you want to when you get back to your phone.<br>- Fixed 2 crashers on iPad related to showing alert dialogs.<br>- Fixed an issue that could cause the \"Migrating...\" screen to show during onboarding.<br>- Fixed a crash on the manual entry screen if you picked a resort then went to pick a resort agin and picked the same one.<br>- Some under-the-hood performance improvements I need for the next big thing I'm working on."},{"version_id":"834107880","version_name":"2019.23","version_date":"2019-12-22 13:34:08.000 +0800","version_description":"- Fix for people getting prompted to activate a pass on recording when they didn't need to."},{"version_id":"834142165","version_name":"2020.1","version_date":"2020-01-03 22:58:27.000 +0800","version_description":"New decade, who dis?<br><br>- Lifetime stats! Ever been curious which resort you visited the most, or what your record is for consecutive days skied? Tap the lifetime stats summary at the top of the Logbook to dig into all the juicy details.<br>- Added a new mini-timeline to the summary screen. It's a great way to quickly get a feel for how active your day was.<br>- 50% of people surveyed through Slopes's IG Story didn't know the season stats and trip stats rows were tappable in the Logbook. There's a ton of great stats in the screens tapping 'em leads to! Oof. Redesigned those table cells to be much clearer that they are tappable.<br>- Likewise, lots of people didn't know that Slopes Premium users can tap on things like \"Top Speed\" for a day to see when and where on the map they hit that. Reworked the Bests section to make that tappability a lot clearer.<br>- Likewise, there are still a lot of people (especially Watch users, since they don't see the iPhone's \"save\" screen) that don't know you can edit / add / remote the lifts and runs that Slopes detected. The new mini timeline was the perfect place to put a little shortcut to get to the timeline editor to make that more discoverable.<br>- Improvements to background syncing of activities that you saved while offline and need to sync later when you're back on WiFi.<br>- Fix for things being mis-centered in maps on iPad for Slopes Premium users.<br>- Fixed a crash on the photos setting screen when changing the setting for the first time.<br>- Hopeful fix for a crash that could occur when splitting a day."},{"version_id":"839913635","version_name":"2021.2","version_date":"2021-01-06 23:56:31.000 +0800","version_description":"- Improvements to the UI when running in the inverted colors accessibility mode.<br>- Fixed day/night forecast backgrounds being swapped in dark mode.<br>- Fixed 2 other random crashers.<br><br>I think I'll be dropping support for iOS 12 soon, so trying to sure things up for the 1% of you still on that.&nbsp;<br>(Remember: you can always download older versions of apps you've already downloaded if you're on an old OS, via your profile - purchases the App Store)"},{"version_id":"839913635","version_name":"2021.2","version_date":"2021-01-06 23:56:31.000 +0800","version_description":"- Improvements to the UI when running in the inverted colors accessibility mode.<br>- Fixed day/night forecast backgrounds being swapped in dark mode.<br>- Fixed 2 other random crashers.<br><br>I think I'll be dropping support for iOS 12 soon, so trying to sure things up for the 1% of you still on that.&nbsp;<br>(Remember: you can always download older versions of apps you've already downloaded if you're on an old OS, via your profile - purchases the App Store)"},{"version_id":"840111243","version_name":"2021.3","version_date":"2021-01-28 20:51:27.000 +0800","version_description":"Slopes is partnering with Protect Our Winters to ensure winter sports stay around for future generations. 2% of Slopes's 2020 revenue is being donated, and Slopes will continue to donate 2% of purchases going forward. Look for more collaborations with them in the future, this is just the start.<br><br>- Slopes's first crowd-sourced translation is live: Dutch! If you'd like to contribute to other languages, head to Account -&gt; Translate to help out. Thanks danidh, japborst2, martinmetselaar, minelli1959, olaf_steen, and tomver for all the work making Dutch happen.<br>- Slopes now requires iOS 13. Not a lot of changes you'll see, but a lot of cleanup under the hood for me to pave the way for more new features. (Remember you can download Slopes on an older OS by tapping your profile icon in the App Store and going to Purchases).<br>- I *think* I fixed the issue that was causing the Watch app to prompt for heart rate permissions more than once."},{"version_id":"840111243","version_name":"2021.3","version_date":"2021-01-28 20:51:27.000 +0800","version_description":"Slopes is partnering with Protect Our Winters to ensure winter sports stay around for future generations. 2% of Slopes's 2020 revenue is being donated, and Slopes will continue to donate 2% of purchases going forward. Look for more collaborations with them in the future, this is just the start.<br><br>- Slopes's first crowd-sourced translation is live: Dutch! If you'd like to contribute to other languages, head to Account -&gt; Translate to help out. Thanks danidh, japborst2, martinmetselaar, minelli1959, olaf_steen, and tomver for all the work making Dutch happen.<br>- Slopes now requires iOS 13. Not a lot of changes you'll see, but a lot of cleanup under the hood for me to pave the way for more new features. (Remember you can download Slopes on an older OS by tapping your profile icon in the App Store and going to Purchases).<br>- I *think* I fixed the issue that was causing the Watch app to prompt for heart rate permissions more than once."},{"version_id":"840380646","version_name":"2021.5","version_date":"2021-02-06 19:04:24.000 +0800","version_description":"- Fixed crash on Apple Watch related to permissions."},{"version_id":"840380646","version_name":"2021.5","version_date":"2021-02-06 19:04:24.000 +0800","version_description":"- Fixed crash on Apple Watch related to permissions."},{"version_id":"840429454","version_name":"2021.6","version_date":"2021-02-18 23:18:46.000 +0800","version_description":"- Added Russian translation, the second language to be brought to you by other Slopes users (thanks lisachev and petr.kashlikov!)<br>- Improvements to the UX when using PayPal via iTunes and those countries in Europe with a new two-step checkout process in iTunes. Slopes won't incorrectly report an error when there was actually wasn't one.<br>- Dug through the customer support emails for this season and made improvements based on common confusions:<br>    - You can now remove friends via the friends tab too (icon in top right brings up option).<br>    - Added a message if you have Slopes Cloud Backup turned off that lets you know you can't participate in the stat comparisons with friends (no data on the server).<br>    - Promoted two FAQs up to the main help screen.<br>    - Tweaked some labels to make some buttons / options clearer.<br>    - Added some other new FAQs and rewrote some existing ones to be clearer / more helpful.<br>- My help provider, HelpScout, has made some nice improvements to their in-app help system over the year. So now launching into that when you view an FAQ instead of the web interface.<br>- Fixed an issue on the summary screen where the red / black / gray dots could be way, way, too big.<br>- Server-side fix, but fixed the case where the \"recent change\" green arrows on the friends tab would stick around longer than 2 weeks.<br>- Fixed two missing icons on the compare run screen."},{"version_id":"840429454","version_name":"2021.6","version_date":"2021-02-18 23:18:46.000 +0800","version_description":"- Added Russian translation, the second language to be brought to you by other Slopes users (thanks lisachev and petr.kashlikov!)<br>- Improvements to the UX when using PayPal via iTunes and those countries in Europe with a new two-step checkout process in iTunes. Slopes won't incorrectly report an error when there was actually wasn't one.<br>- Dug through the customer support emails for this season and made improvements based on common confusions:<br>    - You can now remove friends via the friends tab too (icon in top right brings up option).<br>    - Added a message if you have Slopes Cloud Backup turned off that lets you know you can't participate in the stat comparisons with friends (no data on the server).<br>    - Promoted two FAQs up to the main help screen.<br>    - Tweaked some labels to make some buttons / options clearer.<br>    - Added some other new FAQs and rewrote some existing ones to be clearer / more helpful.<br>- My help provider, HelpScout, has made some nice improvements to their in-app help system over the year. So now launching into that when you view an FAQ instead of the web interface.<br>- Fixed an issue on the summary screen where the red / black / gray dots could be way, way, too big.<br>- Server-side fix, but fixed the case where the \"recent change\" green arrows on the friends tab would stick around longer than 2 weeks.<br>- Fixed two missing icons on the compare run screen."}]