[{"version_id":"813034026","version_name":"8.02.01","version_date":"2015-08-20 19:42:00.000 +0800","version_description":"September 21th 2015: Added XCode Ghost detection tutorial <br><br>This new version contains the following changes and improvements:<br><br>■ Final iOS 9 adjustments <br><br>■ Introduction of Public / Private keys<br><br>The SSH and SFTP Tools now supports Public / Private keys for a more secure connection. As key maintenance is usually not so easy, I also added a separate Tool for maintaining your keys. Finally, you can even generate all kind of keys from inside NetworkToolbox. To encourage more people to use Public/Private keys, I wrote an easy to follow tutorial which helps to start using Public / Private keys.<br><br>■ A Connections Tool was added<br><br>This new tool can be used to not only but mainly to identify Apps on your device that are “calling home” or establishing undesired connections. A new tutorial will also explain how to identify hidden App Communication using this new tool.<br><br>■ Completely renewed HTTP Tool<br><br>So far, I was not quite happy with the HTTP Tool. On one hand, it was able to reveal a lot of Website internals but on the other hand it often failed to display websites correctly. This has been resolved now. The HTTP Tool was completely re-written and now feels much more like Safari but still allows to perform the parameter traversal and standard password tests.<br><br>■ Improved Traceroute<br><br>Traceroute now resolves addresses much more reliable and faster than before.<br><br>■ Improved Certificates Tool<br><br>The domain names that belongs to a certificate are now listed separately one after the other so you can now easily inspect (e.g. visit) each individual website the certificate belongs to. This is especially useful along with the new Connections tool.<br><br>■ Other bug fixes and improvements<br><br>Unfortunately, in the past, some features did not regard timeout values which caused the App to crash in some situations. Also, an iOS bug caused some Tools to crash when one of the tool Buttons (e.g. in the FTP tool) were hit while the keyboard was hidden. All that has been solved now as well as some other minor bugs and improvements as usual.<br><br><br>Please don't forget to check for a data-update after the installation.<br><br>Please let me know should you find a bug or if you have additional ideas or requests.<br><br>Please support my work on this App by writing an App review. This really keeps this App going so you will also benefit.<br><br>If you already wrote an App review, you need to update it as otherwise it will get lost as every review only applies to a certain version.<br><br>Thanks for your great support!<br><br>Kind regards,<br><br>Marcus"},{"version_id":"818884085","version_name":"9.01.02","version_date":"2016-09-22 09:43:25.000 +0800","version_description":"This new version contains various changes and improvements:<br><br>■ Bluetooth<br><br>I have completely re-written the Bluetooth LE scanner. It is now more reliable and easier to use.<br><br>■ New Health Check Tool<br><br>This new Tool can be used to perform recurring pre-defined tests. You can add multiple sites (IP Addresses or hosts) and perform Ping, Certificate, Mailserver and other tests with a single button press. This way, you can quickly check the availability of components either in your home network or your Internet Servers.<br><br>■ New SMB Tool<br><br>You can now even browse Windows or other Samba shares using this new Tool. It is also possible to download files.<br><br>■ New Speed Test Tool<br><br>This new Tool implements the iPerf Speed Test standard for Network Speed/Bandwidth tests aven as iPerf Server.<br><br>■ Improved network scan<br><br>Now, SMB Network Names and Vendor Names will be displayed in the list itself and not only on the detail screen. <br><br>■ Export Settings<br><br>You can now export the settings for backup or to another iOS Device.<br><br>■ Reverse DNS and DNS Lookup improved<br><br>The NS-Lookup Tool is now rather a multipurpose tool that shows all kind of information available to an IP Address or host such as DNS Record information, Revers DNS Lookup, Provider information and more.<br><br>■ Macros for Telnet and SSH<br><br>Possibility to write Macros that can be use in SSH or Telnet.<br><br>■ Other Telnet and SSH improvements<br><br>Using a hardware keyboard, you will now see the full telnet/ssh screen.<br><br>Now you can also directly send special keys that are not available on the soft- or hardware keyboard.<br><br>■ WOL (Wake on Lan) has been built in<br><br>■ HTTP Head Tool improvements<br><br>This Tool now shows the Status code returned from the Server with explanation.<br><br>■ IPv6 support<br><br>Most Tools now support IPv6 where appropriate. If available, you will see IPv4 as well as IPv6 addresses and can enter IPv6 as well as IPv4 addresses.<br><br>■ New IP Calculations<br><br>Along with this, there are three new Calculations for the IP-Calculation Tool such as IPv4 to IPv6, 6to4/6RD and Teredo calculations.<br><br>■ New Manual<br><br>A new manual is available which can now be read side by side with the App, which can also be opened from here: http://go-to.me/nettb-manual but also still from inside the App by hitting the (i) button as usual. For a printed version, you can also download the manual as PDF file.<br><br>■ Bye-bye to the connections Tool<br><br>With iOS 10, Apple has removed an API which has been used for the Connections Tool. This means, that this tool no longer works under iOS 10 and you will get an according message if you try to use it. Even though it is not nice that this valuable tool now no longer can be used, Apples decision is a major increase on Security as this API could have also been used for other purposes by any App. <br><br>■ Other bug fixes and improvements<br><br>Besides the lost Connections Tool, NetworkToolbox is now fully compatible with iOS 10 and even uses some of the new advantages. On an iPad Pro, it can also run in Multitasking and Split Screen mode and it runs just fine on the new iPhone 7 devices.<br><br><br>As you can see, there were many changes with this new Update. It even took quite some time as due to IPv6 Support major parts of the App needed to be re-written. <br><br>This said, I wouldn't be surprised if me or my valued Beta Testers would have missed one or two Bugs. Please don't worry and just let me know so I can fix it timely.<br><br><br>Updating this App means that it will lose all your nice and kind reviews. <br><br>*********<br>So please, after you installed the update, update your review as well or write a new one.<br><br>I hate these annoying nag-screens reminding users to write a review and don't want to include that.<br>*********<br><br>Thanks for your great support!<br><br>Kind regards,<br><br>Marcus"},{"version_id":"819917150","version_name":"9.02.02","version_date":"2016-12-02 07:31:22.000 +0800","version_description":"This release contains the following improvements and changes:<br><br>■ Further improved IP and Domain resolution<br>■ More information inside the Morpheus Tool like ISP/Provider, Domain etc.<br>■ The Domain Tool has been improved (New layout, more information) and has been renamed to \"Address Inspector\"<br>■ New: A Routing Table feature was added (Device Tool)<br>■ A few bug fixes<br><br>In case you may find bugs or have questions, don't hesitate to contact me. For this, please use the support button on the settings screen. <br><br>Updating this App means that it will lose all your nice and kind reviews.<br><br>*********<br>So please, after you installed the update, update your review as well or write a new one.<br><br>I hate these annoying nag-screens reminding users to write a review and don't want to include that.<br>*********<br><br>Thanks for your great support!<br><br>I am continuously improving the App and already working on the next version.<br><br>Best Regards,<br><br>Marcus"},{"version_id":"820169629","version_name":"11.0.2 included the following changes:■ Added:► New WhoIs Lookup Tool (see details about any domain and who has registered it)► New DNS Tool (query ANY! DNS Server for domains","version_date":"","version_description":""},{"version_id":"820169629","version_name":"9.02.03","version_date":"2016-12-16 07:52:44.000 +0800","version_description":"- iOS 10.3 compatibility<br>- Some bug fixing in the device Tool (e.g. crash in Device Tool fixed)<br>- Some UI improvements<br><br>I am glad that this update is now available before Apple closes for the Holidays and I am glad I finally found a solution to show MAC Addresses again (caused me some more gray hair and some long nights). <br><br>Thank you so much for all your reviews. It was overwhelming to read them all. Unfortunately they are now gone with this update but I don't want to bother you again asking to update your review.<br><br>To all of you, have relaxing and secure Holidays.<br><br>Thank you all and let's work together for a more secure 2017!<br><br>All the best, see you in 2017.<br><br>Marcus"},{"version_id":"823744678","version_name":"11.0.2","version_date":"2017-09-28 07:50:44.000 +0800","version_description":"This is finally the new update of App NetworkToolbox with the following changes:<br><br>■ Added:<br><br>► New WhoIs Lookup Tool (see details about any domain and who has registered it)<br><br>► New DNS Tool (query ANY! DNS Server for domains, see records and response times)<br><br>► New visual Traceroute (see trace routes on a map)<br><br>► New UPnP Tool (see which UPnP devices are noisy on your network)<br><br><br>■ Improved:<br><br>► Extensive improvements of the Network Scanning engine<br><br>► Improved Morpheus Map<br><br>► Improved Bonjour Browser<br><br>► Terminal and SSH support for Backspace and CR/LF<br><br>■ Bug Fixes:<br><br>► Fixed Crash in External Apps Tool<br><br>► Special Keyboard Bar are now visible, no longer transparent<br><br>► Display of wrong MAC Addresses fixed<br><br>► Bug in MAC Database fixed which caused some Vendors not to be found<br><br>► Fixed bug in traversal test or Password test where entries, already tried were not marked accordingly<br><br>As always, this version was again a challenge. Please note, with iOS 11 MAC Addresses can no longer be displayed as the API has been removed by Apple for privacy reasons. However, the vastly improved scanning engine now combines many other information available about any IP Address on your network. This not just compensates the missing MAC address. Now you can see as much information as discoverable in one single place. Network scanning was never easier and more convenient before.<br><br>As this was again a major update with several weeks of development time, please consider to rate my App to keep it rolling.<br><br>In case you may find any bug, please let me know, I want to fix it!<br><br>Thank YOU!<br><br>Regards,<br>Marcus"},{"version_id":"823875098","version_name":"11.0.3","version_date":"2017-09-30 20:12:01.000 +0800","version_description":"This update 11.0.3 fixes a crash of the previous version 11.0.2. Sorry for the inconvenience.<br><br>Version 11.0.2 included the following changes:<br><br>■ Added:<br><br>► New WhoIs Lookup Tool (see details about any domain and who has registered it)<br><br>► New DNS Tool (query ANY! DNS Server for domains, see records and response times)<br><br>► New visual Traceroute (see trace routes on a map)<br><br>► New UPnP Tool (see which UPnP devices are noisy on your network)<br><br><br>■ Improved:<br><br>► Extensive improvements of the Network Scanning engine<br><br>► Improved Morpheus Map<br><br>► Improved Bonjour Browser<br><br>► Terminal and SSH support for Backspace and CR/LF<br><br>■ Bug Fixes:<br><br>► Fixed Crash in External Apps Tool<br><br>► Special Keyboard Bar are now visible, no longer transparent<br><br>► Display of wrong MAC Addresses fixed<br><br>► Bug in MAC Database fixed which caused some Vendors not to be found<br><br>► Fixed bug in traversal test or Password test where entries, already tried were not marked accordingly<br><br>As always, this version was again a challenge. Please note, with iOS 11 MAC Addresses can no longer be displayed as the API has been removed by Apple for privacy reasons. However, the vastly improved scanning engine now combines many other information available about any IP Address on your network. This not just compensates the missing MAC address. Now you can see as much information as discoverable in one single place. Network scanning was never easier and more convenient before.<br><br>As this was again a major update with several weeks of development time, please consider to rate my App to keep it rolling.<br><br>In case you may find any bug, please let me know, I want to fix it!<br><br>Thank YOU!<br><br>Regards,<br>Marcus"},{"version_id":"825108745","version_name":"11.0.5","version_date":"2017-12-03 10:54:47.000 +0800","version_description":"This is my Christmas Update with the following Changes:<br><br>■ Some final iPhone X adjustments<br>■ Couple of bugs fixed in the Devices Tool<br>■ Now you can also call Wake on LAN from the Devices Tool<br>■ A few bugs were fixed in the IP Calculation Tool<br>■ Some Screen layout issues fixed in the Logbook<br><br>Some Improvements:<br><br>■ You can now clean the \"recent lists\" without switching to the settings<br>■ The Speed Test Tool has been improved<br><br>And finally, there are now two new Tools:<br><br>+ An NFC Tool to scan NFC NDEF Tags (other types are not supported by Apple)<br>+ A Unit Conversion Tool has been added<br><br>Thanks for your suggestions and support,<br><br>Regards,<br><br>Marcus"},{"version_id":"825566085","version_name":"11.0.6","version_date":"2018-01-09 00:12:09.000 +0800","version_description":"This update fixes some bugs reported over the Christmas time."},{"version_id":"827963076","version_name":"11.5.2","version_date":"","version_description":""},{"version_id":"828200502","version_name":"11.5.4","version_date":"","version_description":""},{"version_id":"828293571","version_name":"11.5.5","version_date":"","version_description":""},{"version_id":"828645422","version_name":"12.0.1","version_date":"2018-09-20 13:53:07.000 +0800","version_description":"This update contains a few minor adjustments for the new iPhone models and iOS 12.<br><br>Also, a few minor bugs were fixed.<br><br>Many thanks for your great support!<br><br>Stay secure!<br><br>Regards,<br><br>Marcus"},{"version_id":"828798097","version_name":"12.0.3","version_date":"2018-10-03 05:16:24.000 +0800","version_description":"This update has some minor bug fixes and improvements including:<br><br>- Additional settings for Ping and Traceroute such as TTL, Packet size, IPv6 etc. can now be hidden by switching off a newly introduced \"Advanced\" switch and will automatically set based on the IP/Domain entered and best-practices.<br><br>- A bug in the file upload and download feature has been fixed<br><br>Many thanks for your great support!<br><br>Stay safe!<br><br>Best regards,<br><br>Marcus"},{"version_id":"829517826","version_name":"12.1.1","version_date":"2018-12-05 09:02:44.000 +0800","version_description":"Among some other smaller changes and fixes, here are two highlights of this update:<br><br>1.) Improved Import/Export<br><br>You can now Export lists from various scanning Tools.<br><br>Also, you can now export the Password and Devices Lists, edit them with your preferred Software like Numbers on your Device or Mac or Excel on your PC. These files can then be Imported back to the App.<br><br>Along with this, the \"Add to Custom Devices\" functionality in Network Scan has also been improved so it's now easier to maintain the missing MAC Addresses and custom names manually.<br><br>2.) New Batch Tool <br><br>This new Tool can be used to perform actions like Ping, Port-Scan, Deep-Scan etc. over a list of Addresses. <br><br>The addresses for this new Batch Tool can be collected from other Tools (Menu -&gt; Add to Batch). <br><br>You can also import Address lists to this Batch tool from csv files maintained in Numbers or Excel.<br><br>Lists and results can be exported back to CSV files.<br><br>Thanks for all your great support and your feedback. <br><br>Best regards,<br><br>Marcus"},{"version_id":"830574419","version_name":"12.2.1","version_date":"2019-03-13 16:31:36.000 +0800","version_description":"This is basically a maintenance update.<br><br>- A few bugs and crashes were fixed (thanks fro reporting these issues)<br>- The network scanning engine has been further improved (it is now faster than ever and finds previously hidden devices)<br>- The SMB Tool can now be used to upload and delete files<br>- The MAC Database has been updated<br><br>The next update will bring new Tools.<br><br>Please don't forget to rate this App to keep it going.<br><br>And please, for those of you having questions or experiencing issues, please contact me. I cannot stress enough that I am highly interested in knowing about any issue so I can fix them for you and for others. Please use the support Email address or the button under Settings of the App.<br><br>Thank you!<br><br>Best regards,<br><br>Marcus"},{"version_id":"831110338","version_name":"12.2.2","version_date":"2019-04-25 19:10:41.000 +0800","version_description":"This update contains a few fixes and improvements:<br><br>- The HaveIBeenPwnd Tool had an issue which is now fixed<br>- The Mac and Geo Databases have been updated<br>- The Conversion Tool can now also encode/decode URLs and HTML Entities and can also generate MD5 and SHA1 hashes<br><br>The next update is already under development.<br><br>Many thanks for your great support and reviews which really keeps this App going.<br><br>For those of you having questions or experiencing issues, please contact me. I cannot stress enough that I am highly interested in knowing about any issue so I can fix them for you and for others. Please use the support Email address or the button under Settings of the App.<br><br>Thank you!<br><br>Best regards,<br><br>Marcus"},{"version_id":"831915833","version_name":"12.9.3","version_date":"2019-07-11 07:09:24.000 +0800","version_description":"This is again a larger Update.<br><br>Among some other smaller changes and fixes, here are the highlights of this update:<br><br>■ IMPROVEMENTS<br><br>- Improved VPN Support<br>- Improved Bonjour Tool<br>- Under Device -&gt; System, more information about the current Model<br>- Improved Network Neighbor tool<br>- Improved Bonjour tool. Now displays readable Service Names<br><br>■ SCANNING<br><br>- Scanning was further improved<br>- You can now select Quick scanning for fast but less accurate scan<br><br>■ NEW TOOLS<br><br>■■ Info Tool<br><br>This Tool provides tables with network related information:<br><br>- List of Ports and their services<br>- List of HTTP Status codes and their meaning<br>- HTML Tags<br>- Bonjour Services and description<br>- URL Encoding Characters for Windows-1253 and UTF8<br>- Common User Agents<br><br>■■ Server Check Tool<br><br>A tool to find leaked information or unintentionally exposed files or contents of a Web-Server.<br><br>■■ Dorks Tool<br><br>A tool to find information or files which were unintentionally indexed by Search Engines.<br><br>■■ Pi-Hole Tool<br><br>A tool to interface with a Pi-hole server and add the power of NetworkToolbox to Pi-hole. <br><br>Best of all, the Pi-hole tool can replace the Connections tool!<br><br>Just one drawback, I was forced to remove the Sensor features under Devices -&gt; Sensors.<br><br>Many thanks for your great support and reviews which really keeps this App going.<br><br>For those of you having questions or experiencing issues, please contact me. I cannot stress enough that I am highly interested in knowing about any issue so I can fix them for you and for others. Please use the support Email address or the button under Settings of the App.<br><br>Thank you!<br><br>Best regards,<br><br>Marcus"},{"version_id":"831983635","version_name":"12.9.5","version_date":"2019-07-12 09:53:28.000 +0800","version_description":"This version mainly fixes a bug of App Version 12.9.3 where the App may crash on older iOS Versions - sorry for that.<br><br>Previous Version 12.9.3. was a larger update with many improvements and fixes and the following highlights:<br><br>■ IMPROVEMENTS<br><br>- Improved VPN Support<br>- Improved Bonjour Tool<br>- Under Device -&gt; System, more information about the current Model<br>- Improved Network Neighbor tool<br>- Improved Bonjour tool. Now displays readable Service Names<br><br>■ SCANNING<br><br>- Scanning was further improved<br>- You can now select Quick scanning for fast but less accurate scan<br><br>■ NEW TOOLS<br><br>■■ Info Tool<br><br>This Tool provides tables with network related information:<br><br>- List of Ports and their services<br>- List of HTTP Status codes and their meaning<br>- HTML Tags<br>- Bonjour Services and description<br>- URL Encoding Characters for Windows-1253 and UTF8<br>- Common User Agents<br><br>■■ Server Check Tool<br><br>A tool to find leaked information or unintentionally exposed files or contents of a Web-Server.<br><br>■■ Dorks Tool<br><br>A tool to find information or files which were unintentionally indexed by Search Engines.<br><br>■■ Pi-Hole Tool<br><br>A tool to interface with a Pi-hole server and add the power of NetworkToolbox to Pi-hole.<br><br>Best of all, the Pi-hole tool can replace the Connections tool!<br><br>Just one drawback, I was forced to remove the Sensor features under Devices -&gt; Sensors.<br><br>Many thanks for your great support and reviews which really keeps this App going.<br><br>For those of you having questions or experiencing issues, please contact me. I cannot stress enough that I am highly interested in knowing about any issue so I can fix them for you and for others. Please use the support Email address or the button under Settings of the App.<br><br>Thank you!<br><br>Best regards,<br><br>Marcus"},{"version_id":"833221007","version_name":"13.0.2","version_date":"2019-10-17 21:27:29.000 +0800","version_description":"This update fixes a compatibility issue with iOS 12.4 and some Dark Mode issues of the previous version.<br><br><br>The previous version contained the following changes, improvements and bug-fixes:<br><br><br>■ IOS 13 Dark Mode compatibility<br><br>■ Support for new iOS 13 UI elements (e.g. pulling down the Help screen)<br><br>■ New NFC Reader. New NFC Tags can also be written (iOS 13 required)<br><br>■ Improved Bonjour Tool<br><br>■ Improved advanced Scanning (now turned back on per default)<br><br>■ Fonts will now not just be listed but also displayed<br><br>■ Improved IP Geolocation detection<br><br>■ The Pi-Hole tool now shows the IP if the Network Name is not available<br><br>■ The Pi-Hole tool now supports a filter<br><br>■ Updated MAC Database<br><br>■ Added SHA256 Hash to the Base64 Tool<br><br>■ A new Tool Two-Tone has been added<br><br>■ The Tool Pwned had to be removed (see my blog for details)<br><br><br>There are several more changes under the hood due to iOS 13 compatibility and bug workarounds. The App is now still backward compatible to iOS 11.1 but runs best on iOS 13.<br><br><br>Many thanks for your great support and reviews which really keeps this App going.<br><br><br>For those of you having questions or experiencing issues, please contact me. I cannot stress enough that I am highly interested in knowing about any issue so I can fix them for you and for others. Please use the support Email address or the button under Settings of the App.<br><br><br>Thank you!<br><br><br>Best regards,<br><br>Marcus"},{"version_id":"833350447","version_name":"13.0.3","version_date":"2019-10-27 00:24:48.000 +0800","version_description":"This update fixes a few iOS 13 compatibility issues.<br><br>The previous version contained the following changes, improvements and bug-fixes:<br><br>■ IOS 13 Dark Mode compatibility<br><br>■ Support for new iOS 13 UI elements (e.g. pulling down the Help screen)<br><br>■ New NFC Reader. New NFC Tags can also be written (iOS 13 required)<br><br>■ Improved Bonjour Tool<br><br>■ Improved advanced Scanning (now turned back on per default)<br><br>■ Fonts will now not just be listed but also displayed<br><br>■ Improved IP Geolocation detection<br><br>■ The Pi-Hole tool now shows the IP if the Network Name is not available<br><br>■ The Pi-Hole tool now supports a filter<br><br>■ Updated MAC Database<br><br>■ Added SHA256 Hash to the Base64 Tool<br><br>■ A new Tool Two-Tone has been added<br><br>■ The Tool Pwned had to be removed (see my blog for details)<br><br>There are several more changes under the hood due to iOS 13 compatibility and bug workarounds. The App is now still backward compatible to iOS 11.1 but runs best on iOS 13.<br><br>Many thanks for your great support and reviews which really keeps this App going.<br><br>For those of you having questions or experiencing issues, please contact me. I cannot stress enough that I am highly interested in knowing about any issue so I can fix them for you and for others. Please use the support Email address or the button under Settings of the App.<br><br>Thank you!<br><br>Best regards,<br><br>Marcus"},{"version_id":"834467975","version_name":"13.3.01","version_date":"2020-01-23 16:05:29.000 +0800","version_description":"This update contains the following changes, improvements and bug-fixes:<br><br>■ Additional IOS 13.3 fixes<br>■ Bug fixes in the Pi-hole tool <br>■ Moved the Glossary tool to Resources<br>■ The Verizon Supercookie check is now back working<br><br>NEW FEATURES:<br><br>■ New Blacklist tool<br><br>You can now query various blacklists for domains or IP addresses, to see if they are listed.<br><br>■ New Elasticsearch tool<br><br>Since more and more Elasticsearch database are involved in recent data breaches, I added Elasticsearch queries for Shodan and Morpheus. <br><br>Also, a new Elasticsearch tool can now be used to browse Elasticsearch databases.<br><br>■ Telnet Security check<br><br>DDOS Bots are using IOT devices around the world that are poorly secured by standard or easy to guess passwords.<br><br>A new Telnet Security Check was added to the included Security Check tool which can be used to check for all known weak passwords on a Telnet server.<br><br>■ Have I been Pwned<br><br>I did remove this tool some time ago because Troy Hunt, the provider of this feature, had to ask for money to use the API. <br><br>Now, I decided to pay the monthly fee for it to support Troy and his amazing service.<br><br>This said, I brought back the tool to the App and you all can use it for free.<br><br><br>I have also updated the online manual so for details, you can learn more about the new features and tools.<br><br>Many thanks for your great support and reviews which really keeps this App going.<br><br>For those of you having questions or experiencing issues, please contact me. I cannot stress enough that I am highly interested in knowing about any issue so I can fix them for you and for others. <br><br>Please use the support Email address or the button under Settings of the App.<br><br>Thank you and stay safe!<br><br>Best regards,<br><br>Marcus"},{"version_id":"837905640","version_name":"14.0.1","version_date":"2020-09-24 13:42:55.000 +0800","version_description":"This update includes the following changes, improvements and fixes:<br><br>◉ The App is now compatible to iOS 14 and takes advantage of some of it's new features<br><br>◉ The SSH Terminal now supports up/down keys e.g. to access the bash history<br><br>◉ The included File Viewer now works nicely together with the local file browser<br><br>◉ The SMB Tool has completely rewritten and now supports SMB1, SMB2 and SMB3 so it can be used to connect to and browse any Windows Server<br><br>◉ The Bluetooth tool has been further improved<br><br>◉ A bug has been fixed that caused the Shodan Tool reporting an error message<br><br>◉ The DNS Tool has been improved so that it now can be used in the reverse direction. You can now enter IP Addresses to query a DNS Server for the host or domain name<br><br>◉ Fixed a bug that prevented the Glossary Tool from opening<br><br>◉ The Blacklist database has been updated and obsolete or too slow servers have been removed<br><br>◉ The MAC Address database has been updated<br><br>◉ A 'Strings' Tool has been added to the local File browser<br><br>◉ The local File browser can now create new files and edit files<br><br>◉ The Batch Tool now supports copy and paste for batch lists<br><br>◉ A new Tool ASCII-Table has been added to the Resources section<br><br>◉ A new Tool Port-Table has been added to Resources which provides an overview of all Ports and services<br><br>◉ A new Tool Cables with common network cable wiring information has been added<br><br>◉ Added new Apple devices to the Device Database<br><br>◉ The Information Tool has been redesigned and is now available under Resources with additional information<br><br>◉ And of course, several additional minor fixes and improvements have been implemented as usual<br><br>Thanks for your fantastic feedback!<br><br>In case of issues or questions or suggestions, please don't leave reviews but please send me an Email. There is a button inside the App for this.<br><br>Stay safe and healthy.<br><br>Best regards,<br>Marcus"},{"version_id":"838434517","version_name":"14.0.2","version_date":"2020-10-29 14:09:57.000 +0800","version_description":"This update includes the following changes, improvements and fixes:<br><br>◉  A new Packet Tool has been added which can be used to send, receive and analyze any TCP or UDP packet<br><br>◉  Improvements around the Bonjour Browser<br><br>◉  The Server Check Tool has been further improved<br><br>◉  Further SMB (Windows) File Browser Tool improvements<br><br>◉  Fixed an issue in the local file browser for opening (e.g. Pages) files<br><br>In case of issues or questions or suggestions, please don't leave reviews but please send me an Email. There is a button inside the App for this.<br><br>Stay safe and healthy.<br><br>Best regards,<br>Marcus"},{"version_id":"839436538","version_name":"14.0.3","version_date":"2020-12-08 19:18:47.000 +0800","version_description":"This update contains some minor bug fixes.<br><br>Thanks for your feedback and great support.<br><br>Stay safe and healthy!<br><br>Best regards,<br><br>Marcus"}]