[{"version_id":"811739331","version_name":"2.5.1","version_date":"2015-02-19 21:12:03.000 +0800","version_description":"- Performance optimizations and stability improvements"},{"version_id":"811990659","version_name":"2.5.2","version_date":"2015-03-31 11:42:45.000 +0800","version_description":"Bug fixes and stability improvements"},{"version_id":"812428355","version_name":"3.0.0","version_date":"2015-08-11 03:09:15.000 +0800","version_description":"File Sharing —&nbsp; Share any file directly from your computer. No cloud storage required, no file size limit, no upload time wasted. Just get a link to a file on your computer and share it with your friends.<br>Apple Watch companion app — Now you can see your remote computer’s status, initiate a connection to it, and control media playback on remote computer, right from your wrist.<br>Gaming mode (experimental) — Special mode with easily accessible controls for modern computer games&nbsp;<br><br>Enhancements to Universal File Manager:<br>- Ability to connect to&nbsp;a&nbsp;remote computer without capturing&nbsp;the&nbsp;screen;&nbsp;only for file operations<br>-&nbsp;Support for OneDrive cloud storage in File Manager<br>- Ability to transfer files from Parallels Access to other apps on&nbsp;the&nbsp;mobile device<br>- Access to Photos on mobile devices<br>- File previews in icons for easier file browsing<br><br>Other enhancements:<br>- Ability to add&nbsp;applications stored in non-standard locations to App Launcher&nbsp;<br>- Improved copy-paste between&nbsp;the&nbsp;mobile device and&nbsp;a&nbsp;remote computer<br>- Support for both landscape and portrait device orientation for smartphones and tablets<br>- Improved Help system and File Manager Tutorial<br>- Various bug fixes and performance improvements<br><br>For assistance, please visit&nbsp;parallels.com/support&nbsp;or tweet to @ParallelsCares."},{"version_id":"813800367","version_name":"3.0.2","version_date":"2015-10-26 14:27:34.000 +0800","version_description":"Performance optimizations and&nbsp;stability improvements"},{"version_id":"817129081","version_name":"3.1.0","version_date":"2016-05-24 04:01:07.000 +0800","version_description":"• Support for 3D Touch on iPhone 6s and iPhone 6s Plus — press to drag-and-drop or right-click<br>• Support for the iPad Pro screen resolution and virtual keyboard<br>• Support for Apple Pencil with iPad Pro<br>• Folders on the App Launcher<br>• Support for cursor movement using the onscreen keyboard as a trackpad (with iOS 9)<br>• Game Mode improvement — shoot in games just by touching a screen<br>• Game Mode improvement — use function keys, \"Pg Up\", \"Pg Dn\" etc.<br>• Support for Windows 10 tablet mode<br>• Improved support for Windows 10 gestures<br>• Improvements in screen resolution switching behavior<br>• Other bug fixes and performance improvements"},{"version_id":"817513897","version_name":"3.1.1","version_date":"2016-05-26 12:27:09.000 +0800","version_description":"Various bug fixes and performance improvements"},{"version_id":"817591485","version_name":"3.1.2","version_date":"2016-06-02 14:22:11.000 +0800","version_description":"Bug fixes and performance enhancements"},{"version_id":"818794375","version_name":"3.1.4","version_date":"2016-09-20 22:55:20.000 +0800","version_description":"- Fixed Korean text input issue<br>- Fixed several crashes<br>- Other performance enhancements and stability improvements"},{"version_id":"820028869","version_name":"3.1.6","version_date":"2016-12-22 20:46:27.000 +0800","version_description":"For added security, device confirmation is required before connecting to a remote computer for the first time <br>Resolved issue with \"Best for iPad\" screen resolution <br>Resolved several issues with connecting to a remote computer <br>Resolved issue with text selection not working correctly in Outlook 2013 <br>Improved stability"},{"version_id":"821039218","version_name":"3.1.7","version_date":"2017-03-02 13:13:55.000 +0800","version_description":"Resolves an issue with Parallels Access crashing for some users when creating a new account"},{"version_id":"821672298","version_name":"3.2.0","version_date":"2017-05-02 13:59:51.000 +0800","version_description":"- Added support for Dropbox API v2 in File Manager<br>- Added support for new APIs when using Google and Facebook social logins<br>- Improved \"Run in Background\" behavior<br>- Improved app behavior after changing e-mail for Parallels Account<br>- Improved compatibility with OneDrive in File Manager<br>- Resolved the issue with some computers missing from the list<br>- Improved stability when establishing connection to a remote computer<br>- Resolved several issues that could cause app crash"},{"version_id":"822855995","version_name":"4.0.4","version_date":"2019-01-16 14:43:25.000 +0800","version_description":"This version contains the following enhancements:<br>- Added support for new iPhones' screen sizes <br>- Resolved an issue with iPhone XR where mouse pointer would misplace clicks <br>- Improved application's operation in background<br>- Improved text selection operations in remote applications<br>- Improved content zoom for remote applications<br>- Improved connection establishment process<br>- Resolved an issue with 3D Touch not working in iOS 12.1<br>- Resolved several minor issues with File Manager <br>- Resolved several issues related to text selection<br>- Resolved an issue where some application windows would get unexpectedly hidden<br>- Resolved several bugs and crashes<br><br>Desktop Agent for macOS now supports Dark mode on macOS Mojave."},{"version_id":"822855995","version_name":"3.2.1","version_date":"2017-07-14 19:50:36.000 +0800","version_description":"Stability improvements (fixed the issue with app crashing on launch for some users)"},{"version_id":"826773366","version_name":"4.0.0","version_date":"2018-05-07 15:09:44.000 +0800","version_description":"This release contains the following new features on iOS<br>- Support for new devices, including iPhone X and iPad Pro<br>- Support for PIN/Touch ID/Face ID to protect access to the app<br>- New mouse mode for easier controls<br>- Use of Spotlight for app search<br>- Text selection using 3D Touch<br>- Faster computer connection/app launch using 3D Touch on app icon<br>- Settings are now available right inside the app<br>- Support for SwiftPoint GT mouse<br><br>Other changes for iOS and desktop Agent<br>- Improved Agent for Mac and Windows<br>- Improved compatibility with iOS 11<br>- Improved remote connection stability<br>- Improved text selection detection for remote applications<br>- Better sound handling on mobile devices<br>- Multiple crashes resolved<br>- Resolved issue with adding new applications to the App Launcher on iPad<br>- Resolved input issues with remote session in a browser"},{"version_id":"827846464","version_name":"4.0.1","version_date":"2018-08-08 12:08:15.000 +0800","version_description":"Bug fixes and performance improvements:<br>- Resolved cellular connectivity issue affecting some of the users <br>- Resolved issue with computers not visible in the list<br>- Resolved issue with right toolbar hiding on iPad<br>- Improved compatibility with Microsoft Word in remote session<br>- Improved keyboard shortcuts behavior<br>- Several crashes fixed"},{"version_id":"828178135","version_name":"4.0.2","version_date":"2018-08-11 15:39:26.000 +0800","version_description":"Resolves login issue affecting some users"},{"version_id":"828498853","version_name":"4.0.3","version_date":"2018-09-18 11:14:29.000 +0800","version_description":"This version contains the following enhancements:<br>- Improved connectivity to remote computers <br>- Improved stability when launching remote applications <br>- Several crashes resolved"},{"version_id":"829326410","version_name":"4.0.4","version_date":"2019-01-16 14:43:25.000 +0800","version_description":"This version contains the following enhancements:<br>- Added support for new iPhones' screen sizes <br>- Resolved an issue with iPhone XR where mouse pointer would misplace clicks <br>- Improved application's operation in background<br>- Improved text selection operations in remote applications<br>- Improved content zoom for remote applications<br>- Improved connection establishment process<br>- Resolved an issue with 3D Touch not working in iOS 12.1<br>- Resolved several minor issues with File Manager <br>- Resolved several issues related to text selection<br>- Resolved an issue where some application windows would get unexpectedly hidden<br>- Resolved several bugs and crashes<br><br>Desktop Agent for macOS now supports Dark mode on macOS Mojave."},{"version_id":"830870126","version_name":"5.0.0","version_date":"2019-07-08 12:06:38.000 +0800","version_description":"•Improved the way how Parallels Access is displayed on the latest iPads.<br>•Based on your everyday experience, Siri creates shortcuts that can help you to speed up connecting to remote computers and launching applications.<br>•Improved remote screen decoding for better performance in various network conditions.<br><br>Parallels Access Agent<br>•Parallels Access Agent automatically checks whether connection with Parallels Access is stable and tries to re-establish it if detects any network issues.<br>•Parallels Access Agent for Mac has been notarized (according to the latest requirements from Apple).<br><br>Other improvements<br>•Improved the process of establishing connection between Parallels Access on your mobile device and Parallels Access Agent on a remote computer. <br>•Improved text selection in remote applications.<br>•Resolved several crashes."},{"version_id":"832354439","version_name":"5.0.1","version_date":"2019-08-19 15:56:35.000 +0800","version_description":"A few minor fixes that improve application stability"},{"version_id":"832998798","version_name":"5.1.1","version_date":"2019-10-17 14:41:16.000 +0800","version_description":"This version of Parallels Access (5.1.1) offers the following features and improvements:<br>- Support for Sign in With Apple authentication system<br>- Improved iOS 13 support<br>- Other stability and performance improvements"},{"version_id":"833500357","version_name":"5.5.0","version_date":"2019-12-17 12:14:20.000 +0800","version_description":"Version 5.5.0 of Parallels Access includes the following features and improvements.\n<br>\n<br>•Work with Parallels Access and other iOS apps side by side on the iPad® screen with multitasking support (both Split View and Slide Over).\n<br>•Use Parallels Access on all new iPhone® and iPad models due to compatibility and design improvements.\n<br>•Feel the full power of the dark side thanks to Dark Mode support in iOS 13.\n<br>•Rearrange or delete remote applications without having to enter Editing mode with an improved App Launch. Additionally, folder design has been improved; if you drag an application icon onto the icon of another application, a folder is created containing both applications.\n<br>•Easily switch between multiple windows of the same application with an improved App Switcher.\n<br>•Get improved microphone support—version 5.5.0 resolves an issue with the microphone not working after the sound is turned off. \n<br>•Several crashes have been fixed.\n<br>•Enjoy other performance and stability enhancements."},{"version_id":"834678948","version_name":"5.6.0","version_date":"2020-02-26 11:49:19.000 +0800","version_description":"This version (5.6.0) of Parallels Access includes the following features and improvements:<br>•    Swipe down in App Launcher to display the Search field and search for remote apps.<br>•    Improved support for the “Sign in with Apple” login procedure.<br>•    Resolved an issue with adding OneDrive to File Manager.<br>•    Resolved an issue with delay when moving app icons.<br>•    Enhanced product stability: several crashes have been resolved."},{"version_id":"836372517","version_name":"5.6.1","version_date":"2020-06-15 11:34:12.000 +0800","version_description":"This update for Parallels Access addresses overall stability and performance issues."},{"version_id":"836843096","version_name":"6.0.0","version_date":"2020-07-28 07:04:18.000 +0800","version_description":"This version of Parallels Access (6.0.0) includes the following features and improvements:<br><br>- Personal Help<br>Now you can easily help your friends and relatives with computer. All you need to do is send them a link to download and install Parallels Access Agent on their Mac or Windows PC. You can do this directly from the Parallels Access mobile app or from your Parallels account on the web. Once the Agent is up and running, the computer appears in the list and becomes available for connection.<br><br>- Simplified App Delivery<br>If you have Parallels Access Agent installed on your Mac or Windows PC, it has become much easier to get Parallels Access on your mobile device. Simply scan a QR code in the Agent or send a download link from the Share menu. And if you have Parallels Access on your mobile device, share a download link to install Parallels Access Agent on a remote computer.<br><br>- Mouse and trackpad support<br>Starting from iPadOS 13.4, use a mouse or trackpad to work with a remote PC or Mac. The mouse cursor changes its form depending on what is displayed on the remote screen.<br><br>Other crash and bug fixes and stability enhancements."},{"version_id":"837924869","version_name":"6.0.2","version_date":"2020-11-11 13:26:02.000 +0800","version_description":"This update for Parallels Access includes the following improvements: <br>•&nbsp;Parallels Access now fully supports iOS 14 <br>•&nbsp;Parallels Access Agent has been optimized for macOS 11 Big Sur (when released) <br>•&nbsp;Connection to a remote computer has become more stable and reliable <br>•&nbsp;Several bugs and crashes have been fixed"},{"version_id":"839577035","version_name":"6.1.0","version_date":"2020-12-24 12:52:44.000 +0800","version_description":"This update for Parallels Access includes the following improvements:  \n<br>•\tSeveral bugs and crashes have been fixed."},{"version_id":"839803167","version_name":"6.2.0","version_date":"2021-02-15 14:43:06.000 +0800","version_description":"This update for Parallels Access includes the following improvements:  <br>·         You can now install and use Parallels Access on Macs with M1 chip.<br>·         Many optimizations have been made to make Parallels Access more convenient, stable and easy to use on M1 Macs.<br>·         Several bugs and crashes have been resolved."},{"version_id":"840506830","version_name":"6.5.0","version_date":"2021-06-01 14:28:49.000 +0800","version_description":"This version of Parallels Access includes the following new features and enhancements:<br><br>Remote Help mode improvements<br>•\tIf you’re connected to a remote computer via a web browser, you can chat with its owner.<br>•\tYou can exchange files with a remote computer if connected via a web browser.<br>•\tYou can now remove a remote computer from the list even if it is online (i.e., available for connection).<br><br>•\tIn the Parallels Client settings, you can now choose whether to use Apple Pencil for gestures or for basic drawing in remote apps (no pressure support yet).<br><br>•\tThe product tutorial has been improved and simplified. It also supports Dark Mode.<br>•\tProduct help systems have been unified – the tutorial, links to knowledge base articles and links to get support are all in one place now.<br>•\tInstall Parallels Access for iOS on a Mac with Apple M1 chip and use it to remotely access other Mac and Windows computers with Parallels Access Agent installed.<br>•\tOther performance and stability improvements."},{"version_id":"842726949","version_name":"6.5.1","version_date":"2021-06-23 12:06:04.000 +0800","version_description":"This update for Parallels Access addresses overall stability and performance issues."},{"version_id":"842808785","version_name":"6.5.3","version_date":"2021-09-29 09:32:06.000 +0800","version_description":"This update for Parallels Access addresses overall stability and performance issues."}]