[{"version_id":"15503589","version_name":"1.0.0","version_date":"2014-12-11 03:24:42.000 +0800","version_description":""},{"version_id":"811452334","version_name":"1.1.1","version_date":"2015-02-25 10:22:18.000 +0800","version_description":"The WW2 adventure keeps marching forward! Clench your teeth, charge into battle, and download this first big update for Brothers in Arms 3 now!<br><br>A WHOLE NEW STORY CHAPTER – PORT DE CHERBOURG<br>Deploy for new story missions to retrieve artworks stolen by the retreating enemy.<br>Play with a new character, war hero Cpl. Lawrence Dailey.  <br>Fight an ailing but deadly enemy army in an all-new game environment.<br><br>NEW GAME MODE<br>Survive never-ending waves of enemies.<br>Fortify your position by repairing blown-out covers.<br><br>NEW WEAPON CLASS<br>Shotguns are here, and they’re ready to make a real splash."},{"version_id":"812125199","version_name":"1.2.2","version_date":"2015-04-20 14:45:18.000 +0800","version_description":"On the sand-swept battlefields of Africa, the sun is not your only enemy. Charge into the next blazing story in the Brothers in Arms saga, and join new faces for some armored warfare!<br> <br>Apple Watch companion app <br>- Receive important notifications regarding upgrades, VIP or energy status.<br>- Claim rewards.<br>- Sign up for events .<br>- Check useful information about weapon and brother upgrades.<br><br>JOIN THE NORTH AFRICAN CAMPAIGN<br>- Begin a compelling new story in a completely new desert environment.<br>- Your mission: Capture and defend the strategic city of El Guettar.<br> <br>2 NEW BROTHERS<br>- Team up with demolitions expert Joe Wellington, and medic Sean Lamar.<br>- Each brother has not 1 but 2 brand-new abilities: Prototype Bomb, Ultrasound Blast, Quick Fix and Mercy Shot.<br> <br>A NEW BREED OF ENEMY<br>- Face the armored threat: the machine gun storm trooper and the fearsome flamethrower soldier.<br>- Take cover! Here comes Tamia, the armored vehicle with 2 heavy machine guns and a trigger-happy gunner.<br> <br>HEAVY WEAPONS<br>- Use the Anti-Tank Rifles to punch a hole right through that armor. Now that’s tremendous firepower!<br>- Plus, 2 new Experimental Weapons for you to discover."},{"version_id":"812755186","version_name":"1.3.1","version_date":"2015-07-08 08:08:12.000 +0800","version_description":"Multiplayer has arrived on the frenzied battlegrounds of World War II! <br> <br>MASTER THE INS AND OUTS OF 4 MAPS<br>•         Hone your reflexes and prepare for a feverish fight in the tight confines of maps like CLAUSTROPHOBIA.<br>•         Employ clever tactics and teamwork to outmaneuver the enemy on the open fields of maps like AFTERMATH.<br><br>2 GAME MODES TO START WITH<br>•         Become a one-man army in the FREE FOR ALL mode.<br>•         Watch your teammates’ backs and develop coordinated attack strategies in the TEAM DEATHMATCH mode.<br> <br>POWERFUL NEW PERKS<br>•         Unlock game-changing perks by playing with each weapon class to become a combat legend. Perks are class-specific, so be sure to try out all the weapons!<br> <br>UPGRADE YOUR ARSENAL <br>•         A soldier’s only as deadly as their weapon. So be sure to upgrade it as often as possible to stay on top of your game. Glory awaits!"},{"version_id":"812994327","version_name":"1.3.2","version_date":"2015-08-10 12:06:16.000 +0800","version_description":"Minor bugs fixed"},{"version_id":"813098820","version_name":"1.3.3","version_date":"2015-08-24 09:14:04.000 +0800","version_description":"Minor bugs fixed"},{"version_id":"813781611","version_name":"1.5.0","version_date":"2019-11-18 10:00:45.000 +0800","version_description":"New Update! Enjoy New Features, bug fixes, and improvements."},{"version_id":"813781611","version_name":"1.4.3","version_date":"2019-06-10 03:00:20.000 +0800","version_description":"New update! Enjoy new features, bug fixes, and improvements."},{"version_id":"813781611","version_name":"1.4.0","version_date":"2015-10-22 06:59:26.000 +0800","version_description":"BATTLE REPORT: Brothers in Arms 3 has mobilized TANKS onto the battlefield! The multiplayer experience you love is about to get even more impressive, so update now to enjoy the ARMORED WARFARE you deserve!<br><br>MAN OR MACHINE? <br>- Hop in a tank and harness its massive firepower and sturdy armor, or…<br>- Face the tanks as a foot soldier, using the environment and clever tactics to prevail.<br><br>17 ICONIC TANKS<br>- Get behind one of the war-changing legends of WW2: Sherman, Hellcat, Panther, Tiger, T-34 and many more. <br><br>NEW MULTIPLAYER MAP &amp; MODE <br>- The desert is your new playground in this multiplayer tank map: Dust Bowl. <br>- Fight to capture and hold control points in the new Domination mode!<br><br>ADD FRIENDS AND PLAY TOGETHER<br>- Add players to your friends list.<br>- Join a friend’s multiplayer match and get bonus rewards."},{"version_id":"813781611","version_name":"1.4.1","version_date":"2018-12-10 10:32:21.000 +0800","version_description":"Various game performance improvements, optimizations and bug fixes."},{"version_id":"829536696","version_name":"1.4.1","version_date":"2018-12-10 10:32:21.000 +0800","version_description":"Various game performance improvements, optimizations and bug fixes."},{"version_id":"831303650","version_name":"1.4.3","version_date":"2019-06-10 03:00:20.000 +0800","version_description":"New update! Enjoy new features, bug fixes, and improvements."},{"version_id":"833492687","version_name":"1.5.0","version_date":"2019-11-18 10:00:45.000 +0800","version_description":"New Update! Enjoy New Features, bug fixes, and improvements."},{"version_id":"834425545","version_name":"1.5.1","version_date":"2020-01-22 07:38:38.000 +0800","version_description":"Bug fixes and UI improvements."}]