[{"version_id":"756772685","version_name":"2.1.0","version_date":"2014-11-04 18:59:13.000 +0800","version_description":"Add iPhone 6 / 6+ resolution support."},{"version_id":"813853886","version_name":"2.2.0","version_date":"2016-03-09 18:17:21.000 +0800","version_description":"Fixed some outstanding bugs and added live tools to System Manager networks, as well as a new view for scoped admin."},{"version_id":"816693400","version_name":"2.2.1","version_date":"2016-03-14 21:17:13.000 +0800","version_description":"Added back support for non 64 bit devices"},{"version_id":"818796108","version_name":"2.2.5","version_date":"2016-09-12 18:08:19.000 +0800","version_description":"Bug fixes"},{"version_id":"819121301","version_name":"2.3.5","version_date":"2016-11-07 18:21:00.000 +0800","version_description":"Added support for MV networks. Add, set up, and monitor your MV camera devices right from the app!"},{"version_id":"819985081","version_name":"2.3.7","version_date":"2016-12-05 18:45:06.000 +0800","version_description":"Camera:<br>*Minor tweaks to save data<br>*Finer focus controls"},{"version_id":"820958921","version_name":"2.3.9","version_date":"2017-02-15 21:25:27.000 +0800","version_description":"Bug fixes"},{"version_id":"832132686","version_name":"2.4.0","version_date":"2019-10-23 17:44:34.000 +0800","version_description":"• Added support for iPhone X, XR, XS, XS Max, 11, 11 Pro, and 11 Pro Max<br>• Added support for choosing to view the Primary or Secondary MX when in HA<br>• Fixed a bug where certain accounts were unable to log in<br>• Fixed a bug that would cause uploading mounting photos for devices to sporadically fail<br>• Fixed a bug that caused the VPN Registry incorrectly display “Disconnected”<br>• Fixed multiple bugs around Google Maps incorrectly loading<br>• Fixed an issue where we were unable to resolve current location, even though location permissions were enabled<br>• Fixed an issue where adding devices from inventory would erroneously fail, while still adding the device"},{"version_id":"833386041","version_name":"2.4.2","version_date":"2019-11-05 16:33:01.000 +0800","version_description":"• Fixed a feature regression where you could no longer view MV live feeds in fullscreen mode<br>• Fixed a bug where viewing the local status page information for the connected node would fail<br>• Fixed a bug where users would sometimes see a blank white screen on app re-launch<br>• Minor performance improvements"},{"version_id":"837998862","version_name":"4.0.0","version_date":"2020-09-30 14:27:23.000 +0800","version_description":"An all new Cisco Meraki mobile experience!<br><br>- Brand new UI/UX, designed for mobile first interactions with your dashboard<br>- Log in with Face ID and Touch ID (Configured via Settings -&gt; Account)<br>- Configure switch ports, SSIDs, client policies, device details<br>- Add new Cisco Meraki devices to your network by quickly scanning it's barcode in app (Devices -&gt; \"+\")<br>- Manage your systems manager devices and network clients easily from the all new unified clients list<br>- Check the health of your Cisco Meraki wireless deployment with Wireless Health<br>- Pull to refresh to get the most up to date information, including any new networks and organizations"},{"version_id":"838387003","version_name":"4.1.0","version_date":"2020-10-27 15:29:14.000 +0800","version_description":"Feature: Camera admins can now log in to the app for a tailored MV view!<br>Feature: Throughput live tool is now available!<br>Feature: Device list search now supports searching by tag!<br>Bugfix: Fixed an issue that was stopping errors from displaying when using the device onboarding tool<br>Bugfix: Fixed an issue causing Clients and SM Devices to show the incorrect status<br>Bugfix: Fixed a network error when viewing clients on a network without an MX<br>Bugfix: Handle errors on log in more gracefully now"},{"version_id":"843099513","version_name":"4.14.0","version_date":"2021-07-15 18:18:57.000 +0800","version_description":"Feature: Sensor event logs now include alert profile names on door and water sensor events!<br>Feature: New troubleshooting tools now available (DNS, Ping Host, Traceroute)!<br>Bugfix: Fixed an issue with organization status indicators not loading on the Organization Choose screen<br>Bugfix: Fixed an issue where throughput limitations were displayed in the wrong units on Group Policies<br>Bugfix: Fixed an issue that was causing the number of networks in the network picker to be capped at 1000"}]