[{"version_id":"814671631","version_name":"1.7","version_date":"2015-11-21 01:05:59.000 +0800","version_description":"- optimization for iPhone6 and iPhone6 plus resolutions<br>- minor bug fixes"},{"version_id":"815441287","version_name":"1.8","version_date":"2016-06-19 16:15:09.000 +0800","version_description":"◎ Users can now completely reset their progress if they want to start the entire program over. This option can be found in the Settings tab.<br>◎ More Apps page has been updated with new screenshots, to show our community which suite of apps will help them best achieve their fitness goals.<br>◎ Optimized voice cues when progressing through workout.<br>◎ Fixed bug when posting to Facebook, a workout voice cue would incorrectly play. <br>◎ Fixed issue on the Motivation Screen where sometimes it won’t show any text."},{"version_id":"819059788","version_name":"1.9","version_date":"2017-11-27 21:34:27.000 +0800","version_description":"◎ Minor bug fixes and optimization<br>◎ iPhone X optimzation<br><br><br>Thank you to our community of millions and millions of runners! We hope you love this update. If you haven't already, please join our amazing community of over 100,000 likes and 1000 personal success photos on Facebook.com/c25kfree. Meet other amazing individuals who are also starting the program or seek advice from the wonderfully helpful veterans who have finished. Join our active forums at forums.zenlabsfitness.com for any questions and help with getting started. <br><br>For support, contact us anytime! We answer each and every single email. contactus@zenlabsfitness.com"},{"version_id":"828807562","version_name":"2.2","version_date":"2018-10-04 17:06:12.000 +0800","version_description":"◎ optimized layout issues on the iPhone XS Max and XR<br>◎ iOS12 optimization<br><br>Our community is our number one priority. We answer each and every email. Most of our updates have been suggestions from our community. Questions? Comments? Suggestions? See why our community has made us the #1 5K training app. contactus@zenlabsfitness.com"}]