[{"version_id":"112502639","version_name":"0.9.6","version_date":"2013-11-13 09:04:08.000 +0800","version_description":"- support for iPad1 and iPod4 - better frame rate, more stable<br>- slightly increased Mr Talonted's Slam Dunk stun time<br>- slightly decreased Mr Talonted level 1 Dash damage<br>- player gets a small amount of gold for calling in next wave early<br>- fixed bug with sheep not appearing in level 2<br>- fixed issue with poseidon not stunning longer when upgraded in game<br>- better feedback when shrine is full<br>- new charging ring feedback for Mr Talonted's Dash, Hercules's Stomp as well as shrine cooldown<br>- new popup when a player purchases something from the store"},{"version_id":"126482637","version_name":"1.0.0","version_date":"2013-11-27 07:52:06.000 +0800","version_description":"- AWESOME NEW HERO AVAILABLE: Play as the deadly Siren!<br>- new item in the store: laZboy bundle.<br>- 5 new hats for your hero to wear!<br>- improved the Centaur's magic bolt targeting.<br> - added Game Center achievements."},{"version_id":"234332650","version_name":"1.0.2","version_date":"2013-12-18 10:32:50.000 +0800","version_description":"- NEW QUEST: Help Daedulus find all of his dropped presents in exchange for a Secret Santa hat!<br>- BRAND NEW HERO AVAILABLE: Play as the fiery, merciless Phoenix!<br>- SNAZZIER SIREN: We upgraded Nina Sea-mone's visuals to match her lethal skills. Check it out!<br>- ENERGY: We're phasing out energy so you can play without energy limitations!"},{"version_id":"524322667","version_name":"1.0.7","version_date":"2014-04-09 00:19:26.000 +0800","version_description":"FIXED ISSUES: Start up and World 4 Crashes, squashed miscellaneous bugs"},{"version_id":"55032632","version_name":"0.9.1","version_date":"2013-10-08 19:39:37.000 +0800","version_description":""},{"version_id":"568472640","version_name":"1.0.9","version_date":"2014-05-05 04:15:08.000 +0800","version_description":"- NEW HERO SKILL: We revamped the Siren's SPELLSONG skill to make it stronger! Now she traps GROUPS of enemies for your gods to easily destroy. Check her out in the HEROES section!\n<br>\n<br>- FIXED ISSUES: squashed miscellaneous bugs"},{"version_id":"612432712","version_name":"1.1.0","version_date":"2014-07-31 03:45:47.000 +0800","version_description":"- LOTS-O-PRETTY NEW PICTURES: Check out the new and improved UI, brand new splash screen, and improved World 2 art!<br><br>- NEW TUTORIAL &amp; COMICS: We added a shiny new tutorial for first-time players, including introductory comics.<br><br>- NEW STORE BUNDLES: We added new power-up bundles with better value for you. Check them out in the store!<br><br>- FIXED ISSUES: squashed miscellaneous bugs!"},{"version_id":"658242696","version_name":"1.1.1","version_date":"2014-08-21 04:01:57.000 +0800","version_description":"- FIXED ISSUES: Improved download and squashed miscellaneous bugs!"},{"version_id":"705932658","version_name":"1.1.2","version_date":"2014-09-25 03:51:41.000 +0800","version_description":"- NEW HERO FIRETONGUE: Born from the heart of a volcano, Firetongue is one metric ton of fire, muscle, and very bad temper.<br><br>- NEW HERO ICEFANG: The living embodiment of winter, Icefang rolls over her enemies like an unstoppable avalanche. Just the sight of her can freeze the bravest in their tracks.<br><br>- TAVERN HERO RENTAL: Heroes have started gathering in the Tavern, relaxing and sharing tall tales. Head over and hire one now to keep them in shape!<br><br>- FIXED ISSUES: Squashed miscellaneous bugs!"},{"version_id":"811223151","version_name":"1.1.4","version_date":"2015-02-12 07:06:44.000 +0800","version_description":"SPECIAL EVENT: It's Chinese New Year and the Nian Monster is wrecking havoc on Olympus! Slay the beasts in return for some nice Hats!<br><br>GEMS: The the nectar of the Gods, save up Gems to permanently own Heroes, Power-Ups, Hats, and other goodies!<br><br>ONLINE FEATURES: Claim your account to play across multiple devices!<br><br>NEW HERO: The Monkey King joins Olympus to help defeat the Nian Monster!"},{"version_id":"811977376","version_name":"1.1.5","version_date":"2015-03-23 07:05:06.000 +0800","version_description":"A small update to squash some pesky bugs while we prepare World 5 for the next version!"},{"version_id":"812142049","version_name":"1.1.6","version_date":"2015-04-15 07:21:28.000 +0800","version_description":"EGYPTIAN WORLD: 7 brand new levels, new enemies to challenge your wits, and play with new level tiles that offer you even more strategy!<br><br>NEW GODS: Anubis and Ra joins the Greek Pantheon. Anubis revelas hidden enemies, Ra offer you more gold in the levels!"},{"version_id":"812327687","version_name":"1.1.7","version_date":"2015-05-11 08:15:12.000 +0800","version_description":"FIXED ISSUES: Squashed miscellaneous bugs!"},{"version_id":"812501935","version_name":"1.1.8","version_date":"2015-07-23 03:48:48.000 +0800","version_description":"This app has been updated by Apple to use the latest Apple signing certificate.<br><br>UPGRADED: Added 64-bit support<br>FIXED ISSUES: Squashed miscellaneous bugs!"},{"version_id":"837078841","version_name":"1.1.8","version_date":"2015-07-23 03:48:48.000 +0800","version_description":"This app has been updated by Apple to use the latest Apple signing certificate.<br><br>UPGRADED: Added 64-bit support<br>FIXED ISSUES: Squashed miscellaneous bugs!"},{"version_id":"86312737","version_name":"0.9.5","version_date":"2013-11-07 01:48:20.000 +0800","version_description":"- Griffin (Mr. Talonted) is now more intimidating<br>- Fixed issue with available 3 star soul rewards not displaying correctly<br>- Buffed up Centaur's (Clyde S. Dale) damage in general<br>- Buffed up lightning shrine damage a little bit<br>- Shrines are now disabled before level starts<br>- Soul images in store are now much shinier"}]