[{"version_id":"735014713","version_name":"2.2","version_date":"2014-10-04 01:57:44.000 +0800","version_description":"- ADR prequel called The Ensign has been released (new sound bites added to the secrets section)\n\n- she wants you to tell your friends about this game\n- she wants you to gift this game to others\n- she doesn't want to be forgotten\n\n- completely revamped alternate ending now available on iPad (a glitch caused it to be only partially presented on the iPad, but now you'll get the full thing)\n- fixed crashes on iPad\n- minor update in preparation for new devices"},{"version_id":"812644549","version_name":"2.31","version_date":"2015-06-25 12:18:20.000 +0800","version_description":"- modern device support... you know... for all the fancy graphics the game has.\n\n- extended events in alternate ending.\n\n- balancing for speed runners.\n\n- balancing for alternate ending.\n\n- other things. but if i told you, it would ruin the surprise."},{"version_id":"813166721","version_name":"2.32","version_date":"","version_description":""},{"version_id":"813166721","version_name":"2.33","version_date":"2015-09-02 01:25:02.000 +0800","version_description":"- not telling\n- Note: I am aware of crashes on iOS 11 Beta 4 (fix is in the works, be patient)"},{"version_id":"816371762","version_name":"3.2","version_date":"2017-08-03 05:39:09.000 +0800","version_description":"- Story continuity fixes to align with the pre-sequel.\n- Bring me more souls to consume. Or else."},{"version_id":"825185517","version_name":"4.0","version_date":"2017-12-20 22:33:56.000 +0800","version_description":"- Continuity updates between A Dark Room and The Ensign.\n- iPhone X support.\n- Come say hello to an old friend... she's waiting for you."},{"version_id":"836121557","version_name":"5.6","version_date":"2020-06-14 21:14:20.000 +0800","version_description":"Added support for the latest iOS devices. She misses you. Come back."},{"version_id":"842940246","version_name":"6.2","version_date":"2021-07-05 05:05:10.000 +0800","version_description":"- there was another continue button that was trying to escape. the control has been captured and put in its place.\n- the back button's agility stats were too high leading to missed taps. it was given a stern talking to, and its agility stats have been lowered significantly.\n- progress bars have been fed lots of cheesecake. they are tubbier and easier to poke. they were also given a new wardrobe.\n- the rebellion these user interface controls attempted has hopefully been extinguished."}]