[{"version_id":"800632691","version_name":"1.2.1","version_date":"2014-11-15 03:52:57.000 +0800","version_description":"Version 1.2.1:<br>- Orange theme is now FREE for all users.<br>- Rotation bug on iPad on iOS 8 (sorry about that! &gt;.&lt;)<br>- iPhone 6 / 6+ empty history text alignment<br><br>Version 1.2:<br>- 9 beautiful themes<br>- Universal for iPhone and iPad (and optimised for iPhone 6 and 6+)<br>- Automatic brackets<br>- Faster evaluation<br><br>Check out the new website and promo video at www.verytinymachines.com/numerical"},{"version_id":"812182733","version_name":"1.2.2","version_date":"2015-10-19 18:02:14.000 +0800","version_description":"Fixes issue with iOS 9 fonts.<br><br>Numerical 2 is coming soon ;)"},{"version_id":"813919610","version_name":"1.2.2","version_date":"2015-10-19 18:02:14.000 +0800","version_description":"Fixes issue with iOS 9 fonts.<br><br>Numerical 2 is coming soon ;)"},{"version_id":"821545231","version_name":"2.0.0","version_date":"2017-04-14 21:01:04.000 +0800","version_description":"Welcome to Numerical² - Brand new app, still no equal!<br>New features include...<br><br>- Full scientific keypad including sin/cos/tan, EE, ln, log, square root and more!<br>- Use the fraction key to do coherent fractional math and your answer is presented in numeric and fractional formats.<br>- Use Pi, E and infinity to determine the answer to any question, including impossible ones.<br>- New design places the History list behind the keypad - pull down to see your history while you work!<br>- History List now syncs with iCloud.<br>- Landscape view (finally) works on iPhone.<br>- Full support for iPad Split Screen multi-tasking.<br>- Install the Numerical² keyboard so you can calculate a question in any app. Tap a button and the answer is inserted in the text field.<br>- Made a mistake? Tap the current equation to enter edit mode where you can select characters, insert and delete.<br>- Apply 16 beautiful themes including new entrants Candy, Mint, Lava and a set of “bright themes”.<br>- Use the Theme Creator to make your own bright and beautiful color scheme.<br><br>Numerical² is totally Free, but if you'd like to support us you can become a Numerical Supporter for $1.99USD p/month, auto renewing. You can cancel at anytime and we'll love you regardless &lt;3<br><br>If you have any questions or feedback please get in touch:<br>verytinymachines@gmail.com<br>www.verytinymachines.com/numerical<br><br>Developed by @andrewjclark. Designed by @andrewjclark &amp; @alexvanderzon.<br>We hope you love it &lt;3"},{"version_id":"821776427","version_name":"2.0.1","version_date":"2017-04-16 18:37:08.000 +0800","version_description":"Grey Screen Issue:<br>Thanks to an astute user the cause of the grey screen issue has been determined! It is caused by the way iOS deals with user's who have enabled Reduced Transparency in iOS Settings &gt; Accessibility. A new version will be uploaded soon but in the meantime you can disable this option in order to restore Numerical² to it's colourful blurry glory.<br><br>Thanks for all of your feedback on Numerical²! If you have any other issues or feedback please get in touch! verytinymachines@gmail.com<br><br>- Custom themes are temporarily disabled. They can be re-enabled in Settings.<br>- Font and UI tweaks to enhance readability and make it look more Numerical 1ish<br>- New logo<br>- Fix for IAP not always working.<br>- Removed autoscroll from history view which made it hard to use concurrently with work.<br>- Fixed logic error related to order of operations of multiply/divide and add/subtract.<br>- Color's in Theme Creator are brighter and more accurate to what the final theme will look like.<br>- Fixes related to crash on launch bug (WIP).<br>- Added \"What's New\" link in Settings area.<br>- Adding Debug Logging to Settings area for users helping diagnose bugs."},{"version_id":"821782566","version_name":"2.0.2","version_date":"2017-04-18 07:10:27.000 +0800","version_description":"We are aware of crash on Launch bug that is still affecting some users. Please delete the app and reinstall it while we work on a fix.<br><br>We're working hard on a bunch of new features and tweaks suggested by users. If you have anything to add please get in touch: verytinymachines@gmail.com"},{"version_id":"821857191","version_name":"2.0.3","version_date":"2017-04-23 18:18:11.000 +0800","version_description":"This version restores 2 popular feature requests/demands: a right aligned equation view and swipe to delete function! There are also a lot of minor bug fixes and UI improvements such as improving font sizes and making the equation area bit bigger, thus making the keypad easier to reach. See the detailed list below for more...<br><br>You can see upcoming features at http://www.verytinymachines.com/numerical2-whatsnew or get in touch at verytinymachines@gmail.com - keep your feedback coming! xoxo AJC<br><br>- Right aligned equation view<br>- Undo swipe<br>- Taller answer area so the delete key is lower<br>- Bigger question font<br>- Workpanel should be movable to a 65% view rather than 50%<br>- Bug: Brackets not being allowed to follow brackets<br>- Bug: Brackets not being allowed to follow percentage’s<br>- Bug: Editing equation would incorrectly position cursor<br>- Copying question now copies \"question = answer\"<br>- Bug: Error types not displaying properly<br>- URL Scheme<br>- Keyboard shorter name"},{"version_id":"821962516","version_name":"2.0.4","version_date":"2017-05-01 17:24:56.000 +0800","version_description":"In this exciting release you can now customise the position of the history list, and disable the scientific keypad - yes, you can make it Numerical 1! There have also been improvements to keyboard responsiveness but more improvements to overall performance are in the works. Wanna get in touch? verytinymachines@gmail.com<br><br>- Prefer history behind toggle (switch it off for history on the side ala Numerical 1)<br>- Show scientific keyboard toggle<br>- Prefer radians toggle<br>- Edit / Delete All button in the history list<br>- Nicer history view<br>- Toggle for always show numeric answers.<br>- Overall colors and design has been darkened and toned down a bit.<br>- Big improvements to keypad responsiveness and that issue where fast typing might start the keypad scrolling a little.<br>- Bug fix: Brackets key would stupidly attempt to follow a ) with an ( when really it should be another )"},{"version_id":"822127672","version_name":"2.0.5","version_date":"2017-05-13 16:16:42.000 +0800","version_description":"- Much faster evaluation and keyboard responsiveness.<br>- Multiline question view, ala Numerical 1.<br>- Set decimal count option.<br>- Fix issue where buttons have underline for user who have enabled Display Button Shapes.<br>- Clear animation.<br>- Fix occasional errors related to History updates.<br><br>If you have any issues, comments or feature ideas please get in touch at: verytinymachines@gmail.com"},{"version_id":"822240941","version_name":"2.0.6","version_date":"2017-05-23 13:36:02.000 +0800","version_description":"- Themes are now nameable!<br>- Undo/redo with swipes, up to 30 times.<br>- Swipe up to clear<br>- Swipe down to start new with answer<br>- Fixed bug where e^2 would produce error<br>- Fixed bug where some equations brought to ^20 or higher would produce error"},{"version_id":"822317030","version_name":"2.0.7","version_date":"2017-05-28 19:55:27.000 +0800","version_description":"- Bug fixes"},{"version_id":"822570678","version_name":"2.0.8","version_date":"2017-06-16 18:55:22.000 +0800","version_description":"Note: There is a bug preventing the Today Widget from working for some users. An update is forthcoming.<br><br>- Enable the new Today Widget you can calculate from anywhere! Just swipe down and you can work right there in Notification Center.<br>- Added copy/paste/insert menu to Today Widget and Keyboard extension. Just tap the equation for options.<br>- Localised decimals and grouping characters (\".\" appears as \",\" for countries where that is the default)<br>- Fixed issue (again) where copying would only copy question, not question &amp; answer.<br>- Performance improvements and UI tweaks."},{"version_id":"822595207","version_name":"2.0.9","version_date":"2017-06-19 16:24:06.000 +0800","version_description":"Update: Fixed issue where \"Show More\" button would not appear in Today Widget.<br><br>- Enable the new Today Widget you can calculate from anywhere! Just swipe down and you can work right there in Notification Center.<br>- Added copy/paste/insert menu to Today Widget and Keyboard extension. Just tap the equation for options.<br>- Localised decimals and grouping characters (\".\" appears as \",\" for countries where that is the default)<br>- Fixed issue (again) where copying would only copy question, not question &amp; answer.<br>- Performance improvements and UI tweaks."},{"version_id":"823027074","version_name":"2.1.0","version_date":"2017-07-26 15:34:25.000 +0800","version_description":"Default Themes now change the App's homescreen icon! Custom Themes default to the normal pink/blue icon. This function can be disabled in settings if you prefer the pink/blue icon for all themes.<br><br>Also included:<br>- Fix for issue where some items would be left over after history deletion.<br>- Setting for Bold text style"},{"version_id":"823706092","version_name":"2.1.1","version_date":"2017-09-22 11:20:03.000 +0800","version_description":"- iOS 11 and iPhone X ready!<br>- External keyboard support<br>- Fixed issue where keyboard would erroneously be scrollable<br>- Bug fixes and performance improvements."},{"version_id":"824802863","version_name":"2.1.3","version_date":"2019-03-24 23:33:13.000 +0800","version_description":"- Minor bug fixes"},{"version_id":"824802863","version_name":"2.1.2","version_date":"2017-11-27 15:52:03.000 +0800","version_description":"- iPhone X layout improvements.<br>- Decimal selector now goes as low as 2 decimal places.<br>- Fix for issue where editing equations could add unexpected commas and flip fractions."},{"version_id":"830678469","version_name":"2.1.3","version_date":"2019-03-24 23:33:13.000 +0800","version_description":"- Minor bug fixes"},{"version_id":"833917792","version_name":"2.1.4","version_date":"2019-12-18 16:17:35.000 +0800","version_description":"• New: Custom Icon Selector - you can now mix and match icon’s and themes, or apply default app icons to your own custom themes (previously, custom theme’s would default to the standard app icon which was not very pleasing)<br>• Finally: Fixed font spacing issues on iOS 13<br>• Fixed app icon mismatch with \"Cloud\" theme<br>• Fixed rate button<br>• Fixed tint color of Max Decimal selector<br>• Fixed out of bounds fraction crash<br>• Fixed landscape layout issue on large iPhones<br>• Improved formatting for scientific symbols log2 and log10<br>• Updated to Swift 5"},{"version_id":"834120040","version_name":"2.1.5","version_date":"2019-12-26 14:25:00.000 +0800","version_description":"This Version:<br>• Fixed issue where localised decimal points were, uh, busted.<br><br>Last Version:<br>• New: Custom Icon Selector - you can now mix and match icon’s and themes, or apply default app icons to your own custom themes (previously, custom theme’s would default to the standard app icon which was not very pleasing)<br>• Finally: Fixed font spacing issues on iOS 13<br>• Fixed app icon mismatch with \"Cloud\" theme<br>• Fixed rate button<br>• Fixed tint color of Max Decimal selector<br>• Fixed out of bounds fraction crash<br>• Fixed landscape layout issue on large iPhones<br>• Improved formatting for scientific symbols log2 and log10<br>• Updated to Swift 5"},{"version_id":"836768350","version_name":"2.1.6","version_date":"2020-07-09 17:12:45.000 +0800","version_description":"Minor bug fixes"}]