[{"version_id":"388192653","version_name":"1.2.0.2123","version_date":"","version_description":""},{"version_id":"669782670","version_name":"1.5.2.2417","version_date":"","version_description":""},{"version_id":"813090260","version_name":"1.5.13","version_date":"","version_description":""},{"version_id":"815701677","version_name":"1.5.14","version_date":"2016-02-04 07:42:03.000 +0800","version_description":"1. Update DSP to improve performance<br>2. Update Audiobus SDK."},{"version_id":"816379349","version_name":"1.5.15","version_date":"2016-02-09 02:59:11.000 +0800","version_description":"Hi there,<br><br>In this update, we fixed a crash issue during launch in some devices, and we also upgraded DSP library for better sound and CPU performance.<br><br>As many of you know, we are working on BIAS HEAD, it is a 600-watt powered guitar amplifier that will give you the world's finest amps. You can amp match any real amplifier’s tone, virtually swap tubes, sync with BIAS mobile and desktop, plus share and download thousands of professional Amp Match profiles, BIAS Head will be seamlessly integrated with BIAS Desktop and Mobile.<br><br>BIAS Head (MSRP $1299) will be available for Limited Early Bird pre-order in Q1 2016. Learn more: www.positivegrid.com/bias-head<br><br>Rock on,<br>The Positive Grid team"},{"version_id":"816468189","version_name":"1.5.16","version_date":"2016-02-19 05:46:40.000 +0800","version_description":"Hi there,<br><br>In this update we have been working hard to squash some bugs: now you can seamlessly open BIAS Amp from Audiobus, fully visualize our BIAS Store / Tonecloud , and other minor fixes.<br><br>And don’t forget to check out our latest release BIAS FX Standalone for Mac and Windows - the easiest way to use BIAS FX!<br><br>Learn more: http://positivegrid.com/bias-fx/<br><br><br>Rock on,<br>the Positive Grid team"},{"version_id":"816660697","version_name":"1.5.17","version_date":"2016-03-15 05:15:04.000 +0800","version_description":"Hi there , <br><br>We hear you! In this update we fixed the cross platform amp integration issues and fixed the panel display on ToneCloud. Now you can also delete any amp model in your custom folder.<br>Our new BIAS Head - Amp Match Amplifier sold out the first 2 pre-orders in just 2 days! Stay tuned for pre-order #3 coming very soon.<br><br>Rock on , <br>The Positive Grid Team"},{"version_id":"817009289","version_name":"1.5.18","version_date":"2016-04-18 15:59:48.000 +0800","version_description":"Hi there , <br><br>We have been working non-stop to make our apps integration as seamless as possible. In this version we fixed the crash bug while opening BIAS Amp from BIAS FX and cab module automatically turned on issue. We also enhanced the cross platform preset support, and cleared up the download error messages to give you a better and easier app experience.<br><br>Our new BIAS Head - Amp Match Amplifier sold out the first 3 pre-orders! Stay tuned for the Last Chance pre-order coming very soon.<br><br>Rock on,<br>The Positive Grid team"},{"version_id":"819566647","version_name":"1.6.0","version_date":"2016-11-24 07:20:51.000 +0800","version_description":"Hi there ,<br><br>Thanks for your feedback! In this update we squashed some bugs so you can download some of the newer ToneCloud presets as you would normally do. And for maximum tone creation, we added IR loader support, so you can get the same awesome tones as our desktop apps. We also fixed other minor bugs including UI issues. Finally, remember BIAS Amp minimum compatible version has been changed from 8.0 to 9.0 to give you the best possible experience.<br><br>Rock on!<br><br>- The Positive Grid team"},{"version_id":"819941662","version_name":"1.6.1","version_date":"2016-12-01 05:03:48.000 +0800","version_description":"Hi There<br><br>Thanks for your Feedback! On this new update you will increase your tone possibilities, because now you can add all the new Choptones FREE amp match presents available on Tonecloud. Also we fixed the bug from last update of the app crashing when switch to an amp in custom folder.<br><br>Rock On!<br>Team Positive Grid"},{"version_id":"820723871","version_name":"1.6.2","version_date":"2017-02-18 10:00:14.000 +0800","version_description":"Hi there,<br><br>In this version, we have added the compatibility to connect BIAS Amp iPhone to all the BIAS Amp Hardware via Bluetooth, including BIAS Head, BIAS Head DSP, BIAS Rack and BIAS Rack DSP. Now you can control all the parameters wirelessly via Bluetooth with BIAS Amp iPhone! We also improved the general user interface to enhance the user experience<br><br>Rock On,<br>Team Positive Grid."},{"version_id":"821326093","version_name":"1.6.3","version_date":"2017-03-21 09:41:49.000 +0800","version_description":"Hi There<br><br>Thanks for your feedback. On this new update we fixed some minor bugs you could experience when logging into ToneCloud. Also the app won’t freeze on the launch screen anymore.<br><br>Rock On!<br>Team Positive Grid"},{"version_id":"821746734","version_name":"1.6.4","version_date":"2017-04-19 08:00:38.000 +0800","version_description":"Hi there,<br><br>Thanks for your feedback. On this new update of BIAS Amp now you are able to download the Amp Match presets from Tone Cloud directly into the BIAS GEAR. Also we improved the UI for a better user experience.<br><br>Rock On, <br>Team Positive Grid."},{"version_id":"822159478","version_name":"1.6.5","version_date":"2017-05-22 10:20:31.000 +0800","version_description":"Hi There,<br><br>Thanks for your feedback. On this new update, we bundled new firmware for BIAS Head and BIAS Rack. We also fixed some minor bugs.<br><br>Rock On!<br>Team Positive Grid"},{"version_id":"822900781","version_name":"1.6.6","version_date":"2017-08-02 08:26:04.000 +0800","version_description":"Hi there, <br><br>In this update, we are fully compatible with Audiobus 3.<br><br>Rock on, <br>Team Positive Grid"},{"version_id":"823433614","version_name":"1.6.7","version_date":"2017-08-31 08:46:55.000 +0800","version_description":"Hi there,<br><br>Thanks for your feedback! In this new update, we've fixed crash issues when using Audiobus, as well as updated the bundled BIAS Head and Rack firmware to fix MIDI assignment problems, crash issues, and minor UI issues.<br><br>Rock On,<br>Team Positive Grid."},{"version_id":"824026238","version_name":"1.6.8","version_date":"2017-10-25 08:36:26.000 +0800","version_description":"Hi there,<br><br>In this new update, we fixed compatibility issues with iOS 11 and crash issues when connecting with BIAS Head.<br><br>Rock On,<br>Team Positive Grid."},{"version_id":"824075834","version_name":"1.6.8","version_date":"2017-10-25 08:36:26.000 +0800","version_description":"Hi there,<br><br>In this new update, we fixed compatibility issues with iOS 11 and crash issues when connecting with BIAS Head.<br><br>Rock On,<br>Team Positive Grid."},{"version_id":"825499251","version_name":"2.1.9","version_date":"2019-03-12 07:38:39.000 +0800","version_description":"Hi there,<br><br>This latest update addresses the issue of integration error with Audiobus 3 and other inter-app audio supported apps.<br><br>Rock on,<br>The Positive Grid Team"},{"version_id":"825499251","version_name":"1.8.1","version_date":"2018-03-20 06:02:29.000 +0800","version_description":"Hi There,<br><br>Thanks for your feedback! In this new update, we’ve implemented some minor bug fixes to improve the overall stability of the app.<br><br>Rock On!<br>Team Positive Grid"},{"version_id":"825499251","version_name":"1.8.0","version_date":"2018-01-08 02:59:58.000 +0800","version_description":"Hi There,<br><br>Positive Grid is proud to introduce a significant update that will make the world's best amp modeling software even better! <br><br>In this update, we added 9 new reverbs to the BIAS Amp software that will also work seamlessly with BIAS Head and BIAS Rack (firmware update required). <br><br>Here’s more info about the Reverb feature:<br><br>-NEW: Reverb types that include Room (x2), Chamber, Hall (x3), and Plate (x3).<br>-NEW: Reverb controls that include Reverb Type, Decay Time, Mix, Damping (which simulates absorptive material in the reverb room, rolling off high frequencies naturally), Lo and Hi Cut filters, and Dwell (which saturates the reverb return).<br>-We have also made changes to make noise gate and reverb as preset dependent, which means you can save different gate and reverb parameters to different amp tones accordingly.<br>-Various minor fixes.<br><br>Hope you’ll enjoy it! To learn more, please head over to:<br>https://www.positivegrid.com/bias-head  and https://www.positivegrid.com/bias-amp .<br><br>Rock On!<br>Positive Grid team"},{"version_id":"826209937","version_name":"1.8.1","version_date":"2018-03-20 06:02:29.000 +0800","version_description":"Hi There,<br><br>Thanks for your feedback! In this new update, we’ve implemented some minor bug fixes to improve the overall stability of the app.<br><br>Rock On!<br>Team Positive Grid"},{"version_id":"826659112","version_name":"1.8.2","version_date":"2018-04-16 06:54:10.000 +0800","version_description":"Hi there,<br><br>This latest update improves the overall stability for connecting with hardware devices.<br><br>Rock On,<br>The Positive Grid Team"},{"version_id":"827486100","version_name":"2.0.0","version_date":"2018-06-12 08:31:17.000 +0800","version_description":"Hi there,<br><br>BIAS AMP 2 for iPhone comes with a host of advancements and new features, including new amp packs, speaker cabs, tubes, transformers, tone stacks and more! The new cab module features dual micing capability and open/closed back cab emulation, and the brand new user interface and updated ToneCloud make using BIAS AMP 2 even faster and more intuitive.<br><br>BIAS AMP 2 represents a revolution in virtual amplifier design, providing the tools to take the ultimate guitar tones with you anywhere, from the studio to the stage and back again.<br><br>BIAS AMP 1 owners qualify for special upgrade pricing, so be sure to log in to your App Store account to learn more.<br><br>Features: <br>    • New DSP sound engine<br>    • New user interface<br>    • New standard preamp tubes (12AY7, 12BH7)<br>    • New standard power amp tubes (6550, KT88)<br>    • 6 New tone stacks<br>    • New transformer model and dynamic tone control<br>    • New cab module with dual mic capability and open/closed back emulation<br>    • 4 new cab models<br>    • 2 new microphone models<br>    • 45 new items in custom panel<br>    • New Blues pack - Preamp, power amp and cabs for blues and mid-gain tones (IAP)<br>    • New Bass pack - Preamp, power amp and cabs for bass guitar (IAP)<br>    • New Celestion speaker cabinets (custom cabs created using officially-licensed Celestion Impulse Responses (IAP)<br><br>Rock On!<br>The Positive Grid Team"},{"version_id":"827512692","version_name":"2.0.1","version_date":"2018-06-25 02:44:40.000 +0800","version_description":"Hi there,<br><br>This latest update improved UI/UX and fixed the following bugs :<br><br>- Revised BIAS MINI firmware (version: 0.1.2.135) to address the issue of LED hang after turning output knob.<br>- Fixed random crashes.<br><br>Rock On!<br>The Positive Grid Team"},{"version_id":"827869341","version_name":"2.1.0","version_date":"2018-07-31 04:23:43.000 +0800","version_description":"Hi there,<br><br>This latest update improves the microphone behavior, sound of the Phase Tube, and the EQ module. This update also consists of the following changes:<br><br>Improvements and Feature Changes<br><br>- Improved volume compensation when a second microphone is added to the CAB module.<br>- Replaced the Phase Tube for Blues/Insane Poweramp.<br>- Imported a new UI design for the Parametric EQ Module.<br><br>Bug Fixes<br><br>- Fixed the issue of “Save” light behavior while attempting to connect with BIAS Head.<br>- Fixed the issue of random UI error.<br><br>Rock On!<br>The Positive Grid Team"},{"version_id":"828159158","version_name":"2.1.1","version_date":"2018-08-09 16:35:21.000 +0800","version_description":"Hi there,<br><br>This latest update mainly addresses the issue that blocked users from accessing the green bank within BIAS MINI.  This update also includes a new firmware update for BIAS MINI.<br><br>Rock on,<br>The Positive Grid Team"},{"version_id":"828253285","version_name":"2.1.2","version_date":"2018-08-28 02:52:24.000 +0800","version_description":"Hi there,<br><br>This latest update mainly addresses the MIDI assignment issue in BIAS AMP Hardware (BIAS Head/Rack/MINI). We’re also bringing you a new firmware update for BIAS MINI as well as the following bug fixes:<br><br>- BIAS AMP hardware can’t change MIDI PC setting in certain statuses.<br>- Some Celestion cabs do not show the correct status.<br>- Blues Preamp and Poweramp controls do not show the correct value.<br><br>Rock on,<br>The Positive Grid Team"},{"version_id":"828413842","version_name":"2.1.3","version_date":"2018-09-14 03:27:26.000 +0800","version_description":"Hi there,<br><br>In this update, we've added all-new updates to our Low Gain presets in the Clean, Glassy, and Blues categories. These preset updates are now available for download on ToneCloud!<br><br>Rock on,<br>The Positive Grid Team"},{"version_id":"828907623","version_name":"2.1.4","version_date":"2018-10-15 07:48:02.000 +0800","version_description":"Hi there,<br><br>This latest update brings you:<br><br>- BIAS FX iPhone integration!<br>- Fixed BIAS AMP 2 from crashing when performing hardware serial number checkup<br>- Minor bug fixes and general performance improvements<br><br>Rock on!<br>The Positive Grid Team"},{"version_id":"829095464","version_name":"2.1.5","version_date":"2018-10-30 03:49:28.000 +0800","version_description":"Hi there,<br><br>In this update, we've added all-new updates to the factory presets in the Crunch and High Gain categories, available now for download from ToneCloud! This update also restored function for the back button in the Cab module.<br><br>Rock on!<br>The Positive Grid Team"},{"version_id":"829349350","version_name":"2.1.6","version_date":"2018-11-21 07:02:25.000 +0800","version_description":"Hi there,<br><br>In this update, we've added a public announcement system that brings you the latest news and announcements right within the app. There’s also a new firmware update for hardware with the following bug fixes:<br><br>- Fixed the sound issue when using 96kHz presets on hardware<br>- Fixed the MIDI PC assignment missing issue after disconnecting BIAS Head/Rack<br>- New public announcement system<br><br>Rock on!<br>The Positive Grid Team"},{"version_id":"829617513","version_name":"2.1.7","version_date":"2018-12-13 09:34:03.000 +0800","version_description":"Hi there,<br><br>This latest release brings an update to the factory presets found in the Metal and Insane categories. These updated amp models are  now available for download on ToneCloud!<br><br>Rock on!<br>The Positive Grid Team"},{"version_id":"829778141","version_name":"2.1.8","version_date":"2019-02-25 04:20:05.000 +0800","version_description":"Hi there,<br><br>This latest update addresses the volume meter display issue in the Cab mixer section. We're also bringing you a few improvements as below:<br><br>- Added an option to disable public announcement<br>- Improved the check license and restore purchase process<br>- Fixed the level indicator display issue in the Cab mixer section<br><br>Rock on,<br>The Positive Grid Team"},{"version_id":"830529827","version_name":"2.1.9","version_date":"2019-03-12 07:38:39.000 +0800","version_description":"Hi there,<br><br>This latest update addresses the issue of integration error with Audiobus 3 and other inter-app audio supported apps.<br><br>Rock on,<br>The Positive Grid Team"},{"version_id":"833641806","version_name":"2.1.10","version_date":"2019-11-18 04:44:30.000 +0800","version_description":"Hi there,<br><br>This latest update mainly adds new firmware version for BIAS MINI. The new version includes the updates below:<br><br>- New MIDI thru feature<br>- Improved preset switching speed when using MIDI message<br>- Fixed the issue that volume increasing when switching standard cab to Celestion cab<br><br>Rock on,<br>The Positive Grid Team"},{"version_id":"835937419","version_name":"2.1.11","version_date":"2020-05-20 08:59:08.000 +0800","version_description":"Hi there,<br><br>This latest version includes the updates below:<br>- Update DSP engine to r2244<br>- BIAS FX 2 Mobile integration<br><br>Rock on,<br>The Positive Grid Team"},{"version_id":"839235320","version_name":"2.1.12","version_date":"2020-11-19 03:22:31.000 +0800","version_description":"Hi there,<br><br>This update is for fixing the crash issue when opening the app from background mode<br><br>Rock on,<br>The Positive Grid Team"},{"version_id":"841024052","version_name":"2.1.13","version_date":"2021-03-30 10:03:05.000 +0800","version_description":"Hi there,<br><br><br>This update contains the following changes:<br><br>- Fixed an issue with Audiobus connection on iOS 14<br><br><br>Rock on,<br><br>The Positive Grid Team"}]