[{"version_id":"813201025","version_name":"1.2.4","version_date":"2015-09-03 21:05:31.000 +0800","version_description":"Stabilitetsforbedringer"},{"version_id":"819315900","version_name":"1.2.5","version_date":"2016-10-18 07:40:15.000 +0800","version_description":"Biblioteket er nu optimeret til større skærme; ikke mere skalering på f.eks. iPhone Plus modeller.<br>Flere rettelser ifbm. iOS 10."},{"version_id":"820067293","version_name":"1.3.0","version_date":"2016-12-13 11:52:12.000 +0800","version_description":"Mindre fejlrettelser"},{"version_id":"820276575","version_name":"1.3.1","version_date":"2017-01-04 11:49:39.000 +0800","version_description":"En enkelt lille rettelse."},{"version_id":"829550832","version_name":"2.3.2","version_date":"2018-12-07 20:28:16.000 +0800","version_description":"Vi er glade for at du vil bruge Biblioteket - både stedet og app’en. Vi har lavet et par smårettelser i denne version af app’en, for at gøre oplevelsen bedre for dig."},{"version_id":"830041869","version_name":"2.3.3","version_date":"2019-02-01 08:44:02.000 +0800","version_description":"Vi har lavet de indledende armbøjninger til, at brugere på godt halvdelen af landets biblioteker om kort tid kan betale deres eventuelle mellemværender via Biblioteket-app’en - med lidt hjælp fra MobilePay ;-). Betalingsfunktionen vil blive slået til for de enkelte biblioteker løbende, efterhånden som de ønsker det."},{"version_id":"830546868","version_name":"2.4.0","version_date":"2019-03-13 13:04:40.000 +0800","version_description":"Nu kan du filtrere dine søgeresultater i Biblioteket app’en. Næste gang du vil finde noget at læse, høre eller se, kan du prøve at filtrere på materialernes sprog, læseniveau, årstal og meget mere. Du kan naturligvis også bare gøre præcis som du plejer. God fornøjelse!"},{"version_id":"830600432","version_name":"2.4.1","version_date":"2019-03-20 06:45:54.000 +0800","version_description":"Du kan nu filtrere dine søgeresultater i Biblioteket-app’en. Næste gang du kigger efter noget bestemt, vil søgefiltreringen forhåbentlig hjælpe dig hurtigere på sporet af det, du leder efter. Hvis du “bare” søger inspiration, kan du bl.a. finde masser af gode bøger i en kavalkade over “Læsernes bogpris”, som netop nu er ved at blive afgjort for 2019. Vi viser på forsiden af app’en de seneste 10 års nominerede bøger."},{"version_id":"830678435","version_name":"2.4.2","version_date":"2019-05-09 06:55:25.000 +0800","version_description":"I denne nye version af app’en har vi lavet nogle smårettelser.<br>Så er du godt klædt på til næste tur på biblioteket ;)<br><br>Hilsen fra teamet bag Biblioteket app’en."},{"version_id":"831329552","version_name":"2.4.3","version_date":"2019-05-21 12:20:43.000 +0800","version_description":"I denne opdatering har vi blot lavet nogle smårettelser. Fortsat god fornøjelse med app’en :)"},{"version_id":"831566725","version_name":"2.4.4","version_date":"2019-06-07 09:09:15.000 +0800","version_description":"Vi er glade for at du vil bruge Biblioteket - både stedet og app’en.<br>I denne opdatering har vi lavet nogle små rettelser.<br><br>Hilsen fra teamet bag Biblioteket app’en."},{"version_id":"833313631","version_name":"3.0.1","version_date":"2019-10-25 12:30:36.000 +0800","version_description":"Tak til alle jer, der har taget godt imod den nyeste version af Biblioteket-app’en.<br><br>Nogle brugere har desværre oplevet problemer, når de har forsøgt at se lån og reserveringer under “Min side”. Det er en central del af app’en og bør selvfølgelig virke. Vi håber derfor, at denne justerede version nu gør det muligt for alle at tilgå funktionerne på “Min side”.<br><br>Hilsen fra teamet bag Biblioteket-app’en"},{"version_id":"835806975","version_name":"3.1.3","version_date":"2020-05-05 11:26:30.000 +0800","version_description":"Hvis du, ligesom os, savner biblioteket i denne corona-tid, så er der lidt godt nyt i den nyeste opdatering af Biblioteket-appen. <br><br>Nu kan du forberede dig på gensynet med dit lokale bibliotek ved at huske de bøger, som du gerne vil låne, når bibliotekerne igen åbner. Vi har gjort det nemt for dig: Tryk bare på hjertet ved bogen og sæt den dermed på appens huskeliste, som også holdes synkroniseret med din huskeliste på dit biblioteks hjemmeside.<br><br>Med denne opdatering bliver det også let at finde ud af, hvilket nummer i serien en bog er, og du finder nemt resten af serien med den nye serievisning. <br><br>Under materialevisningen findes nu også mere information om bøgerne: udgave, genre, målgruppe, alder, omfang, ISBN, originaltitel og oplæser.<br><br>Rigtig god fornøjelse med Biblioteket-appen 3.1 <br>Hilsen fra teamet bag Biblioteket-appen"}]