[{"version_id":"543732862","version_name":"1.1","version_date":"2014-04-17 21:03:37.000 +0800","version_description":"Recently completed<br>- Description label in storage.<br>- Further balancing of the game.<br>- Extra planting fields.<br>- Some bug fixes.<br><br>We are working on the new client. Once it’s done, the performance would improve drastically and new updates will happen much faster."},{"version_id":"812013214","version_name":"2.1.1","version_date":"2015-05-10 11:29:27.000 +0800","version_description":"Here is a breakdown of all the new features: <br>- Marketplace - advertise your items and sell them directly to other players!! <br>- Mailbox - browse the high times newspaper and buy items from other players!! <br>- More machine products (Soup, Clothing sewery, Pie oven, Oil's) <br>- Decorations feature with over 14 different decoration items. <br>- Poppy the errand boy, have him gather all precious items for you. <br>- Video ticket, receive 3 free diamonds every day for watching short videos. <br>- Wheel of fortune redesign and extended prizes!! <br>- Diamond confirmation, have a confirmation appear every speedup.   <br>- A free mystery gift every day!! <br>- Connect with your friends and visit their farms!!! <br>- Improved the performance and fixed many memory leaks. <br>- Improved balancing and lots of polishing and bug fixing. <br>- To avoid hacking and exploits we also added a required network connection.   <br><br>Thanks for all your feedback and support."},{"version_id":"812429575","version_name":"2.4","version_date":"2015-09-28 07:56:51.000 +0800","version_description":"HOT UPDATE:<br>- New content (Decorations, growing fields, boat leaderboard and more!)<br>- Receive help from friends with boat orders.<br>- Diamond confirmation added for machine items.<br>- Increased stash storage.<br>- Non-FB users (Use social features without needing to connect to FB!)<br>- Bug fixes (Fixed space cake counter, data loss, performance and more!)<br>- Polishing (New loading screen, funny quotes, sounds and more!)"},{"version_id":"815973933","version_name":"3","version_date":"2016-01-28 21:00:48.000 +0800","version_description":"HOT UPDATE:<br>- Special discounts for use of poppy the errand boy!<br>- Weed pots with many different weed strains!<br>- Many new machine items<br>- A new machine! Produce powerful blunts!<br><br>Bug fixes and performance: <br>- Wheel of fortune issue fixed. <br>- Land expansion prices issue fixed.<br>- Reduced repair time for loom machine.<br>- Added new saving solution that prevents any data losses!<br>- And many bug and performance fixes."},{"version_id":"816889013","version_name":"5","version_date":"2016-04-08 08:20:52.000 +0800","version_description":"HOT UPDATE:<br>Introducing: The Gift Shop<br>* Receive gift cards from friends as a thanks for helping them out with their offers. <br>* Use these gift cards to purchase mystery packages that allow you to win exclusive decorations.<br><br>Community requested features<br>* User profile statistics.<br>* New achievements<br>* More land available.<br>* More storage upgrades.<br>* New languages: German, Russian, Turkish, Japanese, Chinese and Korean.<br>* Performance and stability improvements."},{"version_id":"817009073","version_name":"6","version_date":"2016-04-14 07:21:46.000 +0800","version_description":"HOT UPDATE: <br>- We made a fix to our grid objects."},{"version_id":"818773917","version_name":"6.4","version_date":"2016-09-10 10:08:03.000 +0800","version_description":"HOT update:<br>- Fixed saving issue<br>- Multiple bug fixes to friends list<br>- Increased storage upgrade<br>- Invite friends added<br>- Potted plant bugs fixed<br>- Fixed depth issues<br>- Notifications added<br>- Further balancing<br>- And overall performance improvement<br><br>Our next update will include new area's, crops, products and features. It will follow shortly."},{"version_id":"820150555","version_name":"7","version_date":"2016-12-15 17:30:19.000 +0800","version_description":"HOT UPDATE:<br>- Neighborhood feature (Chat and cooperate with friends)!<br>- New costumers!<br>- New growing fields!<br>- More crops, machine and products!<br>- Lots of polishing and optimizing!<br>- Improved balancing and bug fixing!"},{"version_id":"822339730","version_name":"8","version_date":"2017-08-10 11:57:12.000 +0800","version_description":"Exciting news! We have added a new feature “420 Rally”. One of the key features that allows to compete with other neighborhoods in real time.      <br><br>We have few more surprise for all of you; we have included a new machine and more growing fields. We are aware of some crop losses and minor bugs so to make your experience seamless lots of rework has been done and bugs have been fixed on our back-end to avoid such things from happening again."},{"version_id":"825843319","version_name":"9.5","version_date":"","version_description":""},{"version_id":"826928564","version_name":"11.5","version_date":"","version_description":""},{"version_id":"828452073","version_name":"11.6","version_date":"2018-09-06 08:15:17.000 +0800","version_description":"Yo Mon,<br><br>We are introducing new social feature called “Neighborhood Trade”. Now you can trade your items with your neighborhood members and for free. <br><br>Here is a overview of all the changes made: <br><br>1- A new feature for trading items with your neighborhood members. <br>2- A lot of fixes of user’s feedback<br><br>Now we got the fixes done we will focus on content expansion, so expect more to soon!<br><br>We want to thank you all for the wonderful feedback and support, as a token of our appreciation we give you 10 free diamonds.<br><br>Regards,<br>Team Ganja Farmer"},{"version_id":"828849095","version_name":"11.7","version_date":"2018-12-18 16:25:48.000 +0800","version_description":"Yo Mon,<br><br>We have incorporated many users feedbacks. Also for your stash limit issues we will introduce new feature named Ganja Town in next update.<br><br>Here is a overview of all the changes made: <br><br>1- Friends are now sorted according to their activity, means more active friends will appear first.<br>2- Special offers are re-activated<br>3- User feedback mechanism is improved<br><br>The next big feature called “GANJA TOWN” will come soon!<br><br>We want to thank you all for the wonderful feedback and support, as a token of our appreciation we give you 10 free diamonds.<br><br>Regards,<br>Team Ganja Farmer"},{"version_id":"830029755","version_name":"11.9","version_date":"2019-01-22 13:14:21.000 +0800","version_description":"Howdy Ganja Farmer,<br><br>We have fixed the Game Connection Issue. Our apology for the inconvenience you faced and we will work our socks off to make sure that these issues don’t happen again. <br><br>We want to thank you all for the wonderful feedback and support, as a token of our appreciation we give you 30 free diamonds.<br><br>Regards,<br>Team Ganja Farmer"},{"version_id":"832420234","version_name":"13.1","version_date":"","version_description":""},{"version_id":"832814210","version_name":"14","version_date":"","version_description":""},{"version_id":"833354696","version_name":"15","version_date":"2019-10-29 15:44:20.000 +0800","version_description":"HOT UPDATE:<br><br>- More machine upgrades<br>- Added new costumers to the town<br>- Added Zoo Teaser<br>- Activated decorations inside the the town. <br>- Polished the Town environment and added obstacles. <br>- Fixed a couple bugs and performance issues"},{"version_id":"836608207","version_name":"16","version_date":"2020-07-10 16:25:01.000 +0800","version_description":"HOT UPDATE:<br>- Activated the Zoo Sanctuary. WOOHOO!<br>- Activated decorations for the Town<br>- Earn more rewards from Boat Shipments<br>- Fixed many derby issues, such as helping neighbours, task cancel issues<br>- Improved the Neighbour feature, by fixing leader issues and requesting items<br>- Mystery Box expansion (Receive more rare mystery boxes)<br>- Reggae Shark (Check out the town lake)<br>- Increased the limit size for crops inside theNeighborhood Donation building.<br>- Fixed many user reported issues inside the town and farm area.<br>- And many more polishing and stability improvements."},{"version_id":"838295842","version_name":"17","version_date":"2020-10-29 07:37:50.000 +0800","version_description":"- New crops (Purple Princess, Betsey, Power Train, Big Buddha and Stanky leg)<br>- New achievements<br>- Lots of fixes to farm, town and performance.<br><br>We appreciate all the support and feedback, this allows us to continue improving the game.<br>Bless,<br>Team Ganja Farmer"},{"version_id":"840558960","version_name":"20","version_date":"","version_description":""}]