[{"version_id":"818585348","version_name":"3.0.0","version_date":"2016-09-09 23:00:55.000 +0800","version_description":"All new app experience by celebrity golf instructor Jim McLean!<br>New FREE Lesson.<br>Our algorithms have been adapted comparing your swing to the Jim McLean teaching system. <br>New Golf Courses module with GPS, ratings and reviews. <br>New subscription model to make learning easy and consistent. <br>Enjoy!"},{"version_id":"818936445","version_name":"3.1.0","version_date":"2016-10-05 13:09:33.000 +0800","version_description":"Many new fixes since our launch! <br>Videos will upload faster and your first free lesson now has better video detection features. <br>The golf courses module has quicker GPS features and ratings has been fixed. <br>We'll keep working hard to make this app better every day!"},{"version_id":"819441920","version_name":"3.2.0","version_date":"2016-10-28 18:26:16.000 +0800","version_description":"FINALLY the front-facing-camera feature is now available!!!  Go ahead and film yourself! <br>We also fixed a bug that was closing the app when saving a recorded video on the iPhone6Pus and 7Plus. <br>Videos will now upload even faster and your first free lesson has better video detection features. <br>We'll keep working hard to make this app better every day!  <br>Remember your feedback is always welcomed!"},{"version_id":"819616597","version_name":"3.3.0","version_date":"2016-11-21 19:22:23.000 +0800","version_description":"Thanks to all our golfing friends our social network keeps growing and thousands of swings are getting boosted! <br>The long awaited front-facing-camera feature is a success!!!  Go ahead and film yourself! <br>A new super cool registration screen has been added. <br>More recording options for our subscription customers. <br><br>We also fixed a bug that was closing the app when saving a recorded video on the iPhone6Pus and 7Plus. <br>Videos will now upload even faster and your first free lesson has even better video detection features. <br><br>We'll always keep working hard to make this app better every day!  <br>Remember your feedback is always welcomed!"},{"version_id":"822805031","version_name":"5.0.0","version_date":"2017-07-26 14:52:20.000 +0800","version_description":"Thanks for boosting your swing with us! <br>We're always working hard to make your app experience better! <br><br>This update includes a a consistent and more modern look &amp; feel.  White backgrounds without cluttered images making the app run even faster. <br>We also kept the new lesson buying circuit offering a free swing analysis.<br><br>Thanks to all the loyal users who keep boosting their swings anywhere!"}]