[{"version_id":"832046702","version_name":"1.0.3936","version_date":"2019-07-19 12:14:09.000 +0800","version_description":"It’s a whole NEW FarmVille with a barn load of NEW features!"},{"version_id":"833128435","version_name":"1.1.5571","version_date":"2019-10-14 09:24:42.000 +0800","version_description":"It’s a whole NEW FarmVille with a barn load of features!\n<br>\n<br>Our new version, fresh from the farm includes:\n<br>MORE DECORATIONS - So you can give your farm that cozy feeling!\n<br>BUILDING SKINS - To make your farm look like home!\n<br>IMPROVED GRAPHICS - The cutest animals you’ve ever seen just got cuter!\n<br>EARLY GAME IMPROVEMENTS - To be the most welcoming version of FarmVille yet!"},{"version_id":"833766210","version_name":"1.1.6778","version_date":"2019-11-27 13:21:42.000 +0800","version_description":"Howdy, Farmers! We've got another farm fresh update, just for you!\n<br>\n<br>We've made some improvements around these parts, and now FarmVille is better than ever!\n<br>\n<br>And those animals? Well, they're still cute as a button!"},{"version_id":"837231924","version_name":"1.4.12041","version_date":"2020-09-21 11:29:52.000 +0800","version_description":"We hope you’re having fun playing FarmVille 3!<br><br>What's New:<br>Various fixes and improvements<br><br>STORAGE<br>The Barn is easier to upgrade, add extra space for your farm goods!<br>VISITORS<br>Fullfil their requests for extra rewards!<br>FISHING<br>New visuals that'll hook you!<br>ACHIEVEMENTS<br>More trophies to unlock!<br><br>Coming back after a break?<br>Log in your account right from the start of the tutorial!<br><br>Have fun!"},{"version_id":"838434728","version_name":"1.5.12974","version_date":"2020-11-05 09:14:34.000 +0800","version_description":"We listened attentively to your feedback and cooked up a new update for you to enjoy! Let us know what you think about the new update!<br><br>FARMHANDS ENERGY<br>• No more tools! Farmhands now use energy. Energy regenerates over time and when you level up.<br>• Clearing rubbles is almost instant and can be queued infinitely.<br>• New items acquired from rubble can now be used in a new factory, the Tinker Station!<br><br>EXOTIC ANIMALS<br>• Koalas and Elephants are now in the game!<br>• Exotic Animals now require homes just like normal animals<br>• You no longer need to collect stickers to obtain Exotic Animals<br><br>COUNTY FAIR<br>• Rank up the leaderboard and compete against other players in the fan-favorite County Fair!<br>• You earn score points by producing and crafting items on your farm<br>• The highest ranking players at the end of County Fair receive special rewards<br>• The County Fair can be found close to the Town Hall on the map"},{"version_id":"842893084","version_name":"1.9.17328","version_date":"2021-07-01 11:21:47.000 +0800","version_description":"Welcome to FarmVille 3, where the animals are cuddly and the farmhands jolly!\n<br>\n<br>GENERAL\n<br>- New crafting factories, farmhands and items, for all your crafty needs!\n<br>- New events, to keep you entertained\n<br>- New rewards, for unlocking new breeds of animals\n<br>\n<br>EXOTIC ANIMALS\n<br>- New Saga map\n<br>- New training and selection screen\n<br>- New rewards"},{"version_id":"843166434","version_name":"1.10.17844","version_date":"2021-07-28 11:41:39.000 +0800","version_description":"Welcome to FarmVille 3! Here comes a newly, freshly baked update!<br><br>GENERAL<br>- New Museum Events themes<br>- New Sky Race Seasons and Rewards<br>- Improvements to Exotic Animals<br>- Changes to the County Fair leaderboard<br><br>Have fun!"},{"version_id":"844339894","version_name":"1.11.19346","version_date":"2021-09-29 10:42:58.000 +0800","version_description":"Welcome to the world of FarmVille 3, where the grass is green and the cows are cuddly!<br><br>In this update: <br>- New visitors heard from the delicious pies from your farm and come all the way from the city to taste them!<br>- Sam brings his Food Truck venture to your popular farm to delight visitors with exotic recipes.<br>- Country camping! A monthly event to unlock unique skins and seasonal costumes for your favorite farmhands to dress up!<br>- Additional tuning and improvements.<br><br>Have fun!"},{"version_id":"844995831","version_name":"1.12.20046","version_date":"2021-11-02 07:00:00.000 +0800","version_description":"Hello everyone and thank you for your interest in FarmVille 3.<br><br>In this update:<br>- Players can now ask for help filling Orders from the Order Board <br>- The County Fair now offers additional rewards such as temporary boosts to your Barn &amp; Silo space<br><br>FarmVille 3 will be available to download globally on November 4th<br>Play the game between Nov 4th and Nov. 18th to earn unique decorations for your farm<br><br>Marie and her crew of friendly Farmhands will be here to welcome you with open arms!"}]