[{"version_id":"827911331","version_name":"1.7.2","version_date":"","version_description":""},{"version_id":"828347509","version_name":"2.0.0","version_date":"2018-08-27 07:59:27.000 +0800","version_description":"1.New mode<br>   Open the Rank Battle, match by rank<br>   No more merit in the Random Battle<br>   Cancel the Train Battle<br>2.Battle system<br>   Increased preview and shot display for submarine torpedo<br>   Optimization of ship's turret firing range and torpedo shooting range<br>   The endurance loss rate of submarine after oxygen depletion is reduced by half<br>3.Warships and research<br>   research interface can preview exclusive painting<br>4.Supply Crates adjustment<br>5.Add New coating product in shop<br>6.Japanese language support<br>7.Other<br>   Items get prompts interface to increase tips display function.<br>   Fix problems that can't be shared.<br>   Fix time zone problem"},{"version_id":"830042969","version_name":"2.2.0","version_date":"2019-01-25 07:01:00.000 +0800","version_description":"2.2 version update content:<br>1 Combat optimization<br>◆ Redo battle income calculation (including silver coins, battleship experience, sailor experience, sailor proficiency), the battle income is more stable.<br>◆ Combat bonus increases combat medal, used to open the battle supply box.<br>2 Adjust the battle supply crate<br>◆ Open conditions changed to collect battle medals.<br>◆ Three kinds of combat supply crates are changed into one type, and 3 can be obtained every day.<br>◆ Significantly increase the output of the battle supply crate, including silver coins, gold coins, accessories, sailors, sailors guide.<br>3 Heavy crate increases the guarantee mechanism, up to 10 times must get Lv5 Equipments.<br>4 Sailors adjustment<br>◆ Adjust sailor recruitment<br>&nbsp;&nbsp; Normal Voucher is changed to Primary Voucher, you can get one B sailor, the price is changed to 40,000 silver.<br>&nbsp;&nbsp; Normal 5times Voucher is changed to Intermediate Voucher, and one B-A sailor can be obtained. The price is changed to 20 gold.<br>&nbsp;&nbsp; Normal Voucher is changed to Advanced Voucher, and 2 A-S sailors can be obtained at the same price.<br>&nbsp;&nbsp; Normal 5times Voucher is changed to Super Voucher, you can get 2 S-SS sailors, the price is changed to 2000 points.<br>◆ Simplify the sailor skill reset interface, and reset does not change the skill quality.<br>◆ The maximum number of sailors increased to 100<br>◆ Sailor guide price reduced by 50%<br>5 Adjust the rank upgrade award.<br>6 Adjust the novice seven days reward.<br>7 Adjust the commander upgrade reward, level 4 reward lv3 battleship [Michigan].<br>8 replace the new port.<br>9 fix the bug of sound loss."},{"version_id":"831041101","version_name":"2.4.0","version_date":"2019-04-22 07:08:37.000 +0800","version_description":"1. New Port Effect.<br>2. Reward of Rank Battle increased by 30%, and silver reward of expedition decreased by 50%.<br>3. All premium warships can be purchased from Tech Tree.<br>4. Adjust packages, warships, camouflages, sailors and equipments in malls.<br>5. New Camouflage: Space battleship · Montana, Glory · Shimakaze.<br>6. Adjust the attributes of some equipments.<br>7. Replace Loading pictures.<br>8. Fix known bugs."},{"version_id":"831621642","version_name":"2.4.2","version_date":"2019-06-12 01:26:53.000 +0800","version_description":"fix bugs"},{"version_id":"833897799","version_name":"2.5.0","version_date":"2019-12-09 08:31:30.000 +0800","version_description":"1. Optimization of projectile jumping mechanism\n<br>2. Refresh mechanism for use of commercial city sailors and accessories\n<br>3. Festival port\n<br>4. H41 and Raytheon new space warship coating\n<br>5. The new open N3 plan of science and technology tree, Xuefeng, enterprise, Phoenix, avant-garde, Richelieu, Stalin, Veneto and other gold warships, and the mall also has corresponding warship gift package\n<br>6. Add Korean language"},{"version_id":"840156228","version_name":"2.6.4","version_date":"2021-01-28 02:09:19.000 +0800","version_description":"1. Balance adjustment:<br>The speed of all warships has been reduced by 10%, and the speed of all shells and torpedoes has been reduced by 10%.<br>The rotation speed of the main turrets of the battleship was greatly accelerated.<br>Slightly increased the endurance and weapon damage of Premium ships. Now they will be 110% as much as standard ships.<br>2. Improve the display of ship status, now it can display various attributes more accurately.<br>3. At the end of the 17 rank battle season, merit will be reset to 400.<br>4. Improve the description of the Sailor system."},{"version_id":"840259102","version_name":"2.6.5","version_date":"2021-02-02 09:02:51.000 +0800","version_description":"1. Balance adjustment:\n<br>The speed of all warships has been reduced by 10%, and the speed of all shells and torpedoes has been reduced by 10%.\n<br>The rotation speed of the main turrets of the battleship was greatly accelerated.\n<br>Slightly increased the endurance and weapon damage of Premium ships. Now they will be 110% as much as standard ships.\n<br>2. Improve the display of ship status, now it can display various attributes more accurately.\n<br>3. At the end of the 17 rank battle season, merit will be reset to 400.\n<br>4. Improve the description of the Sailor system."},{"version_id":"842676778","version_name":"3.3.1","version_date":"2021-06-17 01:31:26.000 +0800","version_description":"fix bugs"}]