[{"version_id":"814825903","version_name":"2.3","version_date":"2015-12-20 04:12:03.000 +0800","version_description":"En esta nueva versión se ha incluido información sobre los precios diarios para Precio Voluntario para el Pequeño Consumidor, así como los gráficos con la evolución de consumo de los contratos de electricidad"},{"version_id":"816784907","version_name":"2.4","version_date":"2016-04-08 06:42:52.000 +0800","version_description":"Esta nueva versión incorpora novedades en el acceso al área privada que facilitan la conexión/desconexión; así mismo, se ha mejorado la gestión y visualización de gráficos de facturación y consumos."},{"version_id":"818222921","version_name":"3.0","version_date":"2016-08-08 05:15:17.000 +0800","version_description":"En esta nueva versión se ha incluido el servicio de control y programación del sistema de calefacción a través del termostato inteligente de Iberdrola. Ahora, fácilmente desde la app, es posible programar la temperatura del termostato, consultar los históricos de consumo de la caldera o personalizar las temperaturas y los programas semanales de la calefacción."},{"version_id":"821066137","version_name":"3.1","version_date":"2017-02-27 08:41:09.000 +0800","version_description":"Corrección de errores y mejoras de rendimiento."},{"version_id":"826018392","version_name":"4.0.0","version_date":"2018-02-20 09:35:21.000 +0800","version_description":"•         Con esta actualización podrás gestionar tus contratos de Iberdrola Clientes, S.A.U. Si tienes un contrato con una comercializadora de Mercado Regulado te recomendamos acceder a través del área privada de su página web; y si, en concreto, eres cliente de Iberdrola Comercializadora de Referencia podrás hacerlo a través de esta URL: https://www.iberdrola.es/webclifr/#/login<br>•         Esta versión trae un diseño innovador y nuevas funcionalidades. ¡Actualízatela y descúbrelo cuanto antes!"},{"version_id":"826055775","version_name":"4.0.1","version_date":"2018-02-22 11:04:23.000 +0800","version_description":"•         Con esta actualización podrás gestionar tus contratos de Iberdrola Clientes, S.A.U. Si tienes un contrato con una comercializadora de Mercado Regulado te recomendamos acceder a través del área privada de su página web; y si, en concreto, eres cliente de Iberdrola Comercializadora de Referencia podrás hacerlo a través de esta URL: https://www.iberdrola.es/webclifr/#/login<br>•         Esta versión trae un diseño innovador y nuevas funcionalidades. ¡Actualízatela y descúbrelo cuanto antes!"},{"version_id":"826271858","version_name":"4.1.0","version_date":"2018-03-14 07:12:43.000 +0800","version_description":"•Ya puedes colaborar con Juntos contra el Cáncer desde la app.<br>•Activa las notificaciones para saber cuándo tienes una nueva factura disponible.<br>•Nuevo gráfico histórico de Termostato Inteligente.<br>•Pequeñas mejoras de rendimiento."},{"version_id":"826680441","version_name":"4.2.0","version_date":"2018-04-14 01:26:37.000 +0800","version_description":"•         Ahora es posible cambiar de plan desde la app.<br>•         Incluimos mejoras de rendimiento."},{"version_id":"826754170","version_name":"4.3.0","version_date":"2018-04-20 14:34:39.000 +0800","version_description":"•En esta actualización incluimos mejoras de rendimiento que nos habéis ido trasladando en vuestros mensajes, muchas gracias!"},{"version_id":"827299506","version_name":"4.4.0","version_date":"2018-05-27 21:29:17.000 +0800","version_description":"En esta versión incluimos lo necesario para que puedas ejercer tus derechos definidos en la nueva Ley de Protección de Datos y además, hemos aprovechado para mejorar la funcionalidad de Facturas haciendo más fácil el acceso al detalle."},{"version_id":"827990955","version_name":"4.5.0","version_date":"2018-07-26 06:25:19.000 +0800","version_description":"Esta actualización incluye como nueva funcionalidad la compra de Paquetes de Energía de 6, 12 o 24 meses para los clientes que tengan contratado Energy Wallet. Y dentro de nuestro proceso de optimización continua hemos incluido también algunas mejoras en usabilidad.<br> <br>Si te gusta la app, nos encantaría recibir tu valoración!"},{"version_id":"828568955","version_name":"4.6.0","version_date":"2018-10-08 07:38:44.000 +0800","version_description":"Estamos constantemente optimizando la experiencia y añadiendo mejoras en la aplicación gracias a vuestros comentarios. ¡Descárgate la última versión!"},{"version_id":"829064484","version_name":"4.6.1","version_date":"2018-10-29 11:47:46.000 +0800","version_description":"Estamos mejorando constantemente nuestra app para poder ofrecerte el mejor servicio. En esta actualización incluimos mejoras de estabilidad y rendimiento."},{"version_id":"829644594","version_name":"4.6.2","version_date":"2018-12-18 09:20:03.000 +0800","version_description":"Seguimos incluyendo mejoras de estabilidad y pequeñas correcciones que nos ayudan a ofreceros un mejor servicio."},{"version_id":"830711136","version_name":"4.6.3","version_date":"2019-03-25 08:30:20.000 +0800","version_description":"Seguimos incluyendo pequeñas correcciones que nos ayudan a ofreceros un mejor servicio. Actualizamos además nuestro catálogo de productos."},{"version_id":"830766994","version_name":"4.6.4","version_date":"2019-03-28 16:33:39.000 +0800","version_description":"Seguimos incluyendo mejoras de estabilidad y pequeñas correcciones que nos ayudan a ofreceros un mejor servicio."},{"version_id":"831482677","version_name":"5.0.0","version_date":"2019-06-10 06:38:18.000 +0800","version_description":"Conoce la nueva app de Iberdrola, en esta versión ofrecemos un cambio a nivel visual y de navegación, para que sea más sencilla e intuitiva y tengáis la mejor experiencia de usuario. ¡Esperemos que os guste!"},{"version_id":"832162216","version_name":"5.1.1","version_date":"2019-07-29 11:30:01.000 +0800","version_description":"En esta versión incluimos nuevas funcionalidades y pequeñas correcciones que nos ayudan a ofreceros un mejor servicio."},{"version_id":"833178765","version_name":"5.2.1","version_date":"2019-10-16 10:29:58.000 +0800","version_description":"En esta versión incluimos nuevas funcionalidades y pequeñas correcciones que nos ayudan a ofreceros un mejor servicio."},{"version_id":"833460522","version_name":"5.2.2","version_date":"2019-11-06 10:18:57.000 +0800","version_description":"En esta nueva versión hemos incluido el pago con Bizum para facilitarte la gestión de tus gastos de manera rápida y sencilla. Asimismo, hemos corregido unos errores que os estaban dando a algunos usuarios al acceder a la App."},{"version_id":"833866286","version_name":"5.3.0","version_date":"2019-12-05 12:16:30.000 +0800","version_description":"Con esta nueva versión podrás controlar tu punto de recarga doméstico de Wallbox y olvidarte si tienes o no cobertura. Además hemos implementado mejoras para que tengas una buena experiencia. Seguimos mejorando al app con vuestro comentarios, no dudes en escribirnos."},{"version_id":"834043338","version_name":"5.4.0","version_date":"2019-12-18 14:23:09.000 +0800","version_description":"Ahora si tienes un servicio con nosotros que te cubre las averías de los electrodomésticos, podrás avisarnos desde la App, y hacer seguimiento. Además de mejoras para que tengas una buena experiencia. Tus comentarios son muy importantes para nosotros, no dudes en escribirnos."},{"version_id":"834841860","version_name":"5.4.1","version_date":"2020-02-26 11:21:33.000 +0800","version_description":"Disfruta ahora de las siguientes mejoras que podrás encontrar en esta nueva versión:<br>•Nuevo diseño de termostato para que lo uses con mayor facilidad. <br>•Mejora en la visualización de tus consumos. <br><br>Seguimos trabajando para mejorar tu experiencia."},{"version_id":"835362015","version_name":"5.4.3","version_date":"2020-04-02 07:23:58.000 +0800","version_description":"Con el objetivo de que podáis seguir realizando todas vuestras gestiones con la mayor normalidad posible durante el estado de alarma, hemos llevado a cabo unas mejoras que te facilitarán la experiencia con nuestra App."},{"version_id":"835573143","version_name":"5.4.4","version_date":"2020-04-17 09:30:04.000 +0800","version_description":"Seguimos incorporando mejoras en la App ante las restricciones establecidas por el COVID19, para que podáis realizar todas vuestras gestiones con la mayor normalidad posible."},{"version_id":"835904653","version_name":"5.5.0","version_date":"2020-05-12 06:01:53.000 +0800","version_description":"Disfruta ahora de mejoras y nuevas funcionalidades que podrás encontrar en esta versión como. <br>- Contratar ahora nuestro Asistente Smart para conocer mejor cómo consumes tu energía, y si además ya los tiene, descubre las nuevas funcionalidades. <br>- Ya puedes consultar tus notificaciones cuando quieras con un nuevo buzón dónde se almacenarán todas las que te lleguen. <br>Seguimos trabajando para mejorar tu experiencia."},{"version_id":"836237064","version_name":"5.6.0","version_date":"2020-06-03 09:02:41.000 +0800","version_description":"En esta nueva versión podrás disfrutar de las siguientes mejoras:<br>- Precios más económicos y estables durante los próximos 5 años con los nuevos Planes Online.<br>- Conoce mejor cómo consumes tu energía contratando ahora desde tu app el Asistente Smart.<br>- Contrata desde la app el Pack Mantenimiento Gas y disfruta de la tranquilidad de una instalación más segura y eficiente.<br>Tenemos en cuenta tu opinión, no dudes en dejarnos tu comentario."},{"version_id":"836598635","version_name":"5.7.0","version_date":"2020-06-30 07:39:53.000 +0800","version_description":"Disfruta ahora de las siguientes novedades que podrás encontrar en esta nueva versión:<br>- Actualización de las mejoras aplicadas durante el periodo COVID tras el fin del estado de alarma. <br>- Si ya has contratado nuestro servicio de Asistente Smart, a partir de ahora empezarás a recibir notificaciones personalizadas con recomendaciones de compra y de ahorro. <br>- Haz un seguimiento dentro de la nueva sección de Informes, de las recargas que has realizado con tu Punto de Recarga de Wallbox que tengas configurado.<br>Seguimos trabajando para que disfrutes de nuestra App con la mejor experiencia."},{"version_id":"836917792","version_name":"5.7.1","version_date":"2020-07-20 16:49:50.000 +0800","version_description":"Queremos seguir mejorando vuestra experiencia con nosotros, por eso en esta nueva publicación hemos realizados algunas correcciones que nos ayudan a ofreceros una mejor experiencia con la app."},{"version_id":"837064536","version_name":"5.8.0","version_date":"2020-07-30 16:55:52.000 +0800","version_description":"¡Volvemos con novedades!<br>- Ya podrás realizar la lectura de tu contador de gas de forma rápida y fácil.<br>- Hemos simplificado el proceso de registro para que te sea más sencillo empezar a disfrutar de nuestra App. <br>- Y si ya tienes tu solución de Smart Solar, a partir de ahora podrás ver el ahorro que están generando tus paneles solares. <br>Seguimos trabajando para que disfrutes de nuestra App"},{"version_id":"838210939","version_name":"5.9.1","version_date":"2020-10-14 14:42:33.000 +0800","version_description":"Con esta versión te facilitamos el acceso para realizar el seguimiento de tus reclamaciones. Además si tienes tu solución de Smart Solar podrás conocer el ahorro por impuestos. Seguimos trabajando para darte la mejor experiencia."},{"version_id":"839765431","version_name":"5.11.0","version_date":"2020-12-29 14:35:02.000 +0800","version_description":"Disfruta ahora de novedades como las siguientes que podrás encontrar en esta última versión del año:<br>- Máxima comodidad al hacer ahora tus pagos de la factura, podrás pagar varias facturas a la vez y además, si tienes alguna tarjeta guardada, podrás eliminarla e incluir una nueva.<br>- Si tienes un Monitor de consumo de Mirubee, ahora podrás ver la desagregación por electrodomésticos así como un histórico de consumo desde nuestra App.<br>Seguimos trabajando para que tu experiencia sea la mejor."}]