[{"version_id":"828953234","version_name":"3.4.2","version_date":"2019-03-13 07:00:31.000 +0800","version_description":"Hijack a hot new McLaren P1 GTR straight from police lockup in an all new pursuit-focused challenge event: Blackridge Breakout! Grab this action-packed update, that lets you:\n\n•Take on ‘Lockdown’ pursuit challenges in the new Breakout event\n•Earn the Porsche 911 GT2 RS in a brand-new Proving Grounds challenge\n•Push back against the Blackridge PD with a boost to cop takedowns\n\nPlus, tackle new events in the ever-expanding flashback list and watch for unique in-game content in the Messaging Inbox.\n\nDo you have what it takes to rule the streets? Prove it!"},{"version_id":"828953234","version_name":"3.3.1","version_date":"2019-01-30 06:59:33.000 +0800","version_description":"Lunar New Year has arrived in Blackridge, with the McLaren 600LT and the Jaguar XJ220 ringing in the festivities. Take on this action-packed update where you can:\n\n•Jump behind the wheel of the McLaren 600LT on the path to enlightenment in an all-new special event, Road to the West \n•Earn the Jaguar XJ220 in an all-new Proving Grounds challenge \n•Head over to the Mod Shop and check out what items are available for purchase, including brand-new wraps\n\nPlus, tackle new events in the ever-expanding flashback list and watch for unique in-game content in the Inbox.\n\nDo you have what it takes to rule the streets? Prove it!"},{"version_id":"828953234","version_name":"3.1.2","version_date":"2018-10-24 07:02:07.000 +0800","version_description":"For the first time in Need For Speed No Limits history, we bring you a truly integrated Halloween horrerfest as Blackridge gets a ghostly makeover in our spookiest update ever! Also in this hauntingly good update:\n\n•Michael Speedway is back in Blackridge to film his new horror-filled action movie. Solve a mystery in the fully spookified Erwick County track and earn the McLaren 720S in the all-new Frights, Camera, Traction special event\n•Underground Rivals continues with a new reward for the red-hot Rival-Tier racers: custom License Plates. Show off your success to the world!\n•Earn the powerful Ferrari 812 Superfast in an all new Proving Grounds challenge\n\nPlus, watch for unique in-game content in the Inbox and a few more spooky surprises.\n\nDo you have what it takes to rule the streets? Prove it!"},{"version_id":"829470531","version_name":"3.2.2","version_date":"2018-12-12 07:01:37.000 +0800","version_description":"A blast from Rockport's past comes to Blackridge: the BMW M3 GTR. Experience this action-packed update where you can:\n\n•Turn back time, climb Blackridge's very own Blacklist and experience the rebirth of the iconic M3 GTR in an all-new special event\n•Rise to fame and win a Ferrari FXX-K Evo in the glamorous High Stakes Invitational\n•Proving Grounds presents the new top-tier car: a Koenigsegg Agera RS\n\nPlus, watch for unique in-game content in the Inbox.\n\nDo you have what it takes to rule the streets? Prove it!"},{"version_id":"829834971","version_name":"3.2.3","version_date":"2019-01-09 07:02:02.000 +0800","version_description":"A blast from Rockport's past comes to Blackridge: the BMW M3 GTR. Experience this action-packed update where you can:\n\n•Turn back time, climb Blackridge's very own Blacklist and experience the rebirth of the iconic M3 GTR in an all-new special event\n•Rise to fame and win a Ferrari FXX-K Evo in the glamorous High Stakes Invitational\n•Proving Grounds presents the new top-tier car: a Koenigsegg Agera RS\n\nPlus, watch for unique in-game content in the Inbox.\n\nDo you have what it takes to rule the streets? Prove it!"},{"version_id":"829996575","version_name":"3.3.1","version_date":"2019-01-30 06:59:33.000 +0800","version_description":"Lunar New Year has arrived in Blackridge, with the McLaren 600LT and the Jaguar XJ220 ringing in the festivities. Take on this action-packed update where you can:\n\n•Jump behind the wheel of the McLaren 600LT on the path to enlightenment in an all-new special event, Road to the West \n•Earn the Jaguar XJ220 in an all-new Proving Grounds challenge \n•Head over to the Mod Shop and check out what items are available for purchase, including brand-new wraps\n\nPlus, tackle new events in the ever-expanding flashback list and watch for unique in-game content in the Inbox.\n\nDo you have what it takes to rule the streets? Prove it!"},{"version_id":"830508723","version_name":"3.4.2","version_date":"2019-03-13 07:00:31.000 +0800","version_description":"Hijack a hot new McLaren P1 GTR straight from police lockup in an all new pursuit-focused challenge event: Blackridge Breakout! Grab this action-packed update, that lets you:\n\n•Take on ‘Lockdown’ pursuit challenges in the new Breakout event\n•Earn the Porsche 911 GT2 RS in a brand-new Proving Grounds challenge\n•Push back against the Blackridge PD with a boost to cop takedowns\n\nPlus, tackle new events in the ever-expanding flashback list and watch for unique in-game content in the Messaging Inbox.\n\nDo you have what it takes to rule the streets? Prove it!"},{"version_id":"831916832","version_name":"3.7.2","version_date":"2019-07-10 07:09:16.000 +0800","version_description":"Two red hot Ferraris blaze into Blackridge with the 488 Pista and F355 Berlinetta! Dominate the competition in this incredible update where you can:\r\n•Be the last driver standing in a survival-of-the-fastest elimination tournament with the intense Blackridge Royale special event\r\n•Earn the Ferrari F355 Berlinetta in an all new Proving Grounds challenge\r\n•Rule the streets and earn fresh license plates in two brand-new airport-focused Underground Rivals events - Jetstream and Red Eye\r\nPlus, tackle more events in the ever-expanding flashback list and watch for exclusive in-game content in the Inbox.\r\nDo you have what it takes to rule the streets? Prove it!"},{"version_id":"832298778","version_name":"3.8.2","version_date":"2019-08-15 07:00:17.000 +0800","version_description":"Celebrate 25 years of the Need for Speed franchise with a Speedhunters takeover of Novato Coast and Blackridge Mountain. Look back at the classic series and forge ahead into the future of dominating the street in this update where you can:\r\n•Take No Limits' first Bugatti on a journey through Need for Speed's greatest hits in the Need For Speed 25th Anniversary Special Event\r\n•Earn the BMW 3.0 CSL Hommage R in a brand-new Breakout event\r\n•Urban Legend joins the NFSNL Flashback list. Rise to first on the Blacklist and claim your own BMW M3 GTR\r\nPlus, watch for some big announcements, more special surprises and in-game content in the Inbox.\r\nDo you have what it takes to rule the streets? Prove it!"},{"version_id":"832797932","version_name":"3.9.2","version_date":"2019-09-25 07:01:15.000 +0800","version_description":"Challenge authority with brute force as you race to rule the streets against the escalating threat of aggressive Blackridge cops! Jump in the all-new 2018 Bentley Continental GT to earn the car and your stripes in an all-new limited-time series, as well as:\r\n•Earn the Ferrari F50 in an all new Proving Grounds challenge\r\n•Take on the added events in the ever-expanding flashback list\r\nPlus, watch for some big announcements, more special surprises and in-game content in the Inbox.\r\nDo you have what it takes to rule the streets? Prove it!"},{"version_id":"833369920","version_name":"4.0.2","version_date":"2019-11-06 07:10:56.000 +0800","version_description":"Need for Speed No Limits and NFS Heat collide in this exciting prequel! Take the sleek 2020 Volvo Polestar 1 to the streets of Blackridge and go head-to-head against Joe from NFS Heat on his journey to Palm City in an all-new limited-time series, as well as:\r\n•Earn the Porsche Carrera GT in a brand new Breakout event!\r\n•Take on the added events in the ever-expanding flashback list\r\nPlus, watch for a behind the scenes look at the mobile and HD collaboration, more special surprises and in-game content in the Inbox.\r\nDo you have what it takes to rule the streets? Prove it!"},{"version_id":"833875189","version_name":"4.1.2","version_date":"2019-12-10 07:03:11.000 +0800","version_description":"‘Tis the season to hit the streets and show the competition what you got! Kick off the holidays with a bang as winter hits the Blackridge Airport. Take on the latest Breakout event in this festive holiday update, where you can:\r\n\r\n•Race through a winter wonderland for your chance to bring the sleek Lamborghini Huracan Evo to your garage\r\n•Earn impressive 2016 Aston Martin Vulcan as the iconic manufacturer makes its Need for Speed No Limits debut in the Speedbreakers limited-time series\r\n•Check out the new Chapter Overview as you race through Blackridge\r\n•Discover a new Proving Grounds with the Mitsubishi Lancer Evo X \r\n•Take on new events added to the ever-expanding flashback list\r\n\r\nPlus, watch for more special surprises and in-game content in the Inbox.\r\n\r\nDo you have what it takes to rule the streets? Prove it!"},{"version_id":"833973833","version_name":"4.1.3","version_date":"2019-12-31 07:03:34.000 +0800","version_description":"‘Tis the season to hit the streets and show the competition what you got! Kick off the holidays with a bang as winter hits the Blackridge Airport. Take on the latest Breakout event in this festive holiday update, where you can:\r\n\r\n•Race through a winter wonderland for your chance to bring the sleek Lamborghini Huracan Evo to your garage\r\n•Earn impressive 2016 Aston Martin Vulcan as the iconic manufacturer makes its Need for Speed No Limits debut in the Speedbreakers limited-time series\r\n•Check out the new Chapter Overview as you race through Blackridge\r\n•Discover a new Proving Grounds with the Mitsubishi Lancer Evo X \r\n•Take on new events added to the ever-expanding flashback list\r\n\r\nPlus, watch for more special surprises and in-game content in the Inbox.\r\n\r\nDo you have what it takes to rule the streets? Prove it!"},{"version_id":"834335612","version_name":"4.2.3","version_date":"2020-01-21 07:01:42.000 +0800","version_description":"Celebrate Lunar New Year with Krewella – the first female-fronted  music group to collaborate with NFSNL – during our signature Need for Speed No Limits LNY event. We are also debuting two new Aston Martins in this incredible update where you can:\r\n\r\n•Win Nissan GT-R R35 Blueprints and two all-new exclusive wraps through Krewella's limited-time daily mission, only available in this update\r\n•Take on a dangerous mission through the underbelly of Zenith Corp to earn an Aston Martin DB11\r\n•The Aston Martin One-77 is yours if you win in an all-new Proving Grounds challenge\r\n•Our signature Lunar New Year event – Road to the West – joins the suite of Special Event Flashbacks for No Limits' Chinese New Year festivities\r\n\r\nPlus, Krewella has taken over our in-game soundtrack! Be sure to watch for behind the scenes looks at our Krewella collaboration as well as how you can enter to win exclusive merch in the Inbox.\r\n\r\nDo you have what it takes to rule the streets? Prove it!"},{"version_id":"834899205","version_name":"4.3.4","version_date":"2020-03-10 07:04:44.000 +0800","version_description":"A mysterious new crew, the Bloodfangs, have emerged from the shadows to challenge the racers of Blackridge as we debut an all-new chapter to the NFS No Limits Campaign! Plus, the brand-new 2020 Shelby GT500 rolls into Blackridge and the furiously fast Honda S2000 tear onto the roads in this awesome update where:\r\n\r\n• The Chop Shop needs help! Take the brand-new 2020 Ford Shelby GT500 to keep Kelly's business afloat while she's out of town\r\n• You can earn the Honda S2000 in an all-new Breakout event\r\n• New events have been added to the ever-expanding flashback list\r\n\r\nAnd be sure to watch for new content in the Inbox, including how you can participate in exciting social competitions.\r\n\r\nDo you have what it takes to rule the streets? Prove it!"},{"version_id":"835445614","version_name":"4.4.6","version_date":"2020-04-21 06:54:14.000 +0800","version_description":"Sometimes you wonder what strange fate brought you onto the streets of Blackridge. Was it the fast cars or the promise of the fast track to glory? Around every turn there’s a new mystery, a new challenger. Every instinct tells you to be on guard. Whether you like your rides new or classic, this Noir update, Midnight Boulevard, has the goods you’re looking for. A mix of old and new school hits the streets with the Bugatti La Voiture Noire, Beck Kustoms F132 and 1991 Honda NSX. Keep an eye for:\r\n\r\n• An unseen hand works from the shadows and the crews of Blackridge aren't sure who to trust. Word on the street is Kim needs a helping hand to uncover a mystery. You’ll earn the Bugatti La Voiture Noire for your troubles\r\n• Every palooka in Blackridge will want to get their mitts on the Beck Kustoms F132. Hit the all-new Proving Grounds and put this beast through its paces in this series of challenges\r\n• The classic 1991 Honda NSX awaits in the latest Breakout - and the cops won't be far behind\r\n\r\nAnd be sure to keep a watchful eye out for new content in the Inbox, including how you can participate in exciting social competitions.\r\n\r\nYou have what it takes to rule the streets, kid? Prove it!"},{"version_id":"835946162","version_name":"4.5.5","version_date":"2020-06-09 06:59:20.000 +0800","version_description":"The glitz of Hollywood comes to Blackridge once again as Michael Speedway returns for his next film in “Knights! Drama! Traction!” Plus, this update lets you get behind the wheel of the McLaren Senna, Jaguar XKR-S GT, and Porsche 718 Cayman GT4, or relive the classics in our new Special Events Vault.\r\n\r\nAnd, watch your back as the streets of Blackridge get more dangerous with the next thrilling chapter of the Need for Speed No Limits campaign in this massive update where:\r\n\r\n• Our brand-new Special Events mode has launched. Jump into the vault and start an NFS No Limits classic Special Event of your choice.\r\n• Real life and fiction collide as Michael Speedway returns to Blackridge for his latest blockbuster. Help him pull off his magnum opus and earn the McLaren Senna – and the admiration of audiences worldwide.\r\n• The Jaguar XKR-S GT is waiting in an all-new Proving Grounds – rise above the contenders and show Ivy you have what it takes.\r\n• Chip is back with the XRC and there's a new car up for grabs. Beat your opponents to win the Porsche 718 Cayman GT4.\r\n\r\nJoin the conversation with us and other Need for Speed No Limits fans by following @nfsnl on our official Instagram.\r\n\r\nDo you have what it takes to rule the streets? Prove it!"},{"version_id":"836846730","version_name":"4.6.31","version_date":"2020-07-28 07:00:02.000 +0800","version_description":"Three iconic cars arrive in Need for Speed No Limits: The Aston Martin DBS Superleggera, Volkswagen Beetle and Mercedes Benz SLR McLaren 722. Plus, the final piece of Detective Wolf's elite squad is revealed as the crews of Blackridge come under attack from a force operating outside the law. This action-packed update brings:\r\n\r\n• The chance to take down Wolf’s enforcers before it's too late and earn the Aston Martin DBS Superleggera in the all new Rogue Justice limited-time series event\r\n• Speedhunters return with a new Zero to Hero series. Take the challenge and customize the swinging 1965 Volkswagen Beetle into a modern racing machine \r\n• A touch of luxury mixed with monster performance in the Mercedes Benz SLR McLaren 722 - available in a new Proving Grounds\r\n\r\nAll that and more events continue to be added to the Vault, so jump in and start playing to earn cars from previous Special Events.\r\n\r\nJoin the conversation with us and other Need for Speed No Limits fans by following @nfsnl on our official Instagram.\r\n\r\nDo you have what it takes to rule the streets? Prove it!"},{"version_id":"837403204","version_name":"4.7.31","version_date":"2020-09-08 06:56:21.000 +0800","version_description":"This update, NFSNL brings you more of everything: More cars, more events, more additions to The Vault and the newest campaign chapter. Plus, the pieces are all falling into place in the epic conclusion of the Dusthowlers story in our all-new special event “Zenith” – all in one explosive update where you can:\r\n\r\n• Earn the outstanding Brabham BT62 as The Dusthowlers make their move against the shadowy corporation\r\n• Powerhaus is on the wrong side of the law again. Team up with Heidi and Frank to earn the AMG SLS Black Series in an all-new Breakout event\r\n• The classic 1971 Nissan Skyline 2000 GT-R comes to a new Proving Grounds! Overcome feelings of nostalgia to bring it to your garage\r\n• The Bloodfangs are continuing to tear the city apart and it's no longer clear whether they can be stopped. Help Kim restore order as the pieces begin to fall into place in the exciting next Campaign Chapter\r\n\r\nAll that and more events have been added to the Vault, so jump in and start playing to earn cars from previous Special Events.\r\n\r\nJoin the conversation with us and other Need for Speed No Limits fans by following @nfsnl on our official Instagram.\r\n\r\nDo you have what it takes to rule the streets? Prove it!"},{"version_id":"838282439","version_name":"4.8.41","version_date":"","version_description":""},{"version_id":"839454457","version_name":"4.9.11","version_date":"2020-12-08 07:00:16.000 +0800","version_description":"We’re looking back and moving forward as Bobby Hundreds, the co-founder of LA streetwear brand The Hundreds, arrives in Blackridge along with the iconic DeLorean DMC-12. Relive past NFS No Limits events as you embark on a journey across time and return to the present in this thrilling update where you can:\r\n\r\n• Earn the DeLorean complete with exclusive The Hundreds body kit as well as two exclusive The Hundreds wraps \r\n• The finale of the Devil’s Run story is here! As the end draws near, the Organizers return with a new Devil's Run that's sure to get Wolf's attention. Keep the cops at bay and the tournament on track to win the Hennessey Venom F5\r\n• Chip returns with another Xtreme Racing Championship! Beat the competition and the Lamborghini Sesto Elemento is yours\r\n\r\nPlus, enjoy some new music tracks selected by Bobby Hundreds himself. Events also continue to be added to the Vault, so jump in to earn a whole range of cars you may have missed. Join the conversation and look out for more surprises from NFSNL and The Hundreds by following @nfsnl on our official Instagram.\r\n\r\nDo you have what it takes to rule the streets? Prove it!"},{"version_id":"840092015","version_name":"5.0.21","version_date":"2021-01-27 06:59:00.000 +0800","version_description":"Celebrate Lunar New Year in style with three incredible cars: The Aston Martin Valkyrie, Volkswagen Scirocco R, and the Dodge ViperSRT ACR-X in this thrilling update where you can also:\n\n• Get an exclusive Lunar New Year wrap for a limited time\n• Take on the Blackridge mob to win the Aston Martin Valkyrie\n• Hit the streets in style and earn the Volkswagen Scirocco R! \n• Put your track skills to the test with the Dodge Viper SRT10 ACR-X in the latest Proving Grounds \n\nPlus, events also continue to be added to the Vault, so jump in to earn a whole range of cars you may have missed. Join the conversation and look out for more surprises by following @nfsnl on our official Instagram.\n\nDo you have what it takes to rule the streets? Prove it!"},{"version_id":"840356637","version_name":"5.0.41","version_date":"2021-02-09 06:31:42.000 +0800","version_description":"Celebrate Lunar New Year in style with three incredible cars: The Aston Martin Valkyrie, Volkswagen Scirocco R, and the Dodge ViperSRT ACR-X in this thrilling update where you can also:\n\n• Get an exclusive Lunar New Year wrap for a limited time\n• Take on the Blackridge mob to win the Aston Martin Valkyrie\n• Hit the streets in style and earn the Volkswagen Scirocco R! \n• Put your track skills to the test with the Dodge Viper SRT10 ACR-X in the latest Proving Grounds \n\nPlus, events also continue to be added to the Vault, so jump in to earn a whole range of cars you may have missed. Join the conversation and look out for more surprises by following @nfsnl on our official Instagram.\n\nDo you have what it takes to rule the streets? Prove it!"},{"version_id":"840604741","version_name":"5.1.21","version_date":"2021-03-09 07:00:04.000 +0800","version_description":"Cruise through the streets of Blackridge with the Maserati GranTurismo MC Stradale, Chevrolet Corvette Stingray 427 C2 and Bugatti Veyron Super Sport! Plus, Women’s History Month brings us two incredible limited-time wraps for you to deck out your ride in this incredible update where you can also:\n\n• Compete in the new Proving Grounds to earn the Chevrolet Corvette Stingray 427 C2\n• Take on the competition to earn the Bugatti Veyron Super Sport\n• Join in some new antics and earn the Maserati GranTurismo MC Stradale\n\nAnd at long last, it's here! No Limits' customisation overhaul is now available for you to make each car in your garage truly your own with phase one of our improved Mod Shop. Plus, events also continue to be added to the Vault, so jump in to earn a whole range of cars you may have missed. Join the conversation and look out for more surprises by following @nfsnl on our official Instagram.\n\nDo you have what it takes to rule the streets? Prove it!"},{"version_id":"841236660","version_name":"5.2.11","version_date":"2021-04-20 08:00:35.000 +0800","version_description":"A new chapter in the story of NFS No Limits begins here! Join Ryo and his brother Hiroshi on their rise to becoming the best in Blackridge as you jump behind the wheel of the Honda Integra DC2 Type R. Race your way to the top in this action-packed where you can also:\n\n• Join Kris and Isabella for some payback in the latest Breakout special event to earn the Aston Martin V12 Vantage S\n• Respect and power, as well as the Alfa Romeo 8C, can be yours in the latest Proving Grounds\n• Not only will you join the newest contenders to rule the underground, earn the wicked Oni wrap alongside the Honda Integra DC2 Type R\n\nPlus, we have a new car series as well as an all-new video series in our Inbox Join the conversation and look out for more surprises by following @nfsnl on our official Instagram.\n\nDo you have what it takes to rule the streets? Prove it!"}]