[{"version_id":"593772665","version_name":"3.0.1","version_date":"2014-10-07 21:14:21.000 +0800","version_description":""},{"version_id":"811801766","version_name":"3.1.1","version_date":"2015-02-24 23:07:04.000 +0800","version_description":"Bug fixes."},{"version_id":"811940178","version_name":"3.1.2","version_date":"2015-03-16 09:59:04.000 +0800","version_description":"Bug fixes."},{"version_id":"812679603","version_name":"3.2.0","version_date":"2015-07-08 02:01:57.000 +0800","version_description":"Here’s the updates you’ll find in this version of SketchBook:\nImport from camera - take a picture with your camera and bring it into SketchBook as a background, inspirational image, or just as something to draw over.\nVarious bug fixes - Wacom 2.0.14 and Adonit 2.7 (corrects the wavy issues and crashes)"},{"version_id":"813395093","version_name":"3.3.0","version_date":"2015-09-19 08:41:45.000 +0800","version_description":"-Address stylus issue on iOS 9"},{"version_id":"813549900","version_name":"3.4.0","version_date":"2015-10-27 14:59:48.000 +0800","version_description":"Our big announcement: Introducing Sketch This; Find inspiration when you need it with new daily drawing challenges from the DeviantArt community right inside of SketchBook.\nOur other not-as-big (yet still very cool) announcements:\n• Do you like the Brush Palette AND the Double Puck? So do we. Opening the Double Puck no longer closes the Brush Palette. You don’t have to choose between them, anymore.\n• Auto-save is now more reliable and provides better data protection. Your work deserves it.\n• All your time-lapse videos play much more smoothly. We didn’t like the choppy playback, either.\n• If you are using an Adonit Bluetooth stylus, we’ve improved palm rejection support for your stylus. No more unwanted marks.\n• Some iOS9 bugs have been squashed. You can focus more on drawing and less on distractions."},{"version_id":"814454625","version_name":"3.5.0","version_date":"2015-11-13 09:28:34.000 +0800","version_description":"Your favorite drawing app is now ready for the all new iPad Pro and Apple Pencil! Here is what we added to make the best drawing experience with these new devices:\n-          On iPad Pro, we’ve increased the canvas size to 4K with up to 12 layers\n-          Apple Pencil includes both pressure and tilt sensitivity. Try it out with the pencil tool and the chisel-tip markers.\nWhy let iPad Pro have all the fun? We’ve also added, for all devices:\n-          Support for pressure-sensitive brush strokes for 3D Touch devices. Your fingers have been enabled for pressure sensitivity. \n-          Unlimited undo and redo.\nThanks, as always, for drawing in SketchBook. If you like SketchBook, please give us a rating or a review in the App Store"},{"version_id":"815125598","version_name":"3.5.1","version_date":"2015-12-09 10:11:15.000 +0800","version_description":"- Inking brush – the most wanted SketchBook desktop brush is now yours on mobile\n- For iOS 9 users, we support split-screen multi-tasking, so SketchBook works with Slide Over and Split View functionality\n- Fixed the stroke lag when using a stylus\n- Fixed a number of bugs"},{"version_id":"816479324","version_name":"3.5.2","version_date":"2016-03-24 14:33:20.000 +0800","version_description":"• Fix offset issue when quickly drawing multiple lines\n• Improve the accessibility of color picker with long-pressed"},{"version_id":"816925999","version_name":"3.6.0","version_date":"2016-04-02 14:24:45.000 +0800","version_description":"◆Bringing your paper sketches into the digital world just got a lot easier. We help you to scan a drawing with perspective correction and background clean-up to make it into digital art. Import drawings from your sketchbook into SketchBook for a seamless transition from physical art to digital. Scan Sketch has three modes:\n•       Black & White: Show/hide the image's background.\n•       Color: Show/hide the image's background.\n•       Original: Import your original image, including the background \nWe’re excited to see all the sketches you’ve undoubtedly drawn in the margins of notebooks, on napkins, and on every loose piece of paper you could get your hands on. Scan those drawings and keep working on them on your mobile device.\n\n◆The efficiency of file saving has greatly improved. Large canvases are two times faster!\n◆Apple Pencil support for new iPad Pro\n◆Property values were corrected for reset Smudge and Synthetic paint brushes\n◆The iCloud storage experience has greatly improved\n◆The layer thumbnail update issue was resolved\n\nAny questions or comments can be sent directly to support@sketchbook.com"},{"version_id":"817332368","version_name":"3.6.1","version_date":"2016-05-12 01:15:04.000 +0800","version_description":"This is a small update to improve the performance of the app for artists using Apple Pencil and other types of Bluetooth-connected styluses."},{"version_id":"818413575","version_name":"3.7.0","version_date":"2016-08-26 06:14:12.000 +0800","version_description":"We designed the interface of SketchBook to keep you in the zone, free of distractions, so you can focus on drawing. We know that sometimes the screen you're drawing on is small, so we added a feature to hide interface elements that are a little too close to your finger when drawing.\n\nNow, purchase a SketchBook Subscription using your iTunes account, right here on your mobile device. A SketchBook Subscription unlocks the SketchBook Pro features across all your Mac and IOS (iPad, iPhone and iPodTouch) devices with a single purchase."},{"version_id":"819289960","version_name":"3.7.2","version_date":"2016-10-14 11:12:03.000 +0800","version_description":"Bug fixes."},{"version_id":"819577102","version_name":"3.7.3","version_date":"2016-11-08 00:00:37.000 +0800","version_description":"•Compatibility update for Wacom® stylus"},{"version_id":"820613970","version_name":"3.7.4","version_date":"2017-01-20 09:26:49.000 +0800","version_description":"For iPhone users, many of you missed using your Wacom Intuos Creative Stylus with SketchBook, so we brought this back."},{"version_id":"821529535","version_name":"4.0.3","version_date":"2017-05-16 22:04:43.000 +0800","version_description":"Welcome to the future of SketchBook! We’ve added new features, significantly improved performance, and made the most robust update to SketchBook on iOS in our history. Here are a few highlights:\n\n• SketchBook has a new drawing and rendering engine, which enables canvas sizes up to 100 mpx, a huge undo stack, unlimited* layers, and a faster and more responsive drawing experience on all 64-bit iOS devices (especially iPad Pro and Apple Pencil).\n\n• Previously existing brushes have been optimized for the new drawing engine and we added several new brush sets. SketchBook now has over 170 customizable brushes, including texture brushes, to meet the demands of all types of artists and designers.\n\n• For 64-bit iPad and iPad Pro users, use Rapid UI mode, as a convenient way to access full menus in full-screen mode, without toggling the interface on and off. When in Rapid UI mode, access the layer, brush, and color editors, by placing your thumb on the edge of the screen and swiping up or down to change menus. While holding down your non-dominant thumb, make a selection in the editor with your drawing hand. Lift your non-dominant thumb to make the entire interface disappear (a quick tutorial will appear the first time you open the app after this update).\n\n• To access common menu items, like the Color Picker, Eraser, Flip Canvas, Last Brush, and the Double Puck, tap the translucent circle at the bottom of the canvas and make a selection. As you gain muscle-memory for these tools, simply tap-and-flick in the direction of the tool you want and to automatically select it.\n\n• Create perfectly symmetrical drawings with X, Y, X-Y, and radial symmetry tools. Reposition the line of symmetry, anywhere on the canvas, for precise control. Use up to 16 sectors of radial symmetry for precise radial sketches.\n\n• Use the popular Predictive Stroke feature from the desktop version of SketchBook in iOS. When enabled, if you draw a line, Predictive Stroke makes your line straight. If you draw a basic shape, Predictive Stroke will correct your shape into precise circles, rectangles, and triangles. If you are drawing freehand and want to apply smoothing, Predictive Stroke will add the right amount of smoothing to curved lines.\n\n• Try the new ruler and ellipse tools to place precise lines or elliptical shapes, such as circles in perspective, by adjusting the position, size, rotation, and aspect ratio of the drawing guides.\n\nAs always, thank you for drawing in SketchBook! Let us know what you think of the new SketchBook on Instagram (@AutodeskSketchBook), Twitter (@sketchbookapp), and Facebook (/AutodeskSketchBook). Need help? Visit SketchBook.com for product information, tutorials, and support (https://help.sketchbook.com/knowledgebase/)."},{"version_id":"822316661","version_name":"4.0.4","version_date":"2017-05-30 00:06:05.000 +0800","version_description":"As part of our last update, we introduced a pixel preview. The intent was to increase rendering speed while zooming in an out of the canvas, by reducing the number of pixels presented. This was confusing, and in some cases, the reduced number of pixels stayed reduced, even after zooming, resulting in your images looking pixelated. We made two changes to address this: we fixed a bug to restore the correct pixel density after zooming, and we also added a preference to disable this reduced pixel density when zooming in. This new feature is called Pixel Preview, and can be toggled on or off from your in-app preferences. This update introduces the preference Pixel Preview (https://help.sketchbook.com/mobile/preferences/#general) to address the pixelation issues in version 4.0.\nWe also addressed a number of bugs."},{"version_id":"822346989","version_name":"4.1.0","version_date":"2017-06-13 05:09:42.000 +0800","version_description":"**We're giving you 30% off Pro Subscription.\nPro version includes:\nMulti-device usage on all platforms\n100+ customizable brushes\nLine-smoothing technology\nAnd many more powerful drawing tools.\nDiscount only applies to annual subscription. \nOffer expires 7/31/17 12AM **\n\n\n• We've listened to your comments and thank you for all the feedback! For 4.1, we have updated to support iOS 10 and above. This means people using certain devices, such as an iPad 4, iPhone 5, or iPhone 5C, can now download and use the app.\n• With 4.1, unlock the power of SketchBook on the new iPad Pro with our enhanced refresh rate of 120Hz, which will offer an ultra-smooth and more natural stroke experience.\n• Apple Pencil users will love the improved responsiveness! Strokes feel even more natural and precise."},{"version_id":"822989443","version_name":"4.1.1","version_date":"2017-07-24 18:51:17.000 +0800","version_description":"We have addressed the following issues in this release:\nFor iPad users, when creating an account, there is no longer an issue with the app hanging after entering a new password.\nFor users trying to log in using Google+, we’ve added a fix to correct the login failure \"Error: disallowed_useragent\"."},{"version_id":"823426384","version_name":"4.2.1","version_date":"2017-09-29 01:25:24.000 +0800","version_description":"•You can now drag and drop sketches from the SketchBook Gallery into other apps.\n•Dragging an image into the canvas places the image onto a new layer."},{"version_id":"824212827","version_name":"4.2.2","version_date":"2017-10-31 12:00:29.000 +0800","version_description":"Got a new iPhone X? Lucky you. We carved out a notch ;-) in our UI just for you. And squashed a few bugs for everyone else while we were at it."},{"version_id":"825899045","version_name":"4.2.3","version_date":"2018-02-07 23:27:48.000 +0800","version_description":"For iPhone X users, the Gallery now works as expected and iCloud saving has been restored."},{"version_id":"826822995","version_name":"4.3.0","version_date":"2018-05-01 00:35:31.000 +0800","version_description":"We are excited to announce that the fully featured version of SketchBook is now FREE for everyone!"},{"version_id":"826822995","version_name":"4.3.1","version_date":"2019-01-22 04:22:38.000 +0800","version_description":"We've made some pretty impactful improvements, the biggest being the removal of the trial. You'll also find a fix or two, as well.\nThere is no more trial version.\nWe created a new **Welcome** splash screen, so there's no longer a need to log in to use SketchBook.\nThe Blog location changed under our noses, but it has been updated. You can access it, once again, from within the app.\nApple Pencil input now works within the Welcome screen.\nThe **No Network** message no longer appears prematurely, and we added a **Back** button to retry after a real network error.\nFormatting issues on the account information dialog have been corrected.\nWe made clicking the Close button a bit easier for all popup dialogs (it was previously a bit small for fingers)."},{"version_id":"829967793","version_name":"4.3.1","version_date":"2019-01-22 04:22:38.000 +0800","version_description":"We've made some pretty impactful improvements, the biggest being the removal of the trial. You'll also find a fix or two, as well.\nThere is no more trial version.\nWe created a new **Welcome** splash screen, so there's no longer a need to log in to use SketchBook.\nThe Blog location changed under our noses, but it has been updated. You can access it, once again, from within the app.\nApple Pencil input now works within the Welcome screen.\nThe **No Network** message no longer appears prematurely, and we added a **Back** button to retry after a real network error.\nFormatting issues on the account information dialog have been corrected.\nWe made clicking the Close button a bit easier for all popup dialogs (it was previously a bit small for fingers)."},{"version_id":"831179712","version_name":"5.0.0","version_date":"2019-05-06 22:40:39.000 +0800","version_description":"We added new features to further help with drawing. We looked at what you use in SketchBook desktop that wasn't in mobile and beyond.\n·        Perspective Guides, with 1, 2, and 3 point perspective guides, a snapping toggle, vanishing point lock, and horizon line visibility.\n·        Customize, Infinite, and Constrained Grid tools.  \n·        Curve ruler, for drawing curves you can’t get with the Ellipse tool.\n·        Support for the new Apple Pencil (2nd generation), which includes its double-tap functionality.\n·        Support for Scan Sketch for the new iPad."},{"version_id":"833437583","version_name":"5.1.0","version_date":"2019-11-06 00:31:20.000 +0800","version_description":"·        We removed the splash screen that appeared upon startup, so there is no longer a need or even an option for logging in.\n·        NOTE: If you are not a SketchBook Pro (enterprise) user and created an Autodesk Account, you may want to delete it. See the article Delete Your Autodesk Account for instructions for how to do this.\n"},{"version_id":"833519899","version_name":"5.1.1","version_date":"2019-11-19 03:30:37.000 +0800","version_description":"Improvements"},{"version_id":"834290552","version_name":"5.1.7","version_date":"2020-01-14 01:04:11.000 +0800","version_description":"• Bug fixes"},{"version_id":"844066305","version_name":"5.2.0","version_date":"2021-09-21 06:01:43.000 +0800","version_description":"• Updated Color Editor and Color Library \n- New quick access to complementary color and 9-swatch color history at the top of the Color Editor \n- On the right side of the Color Editor, a new icon lets you toggle from the Color Wheel panel to the new Color Set panel\n\n• Color Sets are a new method of creating and storing palettes of swatches\n- If you're upgrading from a previous version of Sketchbook, your custom color palette will populate as a new Color Set\n- You can drag and drop colors from the swatches in the top section of the Color Editor to populate palettes\n- In the Color Library you can create a new blank set or load one of our presets as a starting point, including a Basic starter set, a Variety collection, and a set of Greys\n\n• Other color updates\n- Custom Gradient for generating 9-swatch blends of 2 selected colors\n- HEX color values field to allow copying and pasting color across apps\n- On iPad, pin the Color Editor from the Color Puck to remain open while you draw\n- Removal of Copic library and markers – these had to be removed as they were licensed to Autodesk and that license did not transfer to us\n\n• Removal of iCloud from the Gallery. The connection to iCloud breaks when an app transfers between developers. If you have been saving to iCloud, all your files are still there! There is a dialog explaining what to do to access your files that appears on first launch, and also the first time you go to the Gallery.\n\n• New “Save” and “Files” options in the main menu. Because of the iCloud break, it was necessary to create a way for people to bring those files back into Sketchbook. We took this opportunity to expand where and how you can save and export your files. \n- You can now import and export Sketchbook files to your device, iCloud, and other third-party cloud services\n\n• Other data-related changes\n- The Import from iTunes option has been retired\n- A close button has been added to the Gallery. When the Gallery is dismissed, the canvas reverts to the last open sketch.\n\n• Developer update from Autodesk to Sketchbook, Inc. Updated icon, about box, links to support, and dropping the internal cap in the app name\n\n• Sketchbook no longer collects any personal data, so there is no request to opt-in for personal data usage"},{"version_id":"844642678","version_name":"5.2.2","version_date":"2021-10-23 07:12:07.000 +0800","version_description":"• Updates for iOS 15\n• Bug fixes"}]