[{"version_id":"812339170","version_name":"3.0.1","version_date":"2015-05-10 20:07:19.000 +0800","version_description":""},{"version_id":"820194883","version_name":"4.0","version_date":"2016-12-20 04:01:38.000 +0800","version_description":""},{"version_id":"820269148","version_name":"4.0.1","version_date":"2016-12-21 21:47:31.000 +0800","version_description":""},{"version_id":"820316021","version_name":"4.0.2","version_date":"2017-01-03 15:34:54.000 +0800","version_description":""},{"version_id":"820576486","version_name":"4.0.3","version_date":"2017-01-18 15:08:42.000 +0800","version_description":""},{"version_id":"820642401","version_name":"4.0.4","version_date":"2017-01-25 17:07:20.000 +0800","version_description":"The Truth or Dare is now available in English!"},{"version_id":"822710157","version_name":"4.1","version_date":"2017-07-13 10:47:09.000 +0800","version_description":"Hello! The whole Chouic team is back with a HUGE update!<br><br>Our awesome developers, Antoine and Romuald, have been working like crazy to offer you this new version. Do you like it? Give them 5 STARS and write a short comment like \"I LOVE TRUTH OR DARE\". They will be thrilled to read your nice messages! <br><br>What's in this update? <br><br>First of all, it features the big comeback of PERSONALIZED DARES! In order to always have them with you and on your devices, you can save and synchonize them via Facebook. Champagne?!<br><br>Do you like a dare? SHARE it and send us a TAG with #truthordare. <br><br>We hope you'll be delighted with the NEW DESIGN. Each level has its own ambiance! The wheel is now sexier: a light caress is enough to make it spin, but you can keep on tapping it, if you want. N.B.: We will not be held responsible for grease stains on screens due to an overconsumption of potato chips.<br><br>Finally, many bugs have been corrected. Some of you were encountering problems with unlocked levels. The problem is now solved! However, if the levels that you have purchased appear to be blocked, please feel free to press the \"Restore My Purchases\" button. And if you have the slightest issue, we're here to help!<br><br>We hope that you'll like this new version and we wish you an excellent evening!<br><br>Antoine et Romuald gave their all for this new version! Do you like it? Give 5 STARS and a short comment like \"I LOVE TRUTH OR DARE\". <br><br>In this version, there are: synchronized CUSTOMIZED DARES on all your devices to be shared with the tag #TRUTHORDARE. A new colorful DESIGN and a wheel that spins when you lightly  touch it with your hand."},{"version_id":"823524208","version_name":"4.2","version_date":"2017-09-11 15:13:09.000 +0800","version_description":"Our latest update has something for everyone! Don't believe us? Here's the proof:<br><br>Are you a total slacker, too lazy to read the dares?<br><br>Now your phone can read the dares out loud so the whole table can hear each dare.<br><br>Are you a rock star with thousands of followers?<br><br>Our new and improved \"share\" button allows you to easily save and share your favorite dares on social media.<br><br>Are you a hardcore gamer who only plays at the \"hard\" or \"extreme\" levels? <br><br>We've added lots of dares to those two levels!<br><br>Are you a hermit, living deep in the forest?<br><br>Thanks to a bug fix, now you can see the dares even when you have no Internet.<br><br>Are you the kind of person who buys a new phone every week?<br><br>Restoring purchases is now easy (if not, contact us). Actually, if you have enough money for a new phone every week, contact us whether it works or not. We'll send you our bank transfer information, and maybe we can work something out... <br><br>Don't fit any of these descriptions?<br><br>Tell us all about it, and we'll try to include you in the next update!"},{"version_id":"824009886","version_name":"4.3.2","version_date":"2018-02-02 07:02:44.000 +0800","version_description":"A little bug was hidden in the previous version of our Truth or Dare app. Most of you probably didn't even notice it, but the Chouic team hunted it down, found it and eventually tore it to pieces. <br>We hope you can now enjoy trouble-free parties! If you like the app, you can leave a comment on the store, we have a very good time reading all your reviews !"},{"version_id":"824009886","version_name":"4.3","version_date":"2017-11-10 08:23:50.000 +0800","version_description":"To breathe some life into those long winter nights, Chouic has made even more improvements to the application:<br>- A BIG SURPRISE is waiting for you at the end of the year. Be patient and don’t delete the application; you’ll be able to unlock the surprise for free!<br>- The application is now available in 11 LANGUAGES. So no matter where you are, we’re here to spice up your evening.<br>- The BUGS have been fixed, but keep writing to us to say hello!"},{"version_id":"825063269","version_name":"4.3.1","version_date":"2018-01-26 08:07:12.000 +0800","version_description":"Happy new Year! <br>The BUGS have been fixed, but keep writing to us to say hello!"},{"version_id":"825843757","version_name":"4.3.2","version_date":"2018-02-02 07:02:44.000 +0800","version_description":"A little bug was hidden in the previous version of our Truth or Dare app. Most of you probably didn't even notice it, but the Chouic team hunted it down, found it and eventually tore it to pieces. <br>We hope you can now enjoy trouble-free parties! If you like the app, you can leave a comment on the store, we have a very good time reading all your reviews !"},{"version_id":"826577748","version_name":"4.3.3","version_date":"2018-04-13 08:05:19.000 +0800","version_description":"Ta-Da! Thanks to your feedback, we've improved Truth or Dare! The bugs have been exterminated, and performance has been improved.<br>The dare creation process has been optimized.<br>We've also added a feature that lets you find out about our other games :)<br>Have fun with your friends or as a couple with Truth or Dare!<br>If you run into a problem, contact us on Messenger!"},{"version_id":"826899934","version_name":"4.3.6","version_date":"2019-01-16 15:07:44.000 +0800","version_description":"Fixed an issue when you had no network access."},{"version_id":"826899934","version_name":"4.3.4","version_date":"2018-05-08 07:22:35.000 +0800","version_description":"Yeah! Thanks to your feedback, we’ve improved Truth or Dare again!<br>You can now play with as many players as you want!<br><br>Have fun with your friends or as a couple with Truth or Dare! If you run into a problem, contact us on Messenger!"},{"version_id":"829731008","version_name":"4.3.5","version_date":"2018-12-22 12:39:13.000 +0800","version_description":"This latest version has OVER 600 changed, updated and brand new dares for the Truth or Dare Game. Don’t like one of the dares? Let us know and tell us why. Did you find an issue? Contact us.<br><br>Now our couple's game works seamlessly on iOS 12 and the iPhone XS Max."},{"version_id":"829950149","version_name":"4.3.6","version_date":"2019-01-16 15:07:44.000 +0800","version_description":"Fixed an issue when you had no network access."},{"version_id":"832840105","version_name":"4.3.7","version_date":"2019-09-24 21:11:24.000 +0800","version_description":"What’s new with this update? A lot of new dares, and bug fixes.<br>You enjoy the game? Please leave a 5 stars review! By doing it, you put a huge smile on Antoine and Laura’s faces. They wrote a lot of new dares just for you !"},{"version_id":"834269067","version_name":"4.3.8","version_date":"2020-01-08 23:13:06.000 +0800","version_description":"Ta-Da! Thanks to your feedback, we've improved Truth or Dare! The bugs have been exterminated, and performance has been improved.<br>The dare creation process has been optimized.<br>We've also added a feature that lets you find out about our other games :)<br>Have fun with your friends or as a couple with Truth or Dare!<br>If you run into a problem, contact us on Messenger !"},{"version_id":"836966575","version_name":"4.4","version_date":"2020-08-07 19:11:27.000 +0800","version_description":"So many of you have given us feedback about our truth or dare game. We love it! The whole team at Chouic contributed to the update, including: <br>- New dares :) <br>- The ability to change languages <br>- Improvements to personalized dares and the entire app!"},{"version_id":"840849352","version_name":"4.4.1","version_date":"2021-03-18 19:45:52.000 +0800","version_description":"The new update of our Truth or Dare game is available! We've been reading and listening to your feedback for a long time to provide you with an optimal experience!<br><br>On the agenda of this update :<br><br>- We went on the hunt for bugs! Indeed, some of you could encounter a problem with the restoration of your purchases in the game. This is now fixed.<br>    <br>- New content for Truth or Dare! Thanks to your feedback, we have integrated new dares and new truths in the application. Feel free to help us improve the game by telling us if you like or dislike a challenge with the \"Rate the dare\" button.<br>    <br>The whole team hopes you like this update! If you do, don't hesitate to support us with a comment and 5 stars on the store.<br><br>You want to report a problem? Send us a message from the \"Contact Us\" tab of the application.<br>Have fun with the Truth or Dare application!"}]