[{"version_id":"811906715","version_name":"5.0","version_date":"","version_description":""},{"version_id":"813161322","version_name":"5.3.1","version_date":"","version_description":""},{"version_id":"816670151","version_name":"6.0.1","version_date":"","version_description":""},{"version_id":"817845184","version_name":"6.0.2","version_date":"2016-06-29 21:03:39.000 +0800","version_description":"• Fixed a bug with creating exams from flagged questions<br>• Addressed a migration issue that caused the app to misbehave<br>• Minor optimizations"},{"version_id":"818269964","version_name":"6.0.5","version_date":"2016-07-27 05:15:50.000 +0800","version_description":"• Fixed several bugs that were causing stability issues when submitting an exam<br>• Optimized how answer explanations are displayed<br>• Further optimizations for iOS 8 customers<br>• Several design improvements"},{"version_id":"818554936","version_name":"6.0.7","version_date":"2016-08-18 19:36:59.000 +0800","version_description":"• Fixed a bug with retaking exams<br>• Resolved several stability issues<br>• Misc optimizations"},{"version_id":"818656805","version_name":"6.0.9","version_date":"2016-09-01 22:57:42.000 +0800","version_description":"• Dashboard now counts down your unattempted questions<br>• More stability improvements"},{"version_id":"818812322","version_name":"6.0.10","version_date":"2016-09-08 20:38:37.000 +0800","version_description":"• More stability improvements<br>• iOS 10 optimization"},{"version_id":"819564435","version_name":"6.0.11","version_date":"2016-11-08 02:56:37.000 +0800","version_description":"• Retaking exams no longer decrements the amount of remaining questions in the Dashboard<br>•&nbsp;Behind-the-scenes optimizations for the cloud (coming soon!)"},{"version_id":"820066702","version_name":"6.1","version_date":"2016-12-09 02:21:59.000 +0800","version_description":"Our big cloud update has finally arrived! You can now create your own Pocket Prep account to sync all of your exam results, history, and progress between mobile devices. Creating an account is completely free and totally optional. In addition to the cloud, we made significant optimizations to improve the app's speed, reliability, and overall experience.<br><br>Love this new version? Leave a review here in the App Store -- We're listening!"},{"version_id":"820110689","version_name":"6.1.1","version_date":"2016-12-14 03:20:42.000 +0800","version_description":"Bug fixes and stability improvements."},{"version_id":"820257811","version_name":"6.1.2","version_date":"2016-12-21 18:10:46.000 +0800","version_description":"• Bug fixes and stability improvements"},{"version_id":"820636981","version_name":"6.1.3","version_date":"2017-01-22 19:36:06.000 +0800","version_description":"Our big cloud update has finally arrived! You can now create your own Pocket Prep account to sync all of your exam results, history, and progress between mobile devices. Creating an account is completely free and totally optional. In addition to the cloud, we made significant optimizations to improve the app's speed, reliability, and overall experience.<br><br>Love this new version? Leave a review here in the App Store -- We're listening!"},{"version_id":"821134823","version_name":"6.1.4","version_date":"2017-03-01 17:49:53.000 +0800","version_description":"Fixed some bugs affecting multi-device customers along with other cloud optimizations. Don't forget to rate this new version -- we're listening!"},{"version_id":"821301276","version_name":"6.1.5","version_date":"2017-03-14 04:04:45.000 +0800","version_description":"Fixed a bug that was causing crashes/glitches when attempting to resume an exam."},{"version_id":"821492476","version_name":"6.2.1","version_date":"2017-03-27 21:44:02.000 +0800","version_description":"QOTD History has arrived!<br>• Revisit previous daily questions<br>• Track your performance<br>• Sort and filter on demand<br>How long can you go without missing a daily question? Find out on the Dashboard!<br><br>And in bigger news: you can now create your own Pocket Prep account to sync all of your exam results, history, and progress between mobile devices. Creating an account is completely free and totally optional. In addition to the cloud, we made significant optimizations to improve the app's speed, reliability, and overall experience. Let us know what you think of all these new features by leaving a review!"},{"version_id":"821625520","version_name":"6.3","version_date":"2017-04-13 20:47:39.000 +0800","version_description":"Ever wanted to know how well you were doing on a subject as you progressed through the test bank? This latest update introduces “Exam Readiness,” an entire tab dedicated to improving individual subject performance so you can pass your exam on the first attempt. You can quickly visualize areas to improve and even find the perfect tutor right through the app!<br><br>To make room for Exam Readiness, we merged the Settings and Reminders tabs. This new and improved Settings tab will help you better manage your new cloud-powered Pocket Prep account while providing access to the same features as before. Go ahead and upload that selfie — make the app yours!<br><br>This version also includes some general optimizations. You can now:<br>- Swipe to navigate between questions in an exam<br>- Swipe to navigate sub-screens and menus<br>- Set your exam date right from the Dashboard<br>- Tap a tab twice to return to its top level<br>- Add a profile picture in Settings<br><br>We squashed a few bugs to improve stability. For customers with enormous exam histories, you’ll now see a huge improvement in performance when creating exams or browsing previous ones.<br><br>Please take a moment to let us know what you think of these enhancements by leaving a review in the App Store. We’re always listening!"},{"version_id":"822643417","version_name":"6.3.2","version_date":"2017-06-23 18:44:03.000 +0800","version_description":"We've increased the amount of questions available in the limited, free version! We also streamlined the Dashboard to help new users easily navigate and get to studying faster. As with all of our updates, we squashed some bugs and made the app more reliable. Please be sure to rate the app when prompted, which can now be done in a few simple taps. Thanks for studying with Pocket Prep!"},{"version_id":"825326217","version_name":"6.5","version_date":"","version_description":""},{"version_id":"825326217","version_name":"6.4","version_date":"2017-12-19 17:26:15.000 +0800","version_description":"This update includes a host of optimizations to ensure the smoothest study experience possible. Here are a few noteworthy ones:<br>- 100 new questions for 2018 testing<br>- Reset your history and progress through the Settings menu<br>- Tell us how you did on your exam when the day finally comes<br>- Access Exam Builder quickly via the Dashboard<br>- Sync your progress with our new web app<br>- Optimizations for iPhone X and iOS 11<br>- Bug fixes and speed improvements"},{"version_id":"826127132","version_name":"6.5","version_date":"","version_description":""},{"version_id":"826638533","version_name":"6.5.2","version_date":"2018-04-13 22:04:26.000 +0800","version_description":"Bug fixes and performance improvements."},{"version_id":"827111218","version_name":"6.5.3","version_date":"2018-05-11 16:08:03.000 +0800","version_description":"- Fixed a few crashes that were affecting some users<br>- Added compatibility for our new Bulk Purchase program"},{"version_id":"827464117","version_name":"6.5.4","version_date":"2018-06-08 20:15:51.000 +0800","version_description":"We've completely restructured how the app communicates with our cloud, drastically improving load times and overall performance. Let us know what you think of the improvements by leaving a review here in the App Store. We appreciate your support!"},{"version_id":"828180029","version_name":"6.5.5","version_date":"2018-08-25 13:03:12.000 +0800","version_description":"We've made some changes to the app's color scheme and UI, which we think you'll love! This update is far from just cosmetic; we've made a host of improvements to keep the app running as smoothly as possible. Here are a few of the most noteworthy:<br><br>- Updated UI and color theme elements<br>- QOTD improvements to ensure consistent delivery<br>- Addressed repeating questions in certain situations<br>- Multiple offline mode &amp; cloud sync optimizations<br>- Several bug fixes and quality of life improvements<br><br>Let us know what you think of this new version by leaving a review here in the App Store. Thanks for studying with Pocket Prep!"},{"version_id":"828521373","version_name":"6.5.6","version_date":"2018-09-10 23:14:46.000 +0800","version_description":"- Fixed a bug affecting the restore purchase function"},{"version_id":"828974696","version_name":"6.7","version_date":"2018-11-26 22:22:54.000 +0800","version_description":"- Refreshed onboarding for new customers<br>- New pricing options and study plans<br>- Bug fixes and performance improvements"},{"version_id":"830843816","version_name":"6.7.3","version_date":"2019-05-04 16:35:47.000 +0800","version_description":"We love our users, especially those of you that study around the clock. Previously, the more you studied, the slower the Exam Readiness section was to load. Not anymore! Now, it loads even for the most studious of users. Keep working hard towards passing your exam and we will continue to improve the app for you!<br><br>- Major bug fixes and performance improvements<br>- Misc. optimizations"},{"version_id":"833388821","version_name":"6.7.6","version_date":"2019-10-31 13:02:15.000 +0800","version_description":"Just in time for Halloween, we have fixed the 'possessed' slider bar as well as a 'host' of other issues that users were having.<br>Thanks for your feedback and best of luck on your studies.<br>The Pocket Prep team."},{"version_id":"836081776","version_name":"6.7.9","version_date":"2020-06-24 22:42:55.000 +0800","version_description":"Pocket Prep has been working hard on a brand new application.  This update allows us to more easily transfer you to the new app.  If you have upgraded to the Premium Plan, you will still have that access in the new application.<br><br>If you have any trouble, we have also updated our in app help center.  Please visit Settings -&gt; Feedback &amp; Support -&gt; Help &amp; Message Center and one of our team members will help you directly."}]