[{"version_id":"811934589","version_name":"1.7","version_date":"2015-03-06 01:20:02.000 +0800","version_description":"Stability fixes.<br>General performance improvements."},{"version_id":"813063033","version_name":"2.1","version_date":"2015-08-26 07:34:26.000 +0800","version_description":"This update contains many improvements and critical fixes. We've implemented new features from your feedbacks:<br><br>1. Added white theme. Now you can select themes in Settings-&gt;User Interface section.<br>2. Added offline tracks filter in Music Library section. Now you can select offline tracks in one click.<br>3. Added Dropbox login using native app. Now you don’t need to enter your Dropbox credentials manually when you connect a storage.<br><br>Also we’ve fixed critical issues:<br> <br>1. Box session expiration - FIXED.<br>2. SMB crash in offline mode - FIXED.<br>3. Slow performance and scrolling - FIXED.<br>4. Songs not playing offline when downloaded - FIXED."},{"version_id":"815305532","version_name":"2.2","version_date":"2016-03-19 20:52:54.000 +0800","version_description":"1. Selective sync.<br>2. Mega Cloud storage.<br>3. Genres.<br>4. Last media position saving.<br>5. WiFi-Drive.<br>6. All bookmarks view.<br>7. Recents.<br>8. New modern UI.<br>9. SMB fixes and available shares discovering.<br>10. Metadata autocorrect."},{"version_id":"817167420","version_name":"2.3","version_date":"2016-05-27 06:27:49.000 +0800","version_description":"Fixed player performance<br>Fixed files downloading<br>Fixed player scrubbing<br>Fixed next player item loading <br>Fixed MEGA cloud storage<br>Implemented Music Library Sync and Metadata update in the background<br>Fixed SMB Streaming"},{"version_id":"817678148","version_name":"2.4","version_date":"2016-06-09 20:26:00.000 +0800","version_description":"Added Chinese language;<br>Added Spanish language;<br>Fixed duplicate files when you listen to your music from SMB storage;<br>Fixed Cloud/Local Files filter in Music Library section;<br>Fixed memory leaks;<br>Fixed media position saving when you open another music app;"},{"version_id":"817753399","version_name":"2.5","version_date":"2016-06-14 17:44:15.000 +0800","version_description":"Fixed issues;<br>Improved music player performance;"},{"version_id":"818227833","version_name":"2.6","version_date":"2017-01-12 23:25:10.000 +0800","version_description":"iOS 9 Features:<br><br>- Quick Actions. <br>Quick Actions let you do the things you do most often faster and in fewer steps. You can play all tracks, search for favorite song with a single press, right from the&nbsp;Home screen.<br><br>- Core Spotlight.<br>Find your favorite songs in the Spotlight Search and, if you tap one of those search results, the app gets launched and the song start playing.<br><br>Other Features:<br>- Play all songs.<br>Now you can play all songs from your Music Library in one tap.<br><br>- Tag Editor.<br>Edit the most popular music tags: \"Title\", \"Artist\", \"Album\", \"Year\", \"Comment\", \"Track Number\", \"Genre\" or let the system fill this info automatically by tapping “Identify” button.<br><br>We also fixed issues from your feedbacks, thanks for support.<br><br>Your Everappz Team."},{"version_id":"820718324","version_name":"2.8","version_date":"2017-04-23 19:28:11.000 +0800","version_description":"- New cloud storages: MediaFire, MyDrive, pCloud, HiDrive.<br>- Playback fixes.<br>- New Google Drive Auth.<br>- UI fixes and improvements."},{"version_id":"822003296","version_name":"2.9","version_date":"2017-06-29 18:37:48.000 +0800","version_description":"Improved player performance;<br>Minor UI fixes;<br>Dropbox fixes;"},{"version_id":"822748930","version_name":"3.0","version_date":"2017-10-06 21:50:55.000 +0800","version_description":"New Features:<br>iPod library;<br>Player queue;<br>Repeat stop option;<br>Passcode protection;<br>Mini player view;<br>iPad full screen player view;<br>Open in and tags editor for online files;<br>Confirmation alert for all files delete operations;<br>Artist albums;<br>Rewind and fast forward timeout;<br>Each song on the playlist can be quickly pushed to the top of the list;<br>Language selection;<br>Changing number of items per page;<br>New themes;<br><br>Fixes:<br>Fixed music library scanning;<br>Fixed unable to add second Google Drive account;<br>Fixed performance;<br>Fixed player buffering;<br>Fixed when I start a playlist in random mode it always start with the same song;<br>Fixed songs sorting in music library;<br>Fixed invalid certificates;<br>Fixed pCloud connection;<br>Fixed equalizer issues;<br>Fixed localization issues;"},{"version_id":"827295965","version_name":"3.1","version_date":"2018-06-18 21:05:17.000 +0800","version_description":"The main feature in this update is crossfade playback. Now all your songs are playing continuously. There is no pause between songs during switching. You can change crossfade duration or turn it off in settings. Another great feature is new music library. We changed music library section so it looks more clear and it's easy to find all needed songs, albums, artists in it. We also added new sorting function and now you can sort songs in your music library or playlist by name, size, song number, album, artist. New audio player and metadata reader will update your songs metadata very quickly. You can increase speed of metadata loading in settings. With network accounts editing feature you can edit configuration for connected network accounts. This is very useful when you change login information for your cloud storage and you need to update it in the application. Added music library backup - now you can backup all your music library with playlists, songs, album artworks and application settings to the cloud storage and restore it from there. Added grid view and thumbnails for file manager. Added full iPod library support including playlists, albums, genres, artists. Added  audio player queue managing. Improved audio tags editor so now 'Identify' action works more predictable. Fixed Dropbox authorization screen."},{"version_id":"827909424","version_name":"3.2","version_date":"2018-07-26 15:24:23.000 +0800","version_description":"Fixed application performance.<br>Fixed minor issues.<br>Fixed user interface."},{"version_id":"828060825","version_name":"3.3","version_date":"2018-09-22 00:09:38.000 +0800","version_description":"Fixed Google Drive authorization<br>Fixed application crash when you activate passcode<br>Fixed unable to play some songs in iPod music library<br>Fixed use file names instead of audio tags<br>Fixed Tags Editor<br>Added User Guide<br>Added FLAC support<br>Added ZIP and RAR support<br>Added folders importing from another applications"},{"version_id":"829096130","version_name":"3.4","version_date":"2018-11-09 23:00:30.000 +0800","version_description":"Added DLNA support. Now you can connect any personal cloud storage that supports DLNA technology. Application will scan your NAS and all supported audio files will appear on your device.<br>Fixed FLAC files for Google Drive and Box.<br>Fixed Wi-Fi Drive upload issues.<br>Added playback speed control for Google Chromecast.<br>Fixed localization issues.<br>Fixed streaming to Google Chromecast devices. <br>Improved Airplay streaming.<br>Added audio equalizer and playback speed control for AirPlay.<br>Fixed audio volume slider.<br>Fixed user interface for devices with large screen size.<br>Added SONOS support via AirPlay2."},{"version_id":"830078980","version_name":"3.5","version_date":"2019-01-28 14:48:03.000 +0800","version_description":"Fixed OneDrive authorization;<br>Added OneDrive for business;<br>Fixed album artworks;<br>Minor UI fixes;"},{"version_id":"830890846","version_name":"3.6","version_date":"2019-04-07 20:32:38.000 +0800","version_description":"New features:<br><br>CarPlay Support. CarPlay is a smarter, safer way to use your iPhone in the car. Now you can see content from this application on your car’s built-in display. You can listen to your favorite music and stay focused on the road.<br><br>VoiceOver Support. VoiceOver is a gesture-based screen reader that lets you enjoy using iPhone even if you don’t see the screen. Hear a description of everything happening on your screen. We added text labels and hints to all user interface components and now you can enjoy your favorite  audio player with full support of VoiceOver.<br><br>Custom Audio Equalizer Configurations. We added possibility to save custom audio equalizer configurations and they will appear on the top of the list above the built-in settings.<br><br>Mixed Output Mode for Audio Player. Now you can mix audio from this application with audio from other applications on your iPhone. Open settings -&gt; audio player- &gt; general -&gt; audio output mode. <br><br>Continue playback. With this feature you can restore audio player state that was active before you close the app. Just tap and hold PLAY button and audio player state will be restored automatically. This feature is useful for audiobooks and lectures. Just open application settings -&gt; audio player -&gt; general -&gt; save audio player state -&gt; enabled<br><br>Album artworks editing. We implemented album artworks editing for your audio files (FLAC, MP3, AIFF) and playlists. <br><br>iCloud Drive. Now you can import music from iCloud and other applications.<br><br>Fixes:<br><br>Fixed audio player queue.<br>Fixed user interface issues.<br>Fixed songs playback.<br>Fixed localization issues;<br>Fixed FLAC streaming from Windows Media Server.<br>Fixed authorization for MEGA cloud storage.<br>Fixed content sorting ascending and descending.<br>Fixed audio tags reading for AIFF files.<br>Fixed connection for Windows 10 and DLNA.<br>Fixed now playing song in edit mode.<br>Fixed audio bookmarks.<br>Fixed album artworks."},{"version_id":"831632796","version_name":"3.7","version_date":"2019-09-19 20:28:21.000 +0800","version_description":"CarPlay perfomance fixes.<br>User interface fixes.<br>General application perfomance fixes.<br>Added new option for Metadata reading in application Settings. Now you can enable metadata reading only for currently playing song in audio player queue.<br>Fixed OneDrive upload operaion.<br>Fixed \"Unable to play music\" message.<br>Fixed FLAC files playback for QNAP DLNA Media Server and PLEX.<br>Fixed 2 step verification for MEGA cloud service.<br>Fixed Yandex.Disk authorization."},{"version_id":"832860643","version_name":"3.8","version_date":"2019-10-18 18:21:23.000 +0800","version_description":"Added iXpand Flash Drive Support. Now you can listen to your music from the one of the most popular usb flash drive.<br>Fixed user interface for iOS 13.<br>Performance improvements.<br>Fixed synchronization issues.<br>Fixed localization.<br>Fixed audio playback for bluetooth headphones.<br>Fixed FLAC files streaming."},{"version_id":"833270220","version_name":"3.9","version_date":"2019-11-12 22:46:15.000 +0800","version_description":"Added WDMyCloudHome support - now you can listen to your music from the one of the most popular personal NAS;<br>User interface fixes;<br>Performance fixes;<br>Fixed playback issues with DLNA;<br>Added sorting for playlists;"},{"version_id":"833635832","version_name":"4.0","version_date":"2020-02-24 20:12:48.000 +0800","version_description":"- Fixed FILES.APP support.<br>- Added COMPUTERS folder for Google Drive. <br>- Fixed OneDrive for Business.<br>- Added missing languages.<br>- Fixed audio tags editor.<br>- Fixed user interface issues.<br>- Fixed issues from your emails."},{"version_id":"834857411","version_name":"4.1","version_date":"2020-03-17 00:06:17.000 +0800","version_description":"We constantly update EVERMUSIC_PRO to provide the best user experience for you.<br><br>In this version we fixed issues from your emails.<br>We also implemented new features.<br><br>We fixed user interface for devices with small screen size. Thanks everyone who reported this issue and send us screenshots.<br>We fixed files import from external applications. <br>We implemented album covers editing not only for audio playlist but for genre, album and artist also.<br>We also optimized battery usage. <br>We fixed application performance.<br>We fixed network connection for Time Capsule.<br>We also fixed synchronization for audio playlists.<br>Data backup &amp; restore feature was improved also.<br>We fixed playback for audio files which contains high resolution album covers. Thanks everyone who send us demo files so we were able to reproduce and fix that issue.<br><br>Thanks everyone who use our application every day and send us feedbacks and suggestions! We read all your emails."},{"version_id":"835210402","version_name":"4.2","version_date":"2020-03-27 13:30:33.000 +0800","version_description":"We constantly update EVERMUSIC PRO to provide the best user experience for you.<br>In this version we fixed performance."},{"version_id":"835542357","version_name":"4.3","version_date":"2020-11-03 23:54:28.000 +0800","version_description":"Hi everyone, <br>in this update we processed thousands of your emails and implemented new features you asked for.<br><br>- Added CUE and M3U playlists. Now you can start audio player with external playlists in CUE or M3U format. <br>- Added possibility to import external files located on your device to the music library without copying them to the application.<br>- Added support for album artworks located in the music folder. Now you can put album artwork to the music folder and application will find and use it. <br>- Fixed sorting by disk number.<br>- Fixed embedded album artworks not showing in the app.<br>- Fixed MYCLOUDHOME connection problems.<br>- Fixed user interface issues."},{"version_id":"839631822","version_name":"4.4","version_date":"2020-12-15 23:43:16.000 +0800","version_description":"We constantly update application to provide the best user experience for you.<br>Added offline mode for connected cloud services.<br>Fixed songs sorting for albums located on DLNA server.<br>Fixed Chromecast devices discovery."},{"version_id":"839754184","version_name":"4.5","version_date":"2020-12-26 17:59:51.000 +0800","version_description":"We constantly update application to provide the best user experience for you.<br>In this version we added folder selection for Files.app.<br>Fixed WDMyCloudHome connection.<br>Fixed WebDAV connection."},{"version_id":"841595667","version_name":"4.6","version_date":"2021-04-23 02:59:54.000 +0800","version_description":"Hello everyone in this version we fixed issues from your feedbacks.<br><br>Improved user interface for iPad.<br>Fixed user interface issues.<br>Fixed toolbar actions.<br>Implemented context menu.<br>Fixed AirPlay playback.<br>Improved metadata scanning.<br>Fixed local files sorting.<br>Improved search for local files.<br>Fixed MyCloudHome connection.<br>Fixed OneDrive 2FA connection."}]