[{"version_id":"811836716","version_name":"1.4","version_date":"","version_description":""},{"version_id":"814422199","version_name":"2.3","version_date":"2015-11-12 03:16:53.000 +0800","version_description":"We're launching a powerful new way to search for GIFs that helps you drill into your interests: explore related terms while searching to find your perfect GIF for the moment.<br><br>We're celebrating the new feature with a Hunger Games takeover! In partnership with Lionsgate, we're bringing you the best Mockingjay Part 2 GIFs so you can share all the feels you have for the final movie. Search #hungergames and tap the tags to find your favorites."},{"version_id":"815656874","version_name":"2.4","version_date":"2016-01-05 23:13:37.000 +0800","version_description":"Introducing multi-tap GIF-sharing! Share several GIFs at a time with just one tap. Once you tap on a GIF, keep tapping other GIFs you would like to share.<br><br>Annoyed when a friend bails on you? Show them how you feel by sending not one, but four disappointed GIFs in a row."},{"version_id":"816081484","version_name":"2.5","version_date":"2016-01-21 08:01:16.000 +0800","version_description":"- GIF Captions are here! After you tap to send, you can choose to add text to your GIF in seconds. <br><br>- Awesome new GIFs from #KungFuPanda<br><br>- Full sized GIFs are back! Hold down on any GIF to find the option send the larger version.<br><br>- GIF Keyboard is powered by the Riffsy API. Developers - visit api.riffsy.com to integrate into your own app or service."},{"version_id":"816451061","version_name":"2.6","version_date":"2016-02-23 20:34:08.000 +0800","version_description":"- GIF Keyboard is now faster<br><br>- Don’t forget GIF Captions: after you tap to send, you can add text to your GIF in seconds. <br><br>- GIF Keyboard is powered by the Riffsy API. Developers - visit api.riffsy.com to integrate into your own app or service."},{"version_id":"816963170","version_name":"2.7","version_date":"2016-04-20 17:24:06.000 +0800","version_description":"- When you copy a GIF you can see the user who has uploaded it. Tap the GIF again to see all of the GIFs they've uploaded or search @username to find their GIFs. <br><br>- Tap the search bar to explore current trending tags.<br><br>- Now you can upload multiple GIFs at once from your camera roll. Try it out in the app!"},{"version_id":"817808654","version_name":"2.8","version_date":"2016-06-21 19:09:49.000 +0800","version_description":"We’ve updated the share extension so now you can upload GIFs from more places. Give it a shot in any app with GIFs!. Don’t know about our share extension? It lets you add GIFs you find in the other apps directly to your keyboard. Check out the menu in the main app if you need help setting up the share extension.<br><br>Also, try holding down on a GIF to copy the larger version.<br><br>Have feedback or features you’d like to see? Email us at support@riffsy.com"},{"version_id":"817959287","version_name":"2.9","version_date":"2016-07-05 21:17:43.000 +0800","version_description":"General improvements and bug fixes.<br><br>Try double tapping a GIF you love to add it to your favorites or a custom collection. Then you can find them instantly by tapping the profile icon. <br><br>Have feedback or features you’d like to see? Email us at support@riffsy.com"},{"version_id":"818372105","version_name":"2.10","version_date":"2016-08-05 20:17:03.000 +0800","version_description":"Your uploaded and favorited GIFs now show up in search, making it even easier to find and share the GIFs you love."},{"version_id":"818510342","version_name":"2.11","version_date":"2016-08-19 21:20:45.000 +0800","version_description":"We’re excited to introduce our new name - Tenor - add tone to your conversation. Check out tenor.co to learn more."},{"version_id":"818761320","version_name":"3.0","version_date":"2016-09-12 22:00:41.000 +0800","version_description":"We’ve added a brand new iMessage app for iOS 10! Check out these new features - <br><br>* Create Stickers - Press and hold on any GIF to create a sticker that you can drag and drop onto any photo or message in iMessage.<br>* Capture GIFs - Create your own GIFs with your front or back camera and personalize them with text, a handwritten note or drawings. Share instantly or save to a Pack.<br>* Packs - Create packs of your favorite stickers and GIFs that you can easily share with friends and family. <br>* Syncs with GIF Keyboard - Everything syncs to your Tenor GIF Keyboard so you can take your stickers and GIFs everywhere. <br><br>We’ve also given the Tenor GIF Keyboard app a new look. Now you can easily access your profile, upload GIFs, and browse and add GIFs to your packs. Tap the icon from your home screen to check it out."},{"version_id":"818877896","version_name":"3.01","version_date":"2016-09-17 13:01:56.000 +0800","version_description":"Check out our new iMessage app for iOS 10! Open up our main app for installation help.<br><br>Here are some of the new features we’ve added -<br><br>- Create Stickers - Press and hold on any GIF to create a sticker that you can drag and drop onto any photo or message in iMessage. You can also now generate stickers directly after using the camera.<br>- Capture GIFs - Create your own GIFs with your front or back camera and personalize them with text, a handwritten note or drawings. Share instantly or save to a Pack.<br>- Packs - Create packs of your favorite stickers and GIFs that you can easily share with friends and family. <br>- Syncs with GIF Keyboard - Everything syncs to your Tenor GIF Keyboard so you can take your stickers and GIFs everywhere.<br><br>We've also made some improvements in order to provide a better experience in Tenor.<br><br>If our new GIF Keyboard for iMessage app isn't loading for you try deleting and reinstalling the app. <br><br>If your keyboard no longer shows up when you tap on the globe, you'll need to go into your settings and reinstall the keyboard<br><br>Having trouble with collections or logging in? Email support@tenor.co and we will help you resolve the issue!"},{"version_id":"819124494","version_name":"3.1.1","version_date":"2016-10-04 17:19:47.000 +0800","version_description":"We’ve added content flagging options, and rolled-out bug fixes. For people who had trouble logging into their accounts - there’s now a “forgot password” button that will let you reset it. We’ve also made it easier to access our main application to browse, search, upload and view your profile.<br><br>Finally - a small surprise awaits if you search for “happy birthday” in our new iMessage app :-)<br><br>If you have any feedback or questions please email us at feedback@tenor.co"},{"version_id":"820050860","version_name":"3.2","version_date":"2016-12-17 18:02:32.000 +0800","version_description":"We’ve made packs easy to create and share with your friends! Your friends can subscribe to your packs and share all the GIFs you’ve added. <br><br>Have feedback, questions, or suggestions? Email us at feedback@tenor.co."},{"version_id":"820741715","version_name":"3.3","version_date":"2017-01-30 23:23:11.000 +0800","version_description":"Following is here! Tap on a username to view someone's profile and follow them. GIFs from people you follow will show up at the top of your search results. <br><br>Have feedback, questions, or suggestions? Email us at feedback@tenor.co."},{"version_id":"821202209","version_name":"3.4","version_date":"2017-03-07 18:28:26.000 +0800","version_description":"Improved reliability of collections and login to make sure your GIFs are always there when you need them.<br><br>You can now share GIFs in WhatsApp! Copy and paste any GIF into a WhatsApp message to give it a shot.<br><br>We've also created the ability to signup for an account using your Facebook login. You can signup by opening the main app and tapping the profile icon in the bottom right corner."},{"version_id":"822007949","version_name":"3.5","version_date":"2017-05-04 19:07:38.000 +0800","version_description":"- Fixing bugs and optimizing performance to improve your GIF sharing experience."},{"version_id":"822744663","version_name":"4.0","version_date":"2017-07-06 19:03:49.000 +0800","version_description":"GIF Keyboard has received a facelift! Every interface in the app has been reimplemented, making the app faster and easier than ever before.<br>We have also improved the quality of the GIFs. They will appear larger and more crisp for you and your friends!"},{"version_id":"823180509","version_name":"4.1","version_date":"2017-09-01 17:32:17.000 +0800","version_description":"HD GIFs! Tenor now supports higher quality GIFs.<br><br>Better, faster captioning. Adding a custom caption has never looked so good.<br><br>Easier uploading. It’s more effortless than ever to add your own favorite GIFs to Tenor.<br><br>Follow your friends. Find your friend’s GIFs faster than ever before — search for their profile and give them a Follow.<br><br>Stickers in Messages. Stickers are back, and better than ever in Messages."},{"version_id":"823702767","version_name":"4.2","version_date":"2017-09-19 02:08:05.000 +0800","version_description":"We've overhauled Tenor's GIF Keyboard iMessage app for iOS 11. <br><br>Improvements include:<br>* Your iMessage GIF Keyboard is much faster, more reliable, and now supports HD GIFs<br>* Captioning is available in your Tenor iMessage app, along with easier favoriting and sticker creation<br>* Fast access to your profile, uploads, and favorites within your Tenor iMessage app <br>* Better GIF search, making finding the perfect GIF even easier<br><br>Finally, in iOS 11, Tenor is always one-tap away at the bottom of every iMessage conversation. Drag the blue Tenor \"GIF\" icon to the left side of your iMessage tray so it's always available."},{"version_id":"824379541","version_name":"4.3","version_date":"2017-11-16 17:15:59.000 +0800","version_description":"GIF Captioning is now better than ever!<br>- You can now position your captions anywhere on the GIF.<br>- Increase or decrease the size of your captions quickly and easily.<br><br>Includes various bug fixes and speed improvements to help you share GIFs easily."},{"version_id":"825347347","version_name":"4.5.1","version_date":"2018-03-26 22:35:36.000 +0800","version_description":"We have fixed a crash that could occur after sharing in the keyboard extension, as well as a few other issues and bugs. Thank you for sending in feedback -- it's invaluable and helps us make the app better for you!"},{"version_id":"825347347","version_name":"4.4","version_date":"2017-12-18 23:04:51.000 +0800","version_description":"- We improved GIF captioning, making the whole process easier and faster. Make your GIFs more personal by adding a caption in a matter of seconds!<br>- We have optimized the Keyboard Extension! It should run more quickly and reliably than ever before.<br>- Your favorites are now even easier to access in Messages. Access them easily by tapping the Favorites button on the GIF Keyboard Messages Extension launch screen."},{"version_id":"826262894","version_name":"4.5","version_date":"2018-03-13 22:02:34.000 +0800","version_description":"Local Tagging - Add tags to any content you view in GIF Keyboard! Content with tags will appear first in your search results.<br>Tenor Insights - See your most popular uploads and total shares from your Tenor account! Check it out in the activity stream."},{"version_id":"826427117","version_name":"4.5.1","version_date":"2018-03-26 22:35:36.000 +0800","version_description":"We have fixed a crash that could occur after sharing in the keyboard extension, as well as a few other issues and bugs. Thank you for sending in feedback -- it's invaluable and helps us make the app better for you!"},{"version_id":"828036542","version_name":"4.6","version_date":"2018-08-16 21:24:44.000 +0800","version_description":"- Sharing options have been streamlined and updated.<br>- Fixing a number of bugs related to searching and Facebook login."},{"version_id":"828599805","version_name":"4.10","version_date":"2019-10-16 17:23:46.000 +0800","version_description":"Even more stickers! Tenor is continuing to make improvements to our stickers library. Try searching for your favorite terms in the Messages Extension and tap, peel, and share stickers in all of your chats!<br><br>In addition, we've made a few other changes:<br>- We've removed the \"following\" feature from the app.<br>- Fixed an issue with Facebook Login<br>- Fixed numerous other crashes in the Keyboard extension and the Messages Extension<br><br>Thank you for using GIF Keyboard!"},{"version_id":"828599805","version_name":"4.7","version_date":"2018-09-17 19:03:56.000 +0800","version_description":"GIF Keyboard is introducing a brand new stickers extension! Enhance your photos and videos by searching for and inserting fun animating content on the fly. The stickers also track your face and movement. Available on iOS 12 in iMessage and Facetime.<br><br>We've also fixed a number of bugs and crashes based off of your feedback."},{"version_id":"828599805","version_name":"4.9","version_date":"2019-06-24 19:51:49.000 +0800","version_description":"Tenor is introducing Sticker search in the Messages Extension!<br><br>A vast library of fun stickers are now available at your fingertips. Open the messages extension, search for a term, and share stickers with all of your friends. Hold down on a sticker to peel and drag it into your messages conversations.<br><br>In addition to stickers, we've fixed a few crashes and bugs to keep the app performing smoothly."},{"version_id":"828599805","version_name":"4.8","version_date":"2019-04-02 16:27:57.000 +0800","version_description":"We’ve made big improvements to our Camera Effects extension. We’re now providing more stickers than ever before — open up the camera in Messages and share stickers on your photos, videos, and in FaceTime!<br><br>We’ve also fixed a few visual bugs and crashes on newer iPhones."},{"version_id":"830431165","version_name":"4.8","version_date":"2019-04-02 16:27:57.000 +0800","version_description":"We’ve made big improvements to our Camera Effects extension. We’re now providing more stickers than ever before — open up the camera in Messages and share stickers on your photos, videos, and in FaceTime!<br><br>We’ve also fixed a few visual bugs and crashes on newer iPhones."},{"version_id":"831631613","version_name":"4.9","version_date":"2019-06-24 19:51:49.000 +0800","version_description":"Tenor is introducing Sticker search in the Messages Extension!<br><br>A vast library of fun stickers are now available at your fingertips. Open the messages extension, search for a term, and share stickers with all of your friends. Hold down on a sticker to peel and drag it into your messages conversations.<br><br>In addition to stickers, we've fixed a few crashes and bugs to keep the app performing smoothly."},{"version_id":"833096865","version_name":"4.10","version_date":"2019-10-16 17:23:46.000 +0800","version_description":"Even more stickers! Tenor is continuing to make improvements to our stickers library. Try searching for your favorite terms in the Messages Extension and tap, peel, and share stickers in all of your chats!<br><br>In addition, we've made a few other changes:<br>- We've removed the \"following\" feature from the app.<br>- Fixed an issue with Facebook Login<br>- Fixed numerous other crashes in the Keyboard extension and the Messages Extension<br><br>Thank you for using GIF Keyboard!"},{"version_id":"834768179","version_name":"4.11","version_date":"2020-02-27 20:11:30.000 +0800","version_description":"Tenor now supports Google Sign In!<br><br>If you have a Tenor profile, you can link a Google account to that profile. After linking, you’ll be able to access your uploaded content and favorite GIFs with Google. Start the linking process from profile settings within the GIF Keyboard app. Don’t have a Tenor profile yet? Create one more easily than ever with your Google account.<br><br>In addition, we’ve improved stickers in the Messages Extension — more stickers are available for a wider variety of search terms. Share your favorite stickers by dragging and dropping them into your Messages chats.<br><br>Lastly, we’ve fixed a number of crashes and bugs in the Keyboard Extension and Messages Extension.<br><br>If you have any issues with the app or with your Tenor profile, please send us a note at support@tenor.com. We will help get the issue resolved as quickly as possible.<br><br>Thank you for using GIF Keyboard!"},{"version_id":"835908727","version_name":"4.12","version_date":"2020-07-06 20:19:39.000 +0800","version_description":"We're making a few updates to GIF Keyboard to ensure that the app works as intended on iOS 13. The updates are entirely behind the scenes, so there shouldn't be any noticeable changes for you, aside from the app being more stable.<br><br>Similarly, we've fixed some crash bugs that were affecting all iOS versions. Specifically, the app could crash when: <br>1. Typing out search terms for GIFs.<br>2. Tapping on GIFs in the Messages Extension.<br><br>Thank you for using GIF Keyboard. Email us at support@tenor.com if you have any feedback to share."},{"version_id":"837029814","version_name":"4.13","version_date":"2020-08-25 19:57:59.000 +0800","version_description":"This is a minor release that fixes a crash in our messages extension. We observed that some users were unable to launch the extension after our last update. This new version should resolve that bug.<br><br>Thank you for the bug reports and also, thank you for using GIF Keyboard!"},{"version_id":"837838496","version_name":"4.14","version_date":"2020-09-23 20:02:47.000 +0800","version_description":"We're updating our app to be more compatible with the new iOS 14.<br><br>The changes are mostly behind the scenes -- we've fixed issues to ensure that sharing GIFs from the keyboard extension and messages extension functions properly. Additionally, we've made slight modifications to the upload flow, adjusting for some new iOS 14 settings and features.<br><br>If you run into bugs, please contact us at support@tenor.com. We value your feedback. Thank you for using GIF Keyboard!"},{"version_id":"839434761","version_name":"4.15","version_date":"2020-12-15 21:33:17.000 +0800","version_description":"This new release has two core changes.<br><br>First, we’ve fixed a crash that occurs when adding captions to GIFs. Captioning in both the keyboard and messages extensions should now function more reliably.<br><br>Second, Facebook Login is no longer supported. If you used Facebook to access your Tenor profile in the past, simply follow the instructions in GIF Keyboard’s sign in flow. All of your profile details, like uploads and favorites, will remain intact and easily accessible.<br><br>Thank you for using GIF Keyboard. If you have any questions or further feedback, please contact us at support@tenor.com."},{"version_id":"840588054","version_name":"4.16","version_date":"2021-02-24 20:01:22.000 +0800","version_description":"This update makes some improvements to a few core flows in the app.<br><br>- We've made improvements to uploading -- GIF Keyboard now provides album selection, making it easier to find that GIF you want to upload.<br>- We've made some improvements to search results and speed -- GIF Keyboard will deliver great results for your searches more quickly than ever before.<br><br>Thank you for using GIF Keyboard. Please contact support@tenor.com if you run into issues or bugs."},{"version_id":"840666097","version_name":"4.16.1","version_date":"2021-03-08 20:48:34.000 +0800","version_description":"Our previous release had a few minor bugs -- this release fixes all of those.<br><br>Thanks for the bug reports and for using GIF Keyboard!"},{"version_id":"841345446","version_name":"4.16.2","version_date":"2021-04-15 19:16:51.000 +0800","version_description":"This is a minor release that fixes a few bugs and crashes in the app.<br><br>Thank you for using GIF Keyboard!"},{"version_id":"842102076","version_name":"4.16.3","version_date":"2021-05-18 19:29:47.000 +0800","version_description":"This is a minor release that fixes a few issues with the \"insights\" features in the containing app and messages extension.<br><br>Thank you for using GIF Keyboard."},{"version_id":"842572402","version_name":"4.16.4","version_date":"2021-06-15 20:57:37.000 +0800","version_description":"This release fixes a minor crash certain users faced while searching in various languages.<br><br>Thank you for using GIF Keyboard!"},{"version_id":"843031187","version_name":"4.16.5","version_date":"2021-07-12 20:24:37.000 +0800","version_description":"We've made some minor improvements to search to ensure that GIF Keyboard delivers great content for your search terms.<br><br>Thank you for using GIF Keyboard!"}]