[{"version_id":"813915132","version_name":"2.3.07","version_date":"2015-10-20 16:27:43.000 +0800","version_description":"* Fixed a bug where audio wasn't playing on some devices running iOS 9."},{"version_id":"813941330","version_name":"2.3.07","version_date":"2015-10-20 16:27:43.000 +0800","version_description":"* Fixed a bug where audio wasn't playing on some devices running iOS 9."},{"version_id":"815499437","version_name":"ermöglicht es Benutzern","version_date":"","version_description":""},{"version_id":"815499437","version_name":"3.0.19","version_date":"2016-01-13 16:09:58.000 +0800","version_description":"- NEW! iPhone support. A&amp;P is now universal. Use the app on your iPad or iPhone. <br><br>- NEW! Customize the app and track your learning. Create a library of Favorites with 3D models, illustrations, animations, and notes that you need to review. Access a question-by-question assessment of quiz performance to track your understanding of the concepts. <br><br>- ALL-NEW USER EXPERIENCE! We’ve made it even easier for you to pick a lesson and move through it at your own pace. Prefer to jump around to specific topics? The new search tool makes it fast to find topics covered at various points throughout the course. <br><br>- Other enhancements: All new look and feel, plus ability to zoom into images and share content with others."},{"version_id":"818125907","version_name":"4.0.13","version_date":"2016-08-03 13:49:21.000 +0800","version_description":"- NEW! This version allows the user to set the language to English, French, German, Simplified Chinese, and Japanese. <br>- NEW! Even more content with updated 3D models. View 5,000+ structures.<br>- NEW! Higher-resolution illustrations and videos.<br><br>About Visible Body &nbsp;<br>Visible Body creates innovative, interactive 3D human anatomy and physiology content and applications. If you love the human body, you’ll love us! Doctors, professors, nurses, and students are among the people who use our apps to make learning and teaching anatomy and physiology visual and engaging. Over a million people have used our products. Founded in 1996, Visible Body also operates as Argosy Publishing. <br> <br>Contact Us &nbsp;<br>Email us at support@visiblebody.com."},{"version_id":"819209664","version_name":"4.1.11","version_date":"2016-10-20 01:13:01.000 +0800","version_description":"- Improved help menu allows users to get answers to questions even more quickly<br>- Improved Japanese font <br>- Minor corrections and bug fixes"},{"version_id":"825709023","version_name":"5.1.01","version_date":"2018-01-20 21:45:46.000 +0800","version_description":"* Bug fixes, enhancements, and minor improvements."},{"version_id":"830145737","version_name":"6.0.57","version_date":"2019-02-01 17:21:28.000 +0800","version_description":"**More than 100 new microscope images showing body tissues!<br><br>**Zoom and pan all images in full screen mode! A single tap enters full screen mode and double tapping or pinching zooms in and out.<br><br>**Optimized for the newest iPhones and iPads!<br><br>**And as always, bug fixes, enhancements, and minor improvements."},{"version_id":"830756789","version_name":"6.1.00","version_date":"2019-03-28 16:08:26.000 +0800","version_description":"Minor corrections and bug fixes"},{"version_id":"831794332","version_name":"6.2.00","version_date":"","version_description":""}]