[{"version_id":"828842094","version_name":"3.1","version_date":"","version_description":""},{"version_id":"828950266","version_name":"3.11","version_date":"2018-10-22 01:27:51.000 +0800","version_description":"Version 3.11: Fixes bug where sharing PDF or printing various lists only printed the first page.<br> <br>Version 3.1:<br>Adds ‘DECKING’ - a decking &amp; flooring estimator / calculator.<br>Decking provides material layout, quantities, costing in a convenient 1 screen view.<br>The update also removes reference to a French Version (our apologies) which while started has not been completed and was included in error.<br><br>This App it is designed for master carpenters - to save time and money in completing building construction calculations.<br><br>Note Initials values contained are examples and need to be changed to suit your regional and job requirements. Initial support is for rectangular / square shaped decks.<br><br>Decking has been added as new tab for quick access.<br>Tabs can be reorganised if required by going to the 'More' tab and pressing 'Edit'. Swipe the preferred Tabs to the tab bar at the bottom and 'Done'.<br>Older tabs will be gradually updated to the newer format based on feedback we receive.<br><br>The app requires IOS 11 or higher and is optimised for iPads &amp; iPhones - Including iPhone XS, XSMax.<br>Requires Full Screen at the moment on the iPad.<br><br>Please provide feedback on any features you would like to see added or any areas you would like to be improved - we will respond!<br>We never prompt you for a review because we know your time is valuable. <br>If you a few moments please leave a rating or if you can spare the time, please leave a review. <br>It makes a big difference to us!<br>Go to Settings-&gt;More Information-&gt; Review Us In The App Store<br><br>Version 3.0:<br>A major update with a number of new features and simpler presentation style.<br>We have added new calculators - Stud Walls, Set Out , Concrete Estimator, Converter (Length, Area, Volume).<br>Based on feedback we are changing the style from a 'spreadsheet' cell to more obvious and distinct buttons.<br>Also included are some general improvements and minor bug fixes primarily in the stand alone general calculator.<br><br>New Calculators:-<br>• Stud Wall Timber estimator, including a costing function; <br>• Setout/Timber Spacing Layout - includes insets, timber width and equal,fixed and maximum settings;<br>• Concrete estimator, including costing function - replaces Extras Tab;<br>• Convert - Allows conversion of length, area and volume. Convert between metric and US/imperial units including decimal and fractional units yards,feet &amp; inches.<br><br>The additions have been added as new tabs."}]