[{"version_id":"813302767","version_name":"2.4.0","version_date":"2015-09-24 19:00:15.000 +0800","version_description":"Updated for iOS9<br>Supports iPad Split Screen<br>Supports iPhone 6S, iPhone 6S Plus, iPad Mini 4, iPad Pro"},{"version_id":"816319742","version_name":"2.4.3","version_date":"2016-02-10 04:12:19.000 +0800","version_description":"Bugfix release 2.4.3.<br>This version brings a number of bug fixes that have been reported by you! Thanks for all the help.<br>* Fixes an issue where users could not use commas as decimal delimiter<br>* Fixes an issue where the lower end of the inHg Scale was incorrect<br>* Improves an issue where the Trend shows large spikes a lot.<br><br>And on top of that two much requested improvements:<br>* A small indicator tells you how accurate the GPS altitude was determined<br>* A tap on the center of the barometer also sets the marker"},{"version_id":"819532372","version_name":"2.5.1","version_date":"2016-11-19 12:11:13.000 +0800","version_description":"Since iOS 10.1 the barometric pressure sensor works again on iPads. This app update is NOT required to fix this issue and every old version of this app has since started working again!<br>The update fixes a bug with the trend arrow in the widget and includes some optimizations to make the app use less resources."},{"version_id":"823704209","version_name":"2.6.0","version_date":"2017-09-21 16:30:27.000 +0800","version_description":"Fixed some minor bugs and reworked the UI ever so slightly to match the new design of iOS11.<br>Introducing support for the new aspect ratio of the iPhone X."},{"version_id":"823785449","version_name":"2.6.1","version_date":"2017-09-25 22:08:51.000 +0800","version_description":"Fixed some minor bugs and reworked the UI ever so slightly to match the new design of iOS11.<br>Introducing support for the new aspect ratio of the iPhone X.<br>Fix for an issue with the new design on 4.7 inch screens set to \"zoomed\""},{"version_id":"825182663","version_name":"2.7.0","version_date":"2017-12-11 18:25:52.000 +0800","version_description":"- Changed the SET long press behaviour to support setting the marker to exact values<br>- Tap anywhere on the Barometer screen to see additional information on the marker<br>- The current marker value is now displayed as an additional line on the trend view (and disappears if marker is disabled)<br>- Trend view line color is now more transparent<br>- Some smaller bug fixes"},{"version_id":"825489575","version_name":"3.0.0","version_date":"2018-01-03 21:40:50.000 +0800","version_description":"- Introducing Apple Watch 3 support in the free version! Apple Watch 3 has a barometric air pressure sensor built in! This update introduces a stand alone watch app that shows station pressure, station altitude and sea level pressure. It includes a marker and all units known from the iOS application! At this time without historical data and as a digital display<br>- Temperature setting for the Altimeter. By adjusting the average outside temperature, the altitude formula can be more exact<br>- Small bugfixes"},{"version_id":"835121259","version_name":"4.0.2","version_date":"2020-05-09 19:58:47.000 +0800","version_description":"Updated the app for better support of iOS 13 with refined UI.<br>Support for Light and Dark Mode where applicable - keeping the original blue on the barometer page!<br>And of course some minor bugs got fixed again."},{"version_id":"838261122","version_name":"4.1.1","version_date":"2021-01-04 01:24:50.000 +0800","version_description":"* Introducing a new iOS14 Widget: See all important information right on your Home Screen at a glance - regularly updating<br>* Option to use light or dark mode permanently or keep the automatic setting based on your phones overall appearance<br>* Small bug fixes on the iOS and watchOS Apps"}]