[{"version_id":"776582713","version_name":"1.0.2","version_date":"2014-12-16 12:31:54.000 +0800","version_description":"• We’ve made it way easier to rotate objects on canvas<br>• You can rotate even more precisely with the new Rotate slider in Format &gt; Arrange<br>• A new Opacity slider to adjust brush tip opacity<br>• A new Brush Size slider to adjust the Retouch tool tip size<br>• Remastered brushes altogether to work better with styluses<br><br>A slew of fixes to preserve EXIF metadata:<br>• Image metadata is preserved when using Pixelmator Photo Editing Extension<br>• Image metadata is preserved when opening and exporting images to Photo Library<br>• Image metadata is preserved if image is opened from iCloud Drive<br><br>A bunch of fixes to improve Photo Editing Extension:<br>• Remastered Blur effect to work better<br>• Minimized extension app executable file size to lower memory footprint<br>• Removed all unnecessary resources so that extension package is even smaller<br><br>• The selection drawing performance is way better now<br>• Sharpen effect performance is greatly improved<br>• Sharpen/Soften retouching tools’ intensity is improved<br>• Selection animation now restores correctly when switching between apps<br>• Removed irrelevant warning about color profiles when exporting PNG or JPG files to Pixelmator iCloud Drive<br>• Fixed several minor memory leaks<br>• Improved app launch stability. Please upgrade to iOS 8.1.2, too. If you are still experiencing any issues, please email us at bugs@pixelmator.com.<br>• Improved compatibility with Pixelmator for Mac shapes<br>• Improved the Paint Selection tool performance<br>• Fixed possible crashing issue related to the Paint Selection tool<br>• Added Traditional Chinese localization<br><br>Some more exciting news! An awesomely delicious newsletter is getting ready for show. If you want to join the news list, subscribe here: pixelmator.com/newsletter.<br><br>If you think Pixelmator is awesome, please leave us a nice review. It’d make us feel great about our work, and it’ll help others find the app they might be looking for. Thanks!"},{"version_id":"811423098","version_name":"1.1","version_date":"2015-03-19 09:12:46.000 +0800","version_description":"• Unique watercolor painting technology allows creating real-life-looking watercolor paintings<br>• 12 new beautiful artist-designed watercolor brushes<br>• The new Color Picker now features the history of your previously used colors<br>• Use the new Color Grid in the new Color Picker to pick colors even more precisely<br>• Optimized Painting Engine gives you up to 2 times faster painting performance<br>• Now you can open 16-bit RGB, CMYK and Grayscale Photoshop image previews, as well as Photoshop images containing layer masks<br>• Insert an image as a new layer right from your iCloud Drive<br>• Use the Lock Alpha feature to paint on the non-transparent parts of a layer<br>• Preview of your brush while adjusting its settings<br>• Open and edit RAW image previews<br>• Full support for Adonit Jot Script, Jot Touch 4, Jot Touch with Pixelpoint styluses<br>• Enhanced stylus pressure sensitivity with all styluses<br><br>Attention to Detail<br>• Scale images without constraining proportions: Tools &gt; Format &gt; Arrange &gt; Constrain Proportions<br>• Invert image colors with the new Invert color adjustment preset<br>• Open PDF files from your email or any other app<br>• See precise color values while selecting colors with the Eyedropper<br>• Adjust the settings of an effect more accurately with enhanced slider sensitivity <br>• Zoom into your image while still tweaking the effect’s settings<br>• Rotate text more accurately with the new text rotation slider: Tools &gt; Format &gt; Arrange<br>• Toggle between full-screen mode more easily<br>• Optimized memory use allows to undo much faster while painting<br>• Cleaner Eyedropper Interface<br>• Refreshed look of the Gradient Picker<br>• Auto Save improvements<br>• Updated Wacom Stylus SDK for even more precise painting<br><br>Fixes:<br>• Memory leak fixes<br>• Fixed Eyedropper crashes that happened while rotating the device<br>• Fixed adding layer from Photo Stream<br>• Fixed transforming maximum-sized layers <br>• Paint freely without affecting locked or hidden layers<br>• Smoothly transform maximum-sized layers<br>• The image no longer dims when adjusting the effect’s strength<br><br>If you think Pixelmator is awesome, please leave us a nice review. It would make us feel great about our work and help others find the app they might be looking for. Thanks a lot!"},{"version_id":"812525311","version_name":"2.0.2","version_date":"2015-07-14 07:12:04.000 +0800","version_description":"We’ve redefined the performance of the Repair tool, added Dynamic Touch to all Retouch tools, improved the Photo Editing extension, and more.<br><br>• The Repair tool is now up to 5 times faster and even more precise.<br>• Dynamic Touch lets you adjust the stroke size of all Retouch tools by simply using the tip of your finger to create thin strokes and a larger surface area of your finger for thicker lines. <br>• Lots of improvements to the Photo Editing extension and more.<br><br><br>Improvements and bug fixes<br><br>• The Blur effect lets you apply more blur to your images.<br>• We’ve enhanced the look of the Pinch and Bump effects, so now they look even better.<br>• The Effects preview thumbnails of very wide images were too wide. Fixed.<br>• Now you can Cancel or Apply an effect with the settings popover open.<br>• The Clone tool now starts cloning grouped layers when and where you ask it to.<br>• The Retouch tools now work just as they should on layers with Lock Alpha on.<br>• The rhombus shape looks much more crisp.<br>• The Font Size setting had no effect on a few fonts. Fixed.<br>• The values of the Color Balance settings used to stay the same after applying Undo. Fixed.<br>• Previously, after canceling color adjustments for text, shape or grouped layers, you were still able to Undo the adjustments that you never made. Fixed.<br>• Removed Undo Image Size after creating a new Custom Image.<br>• The Replace Photo popover is now displayed properly when customizing a template at a high zoom level.<br>• We’ve made it easier to zoom the canvas into Fit and Full-Screen views.<br>• Your canvas now also fits the screen nicely after rotating the device with the Tools popover open.<br>• Browsing the Image Gallery is easier, when you can start swiping from the Name or Date labels, too.<br>• Images copied from Messages and other text-based apps are now pasted properly.<br>• Shapes with gradients created with Pixelmator for iOS look just the same on Pixelmator for Mac.<br>• Now you can see Pixelmator document thumbnails in the iCloud Drive Document Picker.<br>• Once in a while, the Photo Editing extension used to stop responding while saving changes. We found the reason and fixed it.<br>• The Photo Editing extension used to save the changes you made, even if you made no changes. Fixed.<br>• The app used to quit unexpectedly when you tried to enter Effects while editing a very wide image. Not anymore.<br>• We’ve improved the stability of the app when opening PSD documents with custom fonts.<br>• The Low Disk Space alert is now displayed only when you launch the app.<br>• Once in a while, the app used to stop responding after running in the background. Not anymore.<br>• The app would sometimes stop responding when opening an image from another app or via Handoff. We fixed this.<br><br>Improvements and fixes to Pixelmator for iPad:<br>• We’ve updated to the latest Adonit stylus SDK for a better painting experience.<br>• Replaced the Brush Tool and Eraser Tool stylus shortcut options with one Toggle Eraser option.<br>• Fixed an issue with Stylus Shortcuts, which sometimes used to perform two actions at the same time.<br>• First Writing Style was available but non-selectable. Fixed.<br><br>Other performance and stability improvements, minor bug fixes.<br><br>What’s more, now you can learn about Pixelmator for iOS from the new, complete User Manual, and from a collection of inspiring video tutorials. Visit our website to learn more."},{"version_id":"812980376","version_name":"2.1","version_date":"2015-09-23 10:00:04.000 +0800","version_description":"Pixelmator for iOS 2.1 update includes support for iOS 9, multitasking on iPad via Split View and Slide Over, 8K resolution support, Open in Place and Save to Photos features, and more.<br><br>• Pixelmator now works great on the new iOS 9.<br>• Multitasking on iPad with Split View and Slide Over lets you use Pixelmator for iPad and any other app at the same time.<br>• Open and edit images in stunning 8K resolution.<br>• Open in Place feature lets you open Pixelmator images from anywhere you want and save the changes you make in the exact same place.<br>• Save to Photos lets you open an image from Photos and save the changes you make onto the same image without creating a copy.<br>• Copy Image lets you quickly copy the entire image composition to Clipboard.<br>• San Francisco is now the new user interface font."},{"version_id":"815116723","version_name":"2.2","version_date":"2015-12-10 10:21:35.000 +0800","version_description":"Pixelmator 2.2 for iOS works great on the iPad Pro, fully supports the new Apple Pencil, adds 3D Touch support, and more.<br><br>Pixelmator now works great on the new iPad Pro<br>• Create and edit images with Pixelmator on the iPad Pro.<br>• Sketch and paint even more naturally with full Apple Pencil and palm-rejection support, as well as specially tailored brushes, featuring pressure, tilt, and acceleration sensitivity.<br>• Open and edit images up to 100 megapixels.<br><br>Pixelmator adds 3D Touch support on iPhone 6s and iPhone 6s Plus<br>• Paint with 3D Touch-sensitivity.<br>• Press firmly on the Pixelmator icon on the home screen to instantly open your Pixelmator gallery, create a new image, or open an image from Photos.<br>• Press firmly on an image in your Pixelmator gallery to quickly preview it, duplicate it, share it, copy it to Photos, or to delete it.<br><br>More great improvements and fixes<br>• A collection of artist-designed Basic brushes, including the new Pixel brush.<br>• Enhanced crop and straighten performance.<br>• Auto-straighten to straighten images with a single tap.<br>• Cropping-lines now snap to objects in your composition.<br>• Ability to increase font size up to 1000 pixels.<br>• Pixelmator is no longer the default app for opening PDF documents from iCloud Drive.<br>• Text with a shadow is now exported correctly.<br>• Performance improvements and bug fixes."},{"version_id":"815369570","version_name":"2.2.1","version_date":"2015-12-17 10:37:06.000 +0800","version_description":"This update adds Apple Pencil Tilt feature support to 30 more brushes, performance improvements and bug fixes.<br><br>• 30 more brushes now support the Tilt feature of the Apple Pencil. <br>• Distort tools work faster than before when editing large images.<br>• Applying multiple effects to large images in the Pixelmator Photos Extension works smoothly.<br>• Improved stability when opening images. <br>• The Pixelmator icon looks more crisp on the home screen of the iPad Pro. <br>• Fixed an issue where, after changing either text size or rotation, you had to close and reopen the text format popover to change the other.<br>• Fixed an issue on 3D Touch devices where the app would quit unexpectedly when using Peek and Pop in an empty Pixelmator Gallery.<br><br>Other recent improvements:<br>• Full iPad Pro support.<br>• Apple Pencil and palm-rejection support on iPad Pro.<br>• 3D Touch support on iPhone 6s and 6s Plus.<br>• A new Pixel brush, to create pixel art."},{"version_id":"817534937","version_name":"2.3","version_date":"2016-07-19 10:27:07.000 +0800","version_description":"Pixelmator 2.3 for iOS brings an incredible Quick Selection Tool, a powerful and precise Magnetic Selection Tool, features many small, but awesome improvements to the selection experience on iOS, and more.<br><br>New:<br>• The advanced Quick Selection Tool lets you make incredibly accurate selections.<br>• The smart Magnetic Selection Tool snaps precisely to the objects you trace.<br>• Many small, but awesome changes improve the selection experience on iOS.<br><br>Selection improvements:<br>• When making selections, you can now tap Invert to invert your selection.<br>• The outline of selections made with the Color Selection Tool is more precise thanks to a content-aware smoothing algorithm.<br>• The all-new marching ants design improves performance and has ants that actually march around your selections.<br>• The Color Selection Tool is now faster (especially on older devices).<br>• Added a Create New selection mode, which is now the default.<br>• A live preview of your final selection is now shown when using the Add or Subtract selection modes.<br>• You can now transform selections in the Arrange pane.<br>• Selections now snap to layers and the canvas, just like layers do (but you can turn this off by turning off Guides).<br>• Selections made with the Free Selection, Rectangle Selection, and Ellipse Selection tools now always snap to pixels, meaning there won’t be any unwanted, half-transparent pixels at the edges of a selection when you copy, delete, or transform it. <br>• The selection paths of the Free Selection Tool are now made up of twice as many points, which makes them smoother.<br>• When you open up Select with an already selected area, the selection tool that you were using previously will automatically become active.<br>• When moving a selected area, dragging inside the selection will move it, and dragging outside the selection will now pan the image.<br>• The selection outline that is added as you select with the Free Selection Tool now has a subtle animation.<br>• When making selections with the Quick Selection or Color Selection tools, the selection preview now fades into the marching ants.<br>• Tapping Undo after transforming a selected area sometimes used to make that area flicker. Fixed.<br>• When using the Free Selection Tool, quickly tapping could sometimes make really small selections instead of adding points. Fixed.<br><br>Improvements and bug fixes:<br>• Use a two finger double tap to zoom in or zoom to fit.<br>• The 9:16 aspect ratio is now in the list of ratios in Crop.<br>• The request to let Pixelmator access your Photos library wouldn’t appear if you tried to save to Photos before having opened an image from Photos – it does now.<br>• If you use Copy to Photos to save a new image to your Photos library, you’ll now be able to use Save to Photos to save over that new image.<br>• If you drag a layer that is not selected (the transform handles aren't visible) and it does not fit in the screen, the layer will not be moved. To move it – first, tap to select it.<br>• When you hold two fingers to rotate a layer but one or both fingers are outside the currently selected layer, other layers in your image will not be selected – first tap to select the layer you want to rotate, then hold two fingers inside it to start rotating.<br>• Zoom animations are a little more smooth as they now have subtle ease-out transitions.<br><br>Apple Pencil improvements and bug fixes:<br>• When using Apple Pencil, the brush size of the Quick Selection Tool is pressure-sensitive.<br>• Selections made using Apple Pencil and the Free Selection Tool are now more accurate.<br>• The transform handle area is now smaller, giving you more precision.<br><br>Pixelmator for iPhone improvements:<br>• The Select and Distort tool choosers are now laid out more symmetrically.<br>• The selection mode in the Select tool chooser is highlighted more clearly.<br>• Tapping to choose a selection mode will now close the Select tool chooser.<br><br>Pixelmator 2.3 for iOS has a bunch of other great improvements and fixes – read the full release notes at pixelmator.com/ios/updates"},{"version_id":"822868252","version_name":"2.3.1","version_date":"2017-07-26 06:26:59.000 +0800","version_description":"• The Brushes, Retouch, Distort, and Selection tool choosers were too translucent. They're now just as translucent as they need to be.<br>• The Refine Selection overlay was not disappearing after loading a new image. Fixed."},{"version_id":"823856854","version_name":"2.4","version_date":"2017-10-10 09:21:09.000 +0800","version_description":"Pixelmator for iOS 2.4 Cobalt is now fully compatible with iOS 11, adds Drag and Drop so you can move images and graphics between Pixelmator for iPad and other apps more easily than ever, includes support for importing HEIF images, and more.<br><br>• Pixelmator for iOS is now fully compatible with iOS 11.<br>• Drag and Drop support lets you move images and graphics between Pixelmator for iPad and other apps more easily than ever.<br>• Support for importing HEIF images.<br>• Pixelmator would quit unexpectedly when zooming in after starting a selection. Fixed.<br>• The composition would sometimes disappear when adding or removing layers. Fixed.<br>• Certain buttons in the Color and Format popovers would occasionally not respond to touches. Fixed.<br>• Pixelmator would sometimes stop responding after closing an image and immediately opening it again. Fixed."},{"version_id":"824471890","version_name":"2.4.1","version_date":"2017-11-20 11:39:09.000 +0800","version_description":"This update includes full support for iPhone X as well as a number of stability fixes and performance improvements."},{"version_id":"826287553","version_name":"2.4.2","version_date":"2018-03-20 12:19:10.000 +0800","version_description":"Pixelmator for iOS 2.4.2 features a number of stability improvements and bug fixes.<br><br>• Newly created Pixelmator files will now appear in the Recents tab of the Files app.<br>• The new layer popover was being displayed incorrectly in landscape on iPhone X. Fixed.<br>• The Retouch and Distort tool previews shown when adjusting the Size and Strength sliders were being displayed incorrectly in landscape on iPhone X. Fixed.<br>• Pixelmator for iOS would sometimes quit unexpectedly when trying to load user-installed fonts. Fixed.<br>• Previewing certain effects would cause the canvas to be centered incorrectly. Fixed.<br>• Editing an empty text layer would sometimes make Pixelmator for iOS quit unexpectedly. Fixed.<br>• Fixed an issue with grouping and reordering layers that would occasionally make Pixelmator for iOS quit unexpectedly."},{"version_id":"828620881","version_name":"2.4.3","version_date":"2018-10-04 16:41:23.000 +0800","version_description":"​This update makes Pixelmator compatible with iOS 12 and adds a few additional improvements and fixes.<br><br>• Added several new aspect ratios to the Crop tool.<br>• To make it easier to rasterize non-image layers, Convert into Pixels is now available as an option in various popovers.<br>• Image thumbnails in various places in Pixelmator for iOS would be displayed as solid grey. Fixed.<br>• When tapping and holding a layer, the delay before drag &amp; drop is activated has been increased.<br>• Drag &amp; drop will no longer be activated when you hold a layer in place if you've already moved it. <br>• The Undo button has been moved slightly to the right to prevent accidentally exiting to the gallery.<br>• The tappable area of the buttons in the toolbar has been increased to prevent accidentally hiding it.<br>• When saving a copy of an image to the Photos app, the original format will be preserved (however, when saving to the same image, JPEG will still be used as is required by iOS).<br>• Save to Photos will no longer be shown as an option if the imported image was created on another device and it would not be possible to overwrite the original.<br>• Using the Distort tools on the new iPhone XS and iPhone XS Max would create transparent areas in the image. Fixed.<br>• Pixelmator for iOS would sometimes stop responding when opening the gallery while syncing with iCloud. Fixed.<br>• Fixed an issue that would sometimes cause Pixelmator for iOS to quit unexpectedly when creating images from the Photos app.<br>• Added a few other fixes to prevent Pixelmator for iOS from quitting unexpectedly."},{"version_id":"830221657","version_name":"2.4.4","version_date":"2019-02-12 10:04:21.000 +0800","version_description":"This update adds support for the new iPad Pro and Apple Pencil and brings a number of fixes.<br><br>• The Pixelmator interface has now been optimized for the newest iPad Pro.<br>• The double-tap gesture of the new Apple Pencil is now supported.<br>• Wherever possible, Pixelmator will respect your global settings for the double-tap gesture.<br>• The Noise, Hue, Miniaturize, and Hue effects were not working in the Photos extension. Fixed.<br>• The canvas was being incorrectly centered in both the app and the Pixelmator Photos extension. Fixed.<br>• After making a selection and movi​ng it, tapping a part of the selection outside the bounds of the original layer would deselect the layer. Fixed.<br><br>Have any feedback about the update or Pixelmator for iOS in general? We'd love to hear it at support@pixelmator.com!"},{"version_id":"832126180","version_name":"2.4.5","version_date":"2019-07-29 13:08:36.000 +0800","version_description":"Pixelmator for iOS 2.4.5 improves compatibility with future versions of iOS.<br><br>Have any feedback about this update or Pixelmator for iOS in general? We'd love to hear it at support@pixelmator.com!"},{"version_id":"832311233","version_name":"2.4.6","version_date":"2019-08-09 08:36:03.000 +0800","version_description":"Pixelmator for iOS 2.4.6 improves compatibility with future versions of iOS.<br>Have any feedback about this update or Pixelmator for iOS in general? We'd love to hear it at support@pixelmator.com!"},{"version_id":"833013879","version_name":"2.4.7","version_date":"2019-10-09 12:39:39.000 +0800","version_description":"Pixelmator for iOS 2.4.7 includes some fixes for issues introduced with iOS 13.<br><br>Have any feedback about this update or Pixelmator for iOS in general? Let us know at support@pixelmator.com!"},{"version_id":"833689584","version_name":"2.4.8","version_date":"2019-11-22 09:33:27.000 +0800","version_description":"Pixelmator for iOS 2.4.8 brings some fixes for a few related text issues that were causing the app to quit unexpectedly."},{"version_id":"834968840","version_name":"2.5","version_date":"2020-04-21 10:25:02.000 +0800","version_description":"Pixelmator 2.5 adds a brand new, Files-based document browser, bringing simpler and more familiar document management, a new photo browser that makes it easier to browse and open images from your Photos library, and new image size presets that let you quickly create new images with common sizes.<br><br>• Use the new Files-based document browser to open and manage all your Pixelmator documents.<br>• Thanks to the new browser, it’s now easier to open and edit images in iCloud, on your device, in external locations, or even in third-party cloud storage services.<br>• With a brand new photo browser, you can now browse and open images in your Photos library more easily than ever.<br>• Use the new image size presets to quickly create new images with common sizes.<br>• Take Photo and Open Most Recent Photo have been added as quick actions.<br>• The selected Flash mode will be preserved after closing and reopening the Camera.<br>• The strength of the True Tone effect will now be reduced when editing in Pixelmator.<br>• If certain third-party apps used the PXM extension for their files, having those apps installed could prevent Pixelmator from creating or opening files. Fixed.<br>• Fixed a number of memory management issues.<br>• The Pixelmator for iOS Help would sometimes be displayed incorrectly. Fixed.<br>• Having the Full Keyboard Access accessibility setting turned on would cause Pixelmator to quit unexpectedly. Fixed.<br><br>Have any feedback about this update or Pixelmator in general? Let us know at support@pixelmator.com!"},{"version_id":"835809338","version_name":"2.5.1","version_date":"2020-05-05 10:21:30.000 +0800","version_description":"Pixelmator 2.5.1 adds a few smaller improvements and fixes.<br><br>• The text of the Create Document button has been changed to Create Image.<br>• The aspect ratio of the Create Image button is now 4:3.<br>• On iPhone Plus models, rotating the device to landscape and back to portrait while viewing the document browser would make the status bar disappear. Fixed.<br>• With Rulers turned on, they would appear when creating an image using the Custom preset. Fixed.<br>• After creating an image using the Custom preset, the buttons in Image Setup would be incorrect. Fixed.<br>• When creating images using the Custom preset, tapping cancel would cause Pixelmator to quit unexpectedly. Fixed.<br>• Creating images from presets on devices that don’t support those sizes would cause Pixelmator to quit unexpectedly. Fixed.<br>• In certain situations, grouping layers would cause Pixelmator to quit unexpectedly. Fixed.<br>• Moving a selection while a popover is open would cause Pixelmator to quit unexpectedly. Fixed.<br><br>Have any feedback about this update or Pixelmator in general? Let us know at support@pixelmator.com!"},{"version_id":"835959307","version_name":"2.5.2","version_date":"2020-05-18 09:00:29.000 +0800","version_description":"Pixelmator 2.5.2 adds some improvements to the new Files-based document browser, better support for custom fonts, and brings a few fixes.<br><br>• When capturing screenshots, you can now tap Full Page to take a screenshot of your entire image without any interface elements.<br>• Fonts installed using the new custom font support in iOS 13 will now appear in Pixelmator.<br>• The design of the font picker has been refreshed.<br>• When creating new images, the order of tabs has been rearranged with Photos first, Presets second, and Templates last.<br>• After closing and reopening the Photos browser, the position you scrolled to will now be remembered.<br>• After closing documents, the Browse tab and the location of the file will now be shown instead of the Recents tab.<br>• The color of the buttons in the Files and Photos browsers is now blue to make them a little more visible.<br>• When using the Free Selection tool, selecting outside the edges of the canvas would cause the selection to appear to be automatically closed. Fixed.<br>• On iOS 11 and 12, document thumbnails would not be displayed in the browser. Fixed.<br>• Attempting to group layers would occasionally cause Pixelmator to quit unexpectedly. Fixed.<br><br>Have any feedback about this update or Pixelmator for iOS in general? Let us know at support@pixelmator.com!"},{"version_id":"836037537","version_name":"2.5.3","version_date":"2020-05-21 09:08:21.000 +0800","version_description":"Pixelmator 2.5.3 brings a few fixes to keep the app running smoothly.<br><br>• Using a mouse or trackpad to move layers would not work. Fixed.<br>• The thumbnails of Photos albums would sometimes flicker. Fixed.<br>• With Dark Mode turned on, certain interface elements would be displayed incorrectly. Fixed.<br>• When previewing photos in fullscreen, swiping down to dismiss previews in the Photos browser would make the tab bar disappear. Fixed.<br>• Adjusting the line spacing of text would sometimes cause Pixelmator to quit unexpectedly. Fixed.<br>• Adjusting the alignment of text would sometimes cause Pixelmator to quit unexpectedly. Fixed.<br><br>Have any feedback about this update or Pixelmator for iOS in general? Let us know at support@pixelmator.com!"},{"version_id":"836092632","version_name":"2.5.3","version_date":"2020-05-21 09:08:21.000 +0800","version_description":"Pixelmator 2.5.3 brings a few fixes to keep the app running smoothly.<br><br>• Using a mouse or trackpad to move layers would not work. Fixed.<br>• The thumbnails of Photos albums would sometimes flicker. Fixed.<br>• With Dark Mode turned on, certain interface elements would be displayed incorrectly. Fixed.<br>• When previewing photos in fullscreen, swiping down to dismiss previews in the Photos browser would make the tab bar disappear. Fixed.<br>• Adjusting the line spacing of text would sometimes cause Pixelmator to quit unexpectedly. Fixed.<br>• Adjusting the alignment of text would sometimes cause Pixelmator to quit unexpectedly. Fixed.<br><br>Have any feedback about this update or Pixelmator for iOS in general? Let us know at support@pixelmator.com!"},{"version_id":"836103518","version_name":"2.5.4","version_date":"2020-05-26 06:59:07.000 +0800","version_description":"Pixelmator 2.5.4 fixes an issue with moving selected image areas."},{"version_id":"836302209","version_name":"2.5.5","version_date":"2020-06-08 08:44:42.000 +0800","version_description":"Pixelmator 2.5.5 brings a few improvements to the Export sheet and adds some fixes to keep the app running smoothly.<br><br>• After choosing an export format, it’s now possible to go back and change it.<br>• When exporting images, the file extension will now be displayed when choosing the export location.<br>• The Export sheet will now display the file info of the file being shared: its name, size, and format.<br>• Album thumbnails in the Photos browser will now load more quickly.&nbsp;<br>• Sometimes, after selecting image areas, the selections would actually be completely empty and it would not be possible to edit them. Fixed.<br>• In certain cases, the What’s New screen would not appear after updating. Fixed.<br>• Attempting to open an image in the Pixelmator editing extension in Photos would sometimes cause the extension to quit unexpectedly. Fixed.<br>• In iOS 11 and iOS 12, opening Pixelmator documents would sometimes cause the app to quit unexpectedly. Fixed.<br><br>Have any feedback about this update or Pixelmator for iOS in general? Let us know at support@pixelmator.com!"},{"version_id":"837881788","version_name":"2.6","version_date":"2020-09-29 10:24:58.000 +0800","version_description":"Pixelmator 2.6 brings full support for iOS and iPadOS 14, adds support for using Pixelmator with a Magic Keyboard, trackpad, or mouse, includes 73 new keyboard shortcuts, and features a number of additional improvements and fixes.<br><br>• Pixelmator is now fully compatible with iOS and iPadOS 14.<br>• You can now use Pixelmator for iPadOS with a Magic Keyboard, trackpad, or mouse.<br>• Speed up your editing with 73 new keyboard shortcuts — press and hold the Command key while editing to see some of the most important ones. A full list is also available in the Pixelmator for iOS help manual.<br>• Tapping the name of the image in the toolbar will now present the option to save it.<br>• The color picker will now remember the position in the image it was last picked from.<br>• Drag &amp; drop should no longer be activated when tapping and holding layers after having started editing them.<br>• The Hidden category from your Photos library will now be accessible from the Photos browser.<br>• When exporting images, the PPI setting would be automatically set to 72, even when the original images had a different resolution. Fixed.<br>• Images in the clipboard in GIF format could not be used to create new files. Fixed.<br>• Document thumbnails would not be loaded correctly on older versions of iOS. Fixed.<br>• If rulers were visible, the status bar would not be hidden when hiding the toolbar. Fixed.<br>• When resizing tall and thin or short and wide images, it would not be possible to enter certain sizes. Fixed.<br>• Attempting to pick a color from an empty layer would cause Pixelmator to quit unexpectedly. Fixed.<br><br>Have any feedback about this update or Pixelmator in general? Let us know at support@pixelmator.com!"},{"version_id":"838079358","version_name":"2.6.1","version_date":"2020-10-06 08:05:17.000 +0800","version_description":"Pixelmator 2.6.1 for iOS brings a few smaller fixes.<br><br>• When using brush-based tools, the image would sometimes be panned when trying to paint a brushstroke. Fixed.<br>• With an active selection, pressing the delete key would delete the layer instead of the selected area. Fixed.<br>• Keyboard shortcuts would stop working if the app was in the background for a long time or Pixelmator was reopened with a restored document. Fixed.<br>• The position of the canvas when using the Crop and Add Effects tools was incorrect. Fixed.<br>• When using the Pixelmator editing extension in Photos, Control-clicking the image would cause the extension to quit unexpectedly. Fixed.<br>• When using the Pixelmator editing extension in Photos, attempting to pan the photo could cause the extension to quit unexpectedly. Fixed.<br><br>Have any feedback about this update or Pixelmator in general? Let us know at support@pixelmator.com!"},{"version_id":"838192541","version_name":"2.6.2","version_date":"2020-10-14 13:15:38.000 +0800","version_description":"This update removes the “Draw with Apple Pencil only” option and adds a few small fixes.<br><br>Have any feedback about this update or Pixelmator in general? Let us know at support@pixelmator.com!"},{"version_id":"839302201","version_name":"2.6.3","version_date":"2020-11-23 10:43:41.000 +0800","version_description":"Pixelmator 2.6.3 brings one new keyboard shortcut and a few fixes.<br><br>• You can now select the Clone tool by pressing the O key.<br>• When exporting images with transparency to PNG, their transparency would not be preserved. Fixed.<br>• In certain cases, a flattened version of incompatible Pixelmator files would be opened automatically without explaining why they were incompatible. Fixed.<br>• Sometimes, certain brushes would not appear in the brushes browser. Fixed.<br>• Undoing edits using keyboard shortcuts while using the selection tools would cause the redo stack to be cleared. Fixed.<br><br>Have any feedback about this update or Pixelmator in general? Let us know at support@pixelmator.com!"}]