[{"version_id":"750573091","version_name":"0.1.0","version_date":"","version_description":""},{"version_id":"812452499","version_name":"2.0.0","version_date":"","version_description":""},{"version_id":"812567392","version_name":"2.0.1","version_date":"","version_description":""},{"version_id":"813094641","version_name":"2.3.0","version_date":"","version_description":""},{"version_id":"813280996","version_name":"2.4.0","version_date":"","version_description":""},{"version_id":"813462374","version_name":"2.4.1","version_date":"","version_description":""},{"version_id":"813804539","version_name":"2.5.0","version_date":"","version_description":""},{"version_id":"814110366","version_name":"2.5.2","version_date":"","version_description":""},{"version_id":"814717471","version_name":"2.6.0","version_date":"","version_description":""},{"version_id":"815387166","version_name":"2.7.0","version_date":"","version_description":""},{"version_id":"815531215","version_name":"2.7.1","version_date":"","version_description":""},{"version_id":"815821446","version_name":"2.7.2","version_date":"","version_description":""},{"version_id":"816282547","version_name":"2.7.6","version_date":"","version_description":""},{"version_id":"816614611","version_name":"2.7.8","version_date":"","version_description":""},{"version_id":"816880368","version_name":"2.8.0","version_date":"2016-03-31 10:27:57.000 +0800","version_description":"1. You can not only @ colleagues in chatting, you can also @ your colleagues in DING, approval and daily report now.\n2. Newly added transform audio messages to words feature, transforming audio messages to words in batch with just one click.\n3. Send mails to all group chat members with just one click in group chat page, you don’t have to add members one by one anymore.\n4. Comments feature is added to approval, images and attachment files are supported.\n5. You will have opportunities to join events organized by DingTalk when upgraded to org verified, the verification includes basic verification and advanced verification, basic verification is available to self employed business owner only.\n6. Newly released work attendance widget, get informed of your team's attendance status, personal leave, work attendance report can be generated intelligently. You can find it in work module, note that it's currently available to limited users."},{"version_id":"817112307","version_name":"2.9.0","version_date":"2016-04-26 00:32:16.000 +0800","version_description":"DingTalk can not only improve your work efficiency, but also make you enjoy your work:\n1. Whoever sends you a DING via call at midnight will receive a warm notice instead of waking you up from your sweet dreams \n2. Frustrated work attendance is now made super easy and elegant with DingTalk work attendance, clock in with your mobile phone.\n\nThe most wanted intelligent enterprise management of CEO and admins are now coming：\n3. DingTalk now supports express certification for TrustPass orgs, no business license needed.\n4. Share DingTalk invitation code, win lucky money. \n\nMore great optimized features:\n5. You can clock in even under busy even without the WiFi signals.\n6. You don't have to select members one by one, select all members with just one key.\n7. Find your file instantly according to your desired file format on C-space\n8. Select the file from C-space, send it as an attachment file with DING.\n9. C-space files upload/download, file name is in sync with the local name."},{"version_id":"817413191","version_name":"2.10.0","version_date":"2016-05-19 15:22:02.000 +0800","version_description":"New cool features released on DingTalk 4.26 spring strategy conference, improving your work efficiency with multi-point video conference, intelligent work attendance, and third party encryption upgrading.\n\n  1.  Professional grade video conference, clear display of conference status, easy switch between training and discuss mode. Beta version available for limited users.\n  2.  Work attendance ranking list, get informed of the strange status of your team. Work attendance intelligent report, view the work attendance report of your  department more clearly. Beta version available for limited users.\n  3.  Double chatting encryption, any third party including DingTalk can not decrypt.\n\nMore features:\n\n  4.  View your file more clearly by rotating your screen to preview file details online.\n  5.  More efficient file transfer by sending files via file assistant.\n  6.  Your chatting pictures will be sent in order, don’t worry about the occurrence of picture disorder.\n  7.  Team invitation is now optimized, it’s more convenient to invite your colleagues now."},{"version_id":"817786409","version_name":"2.11.0","version_date":"2016-06-20 00:09:13.000 +0800","version_description":"DingTalk unified communication capability is improved again with more efficient communication.\n【Search】— Searching page is now upgraded, you can search for group chatting records now.\n【Group chat】— Group chat QR code is valid for long term now, you can set member identity verification to ensure security! You can also @ everyone in the group chat. \n【DING】— Set a due time for important things, DING can help you to manage the things must be done before the due time. \n【Conference call】— HD conference call is now online, starting the call in one second, HD audio quality with low data consumption.\n\nMore features：\n【Performance】— Speed of starting and picture downloading is now doubly fasten.\n【Work attendance】— The most loved work attendance is now online! Clock in wherever you are, say bye to long queues. \n【Check in】— Photo with watermarks showing location and weather information! Let your manager know how hard working you are. \n【DING】— You can send DING now in chatting.\n【Global address book】— Template is changed with a foldable organization structure.\n【Sending pictures】— Multi-view pictures sending with custom setting on orders.\n【Share】—Share to Alipay is now supported."},{"version_id":"817841970","version_name":"2.11.1","version_date":"2016-06-21 22:14:55.000 +0800","version_description":"DingTalk unified communication capability is improved again with more efficient communication.\n【Search】— Searching page is now upgraded, you can search for group chatting records now.\n【Group chat】— Group chat QR code is valid for long term now, you can set member identity verification to ensure security! You can also @ everyone in the group chat. \n【DING】— Set a due time for important things, DING can help you to manage the things must be done before the due time. \n【Conference call】— HD conference call is now online, starting the call in one second, HD audio quality with low data consumption.\n\nMore features：\n【Performance】— Speed of starting and picture downloading is now doubly fasten.\n【Work attendance】— The most loved work attendance is now online! Clock in wherever you are, say bye to long queues. \n【Check in】— Photo with watermarks showing location and weather information! Let your manager know how hard working you are. \n【DING】— You can send DING now in chatting.\n【Global address book】— Template is changed with a foldable organization structure.\n【Sending pictures】— Multi-view pictures sending with custom setting on orders.\n【Share】—Share to Alipay is now supported.\n【Bugfix】—Fix some bugs."},{"version_id":"817926594","version_name":"2.12.0","version_date":"2016-06-30 16:57:44.000 +0800","version_description":"Work with more efficiency and happiness with the latest version of DingTalk.\n【Benefit house】--Benefit house for hard working people like you, the more efficient you are, the more benefits you will get. \n【Phone call】--Multi-call for everyone, start the multi-communication with your colleagues.\n【Video call】--Support HD stable video conference, making job interview and work report ever more efficient.\n【Verification】--Junior verification type is newly added, admin only needs to upload work and real name verification to get the org verified.\n【Work attendance】--Work attendance management feature is now upgraded, you can search, export or import the work plan excel files.\n【Clock in/out】-- View your team's footsteps, export data of staffs whose records are absent.\n【Sticker】-- New stickers are now added and supported to bring you more joy at work."},{"version_id":"818203478","version_name":"2.13.0","version_date":"2016-07-23 14:08:07.000 +0800","version_description":"1、VOIP connection rate optimization.\n2、Conference call to support fixed telephone.\n3、Support to untop a conversation on home screen;\n4、My chat groups is now categorized, easier to find.\n5、Personal data upgrade show attendance details."},{"version_id":"818467611","version_name":"2.15.0","version_date":"2016-08-13 10:24:55.000 +0800","version_description":"Brought you by DingTalk ,a more efficient, secured and human oriented way to work. In this new release we have cooperated with dbappsecurity.com.cn (an Olympics security service vendor) to privde \"Double Encryption Service\".\n \n[Third Party Encryption] Your messages are double encrypted, only the recipients in your company can decrypt it.\n \n[Secured Chat] Burn-after-read, screenshot can't reveal the chat peers.\n \n[Ding Space] Support read-only documents and watermark in preview mode.\n \n[Video Conferencing] Support high definition video conferencing.\n \nand more:\nSend video files from your phone in chat."},{"version_id":"818800500","version_name":"3.0.0","version_date":"2016-09-18 15:46:02.000 +0800","version_description":"- [External Contacts] DingTalk upgrades global address book to unified address book, Now your address book not only includes co-workers but also clients and business partners.\n- [Biz Call] Dedicated phone number belongs to your company, zero cost, no hardware required；\n- [DING] The fastest way to deliver your important messages now upgraded with new features: Exist DING message can be added with more recipients; Pin your most important DING messages can be pinned on top, easier to manage.\n- [File Sharing] Share your business files across companies.\n- [3rd-Party Mail Support] DingMail now supports 3rd-party mail service like Aliyun, QQ Mail, 163 Mail and enterprise mailbox.\n- [Improved] For new member joined in group chat, the group admin can allow him to read the last 100 history messages.\n- [Improved] Group chat avatar loading performance is improved.\n- [Improved] Global address book security is enchanced, abnormal accessing behavior will be logged."},{"version_id":"819030745","version_name":"3.0.1","version_date":"2016-09-27 03:40:56.000 +0800","version_description":"1. Optimization for iOS 10: pick up incoming call without opening DingTalk.\n2. One click to confirm all DING messages.\n3. Performance optimization and bug fixs."},{"version_id":"819357486","version_name":"3.1.0","version_date":"2016-10-21 02:50:01.000 +0800","version_description":"[Employee Benefit Service] We have cooperated with partners to provide employee travel, health, taxi, insurance, and law services.\n[Biz Call] Customers's call can be redirected to employee automatically, 12 provinces in China now supported.\n[Contacts] Scan name card to add contacts.\n[Ding Space] Support read/unread status now, preview and download events are recorded.\n[Work Report] Support to attach word, excel and PPT files.\n[Ding] Ding messages are searable now!\n[Ding Mail] Support to login to 163, 126, QQ mailbox without extra configuration."},{"version_id":"819493084","version_name":"3.1.1","version_date":"2016-10-28 05:02:28.000 +0800","version_description":"Performance optimization and bug fixes."},{"version_id":"819779067","version_name":"3.2.0","version_date":"2016-11-22 03:02:27.000 +0800","version_description":"[Specified Customization] DingTalk exclusively customizes smart mobile office portal for users’ business. Currently DingTalk customization supports six areas: restaurant, food, clothing, wholesales, real estate, logistics, and other business.\n\n[External Contacts] Users can add external contacts in batches, and users can write visiting records directly in the external contact page;\n\n[Biz Call] Biz Call now supports the query function in which manager not only learns the total cost, but also sets limits such as the amount limit, area limit for each employee. So the company can save the cost, and employees use business call more conveniently.\n\n[Service Window] Service window invites new users through QR code, sharing links. In addition, Service window can check what kind of services before officially adding.\n \n[Global Address Book] Administrators can transfer and delete departments on the cellphone in batches.\n\n[Ding Space] Ding Space quickly opens or downloads the latest files, no longer worry about searching too many files.\n \n[Chat] Group chat now supports the gag function, and it can enhance the group's manageability.\n\n[DingTalk Certification] DingTalk certification brings the completely new authentication experience. DingTalk can automatically identify ID information. Furthermore, the total speed of certification has been speeded up three times.\n\n[Smart Work] Smart work now can classify topics into different categories, and so users quickly find the business applications which match the users’ expectation.  Administrators can configure the application through a cell phone.\n\nMore:\nSupport to send GIF images.\nSupport to send iCloud images.\nSupport to send Live Photo.\nSupport to send super long text messages.\nThe quality of voice messages has been improved, and supports Bluetooth recording and playback.\nUsers can give a like quickly during chatting, so users have more passions to work."},{"version_id":"820157974","version_name":"3.3.0","version_date":"2016-12-19 10:11:34.000 +0800","version_description":"Not only improve your work efficiency, but also allow you to enjoy a smarter way of working.\n\n[Industry solutions]  \"DingTalk College\" is open for catering, food and beverage, clothing and textile, wholesale and retail, real estate, logistics industry,  where you can learn how to do business management. More industries are opening up soon;\n\n[Improved Chat List]  Read/Unread Status on chat list; Group by last chat date, Support batch delete.\n\n[New Lucky Money] Deliver your lucky money on your selected date and time.\n\n[Quicker Check-in] Automatically check-in by just opening up DingTalk when you arrive office.\n\n[Smart Biz Call] Two-Step to open your account. Support Simultaneously incoming call.\n\n[Graffiti] Support to send photos with your graffiti.\n\n[Role] Unified Address Book supports to add labels like manager, accountant, HR.\n\n[Upgraded Conference Call] Conference/Video Calls now support up to 30 peers.\n\n[Improved Ding Mail] Your mail can be forwarded to chat now.\n\n[Desktop DingTalk] Support multi-windows now! Work apps and chat can be used at same time."},{"version_id":"820253257","version_name":"3.3.1","version_date":"2016-12-22 02:00:37.000 +0800","version_description":"Not only improve your work efficiency, but also allow you to enjoy a smarter way of working.\n\n[Industry solutions]  \"DingTalk College\" is open for catering, food and beverage, clothing and textile, wholesale and retail, real estate, logistics industry,  where you can learn how to do business management. More industries are opening up soon;\n\n[Improved Chat List]  Read/Unread Status on chat list; Group by last chat date, Support batch delete.\n\n[New Lucky Money] Deliver your lucky money on your selected date and time.\n\n[Quicker Check-in] Automatically check-in by just opening up DingTalk when you arrive office.\n\n[Smart Biz Call] Two-Step to open your account. Support Simultaneously incoming call.\n\n[Graffiti] Support to send photos with your graffiti.\n\n[Role] Unified Address Book supports to add labels like manager, accountant, HR.\n\n[Upgraded Conference Call] Conference/Video Calls now support up to 30 peers.\n\n[Improved Ding Mail] Your mail can be forwarded to chat now.\n\n[Desktop DingTalk] Support multi-windows now! Work apps and chat can be used at same time."},{"version_id":"820529006","version_name":"3.3.3","version_date":"2017-01-18 06:34:22.000 +0800","version_description":"Have worked hard for a year, it is time to give lucky money to your colleagues.\n[Balance for Lucky Money] Balance for lucky money! Spring Festival is coming, you can use DingTalk to give lucky money to your colleagues.\n[Designated Lucky Money] You can give lucky money to the designated person form his hard work.\n[Lucky Time Lucky Money] You can choose lucky time to give lucky money, countdown the time, so that make the happier holiday.\n[Year-end Party] We add many new micro-apps such as lottery, live broadcasting, registration, interaction, for your company's year-end party.\n[Biz call] selected limit free lucky numbers, 1000 minutes free experience if users open an account.\n[Group chat] You can add a new group by searching the group number or internal title.\n[Quick Thumbs Up] More thumbs up icons.\n[Secret chat] According to the length of the secret message automatically adjust the destruction of time, to avoid the message is completely destroyed even one doesn't read.\n[Approval] DingTalk have new template square with rich templates with one key. Full-text search on the mobile phone-side; reading experience is optimized.\n [Attendance] Super fast check-in is optimized such asuser-friendly tips; support for the administrator with advanced settings to open or close an item.\n \nOther updates\n--External contacts support archiving queries based on company fields.\n--Enterprise customization and application classification will help a business.\n--Video conferencing optimization, 45% traffic saving; increase smooth mode, automatic switch for the weak network.\n--Support for an appointment after the first meeting, so that mobile meetings more simple.\n \nlast important update \n--The first screen shows the message with read or unread status.\n--Smart office phone two-step quickly operate."},{"version_id":"821080809","version_name":"3.4.0","version_date":"2017-02-27 03:41:13.000 +0800","version_description":"[Message Tone Settings] \n- Set different message tones for different notifications and never miss a crucial message again.\n\n[Group Robots] \n- Group robots can aggregate third-party information to DingTalk Group chats, improving the efficiency of message synchronization. \n- Supports: GitHub, Trello, JIRA, custom robots, etc.\n\n[DingMail] \n- Individual users can sign up for an exclusive DingTalk Mailbox once they have registered for a DingTalk account. \n- Business users are entitled to a free mailbox.\n- Supports logging into to two mailbox accounts simultaneously.\n- Personalize your mailbox with your own unique signature.\n\nMore Updates:\n\n[Personal Details Page Optimization] \n- After a user has searched for and added a friend through their phone number, each party can view the other’s phone number in their personal details page.\n\n[Message Notifications] \n- Improvements made to the message notification switch. You can now click to jump directly to the system settings to turn on/off the system notification switch.\n\nRecent Updates:\n\n- New group-exclusive red envelope function.\n- Business address book now supports role settings.\n- Upgraded phone/video conferencing, can now support up to 30 people."},{"version_id":"821310577","version_name":"3.4.6","version_date":"2017-03-21 01:57:56.000 +0800","version_description":"Here at DingTalk it’s not just your work that we’re concerned about, your health is also at the forefront of our concerns. This is why DingTalk is launching a completely new function which will allow you to share the joys of exercise with your colleagues.\n\n[New DingTalk Run]\nOur new fitness function makes exercising more fun than ever. It supports both individual and departmental fitness rankings, allows you to praise your colleagues on their fitness achievements and ‘like’ their step counts, choose a photo that will be displayed when you’re winning in the ranks, and much more. From now on, you’ll always have somebody to exercise alongside with. \n\n[New Birthday Wishes]\nIn order to make every user’s birthday special we have included a new Birthday Blessings Function. Enter the word “birthday” in a chat to trigger the “birthday blessings mode”. After it has been triggered press and hold the ‘like’ button to send a special birthday message. \n\n[Optimization of Ding Mail Functions]\nEmails can be marked as unread, and can be moved to different folders; Supports the ability to filter emails according to status (read/unread, starred, attachments etc.)\n\n[Optimization of Office Call Functions]\nNumbers can now be pasted into the dial pad and the chat window can now display both parties’ call records.\n\n[Optimization of Approval Functions]\nApproval templates can now be directly shared in chats, making it easier than ever for your colleagues to fill in. \n\nMore Updates:\nAdded a map mode to the clocking in/out function\nWhen clocking in or out you can now check the clocking in/out range and your location, making your position more accurate\nAdded a map mode to the clocking in/out function\nWhen clocking in or out you can now check the clocking in/out range and your location, making your position more accurate.\nAdded weekly trends to attendance statistics\nCheck your attendance by day, week, month or year, and review the team’s growth.\n\nRecent Updates:\n- Set different message tones for different notifications.\n- Group robots can aggregate third-party information to DingTalk Group chats.\n- Individual users can sign up for an exclusive DingTalk Mailbox."},{"version_id":"821365466","version_name":"3.4.6","version_date":"2017-03-21 01:57:56.000 +0800","version_description":"Here at DingTalk it’s not just your work that we’re concerned about, your health is also at the forefront of our concerns. This is why DingTalk is launching a completely new function which will allow you to share the joys of exercise with your colleagues.\n\n[New DingTalk Run]\nOur new fitness function makes exercising more fun than ever. It supports both individual and departmental fitness rankings, allows you to praise your colleagues on their fitness achievements and ‘like’ their step counts, choose a photo that will be displayed when you’re winning in the ranks, and much more. From now on, you’ll always have somebody to exercise alongside with. \n\n[New Birthday Wishes]\nIn order to make every user’s birthday special we have included a new Birthday Blessings Function. Enter the word “birthday” in a chat to trigger the “birthday blessings mode”. After it has been triggered press and hold the ‘like’ button to send a special birthday message. \n\n[Optimization of Ding Mail Functions]\nEmails can be marked as unread, and can be moved to different folders; Supports the ability to filter emails according to status (read/unread, starred, attachments etc.)\n\n[Optimization of Office Call Functions]\nNumbers can now be pasted into the dial pad and the chat window can now display both parties’ call records.\n\n[Optimization of Approval Functions]\nApproval templates can now be directly shared in chats, making it easier than ever for your colleagues to fill in. \n\nMore Updates:\nAdded a map mode to the clocking in/out function\nWhen clocking in or out you can now check the clocking in/out range and your location, making your position more accurate\nAdded a map mode to the clocking in/out function\nWhen clocking in or out you can now check the clocking in/out range and your location, making your position more accurate.\nAdded weekly trends to attendance statistics\nCheck your attendance by day, week, month or year, and review the team’s growth.\n\nRecent Updates:\n- Set different message tones for different notifications.\n- Group robots can aggregate third-party information to DingTalk Group chats.\n- Individual users can sign up for an exclusive DingTalk Mailbox."},{"version_id":"821427623","version_name":"3.4.7","version_date":"2017-03-22 12:13:31.000 +0800","version_description":"Here at DingTalk it’s not just your work that we’re concerned about, your health is also at the forefront of our concerns. This is why DingTalk is launching a completely new function which will allow you to share the joys of exercise with your colleagues.\n\n[New DingTalk Run]\nOur new fitness function makes exercising more fun than ever. It supports both individual and departmental fitness rankings, allows you to praise your colleagues on their fitness achievements and ‘like’ their step counts, choose a photo that will be displayed when you’re winning in the ranks, and much more. From now on, you’ll always have somebody to exercise alongside with. \n\n[New Birthday Wishes]\nIn order to make every user’s birthday special we have included a new Birthday Blessings Function. Enter the word “birthday” in a chat to trigger the “birthday blessings mode”. After it has been triggered press and hold the ‘like’ button to send a special birthday message. \n\n[Optimization of Ding Mail Functions]\nEmails can be marked as unread, and can be moved to different folders; Supports the ability to filter emails according to status (read/unread, starred, attachments etc.)\n\n[Optimization of Office Call Functions]\nNumbers can now be pasted into the dial pad and the chat window can now display both parties’ call records.\n\n[Optimization of Approval Functions]\nApproval templates can now be directly shared in chats, making it easier than ever for your colleagues to fill in. \n\nMore Updates:\nAdded a map mode to the clocking in/out function\nWhen clocking in or out you can now check the clocking in/out range and your location, making your position more accurate\nAdded a map mode to the clocking in/out function\nWhen clocking in or out you can now check the clocking in/out range and your location, making your position more accurate.\nAdded weekly trends to attendance statistics\nCheck your attendance by day, week, month or year, and review the team’s growth.\n\nRecent Updates:\n- Set different message tones for different notifications.\n- Group robots can aggregate third-party information to DingTalk Group chats.\n- Individual users can sign up for an exclusive DingTalk Mailbox."},{"version_id":"821761862","version_name":"3.4.8","version_date":"2017-04-26 02:33:44.000 +0800","version_description":"Group Admin permissions have been upgraded, making it even simpler to manage group chats.\n\n[New Group Fitness] The new Group Fitness function allows you to start up and manage group fitness within internal groups. Group members can go head-to-head and compete for the highest step count, or simply share the joys of exercise and enhance cohesion.\n\n[Censor Group Messages] The Group Admin can now censor inappropriate group chat messages to ensure the safety of the group information.\n\n[@all Permissions] The Group Admin can now set themselves as the only person that can use the @all function within a group. This useful option can help to prevent other members from excessively disturbing each other.\n\nThe External Contacts and BizCall functions have been jointly upgraded, making it easier than ever to manage customers.\n\n[Supports Landline Numbers] Landline numbers can now be used as an external contact’s number. In addition, you can now dial landline numbers when using the BizCall function. Now, even if you do not know a customer’s phone number, you can still use DingTalk Management to contact them.\n\n[Customer Company Library] Enter the same company for multiple contacts without having to re-enter the company name. Simply choose from the existing company library, and enjoy this faster and more accurate way of recording information.\n\nYou can now upgrade the administrator to help make managing the company more relaxing than ever before.\n\n[Work Platform] Upgrade your organization’s Work Platform to an advanced version, to enable  applications and templates to be grouped freely and to make workflows and functions delightfully tidy.\n[Approvals] Templates can be grouped and sorted according to different usage scenarios, making submission approval even clearer.\n\n[Announcements] Announcements can now be published on the PC version of DingTalk and images and forms can be directly pasted into the announcement during editing, enhancing the richness of the content.\n\nRecent updates：\n\n- New DingTalk Fitness\n\n- New Birthday Wishes\n\n- Phone numbers now be pasted into the office phone dial pad\n\n- Approval templates can be shared in group chats\n\n- Filter emails according to status (read/unread, starred, attachments etc.) in Ding Mail"},{"version_id":"821953266","version_name":"3.4.10","version_date":"2017-05-08 11:59:31.000 +0800","version_description":"Everybody fights for the invitation of DingTalk SIM card, because he can get a fancy number in free, and then improve the work efficiency. \n- A fancy number for work, and it would be free for DingTalk Card member.\n- Free for the first month, and get 11GBytes data at max.\n- Gift money for Biz call, and save money for a company.\n\nRelease Dingtalk Smart Attendance Machine:\n- Setting and configuration is much easier than before, and only takes two minutes to input the phone books.\n- It is easier for an employee to sign in and avoid the peaking hours and so improve the efficiency.\n- Easier for financial settlements, and to generate the salary list in two hours and 60times faster than before.\n- Easier for a company management, and to check the attendance rate in real time. \n\nRecent updates: \n- New DingTalk Fitness\n- New Birthday Wishes\n- Phone numbers now be pasted into the office phone dial pad\n- Approval templates can be shared in group chats\n- Filter emails according to status (read/unread, starred, attachments etc.) in Ding Mail"},{"version_id":"822185825","version_name":"3.4.11","version_date":"2017-05-18 02:45:04.000 +0800","version_description":"Everybody fights for the invitation of DingTalk SIM card, because he can get a fancy number in free, and then improve the work efficiency. \n- A fancy number for work, and it would be free for DingTalk Card member.\n- Free for the first month, and get 11GBytes data at max.\n- Gift money for Biz call, and save money for a company.\n\nRelease Dingtalk Smart Attendance Machine:\n- Setting and configuration is much easier than before, and only takes two minutes to input the phone books.\n- It is easier for an employee to sign in and avoid the peaking hours and so improve the efficiency.\n- Easier for financial settlements, and to generate the salary list in two hours and 60times faster than before.\n- Easier for a company management, and to check the attendance rate in real time. \n\nOptimize performance and fix some bugs.\n\nRecent updates: \n- New DingTalk Fitness\n- New Birthday Wishes\n- Phone numbers now be pasted into the office phone dial pad\n- Approval templates can be shared in group chats\n- Filter emails according to status (read/unread, starred, attachments etc.) in Ding Mail"},{"version_id":"822400816","version_name":"3.5.0","version_date":"2017-06-10 02:07:24.000 +0800","version_description":"(DING) The DING feature can now be used for much more than just sending and receiving notifications and reminders. You can now use it to book and check-into meetings and for task management. The DING feature will make sure that all your tasks get done.\n\n (DING) Manage your calendar using the DING feature, and always keep track of your busy schedule.\n\n (Ding Index) The Efficiency Score has been upgraded to the Ding Index. The Ding Index reflects the efficiency, security and informatization of organizations in the era of the mobile cloud. It aims to guide organizations to improve their office coordination and efficiency in every aspect, so that they can master outstanding work practices.\n\n (Organization Homepage) The Organization Service Window has been upgraded to the Organization Homepage. The Organization Homepage is a mobile business card which connects customers with business opportunities. It also enhances the credibility of the organization and allows you to freely share and get in contact with customers. \n\n (Chat) Combine and forward multiple messages and improve your reading experience. When changing a regular chat into a group chat, you can now combine and forward your chat records to the new group, and ensure that new members don’t miss out on any of those important messages.\n\n(Chat) The video function now supports muted playback, meaning that you no longer need to worry about disturbing your colleagues at work.\n\n(Open Platform) The integration between business systems and DingTalk has even more support now that more API functions are open. The attendance, approval and check-in functions and interface are now open.\n\n (Ding Mail) You can now view recipient's email address when writing emails. In order to improve security, when you are writing an email to someone outside of the company, you will receive a special reminder.\n\n (Logs and Approvals) The chat Sticky on Top function has been added. Now when you are writing a log or an approval you can quickly switch to the chat window and back again, increasing your efficiency. \n\n (Leave) The leave date control function has been upgraded. The attendance and shift information has been synchronized making applying for leave easier than ever."},{"version_id":"822448230","version_name":"3.5.0","version_date":"2017-06-10 02:07:24.000 +0800","version_description":"(DING) The DING feature can now be used for much more than just sending and receiving notifications and reminders. You can now use it to book and check-into meetings and for task management. The DING feature will make sure that all your tasks get done.\n\n (DING) Manage your calendar using the DING feature, and always keep track of your busy schedule.\n\n (Ding Index) The Efficiency Score has been upgraded to the Ding Index. The Ding Index reflects the efficiency, security and informatization of organizations in the era of the mobile cloud. It aims to guide organizations to improve their office coordination and efficiency in every aspect, so that they can master outstanding work practices.\n\n (Organization Homepage) The Organization Service Window has been upgraded to the Organization Homepage. The Organization Homepage is a mobile business card which connects customers with business opportunities. It also enhances the credibility of the organization and allows you to freely share and get in contact with customers. \n\n (Chat) Combine and forward multiple messages and improve your reading experience. When changing a regular chat into a group chat, you can now combine and forward your chat records to the new group, and ensure that new members don’t miss out on any of those important messages.\n\n(Chat) The video function now supports muted playback, meaning that you no longer need to worry about disturbing your colleagues at work.\n\n(Open Platform) The integration between business systems and DingTalk has even more support now that more API functions are open. The attendance, approval and check-in functions and interface are now open.\n\n (Ding Mail) You can now view recipient's email address when writing emails. In order to improve security, when you are writing an email to someone outside of the company, you will receive a special reminder.\n\n (Logs and Approvals) The chat Sticky on Top function has been added. Now when you are writing a log or an approval you can quickly switch to the chat window and back again, increasing your efficiency. \n\n (Leave) The leave date control function has been upgraded. The attendance and shift information has been synchronized making applying for leave easier than ever."},{"version_id":"822775180","version_name":"3.5.1","version_date":"2017-07-07 02:04:26.000 +0800","version_description":"[Organization Personalization]\nYou can now set your organization logo as a cover photo on the work page, and help your organization to build corporate culture on DingTalk.\n\n[DingTalk BizCall]\nVoice navigation has been added for incoming calls to improve service efficiency and ensure you don’t miss any potential customers. From now on your company won't need to apply for 400 call services.\n\n[Management Permissions]\nYou can now set sub-administrators using your phone, and share your management responsibilities.\n\n[Attendance]\nNew Clocking-in/out Proof: Every time you clock-in or out a record will be kept to protect your labor rights and interests.\n\n[Approvals]\nOnce a business trip or leave application has been approved, you can edit or withdraw it without having to trouble the administrator.\n\n[Ding Lab]\nDiscover DingTalk’s new trial function and the launch of Streamline Mode. Filter out old messages, keep your home screen in order and improve your business communication and efficiency.\n\n[Chat Group Expansion]\nFull-employee chat groups have been upgraded and now support up to 10,000 employees!"},{"version_id":"823051043","version_name":"3.5.2","version_date":"2017-08-01 03:31:04.000 +0800","version_description":"Work Status\nShare your work status with your colleagues and reduce communication costs. Synchronize your status (Leave, On a Business Trip, Sick etc.) with your approval forms and once approved, your status will automatically be displayed\n \nChats  \nGroup chat member's organizations will now be displayed, making business communication even more efficient\n \nExternal Contacts\nField settings are now mandatory to fill in, ensuring customer information is always complete\n \nSearch\nThe search function has been optimized and you can now search chat records by time or by object\n \nSticky Features On Top\nYou can now sticky on top Ding Mail and many third-party applications in your chats, making switching between application and chats quick and easy\n \nConference Calls\nView and export your call records, making it easier than ever to check them \n \nApprovals\nThe whole approval process and set up has been upgraded. You can now make selections according to department or role\n \nApprovals\nNow supports step-by-step approval management according to department. Set the final approver and never have to trouble the administrator again\n \nDing Mail\nYou can now view the source of chat records that are sent as an email and can click to return to the chat"},{"version_id":"823412885","version_name":"3.5.3","version_date":"2017-08-28 02:04:04.000 +0800","version_description":"[Chats]\nTouch and hold any message in your chat logs to quote a specific message.\n[DING]\nAdded category filtering function, allowing you faster searches for that DING, task or meeting you need to find.\n[Biz Call]\nAdded a new upgrade in our phone services, with a new smart analysis function, reminding you about missed calls. Now you'll never have to worry about missing potential customers again.\n[Conference Calls]\nAdministrators can set individual employee's or a whole department's access rights by phone or through the PC Admin Panel.\n[Ding Mail]\n1.Open a Ding Mail account in just a few easy touches and free of charge.\n2.Organization Ding Mail supports batching distribution functions. Batch whole departments of employees or even batch new employees.\n[Approvals]\n1.New management system for your vacation balances, freeing you from clamoring statistical feeds.\n2.Newly added settings for approving multiple arrangements. Now making it easier for employees from different posts, with different projects and with differently set approval arrangements.\n3.A new approval function, now supporting a single member getting approval from all employees.\n[Attendance]\n1.New function providing automatic calculations for clock-in/out records as well as overtime records, keeping you hassle-free from clamoring statistics.\n2.Now a more personalized clock-in/out reminder as well late night messages. Now taking your well-being more into consideration.\n3.Newly added Smart Work Shift Recommendation system. Fast and effective making administrators have even less to worry about.\n4.New attendance statistics allowing administrators to view any individual employee's daily, monthly, weekly attendance reports, including clock-in/out irregularities. \n[Work Log]\nNewly added daily logs statistics function. Daily logs make it easier for your recipients to understand how your work day went."},{"version_id":"823678301","version_name":"3.5.6","version_date":"2017-09-19 02:19:53.000 +0800","version_description":"[Enterprise Plaza]\n\nDingTalk brand new online Enterprise Plaza helps Small and Medium Business (SMB) discover new business opportunities and acquire new customers in China. By searching company names, products or even business, SMB will find potential partners and do business with over 40 million Chinese companies.   \n\nBy leveraging the new Business Leads Journal, managers will have clear picture not only about how many business leads discover every day, but also about how many new customers acquire by sales every day.\n\nPosting announcement on your enterprise home page is the best way to wide spread your company news, development, events, promotions, and success cases. Getting the important information to the potential partners or customers quickly.\n\nMajor optimization on enterprise home page customization, including edit of your organization's region and address details and display option of your smart office phone.\n\n[External contacts]\n\nNew upgraded statistic features will help managers get the whole picture of new customer acquisition and progress of customer relationship development, and figure out issues in business development immediately. \n\nShowing business development status by the view of enterprise level customer, which will help managers get more accurate understanding of enterprise level customer relationship development.\n\n[Partner Group]\n\nThe group created for external partner communication and collaboration could be upgraded to Partner Group. In the new Partner Group, partners’ company name and members’ personal real name will be displayed, and all resigning employees of partners will be automatically removed from the Partner Group, which will keep your business information confidential and safe."},{"version_id":"824035702","version_name":"4.0.0","version_date":"2017-10-19 14:32:20.000 +0800","version_description":"New Functions\nSmart Front Desk: Smart Front Desk is a new Facial Recognition function of DingTalk Attendance. Precise facial recognition only take 0.6 second, and passing by Smart Front Desk is enough for attendance check-in. \nStreamline: streamline mode will organize chats into different categories, and filter out unimportant messages, helping you concentrate on critical messages and works. \nDING Calendar: Like a personal assistant who can help you sort out tasks, meetings, and important events, and enhance your work efficiency dramatically.\n\nNew Design\nBrand new interface: new interface design, perfect matching iOS11 style.\nNew iPad version: Split View and Multitasking. Better interactive operation experience.\n \nOther New Functions\n「DING」 \nSupport Meeting follow tasks feature. Decisions in meeting can be converted to tasks and assigned to corresponding owner with deadline. \nInvited meeting attendees can also send meeting invitation to others to join the same meeting.\nSupport edit and recall on the DING already sent out.\nAttendance: support repeatable attendance rule for shift arrangement, very useful to shift arrangement with repeated pattern, such as one-day off after three-day work, or, 3 shifts per day."},{"version_id":"824136137","version_name":"4.0.1","version_date":"2017-10-28 13:58:28.000 +0800","version_description":"New Functions\nSmart Front Desk: Smart Front Desk is a new Facial Recognition function of DingTalk Attendance. Precise facial recognition only take 0.6 second, and passing by Smart Front Desk is enough for attendance check-in. \nStreamline: streamline mode will organize chats into different categories, and filter out unimportant messages, helping you concentrate on critical messages and works. \nDING Calendar: Like a personal assistant who can help you sort out tasks, meetings, and important events, and enhance your work efficiency dramatically.\n\nNew Design\nBrand new interface: new interface design, perfect matching iOS11 style.\nNew iPad version: Split View and Multitasking. Better interactive operation experience.\n \nOther New Functions\n「DING」 \nSupport Meeting follow tasks feature. Decisions in meeting can be converted to tasks and assigned to corresponding owner with deadline. \nInvited meeting attendees can also send meeting invitation to others to join the same meeting.\nSupport edit and recall on the DING already sent out.\nAttendance: support repeatable attendance rule for shift arrangement, very useful to shift arrangement with repeated pattern, such as one-day off after three-day work, or, 3 shifts per day."},{"version_id":"824342729","version_name":"4.1.0","version_date":"2017-11-15 15:12:21.000 +0800","version_description":"[DING]\n1.  In this new version, people who assign DING tasks can help assignee to mark tasks as completed, or reopen tasks for assignee.\n2.  Support to send reminders via Short Message or Voice Call, no need to worry about missing reminders of tasks any more.\n3.  DING messages will show in calendar view and provide you a more holistic view of all daily events.\n\n[Attendance]\n1.  Facial recognition, the new innovative technology, applies to attendance clock in now. Attendance now also support smile recognition, and, smile wall makes your team work starting with smile and work with smile.\n2.  No need for administrator to move people from one shift to another, employees can raise shift change request, and transit will be done automatically after request is approved.\n\n[Approval]\nOne Over Time request can cover a group of people, no need to request multiple Over Time by each individual, new feature makes approval more efficient."},{"version_id":"824420618","version_name":"4.1.1","version_date":"2017-11-16 15:30:11.000 +0800","version_description":"[DING]\n1.  In this new version, people who assign DING tasks can help assignee to mark tasks as completed, or reopen tasks for assignee.\n2.  Support to send reminders via Short Message or Voice Call, no need to worry about missing reminders of tasks any more.\n3.  DING messages will show in calendar view and provide you a more holistic view of all daily events.\n\n[Attendance]\n1.  Facial recognition, the new innovative technology, applies to attendance clock in now. Attendance now also support smile recognition, and, smile wall makes your team work starting with smile and work with smile.\n2.  No need for administrator to move people from one shift to another, employees can raise shift change request, and transit will be done automatically after request is approved.\n\n[Approval]\nOne Over Time request can cover a group of people, no need to request multiple Over Time by each individual, new feature makes approval more efficient."},{"version_id":"824624115","version_name":"4.1.3","version_date":"2017-11-30 09:55:21.000 +0800","version_description":"1. Upgraded streamline mode help you keep focused.\n2. Fixing bugs to guarantee user experience."},{"version_id":"825145042","version_name":"4.1.5","version_date":"2017-12-05 11:22:05.000 +0800","version_description":"1. Upgraded streamline mode help you keep focused.\n2. Fixing bugs to guarantee user experience."},{"version_id":"825254238","version_name":"4.2.0","version_date":"2017-12-12 10:14:31.000 +0800","version_description":"【DING Calendar】 Reminders of daily report, weekly report and work summary have been added into DING calendar. Notification will be sent out automatically and you can jump from reminder in calendar to report app to finish your report. \n\n【Sticker】 Brand new GIF now online in DingTalk, you can find the most popular GIF here, and make your chat more interesting.\n\n【External Contact】 GPS information is available now in external contacts profile. You can add location information of your customers, and start navigation by click the location in external contacts profile. \n\n【Select by Role】 Roles based selection is now available in creating chat group or notification. When you want to create a chat or send out notification, you can just select the roles, such as Sales, Finance, or Admin, to start. One more dimension for you to quickly start a chat group. \n\n【New VoIP Call】 New design of voice call on network brings more user friendly experience."},{"version_id":"825325007","version_name":"4.3.4","version_date":"2018-04-01 00:08:33.000 +0800","version_description":"Fixing bugs to guarantee user experience."},{"version_id":"825325007","version_name":"4.2.1","version_date":"2017-12-18 23:54:45.000 +0800","version_description":"【DING Calendar】 Reminders of daily report, weekly report and work summary have been added into DING calendar. Notification will be sent out automatically and you can jump from reminder in calendar to report app to finish your report. \n\n【Sticker】 Brand new GIF now online in DingTalk, you can find the most popular GIF here, and make your chat more interesting.\n\n【External Contact】 GPS information is available now in external contacts profile. You can add location information of your customers, and start navigation by click the location in external contacts profile. \n\n【Select by Role】 Roles based selection is now available in creating chat group or notification. When you want to create a chat or send out notification, you can just select the roles, such as Sales, Finance, or Admin, to start. One more dimension for you to quickly start a chat group. \n\n【New VoIP Call】 New design of voice call on network brings more user friendly experience."},{"version_id":"825416463","version_name":"4.2.2","version_date":"2017-12-22 00:55:50.000 +0800","version_description":"【DING Calendar】 Reminders of daily report, weekly report and work summary have been added into DING calendar. Notification will be sent out automatically and you can jump from reminder in calendar to report app to finish your report. \n\n【Sticker】 Brand new GIF now online in DingTalk, you can find the most popular GIF here, and make your chat more interesting.\n\n【External Contact】 GPS information is available now in external contacts profile. You can add location information of your customers, and start navigation by click the location in external contacts profile. \n\n【Select by Role】 Roles based selection is now available in creating chat group or notification. When you want to create a chat or send out notification, you can just select the roles, such as Sales, Finance, or Admin, to start. One more dimension for you to quickly start a chat group. \n\n【New VoIP Call】 New design of voice call on network brings more user friendly experience."},{"version_id":"825491793","version_name":"4.2.5","version_date":"2018-01-05 12:01:02.000 +0800","version_description":"- Announcement global version \n- Approval global version \n- New global user guide \n- Customer online feedback support"},{"version_id":"825550091","version_name":"4.2.6","version_date":"2018-01-07 10:02:13.000 +0800","version_description":"- Announcement global version \n- Approval global version \n- New global user guide \n- Customer online feedback support"},{"version_id":"825744722","version_name":"4.2.7","version_date":"2018-01-24 07:55:29.000 +0800","version_description":"【DING】\n1. optimized long press menu of messages on iOS, easier to use.\n2. 1 on 1 DING message will be shown in conversation.\n3. Email schedule will sync to DING calendar.\n\n【Ding Drive】\n1. Tutorial video on Ding Drive can be play online, no need to download.\n2. Ding Drive share zone authority upgraded, safer for internal files."},{"version_id":"825753188","version_name":"4.2.8","version_date":"2018-01-26 00:23:29.000 +0800","version_description":"1. Introduce \"Buzz\" mode, never miss a single important message when your phone is muted.\n2. Video on Ding Drive can be played online, no need to download.\n3. Support saving multiple original images into Ding Drive.\n4. Email schedule will sync to DING calendar automatically."},{"version_id":"825998775","version_name":"4.3.0","version_date":"2018-03-02 00:14:16.000 +0800","version_description":"[Internet Conference]\nFree voice conference up to 16 people; Enable efficient communications across the world.\n\n[Group Live]\nA new solution for business training; Transfer group chat into live stream; Support cross group live stream."},{"version_id":"826123289","version_name":"4.3.0","version_date":"2018-03-02 00:14:16.000 +0800","version_description":"[Internet Conference]\nFree voice conference up to 16 people; Enable efficient communications across the world.\n\n[Group Live]\nA new solution for business training; Transfer group chat into live stream; Support cross group live stream."},{"version_id":"826308571","version_name":"4.3.2","version_date":"2018-03-16 07:35:55.000 +0800","version_description":"Ding Drive: Check Ding Drive files directly from iOS 11 \"Files\" application."},{"version_id":"826326575","version_name":"4.3.3","version_date":"2018-03-30 09:49:41.000 +0800","version_description":"Fixing bugs to guarantee user experience."},{"version_id":"826521345","version_name":"4.3.4","version_date":"2018-04-01 00:08:33.000 +0800","version_description":"Fixing bugs to guarantee user experience."},{"version_id":"826672781","version_name":"4.3.5","version_date":"2018-04-17 09:51:17.000 +0800","version_description":"- Easily reedit recalled messages\n- Wanna get rid of  annoying feature notice? Set “Do not disturb” now\n- Share group links to invite friends and colleagues eaily\n- Brand new sticker mall for sticker lovers\n- Upgraded share function from DingTalk to other apps"},{"version_id":"827180577","version_name":"4.3.7","version_date":"2018-05-21 03:58:38.000 +0800","version_description":"1. Security center, customize your own privacy settings.\n2. Improved report feature, mark down whatever you want.\n3. Improved location accuracy.\n4. New report user interface, much more easier to use.\n5. Don’t have enough time to listen voice message? Convert it into text in one click! (English only)"},{"version_id":"827427112","version_name":"4.3.9","version_date":"2018-06-06 09:03:39.000 +0800","version_description":"Fixing bugs to guarantee user experience."},{"version_id":"827443474","version_name":"4.3.10","version_date":"2018-06-09 01:17:47.000 +0800","version_description":"Fixing bugs to guarantee user experience."},{"version_id":"827598219","version_name":"4.5.0","version_date":"2018-06-21 11:42:23.000 +0800","version_description":"1. Check-in is available now! Share your footprint to your team easily!\n2. Easily invite people from other IM Apps.\n3. Use chatbot and enjoy smart chatting!\n4. Guidebook upgraded, enjoy a new and informative guidebook.\n5. Optimization on reports\n6. Bugs fixed"},{"version_id":"827623027","version_name":"4.5.1","version_date":"2018-06-22 01:02:15.000 +0800","version_description":"1. Check-in is available now! Share your footprint to your team easily!\n2. Easily invite people from other IM Apps.\n3. Use chatbot and enjoy smart chatting!\n4. Guidebook upgraded, enjoy a new and informative guidebook.\n5. Optimization on reports\n6. Bugs fixed"},{"version_id":"827811165","version_name":"4.5.3","version_date":"2018-07-11 18:54:38.000 +0800","version_description":"This version optimizes multiple product user experiences, making it even easier to use.\n1. Add frequently used stickers，quickly find the stickers you want;\n2. Support the search department, quickly locate the department structure, find people more convenient;\n3. View more than 100MB Excel charts, design drawings, etc. without downloading, you can zoom in or view horizontally;\n4. Quickly view PSD, AI and other design files on macOS without installing software, look at the picture faster!"},{"version_id":"828067161","version_name":"4.5.5","version_date":"2018-08-11 07:49:57.000 +0800","version_description":"User experience optimization\n1. Long press on the selected picture in the chat to quickly mark the picture;\n2. The search results support a secure watermark to prevent the screenshot from leaking out;\n3. Add more interesting Emoji expressions, and chats could be fun.\n\nOffice collaboration optimization\n1. The report function supports monthly statistics and reminders, so the monthly work is clear at a glance;\n2. Ding Drive upgrade supports file search in any directory, so finding file is more convenient!"},{"version_id":"828307365","version_name":"4.5.10","version_date":"2018-09-06 07:14:40.000 +0800","version_description":"DingTalk Industry Solutions\nDingTalk has a variety of business use cases. Intending to create a new convenience in working, it aims to create a people-oriented, data-driven industry solution. \n\nOptimized User Experience:\n1. Unified method to setup teams, new friends and team members can be added easily.\n2. Organization’s address book optimizes interaction by inviting team members to join the team through various channels;\n3. Search engine is equipped intelligently to search for errors due to mistyped pin yin, allowing for a better and smarter matching for the appropriate words. \n4. Live broadcasts can be launched quickly and waiting time through dial ins can be eliminated. \n5. Live broadcasts will be played immediately when you enter the group with the session, making it super convenient to log in. \n6. Video conference now supports fast redialing to ensure undisrupted meetings;\n7. While calls are being answered, windows can be conveniently minimized, allowing for uninterrupted messaging and work.\n8. Recurring meetings can be inputted to ensure worry free planning. \n\n\n\nOptimized Management function:\n1.  Errors due to duplicates or incorrect formatting is detected to ensure importing and exporting of data is accurate.\n2.  New option which allows internal team members to join departments automatically, decreasing the need to rejoin groups and departments."},{"version_id":"828554171","version_name":"4.5.11","version_date":"2018-09-19 21:17:12.000 +0800","version_description":"User experience optimization\n\n1. The layout of the organizational structure in the address book is redesigned, and the departmental structure is clearer;\n2. When members are invited to join the company/team, members can upload photos (badge, selfie, etc.) to prove their identity. It is easier for administrators to judge the authenticity of joining membership;\n3. When login DingTalk the first time, you can use the mobile phone verification code to log in;\n4. The voice message in the chat supports the progress bar drag and play, no longer have to worry about waiting for 60 seconds to listen from the beginning;\n\nApproval function optimization\n\n1. The approval management permission is subdivided into templates, and the administrator can only edit and export the templates that have permissions to them;\n2. When the approver resigned, the approval process is not interrupted, and the main administrator can forward the unfinished approval form on the report export page."},{"version_id":"828770291","version_name":"4.5.12","version_date":"2018-10-11 08:38:39.000 +0800","version_description":"User experience optimization\n1. The layout of the organizational structure in the address book is redesigned, and the departmental structure is clearer;\n2. When members are invited to join the company/team, members can upload photos (badge, selfie, etc.) to prove their identity. It is easier for administrators to judge the authenticity of joining membership;\n3. When login DingTalk the first time, you can use the mobile phone verification code to log in;\n4. The voice message in the chat supports the progress bar drag and play, no longer have to worry about waiting for 60 seconds to listen from the beginning;\n\nApproval function optimization\n\n1. The approval management permission is subdivided into templates, and the administrator can only edit and export the templates that have permissions to them;\n2. When the approver resigned, the approval process is not interrupted, and the main administrator can forward the unfinished approval form on the report export page."},{"version_id":"828888604","version_name":"4.5.15","version_date":"2018-10-13 11:17:55.000 +0800","version_description":"It's easier for administrators to verify new member:\nThe administrator can set 3 custom questions to verify the join requirement of members.\n\nBasic function optimization:\nDND list under stream line mode only show those messages which @ you.\n\nSearch enhancement:\nSearch of Dingtalk now supports searching for DING, Ding Mail, and Ding Driver."},{"version_id":"829149385","version_name":"4.7.25","version_date":"2020-01-01 18:09:17.000 +0800","version_description":"- As the host in a video conference, you can mute all participants or lock the meeting etc. Seamlessly switch between mobile phone and laptop, allowing audience to enjoy a smooth presentation."},{"version_id":"829149385","version_name":"4.6.25","version_date":"2019-04-18 09:40:51.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"829149385","version_name":"4.7.22","version_date":"2019-12-20 09:35:10.000 +0800","version_description":"- You can now send messages to “My Session“ and plot your story and record your inspiration when you need. Transfer and synchronize your files, videos and photos between mobile phone and laptop becomes more convenient though “My Session“."},{"version_id":"829149385","version_name":"4.7.15","version_date":"2019-10-31 09:59:12.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"829149385","version_name":"4.7.1","version_date":"2019-08-14 09:42:30.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"829149385","version_name":"4.6.40","version_date":"2019-07-18 09:41:37.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"829149385","version_name":"4.7.0","version_date":"2019-07-31 10:54:08.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"829149385","version_name":"4.6.34","version_date":"2019-06-11 09:24:19.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"829149385","version_name":"4.6.36","version_date":"2019-06-21 08:52:57.000 +0800","version_description":"[Intelligent Forms]\nApproval forms now automatically adjust to your usage. Example: Selecting the Reimbursement form [Car Ride] will provide you with a route information field."},{"version_id":"829149385","version_name":"4.6.3","version_date":"2018-12-05 11:16:45.000 +0800","version_description":"Essential Features Upgrade\n1. \"Join Organization\" feature upgrade. New organization members can join teams by scanning QR codes from members around them.\n2. Administrators can configure \"Organization Join Methods\" in \"Organization Management\".\n\nDING Upgrade\n1. We have revised the Calendar feature. Meetings, Schedules, and Tasks are now all organized and easy to access.\n2. Team members can now share Calendar schedules between each other, ensuring collaboration with even greater effectiveness."},{"version_id":"829149385","version_name":"4.6.16","version_date":"2019-03-02 10:23:41.000 +0800","version_description":"Work Communications Secure and Effective\n[Communication Optimizations]\nShared links allow automatic conversion to cards for more efficient viewing and sharing.\nAutomatic transcription for audio messages.\nOrganize chat contents with collapsible likes.\n\n[Calendar Enhancements]\nYou can create recurring events and schedule daily or weekly meetings with reminders.\nMembers that have shared Calendars can view each others schedule details."},{"version_id":"829149385","version_name":"4.6.18","version_date":"2019-03-14 08:38:14.000 +0800","version_description":"[User Experience Optimizations]\n1. Phone numbers in profile details now support extensions and can be dialed directly. Use commas (,) or number signs (#) to indicate the extension.\n2. You can go to \"Me\" > \"Settings\" > \"My Organizations\" to view and switch between all your active Organizations."},{"version_id":"829149385","version_name":"4.6.13","version_date":"2019-02-15 09:49:42.000 +0800","version_description":"[Event Enhanced]\nYou can now make meeting room reservations while creating an Event."},{"version_id":"829149385","version_name":"4.6.15","version_date":"2019-02-28 10:17:44.000 +0800","version_description":"Work Communications Secure and Effective\n\n[Communication Optimizations]\nShared links allow automatic conversion to cards for more efficient viewing and sharing.\nAutomatic transcription for audio messages.\nOrganize chat contents with collapsible likes.\n\n[Calendar Enhancements]\nYou can create recurring events and schedule daily or weekly meetings with reminders.\nMembers that have shared Calendars can view each others schedule details."},{"version_id":"829149385","version_name":"4.5.18","version_date":"2018-11-03 10:47:41.000 +0800","version_description":"1. Submission on behalf is supported, including various requests of leave, out-of-office, reimbursement, and item. When you are inconvenient, you can ask your colleagues for help.\n2. It is now easier to manage and clear the messages in the file assistant.\n3. On the Mac, Ding Drive supports folder downloading, downloading the entire folder with one click, and no longer need to operate multiple times."},{"version_id":"829149385","version_name":"4.6.0","version_date":"2018-12-01 11:52:05.000 +0800","version_description":"Essential Features Upgrade\n1. \"Join Organization\" feature upgrade. New organization members can join teams by scanning QR codes from members around them.\n2. Administrators can configure \"Organization Join Methods\" in \"Organization Management\".\n\nDING Upgrade\n1. We have revised the Calendar feature. Meetings, Schedules, and Tasks are now all organized and easy to access.\n2. Team members can now share Calendar schedules between each other, ensuring collaboration with even greater effectiveness."},{"version_id":"829369981","version_name":"4.6.0","version_date":"2018-12-01 11:52:05.000 +0800","version_description":"Essential Features Upgrade\n1. \"Join Organization\" feature upgrade. New organization members can join teams by scanning QR codes from members around them.\n2. Administrators can configure \"Organization Join Methods\" in \"Organization Management\".\n\nDING Upgrade\n1. We have revised the Calendar feature. Meetings, Schedules, and Tasks are now all organized and easy to access.\n2. Team members can now share Calendar schedules between each other, ensuring collaboration with even greater effectiveness."},{"version_id":"829508228","version_name":"4.6.3","version_date":"2018-12-05 11:16:45.000 +0800","version_description":"Essential Features Upgrade\n1. \"Join Organization\" feature upgrade. New organization members can join teams by scanning QR codes from members around them.\n2. Administrators can configure \"Organization Join Methods\" in \"Organization Management\".\n\nDING Upgrade\n1. We have revised the Calendar feature. Meetings, Schedules, and Tasks are now all organized and easy to access.\n2. Team members can now share Calendar schedules between each other, ensuring collaboration with even greater effectiveness."},{"version_id":"829651950","version_name":"4.6.5","version_date":"2018-12-17 09:40:46.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"829760200","version_name":"4.6.6","version_date":"2018-12-28 22:06:50.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"829792518","version_name":"4.6.8","version_date":"2019-01-02 10:15:39.000 +0800","version_description":"【IM】\n- Effective communication is essential for efficiency. You can now designate Moderators to manage chat groups. \n- Brilliant ideas often arrive unannounced. Create a Nearby Group on-the-fly by entering the same Passcode as people around you.\n- VoIP and Video Call have been upgraded with call Encryption to ensure security and privacy.\n\n【DingTalk Swipe】\n- Jumpstart your \"Exchange Card\" experience with our interactive tutorial featuring DingSanDuo.\n- Create new connections with every scan. You can now scan the QR Code with any App to join an exchange session.\n- Your work status can be updated on the personal information page directly.\n\n【DING Event】\n- Share your schedule to chats for effective communications and efficient Meetings.\n\n【Approval】\n- Share Approval requests and results to chats to ensure effective communication and Approval efficiency.\n\n【Ding Drive】\n- Ding Drive now supports Thumbnail View. Find the file you need with efficiency.\n- Share important documents with the click of a button. You can now send the file path of any public files stored in Ding Drive to chats."},{"version_id":"829961163","version_name":"4.6.10","version_date":"2019-01-18 09:49:36.000 +0800","version_description":"Breaking the 60 Seconds Limitation so You Can Enjoy Effective Communications for Even Higher Efficiency\n\n[60 Seconds is Just the Start]\n\nVoice messages increased from 60 seconds to 300 seconds with controllable playback bar. No more broken sentences.\n\n[Event Groups]\n\nCreate event groups with all the participants and no one is left out of the loop.\n\n[File Preview and Access History]\n\nSave phone storage with online file preview. File access history clearing for confidentiality.\n\n[Quick Replies]\n\nAdded quick replies for Voice Calls. Leave messages when the contact can't be reached and send prompt responses when you're unavailable."},{"version_id":"830084755","version_name":"4.6.11","version_date":"2019-01-30 09:57:41.000 +0800","version_description":"This update includes bug fixes and user interface improvements.\n\n\n\nRecent updates:\n\n[60 Seconds is Just the Start]\n\nVoice messages increased from 60 seconds to 300 seconds with controllable playback bar. No more broken sentences.\n\n[Event Groups]\n\nCreate event groups with all the participants and no one is left out of the loop.\n\n[File Preview and Access History]\n\nSave phone storage with online file preview. File access history clearing for confidentiality.\n\n[Quick Replies]\n\nAdded quick replies for Voice Calls. Leave messages when the contact can't be reached and send prompt responses when you're unavailable."},{"version_id":"830264590","version_name":"4.6.12","version_date":"2019-02-14 11:21:09.000 +0800","version_description":"[Event Enhanced]\nYou can now make meeting room reservations while creating an Event."},{"version_id":"830289644","version_name":"4.6.13","version_date":"2019-02-15 09:49:42.000 +0800","version_description":"[Event Enhanced]\nYou can now make meeting room reservations while creating an Event."},{"version_id":"830434911","version_name":"4.6.15","version_date":"2019-02-28 10:17:44.000 +0800","version_description":"Work Communications Secure and Effective\n\n[Communication Optimizations]\nShared links allow automatic conversion to cards for more efficient viewing and sharing.\nAutomatic transcription for audio messages.\nOrganize chat contents with collapsible likes.\n\n[Calendar Enhancements]\nYou can create recurring events and schedule daily or weekly meetings with reminders.\nMembers that have shared Calendars can view each others schedule details."},{"version_id":"830458220","version_name":"4.6.16","version_date":"2019-03-02 10:23:41.000 +0800","version_description":"Work Communications Secure and Effective\n[Communication Optimizations]\nShared links allow automatic conversion to cards for more efficient viewing and sharing.\nAutomatic transcription for audio messages.\nOrganize chat contents with collapsible likes.\n\n[Calendar Enhancements]\nYou can create recurring events and schedule daily or weekly meetings with reminders.\nMembers that have shared Calendars can view each others schedule details."},{"version_id":"830565211","version_name":"4.6.18","version_date":"2019-03-14 08:38:14.000 +0800","version_description":"[User Experience Optimizations]\n1. Phone numbers in profile details now support extensions and can be dialed directly. Use commas (,) or number signs (#) to indicate the extension.\n2. You can go to \"Me\" > \"Settings\" > \"My Organizations\" to view and switch between all your active Organizations."},{"version_id":"830676838","version_name":"4.6.20","version_date":"2019-03-28 00:20:25.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"830841005","version_name":"4.6.21","version_date":"2019-04-04 09:50:01.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"830990920","version_name":"4.6.25","version_date":"2019-04-18 09:40:51.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"831224805","version_name":"4.6.28","version_date":"2019-05-16 08:06:28.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"831472452","version_name":"4.6.33","version_date":"2019-05-30 09:49:16.000 +0800","version_description":"[Smarter Approvals ]\nApproval forms now support affiliations. Example: Link your Expense Approvals to Business Trip Approvals for full transparency and clear traceability."},{"version_id":"831613454","version_name":"4.6.34","version_date":"2019-06-11 09:24:19.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"831711731","version_name":"4.6.36","version_date":"2019-06-21 08:52:57.000 +0800","version_description":"[Intelligent Forms]\nApproval forms now automatically adjust to your usage. Example: Selecting the Reimbursement form [Car Ride] will provide you with a route information field."},{"version_id":"831820962","version_name":"4.6.37","version_date":"2019-06-30 10:42:34.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"831886074","version_name":"4.6.38","version_date":"2019-07-07 13:17:21.000 +0800","version_description":"[Communication Optimization]\nLong image in the dialog box no longer fills up the entire screen. It supports the automatic folding of long image , and has a small \"long image\" sign, which makes it convenient to find and easy to open. It's easy to both send and view images. \nWhen directing a message using @, the read/unread status of the directed person is separately viewed allowing for effective communication.\n\n[Performance optimization]\nVoice Calling qualitiy improvements allow for more effective communication.\nReport: increased page loading for more efficient use."},{"version_id":"831951427","version_name":"4.6.39","version_date":"2019-07-11 09:25:50.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"832045783","version_name":"4.6.40","version_date":"2019-07-18 09:41:37.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"832109807","version_name":"4.6.41","version_date":"2019-07-29 20:59:16.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"832191880","version_name":"4.7.0","version_date":"2019-07-31 10:54:08.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"832348210","version_name":"4.7.1","version_date":"2019-08-14 09:42:30.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"832381826","version_name":"4.7.5","version_date":"2019-09-09 05:36:51.000 +0800","version_description":"[Thread]\nAll responses to the same message are automatically associated to form a thread, click on the thread to expand to view all associated responses.\n\n[Full screen input and graphic mixing]\nAdded full-screen input function to support text and images in the same message.​"},{"version_id":"832742784","version_name":"4.7.8","version_date":"2019-09-13 07:18:54.000 +0800","version_description":"You can now react with Emojis to the message that mentioned you.\n\nThis update includes bug fixes and user interface improvements."},{"version_id":"832827689","version_name":"4.7.9","version_date":"2019-09-25 08:56:12.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"833081248","version_name":"4.7.10","version_date":"2019-10-09 10:07:09.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"833180632","version_name":"4.7.11","version_date":"2019-10-19 09:41:13.000 +0800","version_description":"Fixed some compatibility issues with iOS 13."},{"version_id":"833283763","version_name":"4.7.12","version_date":"2019-10-23 15:01:18.000 +0800","version_description":"- You can now select multiple images and save them in batches. Images can be saved without effort with one click . \n\n- You can now re-edit recalled message in Full Screen Input mode. Also, you can continue editing your content from text field after switching to Full Screen Input mode."},{"version_id":"833385268","version_name":"4.7.15","version_date":"2019-10-31 09:59:12.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"833672160","version_name":"4.7.16","version_date":"2019-11-22 10:33:53.000 +0800","version_description":"- We now support Read/Unread and DING feature in the CC of Approval application."},{"version_id":"833781879","version_name":"4.7.17","version_date":"2019-12-03 09:17:48.000 +0800","version_description":"[Regular Call]\n- Even if you did not save someone's phone number on your mobile, you can now see who is calling with DingTalk Regular Call. Business card information on DingTalk will be synchronized and displayed when receiving the call. It will never be embarrassing to know who is calling, isn't it? \n\n[Calendar]\n- You can now generate an event QR Code by one-click and share to different chats. Colleagues can join a public event schedule by just scanning the QR Code."},{"version_id":"833949675","version_name":"4.7.19","version_date":"2019-12-13 10:06:04.000 +0800","version_description":"[To-do Feature Upgrade]\n- You can now find approvals that CC'd you from To-do list, making it easier to track your approvals.\n﻿\n[Dark Mode]\n- In iOS 13.0 and later, we now have a dark theme allowing you to manually select whether the app should use a light or dark theme, or change the theme based on the system-wide darkmode feature."},{"version_id":"833999466","version_name":"4.7.20","version_date":"2019-12-14 00:27:02.000 +0800","version_description":"[To-do Feature Upgrade]\n- You can now find approvals that CC'd you from To-do list, making it easier to track your approvals.\n﻿\n[Dark Mode]\n- In iOS 13.0 and later, we now have a dark theme allowing you to manually select whether the app should use a light or dark theme, or change the theme based on the system-wide darkmode feature."},{"version_id":"834036613","version_name":"4.7.21","version_date":"2019-12-18 10:18:12.000 +0800","version_description":"- You can now send messages to “My Session“ and plot your story and record your inspiration when you need. Transfer and synchronize your files, videos and photos between mobile phone and laptop becomes more convenient though “My Session“."},{"version_id":"834062994","version_name":"4.7.22","version_date":"2019-12-20 09:35:10.000 +0800","version_description":"- You can now send messages to “My Session“ and plot your story and record your inspiration when you need. Transfer and synchronize your files, videos and photos between mobile phone and laptop becomes more convenient though “My Session“."},{"version_id":"834120483","version_name":"4.7.25","version_date":"2020-01-01 18:09:17.000 +0800","version_description":"- As the host in a video conference, you can mute all participants or lock the meeting etc. Seamlessly switch between mobile phone and laptop, allowing audience to enjoy a smooth presentation."},{"version_id":"834564917","version_name":"4.7.27","version_date":"2020-02-04 09:50:20.000 +0800","version_description":"-Host DingTalk video conference call with up to 302 participants on-demand for free, support organizations collaborate effectively while work from home."},{"version_id":"834605697","version_name":"4.7.29","version_date":"2020-02-07 10:17:00.000 +0800","version_description":"- DingTalk now supports \"Add to Favorites\" feature on desktop version of DingTalk. You can type \"My Session\" in the search bar and find messages added to \"Favorites\" in \"My Session\"."},{"version_id":"834636904","version_name":"4.7.30","version_date":"2020-02-08 10:03:45.000 +0800","version_description":"- DingTalk now supports \"Add to Favorites\" feature on desktop version of DingTalk. You can type \"My Session\" in the search bar and find messages added to \"Favorites\" in \"My Session\"."},{"version_id":"834703198","version_name":"4.7.31","version_date":"2020-02-17 07:17:29.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"834766096","version_name":"4.7.32","version_date":"2020-02-19 09:35:23.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"834792829","version_name":"5.0.0","version_date":"2020-02-21 15:41:31.000 +0800","version_description":"- You can now modify fonts and insert images, tables and links in your report . \n- In order to facilitate the efficiency of group notifications during the epidemic period, \"In-App DING\" is provided free of charge with unlimited quota from now on. (Phone DING and SMS DING feature not included)"},{"version_id":"834844231","version_name":"5.0.1","version_date":"2020-02-25 11:25:38.000 +0800","version_description":"- You can now modify fonts and insert images, tables and links in your report . \n- In order to facilitate the efficiency of group notifications during the epidemic period, \"In-App DING\" is provided free of charge with unlimited quota from now on. (Phone DING and SMS DING feature not included)"},{"version_id":"834895581","version_name":"5.0.5","version_date":"2020-02-28 11:44:40.000 +0800","version_description":"- [Group Broadcast] For teachers who started live broadcast, system will automatically generates a broadcast report for you. For parents/students watching live broadcast, you can now mirror your phone to TV. Larger screen is always more eye-friendly.\n﻿\n- [Video Conference] System will display \"who\" is speaking during the call, making the conference communication more efficient.\n﻿\n- [Video Conference] When you are in a video conference on your mobile phone, you can now rotate the mobile screen, which enables you to switch freely between in landscape (horizontal) and portrait (vertical)."},{"version_id":"834991943","version_name":"5.0.6","version_date":"2020-03-12 09:41:36.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"835149691","version_name":"5.0.8","version_date":"2020-03-19 11:30:39.000 +0800","version_description":"-[Wiki Update]Wiki members can be added by department, All-Hands Library and more templates have been added."},{"version_id":"835324474","version_name":"5.0.9","version_date":"2020-03-31 11:21:15.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"835338838","version_name":"5.0.10","version_date":"2020-03-31 22:55:53.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"835408473","version_name":"5.0.11","version_date":"2020-04-08 09:53:33.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"835455518","version_name":"5.0.15","version_date":"2020-04-10 10:06:58.000 +0800","version_description":"[Form can be installed on the workbench]\nForms created in [Smart Forms] and [Class Forms] can be installed as quick accesses on the workbench, which makes it more convenient for employees/parents to fill in."},{"version_id":"835652819","version_name":"5.0.16","version_date":"2020-04-26 11:43:31.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"835841398","version_name":"5.1.0","version_date":"2020-05-07 12:13:13.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"835920645","version_name":"5.1.1","version_date":"2020-05-13 15:16:46.000 +0800","version_description":"[Video Meeting Security Upgrade]\nThe host can lock the screen sharing to only allow himself to share the screen.\nThe host can lock the meeting to only allow himself to invite others to join the meeting."},{"version_id":"836023709","version_name":"5.1.2","version_date":"2020-05-21 16:12:10.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"836092811","version_name":"5.1.2","version_date":"2020-05-21 16:12:10.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"836144085","version_name":"5.1.5","version_date":"2020-06-08 11:09:12.000 +0800","version_description":"[Chat Quick Entry Bar]\nPrivate chat can enable quick entry bar now. When enabled, you can directly access @me, calendar, task, approval, report and so on for efficient collaboration."},{"version_id":"836338662","version_name":"5.1.7","version_date":"2020-06-12 13:56:45.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"836438735","version_name":"5.1.8","version_date":"2020-06-19 16:00:34.000 +0800","version_description":"[Calendar Event can be copied for creating]\nExisting calendar event can be copied for creating a new one when it is similar or the same.\n﻿\n[Approval updated]\nAdd phone number, ID card number, signature widgets in Approval. Phone number and ID card number widgets have auto check and signature widget supports handwritten signature.\n\n[Wiki supports watermarks]\nAdmin can enable watermarks in Wiki to trace screenshot’s owner for information security."},{"version_id":"836548665","version_name":"5.1.9","version_date":"2020-06-28 10:09:33.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"836609742","version_name":"5.1.10","version_date":"2020-07-03 13:57:12.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"836745844","version_name":"5.1.11","version_date":"2020-07-10 09:59:31.000 +0800","version_description":"[Full-text Search in Wiki]\nWiki supports full-text search, finding what you want is quicker and easier."},{"version_id":"836823997","version_name":"5.1.12","version_date":"2020-07-16 10:08:41.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"836868073","version_name":"5.1.15","version_date":"2020-07-30 09:51:59.000 +0800","version_description":"[Wiki author displayed]\nInformation like author, updated time, count of readers are displayed at the bottom of each wiki.\n﻿\n[Chat file history supports wiki]\nWiki links shared to chats, could be found in the file category of messages history."},{"version_id":"837101824","version_name":"5.1.16","version_date":"2020-08-10 10:26:22.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"837319572","version_name":"5.1.18","version_date":"2020-08-18 10:27:52.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"837415143","version_name":"5.1.19","version_date":"2020-08-20 10:14:15.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"837441130","version_name":"5.1.20","version_date":"2020-08-21 00:17:18.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"837526816","version_name":"5.1.21","version_date":"2020-08-28 12:44:03.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"837603974","version_name":"5.1.25","version_date":"2020-09-07 10:08:33.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"837690862","version_name":"5.1.26","version_date":"2020-09-10 10:31:59.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"837736042","version_name":"5.1.27","version_date":"2020-09-18 10:03:59.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"837906479","version_name":"5.1.28","version_date":"2020-09-24 10:04:51.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"838011071","version_name":"5.1.30","version_date":"2020-10-12 10:00:52.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"838244532","version_name":"5.1.33","version_date":"2020-10-21 14:29:15.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"838399596","version_name":"5.1.35","version_date":"2020-10-30 11:16:58.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"839237149","version_name":"5.1.36","version_date":"2020-11-19 12:50:10.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"839330209","version_name":"5.1.37","version_date":"2020-11-25 20:51:15.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"839377628","version_name":"5.1.38","version_date":"2020-12-01 11:15:26.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"839531786","version_name":"5.1.39","version_date":"2020-12-10 10:10:56.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"839583538","version_name":"5.1.40","version_date":"2020-12-18 10:13:27.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"839839893","version_name":"6.0.0","version_date":"2021-01-07 13:11:13.000 +0800","version_description":"DingTalk 6.0, A Brand New DingTalk is Here.\nLess for More,  \nOpen for More"},{"version_id":"839986860","version_name":"6.0.1","version_date":"2021-01-13 10:05:42.000 +0800","version_description":"DingTalk 6.0, A Brand New DingTalk is Here.\nLess for More  \nOpen for More"},{"version_id":"840041829","version_name":"6.0.2","version_date":"2021-01-18 09:37:42.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"840211306","version_name":"6.0.3","version_date":"2021-01-29 14:32:27.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"840313511","version_name":"6.0.4","version_date":"2021-02-03 10:31:18.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"840358937","version_name":"6.0.5","version_date":"2021-02-06 10:04:22.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"840425587","version_name":"6.0.6","version_date":"2021-02-18 10:52:10.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"840709747","version_name":"6.0.8","version_date":"2021-03-04 11:57:06.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"840788001","version_name":"6.0.9","version_date":"2021-03-09 10:57:13.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"840920203","version_name":"6.0.10","version_date":"2021-03-19 09:48:36.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"841139329","version_name":"6.0.12","version_date":"2021-04-01 11:06:23.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"841338568","version_name":"6.0.13","version_date":"2021-04-16 11:55:53.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"842020308","version_name":"6.0.15","version_date":"2021-05-01 10:54:20.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"842266073","version_name":"6.0.16","version_date":"2021-05-24 10:14:19.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"842468107","version_name":"6.0.18","version_date":"2021-06-07 09:41:38.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"842748421","version_name":"6.0.19","version_date":"2021-06-24 09:39:34.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"842826462","version_name":"6.0.20","version_date":"2021-06-28 17:20:21.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"843076269","version_name":"6.0.22","version_date":"2021-07-19 10:09:01.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"843296581","version_name":"6.0.23","version_date":"2021-07-29 10:24:18.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"843558911","version_name":"6.0.25","version_date":"2021-08-13 13:59:00.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"843611616","version_name":"6.0.26","version_date":"2021-08-16 15:54:58.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"843653233","version_name":"6.0.27","version_date":"2021-08-21 10:54:34.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"843781949","version_name":"6.0.28","version_date":"2021-08-26 10:33:16.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"843885891","version_name":"6.0.29","version_date":"2021-09-03 10:29:03.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"844024547","version_name":"6.0.30","version_date":"2021-09-10 17:03:03.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"844099921","version_name":"6.0.31","version_date":"2021-09-16 10:04:37.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"844139717","version_name":"6.3.0","version_date":"2021-09-26 10:17:58.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"844702707","version_name":"6.3.5","version_date":"2021-10-18 10:04:32.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"844839631","version_name":"6.3.7","version_date":"2021-10-22 10:39:23.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"845157716","version_name":"6.3.8","version_date":"2021-11-08 10:01:32.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"845279464","version_name":"6.3.10","version_date":"2021-11-16 11:31:47.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"845372684","version_name":"6.3.11","version_date":"2021-11-18 09:49:09.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"845673819","version_name":"6.3.15","version_date":"2021-12-06 10:04:46.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"845930955","version_name":"6.3.16","version_date":"2021-12-17 10:14:12.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"846126157","version_name":"6.3.20","version_date":"2021-12-23 10:52:28.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"846676663","version_name":"6.3.25","version_date":"2022-01-19 10:02:06.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"847101713","version_name":"6.3.30","version_date":"2022-02-21 09:53:27.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"847385772","version_name":"6.3.35","version_date":"2022-03-02 15:26:14.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"847587421","version_name":"6.3.40","version_date":"2022-03-10 17:17:07.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"847730000","version_name":"6.5.0","version_date":"2022-03-17 10:33:10.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"847866357","version_name":"6.5.5","version_date":"2022-03-24 11:24:02.000 +0800","version_description":"This update includes bug fixes and user interface improvements."},{"version_id":"848290512","version_name":"6.5.10","version_date":"2022-04-18 10:15:54.000 +0800","version_description":"This update includes bug fixes and user interface improvements."}]