[{"version_id":"815455405","version_name":"0.5.1","version_date":"2015-12-20 02:01:15.000 +0800","version_description":"Updates and enhancements under the hood.\nGroundwork for upcoming new features."},{"version_id":"816251294","version_name":"1.0.6","version_date":"2016-01-27 12:27:16.000 +0800","version_description":"So many new things that I've almost certainly broken something…\n\n• iPhone support! Now Volotic can be tiny and live in your pocket.\n• Plus Mode, with dozens of new towers, save functionality and more on the way.\n• If you purchased save functionality in the past, you get Plus Mode free.\n• Bug fixes, refactoring, optimizations, performance tweaks and all of the other stuff you see in every App Store update.\n\nIn return for all of these changes I ask that you…\n\n• Call your mom.\n• Clean up the crumbs on the counter.\n• Rate and review Volotic.\n• Check out my other work at www.scottmadethis.net."},{"version_id":"816778348","version_name":"1.0.10","version_date":"2016-03-23 06:28:06.000 +0800","version_description":"• Lots of internal updates that hopefully made things better instead of worse.\n• New Portal towers in Plus Mode—beats entering any \"A\" tower will emerge from all \"B\" towers and vice versa.\n• New Pattern towers in Plus Mode—these towers pass or block beats according to a set pattern.\n• I made the thing that asks for money slightly more annoying. Sorry. I need money to buy food and socks.\n\nPlease note: This release of Volotic is perfect and there are no bugs or shortcomings. If you find any bugs or shortcomings, they were probably added maliciously by the FBI through a secret backdoor."},{"version_id":"818312821","version_name":"1.0.17","version_date":"2016-10-29 06:25:39.000 +0800","version_description":"The previous version of Volotic had a bug that resulted in a child crying. Hopefully this version will not make any children cry. If you ever see or hear a crying child, it is probably because they need to update their apps.\n\nAlso, I updated a bunch of under-the-hood stuff and hopefully didn't break every single thing."},{"version_id":"841491713","version_name":"1.0.17","version_date":"2016-10-29 06:25:39.000 +0800","version_description":"The previous version of Volotic had a bug that resulted in a child crying. Hopefully this version will not make any children cry. If you ever see or hear a crying child, it is probably because they need to update their apps.\n\nAlso, I updated a bunch of under-the-hood stuff and hopefully didn't break every single thing."}]