[{"version_id":"815296068","version_name":"1.0.3","version_date":"2016-01-18 02:47:02.000 +0800","version_description":""},{"version_id":"818034305","version_name":"2.0.2","version_date":"2016-07-13 02:20:18.000 +0800","version_description":"1. support ipv6-only network<br>2. optimize  IM user experience<br>3. bug fix"},{"version_id":"822242488","version_name":"4.0","version_date":"2017-07-12 01:15:37.000 +0800","version_description":"• Receive Zhumu calls using the native phone UI<br>You can receive Zhumu calls using the native phone UI when Zhumu is not the active application, or when the phone is locked.<br><br>• Meeting features<br>     • Multiple participants can share their screen simultaneously<br>     Hosts can choose to have multiple participants share their screens. Tap the arrow next to the Share Screen button to control this feature. This feature is not available if the host is on a mobile device.<br><br>     • Meetings can have multiple co-hosts<br><br>• Webinar feature<br>     • Hosts and panelists can change their name during a webinar<br><br>• Support signing in with Touch ID<br><br>• Support quick actions with 3D touch<br><br>• Scheduled Meeting Notification Preferences<br><br><br>Bug fixes<br>​Minor enhancements"},{"version_id":"823169619","version_name":"4.0.1","version_date":"2017-08-30 02:08:15.000 +0800","version_description":"1、Receive Zhumu calls using the native phone UI (iOS 10)<br>When Zhumu is not the active application, or when the phone is locked you can receive Zhumu calls using the native phone UI. <br><br>2、Additional bug fixed"},{"version_id":"823625366","version_name":"4.0.2","version_date":"2017-09-15 02:03:14.000 +0800","version_description":"1、SMS authentication is needed when selecting Phone Contacts Matching;  <br>2、IM UI enhancements;   <br>3、Bug fixes"},{"version_id":"824045663","version_name":"4.0.4","version_date":"2018-01-04 14:55:42.000 +0800","version_description":"1. Support iPhone X<br>2. Minor bug fixes"},{"version_id":"827408241","version_name":"4.0.5","version_date":"2018-06-25 20:50:22.000 +0800","version_description":"1. Mobile phone number can be logged in as an Zhumu ID.<br>2. Bugfix"},{"version_id":"827972600","version_name":"4.0.6","version_date":"2018-07-27 10:58:24.000 +0800","version_description":"bug fix"},{"version_id":"829892552","version_name":"4.2.5","version_date":"2019-01-15 06:31:08.000 +0800","version_description":"1. Video filter，If you select the Apply video filter option, your video display is retouched with a soft focus. Configure this setting in Video Settings.<br>2. UI update, more convenient to use common functions.<br>3. You can directly share the screen of your iOS device during Zhumu meetings using the Screen Recording feature available on iOS version 11.<br>4. Meeting hosts can control whether participants can chat with everyone, or only with the host.<br>5. Users can now disable Safe Driving Mode for all meetings in their Zhumu app settings.<br>6. You have an option to include a clock in the meeting display, showing how much time has elapsed. Configure this option in the Settings of your Zhumu application.<br>7. Improved Audio and Video Quality with Low Bandwidth connections<br>8. Reduction of Typing/Keyboard Noise"},{"version_id":"831327966","version_name":"4.2.6","version_date":"2019-05-23 04:29:09.000 +0800","version_description":"bug fix"},{"version_id":"831666462","version_name":"4.2.7","version_date":"2019-06-14 17:39:13.000 +0800","version_description":"bug fix"},{"version_id":"832317820","version_name":"4.2.9","version_date":"2019-08-19 01:42:25.000 +0800","version_description":"1. Add telephone complaint entry<br>2, optimize group message experience<br>3, bug fix"},{"version_id":"835295657","version_name":"4.5.0","version_date":"2020-03-30 09:23:13.000 +0800","version_description":"1. Enhanced  UI<br>2. Improved experience<br>3. Minor bug fixes"},{"version_id":"835360855","version_name":"4.5.1","version_date":"2020-04-02 01:40:12.000 +0800","version_description":"Minor bug fixes"},{"version_id":"843121752","version_name":"5.3.9","version_date":"2021-07-18 12:59:56.000 +0800","version_description":"【New Features】<br>1. Newly designed UI .<br>2. You can use the virtual background feature without a green screen on iPhone8 +、iPad 9.7+.<br>3. Supported WeChat login, SMS login, international mobile phone number registration and login.<br>4. Schedule meeting supports add participants, and the meeting schedule supports multi-terminal synchronization.<br>5. Non-personal schedule meeting supports waiting room，participants join meeting need host’s permission.<br>6. Schedule meeting supports assign alternative hosts,who will be co-hosts after joining meeting.<br>7. Support to send emoticons in meetings, meetings will no longer be monotonous.<br>8. Add audio signatures for more secure meetings.<br>9. Now you can chat with your friends and colleagues, Schedule meeting support create groups at the same time. Open a meeting with one click with a frequently used group.<br>10.With the new message notification feature, meeting invitations can no longer be missed.<br>11.You can view Q&amp;A and contact help at Help Center.<br>12.You can now minimize the meeting window to check your chat messages or schedule a new meeting. Click More and choose Minimize Meeting.<br>13.Add Olympic elements.<br>14.Adjust UI Layout on ipad.<br> <br>【Optimization】<br>1. Mobile phone and email can be changed in Personal Settings,you can check your account expiry date.<br>2. The option of PMI is moved to the Start Meeting and Schedule Meeting.<br>3. Optimized the classification of address book, personal friends and colleagues are separately view  <br>   and management.<br>4. Optimized the user experience of video meeting."}]