[{"version_id":"833936550","version_name":"1.20.0","version_date":"2019-12-11 11:32:48.000 +0800","version_description":"Changes of version 1.20.0<br> - Long-awaited final of the Chapter VII: incredible bosses, scenic locations and the story pinnacle;<br> - New Transfomation story mode: unexpected storyline and even harder fights that will be a challenge for the most experienced fighters;<br> - New equipment including a brand new fight style, both agile and attractive;<br> - 3 new titled sets, each with a unique fight bonus;<br> - Several bugs fixed, also general performance of the game improved."},{"version_id":"834112235","version_name":"1.20.1","version_date":"2020-01-22 10:09:06.000 +0800","version_description":"Changes of version 1.20.1<br> - New Family Tree event, full of Korean New Year spirit; new fight mechanics and a unique equipment set;<br> - Long-awaited final of the Chapter VII: incredible bosses, scenic locations and the story pinnacle;<br> - New Transfomation story mode: unexpected storyline and even harder fights that will be a challenge for the most experienced fighters;<br> - New equipment including a brand new fight style, both agile and attractive;<br> - 3 new titled sets, each with a unique fight bonus;<br> - Several bugs fixed, also general performance of the game improved."},{"version_id":"834574137","version_name":"1.20.2","version_date":"2020-02-05 08:32:45.000 +0800","version_description":"Changes of version 1.20.2<br> - Long-awaited final of the Chapter VII: incredible bosses, scenic locations and the story pinnacle;<br> - New Transfomation story mode: unexpected storyline and even harder fights that will be a challenge for the most experienced fighters;<br> - New equipment including a brand new fight style, both agile and attractive;<br> - 3 new titled sets, each with a unique fight bonus;<br> - Critical bugs fixed, also general performance of the game improved."},{"version_id":"834854490","version_name":"1.20.3","version_date":"2020-03-13 14:04:49.000 +0800","version_description":"Changes of version 1.20.3<br> - Long-awaited final of the Chapter VII: incredible bosses, scenic locations and the story pinnacle;<br> - New Transfomation story mode: unexpected storyline and even harder fights that will be a challenge for the most experienced fighters;<br> - New equipment including a brand new fight style, both agile and attractive;<br> - 3 new titled sets, each with a unique fight bonus;<br> - Critical bugs fixed, also general performance of the game improved."},{"version_id":"835590156","version_name":"1.20.4","version_date":"2020-04-21 13:14:08.000 +0800","version_description":"Changes of version 1.20.4<br> - Long-awaited final of the Chapter VII: incredible bosses, scenic locations and the story pinnacle;\n<br> - New Transfomation story mode: unexpected storyline and even harder fights that will be a challenge for the most experienced fighters;\n<br> - New equipment including a brand new fight style, both agile and attractive;\n<br> - Critical bugs fixed, also general performance of the game improved."},{"version_id":"836135805","version_name":"1.21.0","version_date":"2020-06-25 10:48:46.000 +0800","version_description":"Version 1.21.0 features:\n<br> - Players can now customize their equipment sets or separate items to give their characters unique looks.\n<br> - 3 expressive skins for Divine Judge, Warmonger and Star Chaser equipment sets added.\n<br> - 15 dyes of different rarity are now available for even bolder style experiments.\n<br> - New marathons and booster pack types added.\n<br> - Many techical improvements added, also many bugs fixed. Stability of the game performance is increased."},{"version_id":"837222821","version_name":"1.21.2","version_date":"2020-08-17 12:08:04.000 +0800","version_description":"Version 1.21.2 features:\n<br> - New bonuses for Arrow and Shadow Artisan equipment sets, which were chosen by players of our community.\n<br> - Added technical framework for a future Legionary set bonus and also for new special events.\n<br> - A new free gems source added - Fyber.\n<br> - Many improvements added, many bugs fixed, increased overall game stability."},{"version_id":"838291761","version_name":"1.22.0","version_date":"2020-10-22 14:47:53.000 +0800","version_description":"Version 1.22.0 changes:\n<br> - Transformation story mode continues: the 1st part of Itu's Plane is now available! New challenging fights, new locations and new characters;\n<br> - Stability gain is changed for Itu's Plane;\n<br> - A brand new fighting style is added: meet sanjiegun (also knows as triple-section staff) with a new legendary set;\n<br> - Technical changes to support next updates;\n<br> - Some UI changes to improve players' overall experience;\n<br> - Many bugs fixes and general technical improvements."},{"version_id":"838363237","version_name":"1.22.1","version_date":"2020-10-26 09:17:28.000 +0800","version_description":"Version 1.22.1 changes:\n<br> - Transformation story mode continues: the 1st part of Itu's Plane is now available! New challenging fights, new locations and new characters;\n<br> - Stability gain is changed for Itu's Plane;\n<br> - A brand new fighting style is added: meet sanjiegun (also knows as triple-section staff) with a new legendary set;\n<br> - Technical changes to support next updates;\n<br> - Some UI changes to improve players' overall experience;\n<br> - Many bugs fixes and general technical improvements."},{"version_id":"838376966","version_name":"1.23.0","version_date":"2020-11-19 11:30:26.000 +0800","version_description":"Version 1.23.0 is a special one; Shadow Fight 3 celebrates it's 3rd anniversary! We prepared many gifts and special activities for our players, and also a unique celebration minigame! Thank you for playing out game! Keep fighting!"},{"version_id":"839466218","version_name":"1.23.1","version_date":"2020-12-07 12:12:07.000 +0800","version_description":"New version is available! Many techical improvements added, also many bugs fixed."},{"version_id":"839711066","version_name":"1.24.0","version_date":"2020-12-21 11:34:05.000 +0800","version_description":"Version 1.24.0 changes:\n<br> - Technical support for upcoming events themed on winter holidays added;\n<br> - Technical support for upcoming new Transformation story chapter (Itu's Plane, p.3) added;\n<br> - Technical improvents added, also many bugs fixed."},{"version_id":"840315000","version_name":"1.24.2","version_date":"2021-03-17 07:46:13.000 +0800","version_description":"Version 1.24.2 changes:\n<br> - Internal instruments and services of the game updated;\n<br> - Many technical improvents added."},{"version_id":"841020061","version_name":"1.25.0","version_date":"2021-06-30 11:21:57.000 +0800","version_description":"Version 1.25.0 changes:<br> - Aspects, new color variations for equipment skins, are added into the game;<br> - Temporary Deep Color event launched with an opportunity to win a skin and some aspects;<br> - Many technical improvements and some UI improvements added;<br> - Technical support for the upcoming Marcus's Plane story chapter added."}]