[{"version_id":"812056531","version_name":"1.6.5","version_date":"2019-11-30 05:15:10.000 +0800","version_description":"This update brings some delightful bug fixes ahead of 1.7! Also if you're reading this and it's the Black Friday weekend, (Friday through Monday) Apollo Ultra's on its biggest sale ever! Oh, and Apollo merch is available for a few more days if you're interested as well, see Settings. :)\n\n- A gorgeous new homescreen icon by Jhona Burame, called Void Emperor as part of the Apollo Ultra pack!\n- Fix to a video playback bug where eventually videos could get the dreaded playback error\n- Fixed bug where in compact mode some posts could lose their bottoms\n- Fixed some oddities around Jump Bar suggestions (should properly include subscriptions/favorites/etc.)\n- Fixed some other minor bugs (not a ton in this minor update as those two first bugs took a ton of time to track down, gah!)\n\nThank you all for being so awesome always, and happy Thanksgiving if you're celebrating!\n\n– Christian"},{"version_id":"812056531","version_name":"1.6.3","version_date":"2019-10-25 04:34:36.000 +0800","version_description":"Happy early Halloween! This update brings new artwork as well as some delicious candied bug fixes. \n\n- An incredible Halloween rendition of the Apollo icon done by Anthony Piraino of The Iconfactory as part of the Apollo Ultra. It's sooooo cool, from the vines, to the moon in the background, to the pumpkin itself! Hope you all have a spoopy and fantastic Halloween!\n- Fixed the affectionately named “Australia Mode” bug where private message conversations could get flipped-turned upside down\n- Fixed bug where some Gfycat GIFs wouldn't play properly\n- Made the \"light mode\" launch screen a little darker\n- Fixed bug that could affect restoring Pro/Ultra (and worse, prevent confetti from falling when you do)\n- Fixed bug where videos would show up empty at first or you’d just heard the audio\n- Fixed bug where performance could slow down over time in weird situations\n- Fixed bug where not all elements on screen would switch to dark mode or light mode (hopefully, this one’s elusive)\n- Fixed bug where app would exit really quickly when going into the background\n- Fixed obscured album count on new devices\n- Fixed bug with AirPlay issues on iOS 13\n- Fixed bug with abrupt scrolling stops in Saved posts\n- Fixed bug where sometimes flicking back a GIF would cause it to pause\n- Lots of other small tweaks to make things smoother and nicer :)\n\n1.7 will be out very soon to boot and it’s SO NICE. Can’t wait to show off more details with it, it includes so many things that have been frequently asked for that I’m so glad to have finally been able to get to.\n\nAs always, THANK YOU SO MUCH for all the support given toward Apollo, I enjoy working on it every day and it’s 10 billion percent because of the amazing people who use the app and permit me to, so a very heartfelt thanks.\n\n– Christian"},{"version_id":"812056531","version_name":"1.6.4","version_date":"2019-11-10 04:19:53.000 +0800","version_description":"Here's a good ol' bug fix update that address some annoying things before 1.7.\n\n- Fixed bug around video playback (video wouldn't show up sometimes or would just be audio)\n- Fixed bug where occasionally there could be a weird mix of light mode and dark mode at the same time\n- Fixed bug where some GIF playback wouldn't properly load\n- Fixed bug where opening Apollo from a notification wouldn't always load the proper notification item (comment, post, etc.)\n- Fixed bug where Apollo wouldn't always open properly from other apps\n- Fixed bug where some Reddit hosted images/videos wouldn't load properly\n- Fixed bug where sometimes when rotating a GIF in the media viewer would make it disappear (dang spooky Halloween bugs)\n- GIFs load even faster and more play inline (also better detects if a Reddit \"video\" doesn't actually have an audio track so it will just treat it like a GIF)\n- Fixed bug where multi-window support wouldn't always work on iPad\n- Fixed bug where if the original poster deleted their account it would look like every deleted comment was from the original poster\n- Entering subreddits in the Jump Bar now properly disallows spaces and will automatically remove them if you, say, copy-paste or use the new QuickPath keyboard\n- Fixed bug where when dictating comments there could be a weird [OBJ] character that showed up (theory: ghosts of Objective-C angry that I'm using Swift?)\n- Fixed bug where when rotating in the media viewer the bottom gradient would sometimes creep across the screen weirdly\n- Fixed bug where there could be weird spacing in text posts with a bunch of image uploads\n- Fixed bug where in the last update the video player didn't have all of its cool features/options\n\n1.7 is right on the horizon woohoo! :D Can't wait to show it to y'all and thank you as always for being amazing and supportive!\n\n- Christian"},{"version_id":"812056531","version_name":"1.4.27","version_date":"2019-08-01 07:32:34.000 +0800","version_description":"- Introducing Mr. Neep Neep, an esteemed, and well-respected individual created deep inside the mind of Michael Flarup, available as part of the Apollo Ultra pack.\n- In other news, did you hear? We raised over $27,000 for the SPCA animal shelter together! We rock, lots of dogs and cats are going to live amazing lives thanks to this awesome Apollo community. :)\n- Sorry for this build not having a ton in it other than the icon and the cool, I'm this close (pretend you can see me with really close fingers) to releasing 1.5 and I've been putting everything into getting it tidied up.\n\nHope it's nice weather where you're from, it's sweltering here!\n\n– Christian"},{"version_id":"812056531","version_name":"1.5","version_date":"2019-09-04 01:58:49.000 +0800","version_description":"SO MUCH AWESOME!\n\n- The biggest change in Apollo 1.5 has been the most requested one, better private messages support! Now you can view and reply to Reddit messages in a beautiful, fully-threaded conversational message view, things like seeing sent messages are so great now. This includes being able to go into separate inbox sections, like purely viewing comment replies.\n- Added an awesome new Pro feature: auto collapsing child comments. Now when reading threads you can collapse everything that isn't a top-level comment, making reading the juiciest replies even easier. You can have it automatically always do it, or remember your setting per subreddit. Or manually!\n- ANOTHER awesome new Pro feature (well two): auto hiding read posts (keeps that feed fresh), and auto marking posts read on scroll. Also an option to have a permanent floating \"hide read posts\" button. Fixes a bug around hiding too.\n- AMAZING moderator features. I think Apollo has to now be one of the most full-featured apps for Reddit moderators out there. First, Mod Mail! You can now view, respond to, action, sort, search, filter mod mail (both new and legacy, all threaded), includes \"user report cards\". Mod Queue. Mod Log. Mod Zone for quick access. Traffic stats. Edit rules. Lock comments. Edit AutoMod config. View/edit/add removal reasons. Report to Admins. Quick mod actions. Edit banned/muted/approved users. Comment nuke (delete comment and all replies). These aren't just web wrappers, they're all native and built right into the app.\n- New amazing Apollo Ultra icon by Jorge Velez, meet Mechapollo!\n- More gesture controls!\n- Pure Black Dark Mode now has pure dark headers as well \n- Tall thumbnails no longer cropped\n- Setting to show subreddits at the top of a post\n- Setting to always show usernames\n- Manually corrected another 1K subreddit capitalizations, currently up to around 5,200. (eg: askreddit -> AskReddit, wholesomememes -> WholesomeMemes)\n- You can now swipe along the top bar (in addition to the bottom tab bar) to go back/forward\n- Fixed bug with new comments sort eventually loading top comments instead of new\n- Media viewer supports even larger images\n- When typing, if you select text then the create link button it autofills the text\n- When you’re on a user’s profile (or your own) you can tap the headers for more info\n- Option to disable GIF autoplay\n- sPoNgEtExT option for 14% boosted in memeing\n- Fixed bug where numbered lists could have their numbers disappear\n- Fixed bug with around issues with swiping forward\n- Fixed delay with keyboard opening in alerts\n- Fixed two significant memory leaks, should make Apollo faster/less crashy\n- Fixed bug with marking all messages read\n- Fixed bug where tags in post could have their color take over the whole title\n- Gesture icons now better indicate if you're undoing something (undo upvote, etc.)\n- 14 new Text Faces\n- Subreddit Jump Bar makes better suggestions\n- Supports fenced code blocks like new Reddit\n- Fixes some video playback issues\n- Fixed bug with subreddit loading\n- Fixed bug with weird spoiler formatting\n- Double-tapping to zoom tall images won't cut top off on X/XS devices\n- Ability to view and message subreddit mods\n- Reddit URLs that let you jump into message composing now work\n- Accept moderator invites\n- Searching subreddit hides keyboard on scroll\n- Shows if a comment has been locked\n- Tweets with spoilers now hide the tweet\n- Compact mode spoilers hide properly\n- Fixed some bugs around trophies\n- Fixes to some weird mismatched colors in Monochrome theme\n- Improved abilities to report things\n- Fixes to long Twitter handles running off screen\n- Fix to when sharing some non-English Reddit posts it would sometimes cut off the link\n- Fixed bug around unfollowing users\n- A bunch more tweaks and fixes to just make everything even more awesome\n\nDang I've run out of text, for more see r/ApolloApp subreddit! :)"},{"version_id":"812056531","version_name":"1.6","version_date":"2019-09-20 01:38:35.000 +0800","version_description":"This update brings a bunch of awesome changes for the brand new iOS 13!\n\nFirst and foremost, Apollo has some great new visual touches, like supporting the new Dark Mode in iOS 13! So if you enable Dark Mode system wide, Apollo will follow the rest of the apps as well as iOS in pulling the curtains down, giving you a beautiful, dark look. You can customize this in Apollo's settings as well, from themes to how dark you want \"dark\" to be, and more! There's also refreshed icons, new inset lists like on Profile, and more!\n\niOS 13 also brought about a bunch of awesome speed and size improvements. Apollo should be (even more of) a lean, mean, fighting machine. The app is smaller to download, and much quicker to open to boot. Nice! Enjoy Redditing with even more speed than you were used to before.\n\nSiri Shortcuts support! Apollo now works with the (now built-in) Siri Shortcuts app, so you can set up custom shortcut scripts that work with Apollo (like opening subreddits, users, etc.) or even program them to work with Siri. There's no better way to start your day than with a custom command like \"Hey siri, fire the meme cannon\" to open r/memes or \"give me something to laugh at\" and have it open r/WhatCouldGoWrong.\n\n        Keyboard and Game Controller support. In addition to previous game controller support, iOS 13 added support for some very popular console controllers, so those all now work with Apollo, in addition to regular hardware keyboards, like keyboard cases! So now you can kick your feet up with a controller, or set up a keyboard, and navigate Apollo with ease, opening and reading comments, opening and closing the media viewer, etc. If there's more functionality you'd like to see here, tell me, I'm just getting started!\n\nBetter Accessibility support. I want Apollo to be the best browsing experience for Reddit for *everyone*, so I worked really hard to improve how accessible Apollo is for everyone. It now has much, much improved VoiceOver support for navigating the UI, even with custom swiping actions to open the media viewer for instance. In addition it also supports iOS 13's new Voice Control feature, so you can control Apollo without even touching it. This is another area I'm just getting started with and would love your feedback if you're willing to provide!\n\nThere's also LOTS more improvements, like being able to open multiple, different windows of Apollo on iPads, which is a personal favorite of mine and great for referencing multiple things on Reddit at once. Before iOS 13 you'd need 3 iPads to view 3 different Apollo windows, now you can do it with one iPad! Talk about cost savings!\n\nThere's also support for the new, beautiful Haptic Touch Context Menus in iOS 13, so every device can now preview media beautifully and easily.\n\nIn addition to the above, there's a bunch of bug fixes to things like random unresponsiveness, message bars reappearing like ghosts, crashes that could happen when marking posts read, listened to feedback on how the Inbox tab tapping behavior was a little weird, and much more! Being a brand new operating system too, it's possible Apollo might have a few bugs here and there while getting used to all the cool new things, so if you encounter anything weird give me a shout through the app and I'll fix 'em up!\n\nOnward and upward! As always, thank you so much for the support, a tip helps immensely if you're really enjoying Apollo. :)\n\n– Christian"},{"version_id":"812056531","version_name":"1.6.2","version_date":"2019-10-01 07:26:48.000 +0800","version_description":"- Brand new Apollo Ultra icon by the incredible Thomas Noppers, called “The Copper Giant”, it has such a fun, nostalgic feel, I love how Thomas designed it.\n- Dark Mode improvements/bug fixes for edge cases (if you still encounter something weird, gimme a shout!)\n- More Dark Mode settings so you can tweak it to your liking\n- Fixed bug where red Inbox badge wouldn't show up\n- Fixed bug where posts could flicker as you scroll sometimes\n- Fixed bug where media viewer could be zoomed in weirdly on iPad in split view\n- Fixed bug where navigation bar icons could go for a walk\n- Improvements to double-tap-and-drag-to-zoom (like in Maps) so it should be faster (if it's not working for you make sure you're on iOS 13.1)\n- Context menu has Open in YouTube app option\n- Light mode/dark mode launch screens\n- Fixed some weird colors\n- Comment composer now properly respects text sizing preferences as an Accessibility improvement\n- Bunch of other little bug fixes here and there! :D\n- And this is all in addition to the bunch of awesome iOS 13 additions listed below!\n\nFirstly, Apollo has some great new visual touches, like supporting the new Dark Mode in iOS 13! So if you enable Dark Mode system wide, Apollo will follow the rest of the apps as well as iOS in pulling the curtains down, giving you a beautiful, dark look. You can customize this in Apollo's settings as well, from themes to how dark you want \"dark\" to be, and more!\n\niOS 13 also brought about a bunch of awesome speed and size improvements. Apollo should be (even more of) a lean, mean, fighting machine. The app is smaller to download, and much quicker to open to boot. Nice! Enjoy Redditing with even more speed than you were used to before.\n\nSiri Shortcuts support! Apollo now works with the (now built-in) Siri Shortcuts app, so you can set up custom shortcut scripts that work with Apollo (like opening subreddits, users, etc.) or even program them to work with Siri. There's no better way to start your day than with a custom command like \"Hey siri, fire the meme cannon\" to open r/memes.\n\nKeyboard and Game Controller support. In addition to previous game controller support, iOS 13 added support for some very popular console controllers, so those all now work with Apollo, in addition to regular hardware keyboards, like keyboard cases! So now you can kick your feet up with a controller, or set up a keyboard, and navigate Apollo with ease, opening and reading comments, opening and closing the media viewer, etc.\n\nBetter Accessibility support. I want Apollo to be the best browsing experience for Reddit for *everyone*, so I worked really hard to improve how accessible Apollo is for everyone. It now has much, much improved VoiceOver support for navigating the UI, even with custom swiping actions to open the media viewer for instance. In addition it also supports iOS 13's new Voice Control feature, so you can control Apollo without even touching it.\n\nThere's also LOTS more improvements, like being able to open multiple, different windows of Apollo on iPads, which is a personal favorite of mine and great for referencing multiple things on Reddit at once. Before iOS 13 you'd need 3 iPads to view 3 different Apollo windows, now you can do it with one iPad! Talk about cost savings!\n\nThere's also support for the new, beautiful Haptic Touch Context Menus in iOS 13, so every device can now preview media beautifully and easily.\n\nOnward and upward! As always, thank you so much for the support, a tip helps immensely. :)\n\n– Christian"},{"version_id":"812056531","version_name":"1.4.13","version_date":"2019-04-01 23:09:53.000 +0800","version_description":"(Take 2 of this update, first had an issue with the icon chooser!)\n\n- Two new icons this month! The first is part of the Apollo Ultra pack, an adorable robot created by none other than the Louie Mantia of Parakeet, called Cuddleb0t. It's like the cutest thing ever. On the opposite end of the spectrum we also have the ferocious dinosaur, part T-Rex, part flatware, part subreddit famous: it's Dino Spoon!\n- Bug fixes galore! Tried to fix a bunch of bugs in this release that were bugging y'all. Some of them have gotten pretty annoying (sorry) and I'm working really hard to address those, with a bunch already gone, and more to come!\n- Annoying, GIFs could turn black when rotating the device. That has been stopped.\n- Search results would abruptly call in a sick day. Nuh-uh, not anymore.\n- Issues with “Open in Apollo” on iPads.\n- There's two super annoying bugs that have long vexed me: tapping on “Load more comments” sometimes just has no effect, and sometimes subreddits will refuse to load more posts after you've scrolled for awhile. I wish I could say I have these completely fixed for this update, but I have the next best thing: a way to fix them! A big issue is me not being able to reproduce bugs like this in order to fix them, so I added some (anonymous) logging in the app to try to help figure out what goes wrong in situations like this. If you go to Settings > About > Logs, you can then email me them if you want to email me about a bug, and I'll be able to hopefully better figure out what went wrong. This should hopefully allow me in this update to track down the bug and quickly ship a fix to it. (And other bugs!)\n- In addition to bug squashing, been working really hard at the next feature update, which is honestly a really cool (and very functional) one, and thankfully it's very close. Trying my best to juggle cool updates like that, while also staying on top of those annoying bugs. Gonna ship a public bug tracker too to help make this easier and trackable, as a few more bugs have slipped by lately so I want to make sure that doesn't become a trend.\nAs always (hope I'm not rambling), thank you so much for being the best community out there. Especially with the coming updates soon, working on Apollo has been even more of a blast lately than usual, so excited and so thankful that y'all let me get to do this for a living. Seriously, you rock. Yeah you, the person reading this.\n\n- Christian"},{"version_id":"812056531","version_name":"1.4.22","version_date":"2019-06-20 09:03:04.000 +0800","version_description":"Apollo is regularly updated to include bug fixes and perf– oh, you want a real changelog? Okay sure!\n\n- Fixed bug where multireddits couldn't be edited\n- Fixed bug where some videos wouldn't play properly\n- Fixed bug where some GIFs wouldn't play properly\n- Fixed bug where the \"… See More\" text in an album's caption wouldn't be the right size\n- Fixed bug where a weird &#x200B; would summon itself (it's been banished)\n- Lotsa other small tweaks.\n\nReally fun update incoming soon. Thanks so much for using Apollo and I really love hearing what you think, so please share feedback! If you're enjoying the app leaving a tip really helps me to be able to keep building it, it's just me (and two mostly unhelpful cats) building Apollo, haha.\n\n- Christian\n\n- Christian"},{"version_id":"812056531","version_name":"1.4.25","version_date":"2019-07-02 08:39:56.000 +0800","version_description":"A quick but delightful update today!\n\n- Includes a brand new Apollo Ultra icon option from none other than Lux, depicting our friendly neighborhood astronaut floating with his favorite ducky and enjoying summer. Hope y'all are too. :)\n- Fixes two bugs around prominent crashes in Apollo. One affects primarily devices on iOS 10, while the other should benefit everyone and help stability around edge cases in the media viewer and crashes.\n\nNot a ton in this update as I've been pouring a ton of effort into version 1.5, which is *just* about ready, can't wait to show you!\n\n- Christian"},{"version_id":"812056531","version_name":"1.4.21","version_date":"2019-06-12 00:25:19.000 +0800","version_description":"Hey all! Back from WWDC with for now just a small bug fix update for you (addresses a crash that could happen in the media viewer), with SO much more to come. It's going to be a busy summer. :)\n\nIt was really awesome meeting some of you at WWDC as well, thanks for saying hi!\n\n- Christian"},{"version_id":"812056531","version_name":"1.4.6","version_date":"2018-12-22 22:27:39.000 +0800","version_description":"[Take 2 at this update, small bug let through in the first one, I shall wear my dumb dumb hat.]\n\nI've got a Christmas gift coming a few days early for y'all! This one's a pretty big update featuring an amazing holiday themed icon from the super talented Qi Sandor, as well as a ton of bug fixes that have been making the holiday season a little less merry.\n- Our monthly new icon is a gorgeous new holiday themed icon by the amazingly talented Qi Sandor. \"Ye Snow Guardian\"\n- Basically rewrote the code around tables in Apollo (commonly used in sports subreddits to display scores, stats, and whatnot) to create a much better experience. In addition to some annoying bugs disappearing, there's a ton of great features like a sticky top-header that stays to give you context as you scroll, a similar sticky left column so as you scroll left-to-right through a wide set of data you can keep your context too. Oh, and the columns are sortable too, simply tap one of the headers to sort that column, which is great for rearranging data to better understand or visualize what's going on.\n- Bug around where the app could crash on sign in and subsequent launches.\n- Bug where submitting comments and posts could freeze the app a little bit, now submitting posts and comments should be faster with immediately let you go onto your next task of viewing kitten GIFs (just me?)\n- Bug where Streamable videos would sometimes only have audio for the first few seconds before the video showed up. Also fixed a Streamable bug around some videos not being recognized.\n- Zooming in the media viewer is a lot smoother and just all around better, in that if a higher quality version of the image finishes downloading, it no longer resets zoom position, you can even keep zooming smoothly if the image is downloaded while you're still zooming, it'll just swap it in seamlessly.\n- Bug where you'd try to swipe away the media viewer but it would just bounce.\n- Bug where sometimes the media viewer would jump to the top left of the picture (whatchu doin up there?).\n- Weird bug where collapsing a comment after voting could cause it to lose its vote. This was thankfully just a visual glitch (all votes were still going through) but it was still a silly one, so glad to have that fixed.\n- Bug where tapping on a link could result in a 404 error due to the URL text being decoded improperly, so now all URLs (even the weird ones) should load beautifully.\n- Bug where a mysterious floating box would obstruct the content for seemingly no reason.\n- Bug where apostrophes and other characters when inside a comment spoiler would be rendered incorrectly.\n- Bug where some pictures would flash briefly before showing the higher resolution image.\n- Bug where when in landscape or with a really tall/fullscreen GIF the progress bar would be in a weird location, it's now been convinced to stay closer to the bottom WHERE IT BELONGS.\n- Bug where certain Reddit URLs if tapped would bring you to the wrong location. One of them just brought you to a random r/Vancouver post! sup vancouver\n- Bug where unsubscribing was kinda weird, in that after you unsubscribed the status wouldn't really update properly, now your action should be properly reflected in the app.\n- Fixed bug where when you rotated GIFs occasionally black magic would occur.\n- Lots of other small fixes and tweaks.\n\nHope you all have an awesome holiday season, from Christmas to Hanukkah to Kwanzaa to any other one! You've seriously made my Christmas amazing with the incredible support you've given Apollo over the last year. It seriously makes my heart just full of happy. Y'all are the best.\n\nIf you're looking for an awesome gift for someone, or just to Treat Yo Self™, Apollo Pro or Ultra is the best way to say \"I love you\", \"you're a great friend\", or \"thanks for that pie when my microwave exploded\". Plus it helps me out to keep developing this app and making it better and better, your support is what keeps this app alive! Thank you!!"},{"version_id":"812056531","version_name":"1.4.7","version_date":"2019-02-01 04:52:12.000 +0800","version_description":"This update is primarily focused on fixing some of those annoying bugs that creep up.\n\n- Added this month's icon in the Apollo Ultra pack, \"The Orbit of Gargantua\", a beautiful piece of pixel art created by the incredibly talented Victor F. Leão.\n- Fixed bug where some images would improperly not load saying they were deleted.\n- Fixed bug where thumbnails could have the wrong colors from the full image.\n- Fixed bug where comments would be collapsed accidentally, as if by a secret ghost.\n- Fixed bug with stretched text occurring (on rotate especially, sensing a theme?).\n- Fixed bug around some videos failing to load.\n- Regarding the previous bug, there's a related issue around playing audio (like music or a podcast) that gets interrupted and not resumed when watching a video. Working to fix that one, think I've identified the issue.\n- Fixed bug where when loading webpages sometimes it would just be a blank white page.\n- While I wasn't able to ship it in this update, made a lot of progress on the rotating-jump-up-the-page bug. Stick tight.\n- Lots of other small bug fixes. I know there's a few other annoying ones here and there, working around the clock to fix those too, as well as finishing up a super sweet feature update.\n\nHey, you. Thank you for supporting Apollo and using it and being awesome. Without it Apollo wouldn't exist and it means the world. I'm aware there's a few bugs here and there that need to get worked out, and I'm working super hard to address those, as well as bring you some awesome features that you've been asking a ton for. Trying really hard to make Apollo the best you could ask for."},{"version_id":"812056531","version_name":"1.4.11","version_date":"2019-03-15 09:42:46.000 +0800","version_description":"Just a wee bug fix update that fixes some issues around GIF loading, some erroneous crashes, and fixed a bug where “Open in Apollo” wouldn't work on some devices (it does now!)."},{"version_id":"812056531","version_name":"1.1.9","version_date":"2018-02-09 04:25:58.000 +0800","version_description":"More changes to further optimize API usage for media consumption, by using a more aggressive caching mechanism. If that sounds like a bunch of gobbledygook to you (yeah, reading that back it barely makes sense to me), no worries, I've essentially just been working to lower operating costs of Apollo through making some things more efficient. :)\n\nSome juicier, more-front-facing feature updates and goodies are coming soon in 1.2, this API stuff has just been a costly priority to fix and demanded a lot of my attention! Glad to be able to get back to the fun stuff, so keep your eyes peeled!"},{"version_id":"812056531","version_name":"1.0","version_date":"2017-10-23 16:33:58.000 +0800","version_description":""},{"version_id":"824268536","version_name":"1.1","version_date":"2017-11-04 03:59:30.000 +0800","version_description":"- Further support for iPhone X\n- Text size setting\n- Content display preference settings on the website are respected better in Apollo\n- Darker dark mode option\n- Streamable videos fix\n- Corrected color of vote buttons in comments header\n- A bunch of other small bug fixes\n\nIt has been a crazy two weeks since the initial release! Thank you so much for the awesome feedback and support! I have lots more up my sleeve!\n\nIf you're enjoying Apollo, leaving a rating or tip helps a ton. :)"},{"version_id":"824281737","version_name":"1.1.1","version_date":"2017-11-06 05:59:26.000 +0800","version_description":"- Further support for iPhone X\n- Text size setting\n- Content display preference settings on the website are respected better in Apollo\n- Darker dark mode option\n- Streamable videos fix\n- Corrected color of vote buttons in comments header\n- A bunch of other small bug fixes\n\n(In addition to yesterday's 1.1 update this 1.1.1 update includes some further bug fixes!)\n\nIt has been a crazy two weeks since the initial release! Thank you so much for the awesome feedback and support! I have lots more up my sleeve!\n\nIf you're enjoying Apollo, leaving a rating or tip helps a ton. :)"},{"version_id":"825381809","version_name":"1.1.5","version_date":"2017-12-20 23:28:25.000 +0800","version_description":"To make Apollo better for you, I update — oh, you want a *real* changelog? Okay!\n\n- New icon per request of Reddit. It make take some getting used to, but I hope you like it, and it was out of my control. I'm really liking it.\n- Introduced four new icon options in addition!\n- Upon tapping the status bar to go to the top, if you want to go back down to your previous position, simply tap it once more (hat tip to Tweetbot).\n- Fixed Face ID / Touch ID authentication loop bug.\n- Fixed bug with album count being obscured behind iPhone X sensor housing.\n- Fixed tab bar bug on iPhone X where it would dance merrily about the screen when scrolling.\n- Fixed bug where split view on iPad would cut the content off.\n- Fixed bug where spoilers would sometimes be unblurred in main Home/All/Popular feed.\n- Made it harder to accidentally unsubscribe to a subreddit.\n- Fixed bug where search results would repeat infinitely leading to Dancing Fever.\n- Fixed bug where navigation bar would hide on scroll in some screens where it doesn't make sense to.\n- Added view count to posts that you created, or in subreddits that you moderate.\n- UI tweaks for the Media Viewer on iPhone X to make everything feel just a bit more comfortable.\n- Fixed bug where you could (visually) upvote and downvote a post at the same time.\n- Made tap targets for subreddit/username in posts feed a little more manageable to prevent accidental taps.\n- Watching videos should properly hide home indicator on iPhone X.\n- Fixed bug where some subreddits could cause a crash upon viewing.\n- Fixed bug where some longer subreddit names couldn't be entered.\n- Fixed bug where status bar would sometimes erroneously show up in the Media Viewer (and make it hard to tap the X on iPhone X).\n- Fixed bug where text entered when filtering subreddits in Dark Mode would be unreadable.\n- Fixed crash that could occur when sharing on iPad.\n- Fixed iOS 10 bug where section headers could overlap the content.\n- Many more smaller bug fixes and tweaks that just make Apollo an even more delightful experience.\n\nHope you all have an awesome holiday season celebrating whatever you're celebrating! Thanks for making mine so great. :) I have a lot more terrific stuff cooking for Apollo that I can't wait to show you.\n\nIf you're really enjoying Apollo, rating it (and leaving a tip if you're even more awesome!) helps more than you can ever imagine."},{"version_id":"825487133","version_name":"1.1.7","version_date":"","version_description":""},{"version_id":"825819561","version_name":"1.1.8","version_date":"2018-02-01 01:24:36.000 +0800","version_description":"Long story short, displaying Imgur media in the app ended up costing a lot more than I expected (API calls to Imgur cost money and Apollo makes a lot of them… I got some fun bills). Because of this, for the free version I had to pull back a bit on rich album previews and some other content detection. Not a massive change (and Imgur is still awesome in the app), just wanted to be transparent with you all and hope you understand why I had to move it to the Pro version from a sustainability standpoint. I elaborated a bit more in the ApolloApp subreddit if you want some more details too. \n\nIn more fun news, I'm working hard away at the 1.2 update that has a ton of awesome goodies you all have requested, can't wait to show it to you soon. :)"},{"version_id":"825928856","version_name":"1.1.9","version_date":"2018-02-09 04:25:58.000 +0800","version_description":"More changes to further optimize API usage for media consumption, by using a more aggressive caching mechanism. If that sounds like a bunch of gobbledygook to you (yeah, reading that back it barely makes sense to me), no worries, I've essentially just been working to lower operating costs of Apollo through making some things more efficient. :)\n\nSome juicier, more-front-facing feature updates and goodies are coming soon in 1.2, this API stuff has just been a costly priority to fix and demanded a lot of my attention! Glad to be able to get back to the fun stuff, so keep your eyes peeled!"},{"version_id":"827009078","version_name":"1.2","version_date":"2018-05-10 21:19:19.000 +0800","version_description":"Hey all! Been working on a big update for you, hope you like it! Details below!\n\n- Added Jump Button in comments to quickly go to the next top-level comment (customizable)\n- Added subtle GIF progress indicators to show where you're at in the GIF you're viewing\n- Much faster GIF viewing and loading, as well as fixed issues where some sources would be unreliable\n- Rich media headers in comments, just like in your feed\n- You can now see how long a video is by a new length indicator in the thumbnail\n- Alternative browser options! External Safari, Chrome, Firefox, Edge, Dolphin!\n- Option to open in YouTube app directly!\n- And if you only want to occasionally, you can open a video in YouTube app with a long-press action!\n- New \"Best\" sort option for viewing posts, a fresh take on \"Hot\"! (Can change default.)\n- When in Compact mode and viewing media, the speeds which they'll load at is greatly increased\n- Option to show were pages end, so when you reach the end of one page it will state \"Page 2\", for instance\n- Option to share comment text, in addition to just the link to the comment\n- Option to share self post text, in addition to just the link to the post\n- Select Mode for self text posts\n- Fixed bug where Apollo would sometimes refuse to load further content\n- Fixed bug with flashing volume indicator when scrolling\n- Faster media loads in general\n- Added support for gilding other users using Creddits\n- Displays if it's currently a user's cake day!\n- Added support for new comment spoiler format\n- Option to auto-collapse AutoModerator comments\n- If you have Reddit Gold, Apollo syncs read status both to and from the website\n- When double-tapping higher-resolution media it no longer zooms in super far\n- Double-tapping wide or short media will zoom to fit\n- When zooming to view something very tall, the Media Viewer now scrolls more comfortably\n- Fixed issue with tapping searched subreddits\n- Fixed bug with duplicating \"More Comments…\"\n- Fixed bug with image captions displaying weirdly\n- Option to include the post title when sharing links, images, text, etc.\n- GIFs no longer start autoplaying early/before they're in frame\n- Fixed rotation bug that would throw you up the page\n- Fixed more bugs surrounding tab bar floating up\n- Media is allowed to be a little taller in the posts feed\n- Fixed weird scroll offset issue in Search tab\n- Fixed bug with sorting user comments\n- Fixed occasionally jumpy animation when going from tapping an image in a post to the Media Viewer\n- Fixed bug where double-tapping in the Media Viewer would jump the image somewhere it shouldn't\n- If an error occurs during an in-app purchase (a tip), the error message is now more helpful. Try it out! ;)\n- Fixed bug where some media sources could not have their aspect ratio/size displayed properly\n- Better detection of Imgur media in some edge cases\n- Fixed bug where View All Comments button would jump around when rotating. (Looking into making this button less obtrusive in general)\n- Removed Fabric by Twitter/Google\n- Added Privacy Policy\n- Fixed bug where text would stretch out on rotation\n- Interact with media (save, share, copy, etc.) directly from the posts feed by long-pressing, rather than having to load in Media Viewer first\n- Fixed bug where when typing in search bar in Search tab keyboard would get offended and leave\n- Fixed bug where severely negative scores on comments would have improper formatting\n- Fixed bug where media in crossposts would not display properly\n- Fixed bug with negative post views \n- Tons of other small tweaks and fixes!\n\nThis update took a little longer than I intended, so I'm going to be switching to a more frequent update schedule from here on out! \n\nIf you enjoyed this update, a rating helps a lot, and a nice tip helps even more! Thank you so much for using Apollo, I have so many great things planned for it, can't wait to show you. :)"},{"version_id":"827521339","version_name":"1.2.1","version_date":"2018-06-14 00:54:16.000 +0800","version_description":"Here's an update with some bug fixes to make Apollo even smoother! Details below!\n\n- Fix for posts incorrectly saying there was an error submitting\n- Fix for some characters/symbols rendering incorrectly in text\n- Fix for bug where infinite scrolling could sometimes stop loading new content/pages until restart\n- Fix for some GIFs showing up in lower quality\n- Fix for some GIFs not being able to be saved to Photos\n- Fixed issue with signing in for some users (where it would just refresh the sign in page)\n- Made swipe gestures a little less sensitive to prevent accidental triggering\n- Fixed registering for Reddit within the app\n- Changed \"Include Titles when Sharing\" setting to be off by default (Settings > General in Apollo)\n- Changed outgoing port when connecting to caching server to help compatability\n- Fixed bug where some content would be made too short in the Posts feed\n- Fixed bug where the option to Open in YouTube wouldn't appear in Compact Mode\n- Fixed bug with \"Thanks To\" section mapping in About settings\n- Added a Pride themed custom app icon\n- A bunch of other small tweaks and fixes here and there\n\nI'm always trying to make Apollo the best experience possible, and I have a bunch of awesome new things planned coming soon! If you're enjoying Apollo, leaving a rating or a tip helps immensely! Thank you. :)"},{"version_id":"827800747","version_name":"1.2.2","version_date":"2018-07-09 15:54:52.000 +0800","version_description":"- Fix for crash with some YouTube URL parsing (sorry)\n- Gesture sensitivity tweaks (last update I adjusted the gesture sensitivity to be less likely to happen accidentally, based on feedback I think I *over* corrected, so I met it in the middle now, let me know what you think).\n\nHope everyone had an awesome July 4th/Canada Day or any other fun holidays recently! I have an awesome update cooked up for you coming shortly. :)"},{"version_id":"828436566","version_name":"1.2.3","version_date":"2018-09-04 02:00:51.000 +0800","version_description":"Hey all, here's some quick bug fixes and tweaks. Got a really awesome update coming to you soon that I've been working on that I'm super stoked about, keep your eyes peeled.\n\n- Fixes random symbols showing up in some comments\n- Better caching should result in faster loads\n- Fixed bugs around GIFs not loading properly\n- Added toggle to turn off haptic feedback if you don't like the buzzin\n- Fixed some out of line apostrophes\n\nThanks again to everyone for being awesome. Last month we managed to raise over $5,000 for our local animal shelter! We rock."},{"version_id":"828701368","version_name":"1.2.4","version_date":"2018-09-25 22:59:16.000 +0800","version_description":"Hey all, got some nice fixes and tweaks specifically around the new phones. Big ol' update right around the corner too!\n\n- Better support for new iPhones (XS, XS Max, XR)\n- Fix for a log in crash for some users\n- Fix where for some users Apollo Pro wouldn't restore properly\n- Made some buttons a little more legible\n- Fixed Japanese/Pinyin/etc. keyboard input issues\n- Feed now properly refreshes on account change\n- When sharing a Reddit URL it now no longer prompts you the next time you launch the app to open it (how silly was that?)\n- Lots of other small tweaks and fixes"},{"version_id":"828745907","version_name":"1.3","version_date":"2018-10-27 22:54:24.000 +0800","version_description":"Hey all, got a really awesome update here that I've worked really hard on!\n\nIt includes a brand new feature pack called Apollo Ultra that includes full App Theming, realtime notifications for all your comments, posts, and messages, a custom new icon every month (with this month's designed by the terrific Iconfactory group), and of course it helps to support Apollo's development.\n\nIt's a different feature pack from Apollo Pro, which don't worry, is not going anywhere and has some amazing updates coming shortly. Ultra just encompasses some extra features that have ongoing server costs, and as a result there's a small subscription fee associated to help cover these costs, but it's a completely optional pack.\n\nIn addition to the above, this update includes some great bug fixes as well, namely around recent issues with an overflowing cache (essentially had to do with extraneous thumbnail downloads), and it also fixed some extra data usage that could occur. There's lots of other bug fixes in there too (such as floating bottom bar fixes), so I really hope you like this update overall.\n\nThank you so much as always!"},{"version_id":"829219790","version_name":"1.3.1","version_date":"2018-11-15 00:16:52.000 +0800","version_description":"Hey! Great bug fix update coming your way!\n\n- Support for the new iPad Pros (begone, letter-boxing! BEGONE!)\n- Notification fixes\n- If you comment and there's an issue where Reddit is unable to post it (if Reddit is down or having issues, for instance) your comment is no longer consumed by the void and is instead offered up for you to retry again or edit!\n- Fixed bug when creating a post where the 3 post type options (Photo/Link/Text) could be unresponsive/untappable\n- Fixed bug where if there's an issue uploading to Imgur the app could become unresponsive\n- Fixed bug where swiping up to access Control Center while watching a video could exit the video (just when it's at the good part!)\n- Fixed bug where videos could playback weird (especially Streamable, so sports people should be happy!)\n- Chumbus carries through with his reward\n- Fixed some more floating bottom bar issues (if you come across reproducible edge cases I'm always all ears!)\n- Fixed some layouting issues on iPhone XS Max\n- Fixed bug where app would think you had Pro+Ultra when you only had Pro\n- Fixed issue where Monochromatic theme would have link colors the… wrong color\n- Bunch of other lil fixes\n\nAlso of note, I'm aware of an annoying bug where sometimes comments and posts can be collapsed accidentally while scrolling. Annoying. Working on a fix for that one but couldn't quite get it in under the wire for this update, so look for it soon! I'm also aware of other annoying bugs that I shall fix too. :P\n\nThank you so much for all your support with Apollo Ultra, it seriously means the world and I'm so stoked by the reception (new really cool icon coming soon too!). I'm hard at work on the 1.4 update as well, can't wait to show you all that! So many juicy things up my sleeve. ;)"},{"version_id":"829473172","version_name":"1.4","version_date":"2018-12-01 06:56:10.000 +0800","version_description":"Hey all, I present to you Apollo 1.4! An update with a bunch of highly requested features as well as some bug fixes. Hope you like it. :)\n\n- Option to have subreddit specific sorting, where Apollo can remember preferred sorting preferences on a per subreddit basis. For example, if you want one subreddit to always be sorted by \"New\", but another to always be sorted by \"Best\", that power is now in your hands. There are separate options for both subreddit posts, and the comments themselves for the subreddit, in case you want those to be different.\n- Along similar lines, you can now (optionally) have Apollo remember your post size preferences on a per subreddit basis. If you want some subreddits compact, while others large, go for it!\n- A gorgeous new icon designed by the incredibly talented David Lanham is now available with the Ultra Pack. The Adventurer.\n- Quick switching accounts is now possible by long-pressing the Accounts tab in the bottom tab bar.\n- Support for Reddit Silver, Gold, and Platinum. Essentially Reddit replaced the previous \"Reddit Gold\" gifting system with three separate tiers of awarding a post, instead of just Gold. You now have Silver, Gold, and Platinum. The monthly Reddit Gold service itself is now Reddit Premium, which alongside the previous benefits you now get monthly coins that you can put toward gifting these Silver/Gold/Platinum awards for posts and comments. \n- More browser support, including support for Firefox Focus, Brave, DuckDuckGo, and iCab Mobile.\n- Twitter client support, if you'd like you can now choose to have all tweets open in Tweetbot, Twitterrific, or the official Twitter app.\n- Apollo now shows if a comment was edited.\n- Filters from r/All now also apply to r/Popular.\n- After some emails I've decided that Ultra now automatically includes all the features of Pro automatically, you don't have to unlock both separately if you don't want to anymore. I initially kept the two separate because I wanted it to be clear that, well, they're separate services (Pro will not be going anywhere). But many people who were awesome and generous enough to contribute monthly, yearly or with a lifetime unlock to Ultra were confused that they still had to pay a few dollars for some other features, which admittedly didn't make the most sense in the end and I didn't want it to seem greedy. So hopefully that makes things a little more clear.\n- Fixed bug that was preventing some GIFs from playing and just showing up blank.\n- Lots of other small tweaks and bug fixes, per usual. :)\n\nThanks again as always, your support seriously means the world to me. Hope everyone who celebrates had a fantastic Thanksgiving, I'm certainly thankful for you amazing people who support Apollo, you're the best. :)"},{"version_id":"829654604","version_name":"1.4.1","version_date":"2018-12-16 03:21:32.000 +0800","version_description":"Hey all, small fix today, patches an issue around a crash that could occur when the app starts up. Got an additional awesome bug fix update coming at you soon!"},{"version_id":"829733715","version_name":"1.4.5","version_date":"2018-12-22 05:28:55.000 +0800","version_description":"I've got a Christmas gift coming a few days early for y'all! This one's a pretty big update featuring an amazing holiday themed icon from the super talented Qi Sandor, as well as a ton of bug fixes that have been making the holiday season a little less merry.\n\n- Our monthly new icon is a gorgeous new holiday themed icon by the amazingly talented Qi Sandor. \"Ye Snow Guardian\"\n- Basically rewrote the code around tables in Apollo (commonly used in sports subreddits to display scores, stats, and whatnot) to create a much better experience. In addition to some annoying bugs disappearing, there's a ton of great features like a sticky top-header that stays to give you context as you scroll, a similar sticky left column so as you scroll left-to-right through a wide set of data you can keep your context too. Oh, and the columns are sortable too, simply tap one of the headers to sort that column, which is great for rearranging data to better understand or visualize what's going on.\n- Bug around where the app could crash on sign in and subsequent launches.\n- Bug where submitting comments and posts could freeze the app a little bit, now submitting posts and comments should be faster with immediately let you go onto your next task of viewing kitten GIFs (just me?)\n- Bug where Streamable videos would sometimes only have audio for the first few seconds before the video showed up. Also fixed a Streamable bug around some videos not being recognized.\n- Zooming in the media viewer is a lot smoother and just all around better, in that if a higher quality version of the image finishes downloading, it no longer resets zoom position, you can even keep zooming smoothly if the image is downloaded while you're still zooming, it'll just swap it in seamlessly.\n- Bug where you'd try to swipe away the media viewer but it would just bounce.\n- Bug where sometimes the media viewer would jump to the top left of the picture (whatchu doin up there?).\n- Weird bug where collapsing a comment after voting could cause it to lose its vote. This was thankfully just a visual glitch (all votes were still going through) but it was still a silly one, so glad to have that fixed.\n- Bug where tapping on a link could result in a 404 error due to the URL text being decoded improperly, so now all URLs (even the weird ones) should load beautifully.\n- Bug where a mysterious floating box would obstruct the content for seemingly no reason.\n- Bug where apostrophes and other characters when inside a comment spoiler would be rendered incorrectly.\n- Bug where some pictures would flash briefly before showing the higher resolution image.\n- Bug where when in landscape or with a really tall/fullscreen GIF the progress bar would be in a weird location, it's now been convinced to stay closer to the bottom WHERE IT BELONGS.\n- Bug where certain Reddit URLs if tapped would bring you to the wrong location. One of them just brought you to a random r/Vancouver post! sup vancouver\n- Bug where unsubscribing was kinda weird, in that after you unsubscribed the status wouldn't really update properly, now your action should be properly reflected in the app.\n- Fixed bug where when you rotated GIFs occasionally black magic would occur.\n\nHope you all have an awesome holiday season, from Christmas to Hanukkah to Kwanzaa to any other one! You've seriously made my Christmas amazing with the incredible support you've given Apollo over the last year. It seriously makes my heart just full of happy. Y'all are the best.\n\nIf you're looking for an awesome gift for someone, or just to Treat Yo Self™, Apollo Pro or Ultra is the best way to say \"I love you\", \"you're a great friend\", or \"thanks for that pie when my microwave exploded\". Plus it helps me out to keep developing this app and making it better and better, your support is what keeps this app alive! Thank you!!"},{"version_id":"829751931","version_name":"1.4.6","version_date":"2018-12-22 22:27:39.000 +0800","version_description":"[Take 2 at this update, small bug let through in the first one, I shall wear my dumb dumb hat.]\n\nI've got a Christmas gift coming a few days early for y'all! This one's a pretty big update featuring an amazing holiday themed icon from the super talented Qi Sandor, as well as a ton of bug fixes that have been making the holiday season a little less merry.\n- Our monthly new icon is a gorgeous new holiday themed icon by the amazingly talented Qi Sandor. \"Ye Snow Guardian\"\n- Basically rewrote the code around tables in Apollo (commonly used in sports subreddits to display scores, stats, and whatnot) to create a much better experience. In addition to some annoying bugs disappearing, there's a ton of great features like a sticky top-header that stays to give you context as you scroll, a similar sticky left column so as you scroll left-to-right through a wide set of data you can keep your context too. Oh, and the columns are sortable too, simply tap one of the headers to sort that column, which is great for rearranging data to better understand or visualize what's going on.\n- Bug around where the app could crash on sign in and subsequent launches.\n- Bug where submitting comments and posts could freeze the app a little bit, now submitting posts and comments should be faster with immediately let you go onto your next task of viewing kitten GIFs (just me?)\n- Bug where Streamable videos would sometimes only have audio for the first few seconds before the video showed up. Also fixed a Streamable bug around some videos not being recognized.\n- Zooming in the media viewer is a lot smoother and just all around better, in that if a higher quality version of the image finishes downloading, it no longer resets zoom position, you can even keep zooming smoothly if the image is downloaded while you're still zooming, it'll just swap it in seamlessly.\n- Bug where you'd try to swipe away the media viewer but it would just bounce.\n- Bug where sometimes the media viewer would jump to the top left of the picture (whatchu doin up there?).\n- Weird bug where collapsing a comment after voting could cause it to lose its vote. This was thankfully just a visual glitch (all votes were still going through) but it was still a silly one, so glad to have that fixed.\n- Bug where tapping on a link could result in a 404 error due to the URL text being decoded improperly, so now all URLs (even the weird ones) should load beautifully.\n- Bug where a mysterious floating box would obstruct the content for seemingly no reason.\n- Bug where apostrophes and other characters when inside a comment spoiler would be rendered incorrectly.\n- Bug where some pictures would flash briefly before showing the higher resolution image.\n- Bug where when in landscape or with a really tall/fullscreen GIF the progress bar would be in a weird location, it's now been convinced to stay closer to the bottom WHERE IT BELONGS.\n- Bug where certain Reddit URLs if tapped would bring you to the wrong location. One of them just brought you to a random r/Vancouver post! sup vancouver\n- Bug where unsubscribing was kinda weird, in that after you unsubscribed the status wouldn't really update properly, now your action should be properly reflected in the app.\n- Fixed bug where when you rotated GIFs occasionally black magic would occur.\n- Lots of other small fixes and tweaks.\n\nHope you all have an awesome holiday season, from Christmas to Hanukkah to Kwanzaa to any other one! You've seriously made my Christmas amazing with the incredible support you've given Apollo over the last year. It seriously makes my heart just full of happy. Y'all are the best.\n\nIf you're looking for an awesome gift for someone, or just to Treat Yo Self™, Apollo Pro or Ultra is the best way to say \"I love you\", \"you're a great friend\", or \"thanks for that pie when my microwave exploded\". Plus it helps me out to keep developing this app and making it better and better, your support is what keeps this app alive! Thank you!!"},{"version_id":"830152033","version_name":"1.4.7","version_date":"2019-02-01 04:52:12.000 +0800","version_description":"This update is primarily focused on fixing some of those annoying bugs that creep up.\n\n- Added this month's icon in the Apollo Ultra pack, \"The Orbit of Gargantua\", a beautiful piece of pixel art created by the incredibly talented Victor F. Leão.\n- Fixed bug where some images would improperly not load saying they were deleted.\n- Fixed bug where thumbnails could have the wrong colors from the full image.\n- Fixed bug where comments would be collapsed accidentally, as if by a secret ghost.\n- Fixed bug with stretched text occurring (on rotate especially, sensing a theme?).\n- Fixed bug around some videos failing to load.\n- Regarding the previous bug, there's a related issue around playing audio (like music or a podcast) that gets interrupted and not resumed when watching a video. Working to fix that one, think I've identified the issue.\n- Fixed bug where when loading webpages sometimes it would just be a blank white page.\n- While I wasn't able to ship it in this update, made a lot of progress on the rotating-jump-up-the-page bug. Stick tight.\n- Lots of other small bug fixes. I know there's a few other annoying ones here and there, working around the clock to fix those too, as well as finishing up a super sweet feature update.\n\nHey, you. Thank you for supporting Apollo and using it and being awesome. Without it Apollo wouldn't exist and it means the world. I'm aware there's a few bugs here and there that need to get worked out, and I'm working super hard to address those, as well as bring you some awesome features that you've been asking a ton for. Trying really hard to make Apollo the best you could ask for."},{"version_id":"830174720","version_name":"1.4.9","version_date":"2019-02-03 00:41:55.000 +0800","version_description":"This update is primarily focused on fixing some of those annoying bugs that creep up.\n\n- Added this month's icon in the Apollo Ultra pack, \"The Orbit of Gargantua\", a beautiful piece of pixel art created by the incredibly talented Victor F. Leão.\n- Fixed bug where some images would improperly not load saying they were deleted.\n- Fixed bug where thumbnails could have the wrong colors from the full image.\n- Fixed bug where comments would be collapsed accidentally, as if by a secret ghost.\n- Fixed bug with stretched text occurring (on rotate especially, sensing a theme?).\n- Fixed bug around some videos failing to load.\n- Regarding the previous bug, there's a related issue around playing audio (like music or a podcast) that gets interrupted and not resumed when watching a video. Working to fix that one, think I've identified the issue.\n- Fixed bug where when loading webpages sometimes it would just be a blank white page.\n- While I wasn't able to ship it in this update, made a lot of progress on the rotating-jump-up-the-page bug. Stick tight.\n- Lots of other small bug fixes. I know there's a few other annoying ones here and there, working around the clock to fix those too, as well as finishing up a super sweet feature update.\n\nHey, you. Thank you for supporting Apollo and using it and being awesome. Without it Apollo wouldn't exist and it means the world. I'm aware there's a few bugs here and there that need to get worked out, and I'm working super hard to address those, as well as bring you some awesome features that you've been asking a ton for. Trying really hard to make Apollo the best you could ask for.\n\n(This update fixes one more bug from the previous 1.4.7.)"},{"version_id":"830459926","version_name":"1.4.10","version_date":"2019-03-02 00:13:01.000 +0800","version_description":"Hey all, have a juicy new update coming your way today. :)\n\n- New icon as part of this month's Apollo Ultra pack, a lovely being called Ice•bot in its signature hero mode. This brilliant being is the brainchild of the amazing Mike of Creative Mints fame.\n- “Open in Apollo”! Finally! A very commonly requested feature, now if you're in another app like Safari you can summon the share sheet and next to the “Copy”, “Print”, etc buttons you'll be able to add an “Open in Apollo” button to quickly open a Reddit link in Apollo, which is great for being able to quickly and easily bring an outside Reddit link into Apollo! Note: to be able to do this, when you bring up the share sheet, scroll all the way to the right and hit the ••• button, and toggle \"Open in Apollo\" on (at the bottom), you can also rearrange it to bring it the front here! Noice.\n- In Compact Mode links and videos now have their icon overlay shrunken a bit and pushed out of the way as to not block the thumbnail. Smort.\n- Similarly in Compact Mode Twitter links now have a Twitter overlay to better distinguish them. Noice.\n- 3D Touching an image and selecting “Share” should now properly share it as expected. Toit.\n- If you search something bizarrely obscure (yeah you Melissa) it will no longer just spin endlessly as if it's still loading.\n- If you're using the Monochromatic app theme the “View All Comments” button is now longer a spooky ghost.\n- Fixed bug where status banners (some people call this toast??) could go behind the notch.\n- Fixed bug with blank Twitter thumbnails.\n- Fixed bug where links inside tables could sometimes act weird (especially if they were Reddit URLs).\n- Fixed a bug where users could encounter some issues when first trying unlock Apollo Ultra.\n- Fixed a bug where app could crash on sign in.\n- Added indicators if copying/saving an image succeeds so as to be more clear.\n- Bunch of other little small tweaks and fixes.\n\nHope y'all like the update. If you do, supporting the app with a tip helps a ton to keep the app going. :) Been a bit of a busy month for me (I moved!) but this next month has some juicy stuff coming for Apollo. :)"},{"version_id":"830616952","version_name":"1.4.11","version_date":"2019-03-15 09:42:46.000 +0800","version_description":"Just a wee bug fix update that fixes some issues around GIF loading, some erroneous crashes, and fixed a bug where “Open in Apollo” wouldn't work on some devices (it does now!)."},{"version_id":"830809935","version_name":"1.4.12","version_date":"2019-04-01 09:54:51.000 +0800","version_description":"- Two new icons this month! The first is part of the Apollo Ultra pack, an adorable robot created by none other than the Louie Mantia of Parakeet, called Cuddleb0t. It's like the cutest thing ever. On the opposite end of the spectrum we also have the ferocious dinosaur, part T-Rex, part flatware, part subreddit famous: it's Dino Spoon!\n- Bug fixes galore! Tried to fix a bunch of bugs in this release that were bugging y'all. Some of them have gotten pretty annoying (sorry) and I'm working really hard to address those, with a bunch already gone, and more to come!\n- Annoying, GIFs could turn black when rotating the device. That has been stopped.\n- Search results would abruptly call in a sick day. Nuh-uh, not anymore.\n- Issues with “Open in Apollo” on iPads.\n- There's two super annoying bugs that have long vexed me: tapping on “Load more comments” sometimes just has no effect, and sometimes subreddits will refuse to load more posts after you've scrolled for awhile. I wish I could say I have these completely fixed for this update, but I have the next best thing: a way to fix them! A big issue is me not being able to reproduce bugs like this in order to fix them, so I added some (anonymous) logging in the app to try to help figure out what goes wrong in situations like this. If you go to Settings > About > Logs, you can then email me them if you want to email me about a bug, and I'll be able to hopefully better figure out what went wrong. This should hopefully allow me in this update to track down the bug and quickly ship a fix to it. (And other bugs!)\n- In addition to bug squashing, been working really hard at the next feature update, which is honestly a really cool (and very functional) one, and thankfully it's very close. Trying my best to juggle cool updates like that, while also staying on top of those annoying bugs. Gonna ship a public bug tracker too to help make this easier and trackable, as a few more bugs have slipped by lately so I want to make sure that doesn't become a trend.\n\nAs always (hope I'm not rambling), thank you so much for being the best community out there. Especially with the coming updates soon, working on Apollo has been even more of a blast lately than usual, so excited and so thankful that y'all let me get to do this for a living. Seriously, you rock. Yeah you, the person reading this.\n\n- Christian"},{"version_id":"830815888","version_name":"1.4.13","version_date":"2019-04-01 23:09:53.000 +0800","version_description":"(Take 2 of this update, first had an issue with the icon chooser!)\n\n- Two new icons this month! The first is part of the Apollo Ultra pack, an adorable robot created by none other than the Louie Mantia of Parakeet, called Cuddleb0t. It's like the cutest thing ever. On the opposite end of the spectrum we also have the ferocious dinosaur, part T-Rex, part flatware, part subreddit famous: it's Dino Spoon!\n- Bug fixes galore! Tried to fix a bunch of bugs in this release that were bugging y'all. Some of them have gotten pretty annoying (sorry) and I'm working really hard to address those, with a bunch already gone, and more to come!\n- Annoying, GIFs could turn black when rotating the device. That has been stopped.\n- Search results would abruptly call in a sick day. Nuh-uh, not anymore.\n- Issues with “Open in Apollo” on iPads.\n- There's two super annoying bugs that have long vexed me: tapping on “Load more comments” sometimes just has no effect, and sometimes subreddits will refuse to load more posts after you've scrolled for awhile. I wish I could say I have these completely fixed for this update, but I have the next best thing: a way to fix them! A big issue is me not being able to reproduce bugs like this in order to fix them, so I added some (anonymous) logging in the app to try to help figure out what goes wrong in situations like this. If you go to Settings > About > Logs, you can then email me them if you want to email me about a bug, and I'll be able to hopefully better figure out what went wrong. This should hopefully allow me in this update to track down the bug and quickly ship a fix to it. (And other bugs!)\n- In addition to bug squashing, been working really hard at the next feature update, which is honestly a really cool (and very functional) one, and thankfully it's very close. Trying my best to juggle cool updates like that, while also staying on top of those annoying bugs. Gonna ship a public bug tracker too to help make this easier and trackable, as a few more bugs have slipped by lately so I want to make sure that doesn't become a trend.\nAs always (hope I'm not rambling), thank you so much for being the best community out there. Especially with the coming updates soon, working on Apollo has been even more of a blast lately than usual, so excited and so thankful that y'all let me get to do this for a living. Seriously, you rock. Yeah you, the person reading this.\n\n- Christian"},{"version_id":"830942804","version_name":"1.4.15","version_date":"2019-04-12 07:48:37.000 +0800","version_description":"Hey all, I worked really hard over the last little bit to get rid of a bunch of bugs that've been annoying you! Enjoy!\n\n- Fixed bug where when scrolling through subreddit posts sometimes (randomly) Apollo would stop loading more content\n- Fixed bug where tapping “Load x more comments” wouldn't do anything. This was a two-part bug, where the first part was Apollo doing something silly that I fixed, and the second part being an interesting phenomenon where basically if the \"more comments\" that are trying to be loaded were actually deleted at some point, the marker doesn't always get the heads up. So now in the event that some or all of them have been deleted, now when trying to load them Apollo will tell you how many were deleted rather than the button just disappearing.\n- When you tap \"Load x more comments\" it now shows you a loading indicator/spinner\n- In the event that the loading of more comments actually fails for some reason Apollo will now properly notify you\n- Fixed bug where comments could get in a weird collapse state that would make them difficult to expand, or they'd be collapsed when they shouldn't be\n- Fixed bug where GIFs could turn black when rotating to landscape in the media viewer (I actually fixed it this time, haha)\n- Fixed bug where silent GIFs could interrupt background audio (like music or podcasts)\n- Fixed bug where inserting quotes could cause autocorrect to be disabled when typing comments or posts\n- Logs from the last updated helped a ton (thanks!), doing more in this update with adding anonymous crash reporting and analytics\n- In addition to this there's also the option to send in an app store receipt if you're having problems restoring for instance\n- Fixed bug where when opening a notification it could sometimes trap you without any way to dismiss the opened post\n- Fixed bug where the option to subscribe or unsubscribe from a subreddit would go missing\n- Fixed bug where subscribed subreddit list would be empty for no reason\n- Fixed bug where scrolling performance wasn't great in the custom App Icon chooser page\n- Fixed bug where Controversial sort in profiles was mislabeled as Top\n- Fixed bug where the current selected comments sort wouldn't be visible in the selector\n- Fixed bug where you were unable to award a post (silver, gold, platinum) from within the post itself\n- Fixed some more instances where the tab bar could begin floating (also a smart adapter)\n- Fixed bug where the confetti associated with giving an award wouldn't match that specific award's metal\n- Fixed bug where platinum icon was incorrect\n- Moderator links for a specific subreddit (traffic, mod queue, mod mail, etc.) were problematic, temporarily removed while I build in natively\n- Fixed bug where YouTube thumbnails sometimes wouldn't load\n- Fixed bug where Reddit short links (redd.it) wouldn't work with the \"Open in Apollo\" functionality\n- Fixed bug where the \"Open in Apollo\" functionality wouldn't work inside some apps like Mail apps\n- Fixed bug where \"Open in Apollo\" could open but not actually load anything (embarrassing)\n- Fixed bug where once you set a third-party Twitter client to open in Settings you couldn't unset it\n- Fixed bug where replying-to-context could overlay content in comment/post composer\n- Fixed bug where some two-level top-level-domains (such as .ac.uk) wouldn't display properly in thumbnails, same with IP addresses\n- Fixed bug where some Gfycat URLs wouldn't load\n- If there's some random bunch of spaces/enters/returns in the middle of a comment, they're now trimmed down\n- When saving GIFs there's now a \"Saved!\" notification like with images\n- Bunch of other small fixes and tweaks\n\nThanks for all the support everyone. I'm going to keep working hard building Apollo better for each and every one of you.\n\nIf you're a fan of the detailed changelogs, or even are just enjoying Apollo, a tip helps a TON. It's just me building the app. :)\n\n- Christian"},{"version_id":"830995165","version_name":"1.4.16","version_date":"2019-04-18 02:26:25.000 +0800","version_description":"I fixed a few more bugs since the last update that have been reported, thanks everyone! Keep on being awesome! :)\n\n- Fixed bug that could cause GIFs to crash\n- Fixed bug where it could say a negative amount of comments were deleted (eg -3)\n- Fixed bug where you could tap on the deleted comments to try to load them (from the shadow realm??)\n- Fixed app icons loading slow and some oddities around it\n- Fixed wrong background color in crash reporting screen in dark mode\n- Fixed bug with bars showing back in Hide Bars on Scroll mode\n- Fixed bug with user post histories not loading\n- Fixed bug with subreddit sorts applying weirdly\n- Fixed bug where you could tap on the \"No comments\" indicator for a post\n- Fixed some weird edge cases that could cause crashes (thanks for the crash reports!)\n\nPrevious update:\n\n- Fixed bug where when scrolling through subreddit posts sometimes (randomly) Apollo would stop loading more content\n- Fixed bug where tapping “Load x more comments” wouldn't do anything\n- When you tap \"Load x more comments\" it now shows you a loading indicator/spinner\n- In the event that the loading of more comments actually fails for some reason Apollo will now properly notify you\n- Fixed bug where comments could get in a weird collapse state that would make them difficult to expand, or they'd be collapsed when they shouldn't be\n- Fixed bug where GIFs could turn black when rotating to landscape in the media viewer (I actually fixed it this time, haha)\n- Fixed bug where silent GIFs could interrupt background audio (like music or podcasts)\n- Fixed bug where inserting quotes could cause autocorrect to be disabled when typing comments or posts\n- Logs from the last updated helped a ton (thanks!), doing more in this update with adding anonymous crash reporting and analytics\n- In addition to this there's also the option to send in an app store receipt if you're having problems restoring for instance\n- Fixed bug where when opening a notification it could sometimes trap you without any way to dismiss the opened post\n- Fixed bug where the option to subscribe or unsubscribe from a subreddit would go missing\n- Fixed bug where subscribed subreddit list would be empty for no reason\n- Fixed bug where Controversial sort in profiles was mislabeled as Top\n- Fixed bug where the current selected comments sort wouldn't be visible in the selector\n- Fixed bug where you were unable to award a post (silver, gold, platinum) from within the post itself\n- Fixed some more instances where the tab bar could begin floating (also a smart adapter)\n- Fixed bug where the confetti associated with giving an award wouldn't match that specific award's metal\n- Fixed bug where platinum icon was incorrect\n- Moderator links for a specific subreddit (traffic, mod queue, mod mail, etc.) were problematic, temporarily removed while I build in natively\n- Fixed bug where YouTube thumbnails sometimes wouldn't load\n- Fixed bug where Reddit short links (redd.it) wouldn't work with the \"Open in Apollo\" functionality\n- Fixed bug where the \"Open in Apollo\" functionality wouldn't work inside some apps like Mail apps\n- Fixed bug where \"Open in Apollo\" could open but not actually load anything (embarrassing)\n- Fixed bug where once you set a third-party Twitter client to open in Settings you couldn't unset it\n- Fixed bug where replying-to-context could overlay content in comment/post composer\n- Fixed bug where some two-level top-level-domains (such as .ac.uk) wouldn't display properly in thumbnails, same with IP addresses\n- Fixed bug where some Gfycat URLs wouldn't load\n- Trimmed random spaces in middle of comment\n- When saving GIFs there's now a \"Saved!\" notification like with images\n- Bunch of other small fixes and tweaks\n\nThanks for all the support everyone. I'm going to keep working hard building Apollo better for each and every one of you.\n\nIf you're a fan of the detailed changelogs, or even are just enjoying Apollo, a tip helps a TON. It's just me building the app. :)\n\n- Christian"},{"version_id":"831154245","version_name":"1.4.17","version_date":"2019-05-05 09:39:39.000 +0800","version_description":"- A brand new custom icon as part of this month’s Apollo Ultra pack is now available to grace your homescreen with, The Little Prince! This delightfully inquisitive being was created by the incredibly talented Anh Nguyen!\n- Fixed bug where the comment jump button refused to act properly\n- Fixed bug where collapsing long comments didn’t properly adjust the scroll position\n- Fixed bug where in some subreddits Apollo would think that the media was an animated GIF when it wasn’t at all (the Calvin and Hobbes subreddit especially!)\n- Fixed bug where Apollo would super over-estimate how many comments were deleted\n- Added an in app “Feature Requests” and “Bug Reports” under Settings > About to make it easier to keep track of these things and submit new ones!\n- Fixed bug where in-app Safari could crash in some odd circumstances\n- Fixed bug where Jump Bar would refuse to obey your suggestions when entering subreddits\n- Fixed bug where you could get trapped in the Jump Bar\n- Bunch of other small tweaks and fixes\n\nThanks for being the best Redditors on the planet and giving me a job! If you like my work, leaving a tip or sharing the app helps A TON! More great things to come! :)\n\n- Christian"},{"version_id":"831203409","version_name":"1.4.18","version_date":"2019-05-07 11:19:57.000 +0800","version_description":"- A brand new custom icon as part of this month’s Apollo Ultra pack is now available to grace your homescreen with, The Little Prince! This delightfully inquisitive being was created by the incredibly talented Anh Nguyen!\n- Fixed bug where the comment jump button refused to act properly\n- Fixed bug where collapsing long comments didn’t properly adjust the scroll position\n- Fixed bug where in some subreddits Apollo would think that the media was an animated GIF when it wasn’t at all (the Calvin and Hobbes subreddit especially!)\n- Fixed bug where Apollo would super over-estimate how many comments were deleted\n- Added an in app “Feature Requests” and “Bug Reports” under Settings > About to make it easier to keep track of these things and submit new ones!\n- Fixed bug where in-app Safari could crash in some odd circumstances\n- Fixed bug where Jump Bar would refuse to obey your suggestions when entering subreddits\n- Fixed bug where you could get trapped in the Jump Bar\n- Fixed bug where Safari links would open in the wrong spot\n- Fixed bug where gestures and buttons could become unresponsive in comments\n- Bunch of other small tweaks and fixes\nThanks for being the best Redditors on the planet and giving me a job! If you like my work, leaving a tip or sharing the app helps A TON! More great things to come! :)\n\n- Christian"},{"version_id":"831379165","version_name":"1.4.19","version_date":"2019-05-22 02:30:08.000 +0800","version_description":"Today I bring you some good ol' bug fixes! Enjoy. :)\n\n- Fixed issue around search bar jumping upward on iPhone X, XS, and XS Max\n- Fixed some silly crashes that could occur\n- Changed Pure Black Mode ever so slightly to prevent color smearing that could occur (credit to Vidit Bhargava)\n- Bunch of other little bug fixes\n\nThanks as always for being awesome. If you're enjoying the app a review or a tip inside the app means the world. :)\n\n- Christian"},{"version_id":"831493332","version_name":"1.4.20","version_date":"2019-05-31 10:29:08.000 +0800","version_description":"Yay! More fixes to make everything super smooth and pleasant as could be!\n\n- This month's icon as part of the Apollo Ultra pack is an amazing piece of pixel art by the insanely talented Michael Myers, called Wish Maker. Legend has it if you change your icon to it and whisper to it it will partially grant a part of a wish somewhat\n- Fixed issue where when trying to flick away some images in the media viewer it would just disobediently bounce back into place\n- Fixed crash that could occur while searching in the Search tab\n- Actually just straight up fixed a bunch of edge case crashes that could occur in corners of the app, should help stability be even better!\n- Now when Imgur album captions/descriptions are super long you're now able to scroll them so you can read it all\n- Fixed bug where some weirdly formatted spoilers in comments weren't being covered properly\n- Fixed bug that could prevent sharing Reddit links via long-press\n- Fixed weird delay that could occur when submitting image posts\n- Fixed bug with moderating where activating the moderator options could cause a crash due to the user being shadowbanned\n- Bunch of other small tweaks and fixes!\n\nThanks everyone for using and supporting Apollo, it truly means the world. :) If you're enjoying it leaving a rating or a tip helps me a ton to keep building it! A bunch of people lately asked about Apollo t-shirts, pins, and related things, so I'm looking into doing that soon if you're interested!\n\nOh, and if you're around WWDC, say hi! I'll be in an Apollo shirt!\n\n- Christian"},{"version_id":"831621800","version_name":"1.4.21","version_date":"2019-06-12 00:25:19.000 +0800","version_description":"Hey all! Back from WWDC with for now just a small bug fix update for you (addresses a crash that could happen in the media viewer), with SO much more to come. It's going to be a busy summer. :)\n\nIt was really awesome meeting some of you at WWDC as well, thanks for saying hi!\n\n- Christian"},{"version_id":"831726420","version_name":"1.4.22","version_date":"2019-06-20 09:03:04.000 +0800","version_description":"Apollo is regularly updated to include bug fixes and perf– oh, you want a real changelog? Okay sure!\n\n- Fixed bug where multireddits couldn't be edited\n- Fixed bug where some videos wouldn't play properly\n- Fixed bug where some GIFs wouldn't play properly\n- Fixed bug where the \"… See More\" text in an album's caption wouldn't be the right size\n- Fixed bug where a weird &#x200B; would summon itself (it's been banished)\n- Lotsa other small tweaks.\n\nReally fun update incoming soon. Thanks so much for using Apollo and I really love hearing what you think, so please share feedback! If you're enjoying the app leaving a tip really helps me to be able to keep building it, it's just me (and two mostly unhelpful cats) building Apollo, haha.\n\n- Christian\n\n- Christian"},{"version_id":"831730711","version_name":"1.4.24","version_date":"","version_description":""},{"version_id":"831846925","version_name":"1.4.25","version_date":"2019-07-02 08:39:56.000 +0800","version_description":"A quick but delightful update today!\n\n- Includes a brand new Apollo Ultra icon option from none other than Lux, depicting our friendly neighborhood astronaut floating with his favorite ducky and enjoying summer. Hope y'all are too. :)\n- Fixes two bugs around prominent crashes in Apollo. One affects primarily devices on iOS 10, while the other should benefit everyone and help stability around edge cases in the media viewer and crashes.\n\nNot a ton in this update as I've been pouring a ton of effort into version 1.5, which is *just* about ready, can't wait to show you!\n\n- Christian"},{"version_id":"832008103","version_name":"1.4.26","version_date":"2019-07-16 08:32:44.000 +0800","version_description":"Mmmm. Bug fixes. A simple one today, some fixes around the media viewer having some weird behavior and crashing or not loading occasionally. UNACCEPTABLE"},{"version_id":"832204370","version_name":"1.4.27","version_date":"2019-08-01 07:32:34.000 +0800","version_description":"- Introducing Mr. Neep Neep, an esteemed, and well-respected individual created deep inside the mind of Michael Flarup, available as part of the Apollo Ultra pack.\n- In other news, did you hear? We raised over $27,000 for the SPCA animal shelter together! We rock, lots of dogs and cats are going to live amazing lives thanks to this awesome Apollo community. :)\n- Sorry for this build not having a ton in it other than the icon and the cool, I'm this close (pretend you can see me with really close fingers) to releasing 1.5 and I've been putting everything into getting it tidied up.\n\nHope it's nice weather where you're from, it's sweltering here!\n\n– Christian"},{"version_id":"832596829","version_name":"1.5","version_date":"2019-09-04 01:58:49.000 +0800","version_description":"SO MUCH AWESOME!\n\n- The biggest change in Apollo 1.5 has been the most requested one, better private messages support! Now you can view and reply to Reddit messages in a beautiful, fully-threaded conversational message view, things like seeing sent messages are so great now. This includes being able to go into separate inbox sections, like purely viewing comment replies.\n- Added an awesome new Pro feature: auto collapsing child comments. Now when reading threads you can collapse everything that isn't a top-level comment, making reading the juiciest replies even easier. You can have it automatically always do it, or remember your setting per subreddit. Or manually!\n- ANOTHER awesome new Pro feature (well two): auto hiding read posts (keeps that feed fresh), and auto marking posts read on scroll. Also an option to have a permanent floating \"hide read posts\" button. Fixes a bug around hiding too.\n- AMAZING moderator features. I think Apollo has to now be one of the most full-featured apps for Reddit moderators out there. First, Mod Mail! You can now view, respond to, action, sort, search, filter mod mail (both new and legacy, all threaded), includes \"user report cards\". Mod Queue. Mod Log. Mod Zone for quick access. Traffic stats. Edit rules. Lock comments. Edit AutoMod config. View/edit/add removal reasons. Report to Admins. Quick mod actions. Edit banned/muted/approved users. Comment nuke (delete comment and all replies). These aren't just web wrappers, they're all native and built right into the app.\n- New amazing Apollo Ultra icon by Jorge Velez, meet Mechapollo!\n- More gesture controls!\n- Pure Black Dark Mode now has pure dark headers as well \n- Tall thumbnails no longer cropped\n- Setting to show subreddits at the top of a post\n- Setting to always show usernames\n- Manually corrected another 1K subreddit capitalizations, currently up to around 5,200. (eg: askreddit -> AskReddit, wholesomememes -> WholesomeMemes)\n- You can now swipe along the top bar (in addition to the bottom tab bar) to go back/forward\n- Fixed bug with new comments sort eventually loading top comments instead of new\n- Media viewer supports even larger images\n- When typing, if you select text then the create link button it autofills the text\n- When you’re on a user’s profile (or your own) you can tap the headers for more info\n- Option to disable GIF autoplay\n- sPoNgEtExT option for 14% boosted in memeing\n- Fixed bug where numbered lists could have their numbers disappear\n- Fixed bug with around issues with swiping forward\n- Fixed delay with keyboard opening in alerts\n- Fixed two significant memory leaks, should make Apollo faster/less crashy\n- Fixed bug with marking all messages read\n- Fixed bug where tags in post could have their color take over the whole title\n- Gesture icons now better indicate if you're undoing something (undo upvote, etc.)\n- 14 new Text Faces\n- Subreddit Jump Bar makes better suggestions\n- Supports fenced code blocks like new Reddit\n- Fixes some video playback issues\n- Fixed bug with subreddit loading\n- Fixed bug with weird spoiler formatting\n- Double-tapping to zoom tall images won't cut top off on X/XS devices\n- Ability to view and message subreddit mods\n- Reddit URLs that let you jump into message composing now work\n- Accept moderator invites\n- Searching subreddit hides keyboard on scroll\n- Shows if a comment has been locked\n- Tweets with spoilers now hide the tweet\n- Compact mode spoilers hide properly\n- Fixed some bugs around trophies\n- Fixes to some weird mismatched colors in Monochrome theme\n- Improved abilities to report things\n- Fixes to long Twitter handles running off screen\n- Fix to when sharing some non-English Reddit posts it would sometimes cut off the link\n- Fixed bug around unfollowing users\n- A bunch more tweaks and fixes to just make everything even more awesome\n\nDang I've run out of text, for more see r/ApolloApp subreddit! :)"},{"version_id":"832820076","version_name":"1.6","version_date":"2019-09-20 01:38:35.000 +0800","version_description":"This update brings a bunch of awesome changes for the brand new iOS 13!\n\nFirst and foremost, Apollo has some great new visual touches, like supporting the new Dark Mode in iOS 13! So if you enable Dark Mode system wide, Apollo will follow the rest of the apps as well as iOS in pulling the curtains down, giving you a beautiful, dark look. You can customize this in Apollo's settings as well, from themes to how dark you want \"dark\" to be, and more! There's also refreshed icons, new inset lists like on Profile, and more!\n\niOS 13 also brought about a bunch of awesome speed and size improvements. Apollo should be (even more of) a lean, mean, fighting machine. The app is smaller to download, and much quicker to open to boot. Nice! Enjoy Redditing with even more speed than you were used to before.\n\nSiri Shortcuts support! Apollo now works with the (now built-in) Siri Shortcuts app, so you can set up custom shortcut scripts that work with Apollo (like opening subreddits, users, etc.) or even program them to work with Siri. There's no better way to start your day than with a custom command like \"Hey siri, fire the meme cannon\" to open r/memes or \"give me something to laugh at\" and have it open r/WhatCouldGoWrong.\n\n        Keyboard and Game Controller support. In addition to previous game controller support, iOS 13 added support for some very popular console controllers, so those all now work with Apollo, in addition to regular hardware keyboards, like keyboard cases! So now you can kick your feet up with a controller, or set up a keyboard, and navigate Apollo with ease, opening and reading comments, opening and closing the media viewer, etc. If there's more functionality you'd like to see here, tell me, I'm just getting started!\n\nBetter Accessibility support. I want Apollo to be the best browsing experience for Reddit for *everyone*, so I worked really hard to improve how accessible Apollo is for everyone. It now has much, much improved VoiceOver support for navigating the UI, even with custom swiping actions to open the media viewer for instance. In addition it also supports iOS 13's new Voice Control feature, so you can control Apollo without even touching it. This is another area I'm just getting started with and would love your feedback if you're willing to provide!\n\nThere's also LOTS more improvements, like being able to open multiple, different windows of Apollo on iPads, which is a personal favorite of mine and great for referencing multiple things on Reddit at once. Before iOS 13 you'd need 3 iPads to view 3 different Apollo windows, now you can do it with one iPad! Talk about cost savings!\n\nThere's also support for the new, beautiful Haptic Touch Context Menus in iOS 13, so every device can now preview media beautifully and easily.\n\nIn addition to the above, there's a bunch of bug fixes to things like random unresponsiveness, message bars reappearing like ghosts, crashes that could happen when marking posts read, listened to feedback on how the Inbox tab tapping behavior was a little weird, and much more! Being a brand new operating system too, it's possible Apollo might have a few bugs here and there while getting used to all the cool new things, so if you encounter anything weird give me a shout through the app and I'll fix 'em up!\n\nOnward and upward! As always, thank you so much for the support, a tip helps immensely if you're really enjoying Apollo. :)\n\n– Christian"},{"version_id":"832867114","version_name":"1.6.1","version_date":"2019-09-26 03:24:47.000 +0800","version_description":"This update brings a bunch of awesome changes for the brand new iOS 13!\n\nFirst and foremost, Apollo has some great new visual touches, like supporting the new Dark Mode in iOS 13! So if you enable Dark Mode system wide, Apollo will follow the rest of the apps as well as iOS in pulling the curtains down, giving you a beautiful, dark look. You can customize this in Apollo's settings as well, from themes to how dark you want \"dark\" to be, and more! There's also refreshed icons, new inset lists like on Profile, and more!\n\niOS 13 also brought about a bunch of awesome speed and size improvements. Apollo should be (even more of) a lean, mean, fighting machine. The app is smaller to download, and much quicker to open to boot. Nice! Enjoy Redditing with even more speed than you were used to before.\n\nSiri Shortcuts support! Apollo now works with the (now built-in) Siri Shortcuts app, so you can set up custom shortcut scripts that work with Apollo (like opening subreddits, users, etc.) or even program them to work with Siri. There's no better way to start your day than with a custom command like \"Hey siri, fire the meme cannon\" to open r/memes or \"give me something to laugh at\" and have it open r/WhatCouldGoWrong.\n\n        Keyboard and Game Controller support. In addition to previous game controller support, iOS 13 added support for some very popular console controllers, so those all now work with Apollo, in addition to regular hardware keyboards, like keyboard cases! So now you can kick your feet up with a controller, or set up a keyboard, and navigate Apollo with ease, opening and reading comments, opening and closing the media viewer, etc. If there's more functionality you'd like to see here, tell me, I'm just getting started!\n\nBetter Accessibility support. I want Apollo to be the best browsing experience for Reddit for *everyone*, so I worked really hard to improve how accessible Apollo is for everyone. It now has much, much improved VoiceOver support for navigating the UI, even with custom swiping actions to open the media viewer for instance. In addition it also supports iOS 13's new Voice Control feature, so you can control Apollo without even touching it. This is another area I'm just getting started with and would love your feedback if you're willing to provide!\n\nThere's also LOTS more improvements, like being able to open multiple, different windows of Apollo on iPads, which is a personal favorite of mine and great for referencing multiple things on Reddit at once. Before iOS 13 you'd need 3 iPads to view 3 different Apollo windows, now you can do it with one iPad! Talk about cost savings!\n\nThere's also support for the new, beautiful Haptic Touch Context Menus in iOS 13, so every device can now preview media beautifully and easily.\n\nIn addition to the above, there's a bunch of bug fixes to things like random unresponsiveness, message bars reappearing like ghosts, crashes that could happen when marking posts read, listened to feedback on how the Inbox tab tapping behavior was a little weird, and much more! Being a brand new operating system too, it's possible Apollo might have a few bugs here and there while getting used to all the cool new things, so if you encounter anything weird give me a shout through the app and I'll fix 'em up!\n\nOnward and upward! As always, thank you so much for the support, a tip helps immensely if you're really enjoying Apollo. :)\n\n– Christian\n\n1.6.1 changes (mostly bug fixes):\n\n- Context menu crash fix\n- Navigation can go forward/backward again\n- Occasional crash when posting/commenting fix\n- Face/Touch ID fixes\n- Light/dark mode change crash fix\n- Weird list formatting fix\n- Hide Bars on Scroll fix\n- Dark mode tweaks\n- External keyboard support fixes\n- GIFs and context menu improvements\n- Other bug fixes"},{"version_id":"832978238","version_name":"1.6.2","version_date":"2019-10-01 07:26:48.000 +0800","version_description":"- Brand new Apollo Ultra icon by the incredible Thomas Noppers, called “The Copper Giant”, it has such a fun, nostalgic feel, I love how Thomas designed it.\n- Dark Mode improvements/bug fixes for edge cases (if you still encounter something weird, gimme a shout!)\n- More Dark Mode settings so you can tweak it to your liking\n- Fixed bug where red Inbox badge wouldn't show up\n- Fixed bug where posts could flicker as you scroll sometimes\n- Fixed bug where media viewer could be zoomed in weirdly on iPad in split view\n- Fixed bug where navigation bar icons could go for a walk\n- Improvements to double-tap-and-drag-to-zoom (like in Maps) so it should be faster (if it's not working for you make sure you're on iOS 13.1)\n- Context menu has Open in YouTube app option\n- Light mode/dark mode launch screens\n- Fixed some weird colors\n- Comment composer now properly respects text sizing preferences as an Accessibility improvement\n- Bunch of other little bug fixes here and there! :D\n- And this is all in addition to the bunch of awesome iOS 13 additions listed below!\n\nFirstly, Apollo has some great new visual touches, like supporting the new Dark Mode in iOS 13! So if you enable Dark Mode system wide, Apollo will follow the rest of the apps as well as iOS in pulling the curtains down, giving you a beautiful, dark look. You can customize this in Apollo's settings as well, from themes to how dark you want \"dark\" to be, and more!\n\niOS 13 also brought about a bunch of awesome speed and size improvements. Apollo should be (even more of) a lean, mean, fighting machine. The app is smaller to download, and much quicker to open to boot. Nice! Enjoy Redditing with even more speed than you were used to before.\n\nSiri Shortcuts support! Apollo now works with the (now built-in) Siri Shortcuts app, so you can set up custom shortcut scripts that work with Apollo (like opening subreddits, users, etc.) or even program them to work with Siri. There's no better way to start your day than with a custom command like \"Hey siri, fire the meme cannon\" to open r/memes.\n\nKeyboard and Game Controller support. In addition to previous game controller support, iOS 13 added support for some very popular console controllers, so those all now work with Apollo, in addition to regular hardware keyboards, like keyboard cases! So now you can kick your feet up with a controller, or set up a keyboard, and navigate Apollo with ease, opening and reading comments, opening and closing the media viewer, etc.\n\nBetter Accessibility support. I want Apollo to be the best browsing experience for Reddit for *everyone*, so I worked really hard to improve how accessible Apollo is for everyone. It now has much, much improved VoiceOver support for navigating the UI, even with custom swiping actions to open the media viewer for instance. In addition it also supports iOS 13's new Voice Control feature, so you can control Apollo without even touching it.\n\nThere's also LOTS more improvements, like being able to open multiple, different windows of Apollo on iPads, which is a personal favorite of mine and great for referencing multiple things on Reddit at once. Before iOS 13 you'd need 3 iPads to view 3 different Apollo windows, now you can do it with one iPad! Talk about cost savings!\n\nThere's also support for the new, beautiful Haptic Touch Context Menus in iOS 13, so every device can now preview media beautifully and easily.\n\nOnward and upward! As always, thank you so much for the support, a tip helps immensely. :)\n\n– Christian"},{"version_id":"833311242","version_name":"1.6.3","version_date":"2019-10-25 04:34:36.000 +0800","version_description":"Happy early Halloween! This update brings new artwork as well as some delicious candied bug fixes. \n\n- An incredible Halloween rendition of the Apollo icon done by Anthony Piraino of The Iconfactory as part of the Apollo Ultra. It's sooooo cool, from the vines, to the moon in the background, to the pumpkin itself! Hope you all have a spoopy and fantastic Halloween!\n- Fixed the affectionately named “Australia Mode” bug where private message conversations could get flipped-turned upside down\n- Fixed bug where some Gfycat GIFs wouldn't play properly\n- Made the \"light mode\" launch screen a little darker\n- Fixed bug that could affect restoring Pro/Ultra (and worse, prevent confetti from falling when you do)\n- Fixed bug where videos would show up empty at first or you’d just heard the audio\n- Fixed bug where performance could slow down over time in weird situations\n- Fixed bug where not all elements on screen would switch to dark mode or light mode (hopefully, this one’s elusive)\n- Fixed bug where app would exit really quickly when going into the background\n- Fixed obscured album count on new devices\n- Fixed bug with AirPlay issues on iOS 13\n- Fixed bug with abrupt scrolling stops in Saved posts\n- Fixed bug where sometimes flicking back a GIF would cause it to pause\n- Lots of other small tweaks to make things smoother and nicer :)\n\n1.7 will be out very soon to boot and it’s SO NICE. Can’t wait to show off more details with it, it includes so many things that have been frequently asked for that I’m so glad to have finally been able to get to.\n\nAs always, THANK YOU SO MUCH for all the support given toward Apollo, I enjoy working on it every day and it’s 10 billion percent because of the amazing people who use the app and permit me to, so a very heartfelt thanks.\n\n– Christian"},{"version_id":"833538566","version_name":"1.6.4","version_date":"2019-11-10 04:19:53.000 +0800","version_description":"Here's a good ol' bug fix update that address some annoying things before 1.7.\n\n- Fixed bug around video playback (video wouldn't show up sometimes or would just be audio)\n- Fixed bug where occasionally there could be a weird mix of light mode and dark mode at the same time\n- Fixed bug where some GIF playback wouldn't properly load\n- Fixed bug where opening Apollo from a notification wouldn't always load the proper notification item (comment, post, etc.)\n- Fixed bug where Apollo wouldn't always open properly from other apps\n- Fixed bug where some Reddit hosted images/videos wouldn't load properly\n- Fixed bug where sometimes when rotating a GIF in the media viewer would make it disappear (dang spooky Halloween bugs)\n- GIFs load even faster and more play inline (also better detects if a Reddit \"video\" doesn't actually have an audio track so it will just treat it like a GIF)\n- Fixed bug where multi-window support wouldn't always work on iPad\n- Fixed bug where if the original poster deleted their account it would look like every deleted comment was from the original poster\n- Entering subreddits in the Jump Bar now properly disallows spaces and will automatically remove them if you, say, copy-paste or use the new QuickPath keyboard\n- Fixed bug where when dictating comments there could be a weird [OBJ] character that showed up (theory: ghosts of Objective-C angry that I'm using Swift?)\n- Fixed bug where when rotating in the media viewer the bottom gradient would sometimes creep across the screen weirdly\n- Fixed bug where there could be weird spacing in text posts with a bunch of image uploads\n- Fixed bug where in the last update the video player didn't have all of its cool features/options\n\n1.7 is right on the horizon woohoo! :D Can't wait to show it to y'all and thank you as always for being amazing and supportive!\n\n- Christian"},{"version_id":"833804617","version_name":"1.6.5","version_date":"2019-11-30 05:15:10.000 +0800","version_description":"This update brings some delightful bug fixes ahead of 1.7! Also if you're reading this and it's the Black Friday weekend, (Friday through Monday) Apollo Ultra's on its biggest sale ever! Oh, and Apollo merch is available for a few more days if you're interested as well, see Settings. :)\n\n- A gorgeous new homescreen icon by Jhona Burame, called Void Emperor as part of the Apollo Ultra pack!\n- Fix to a video playback bug where eventually videos could get the dreaded playback error\n- Fixed bug where in compact mode some posts could lose their bottoms\n- Fixed some oddities around Jump Bar suggestions (should properly include subscriptions/favorites/etc.)\n- Fixed some other minor bugs (not a ton in this minor update as those two first bugs took a ton of time to track down, gah!)\n\nThank you all for being so awesome always, and happy Thanksgiving if you're celebrating!\n\n– Christian"},{"version_id":"834039001","version_name":"1.6.6","version_date":"2019-12-20 13:31:36.000 +0800","version_description":"Merry Christmas! This is just a quick update where I wanted to include an optional Christmas icon (by Anthony Piraino) ahead of version 1.7, which is about to go into beta, so I wanted to make sure you’d have this icon well in advance of Christmas! If you don’t celebrate or celebrate something different, have an equally awesome time!"},{"version_id":"834520450","version_name":"1.7","version_date":"2020-01-30 02:29:57.000 +0800","version_description":"Apollo 1.7 IS HERE! I’ve been working around the clock on this update for months and months, it’s a doozy! I’ve been keeping track of the most requested features/additions and for 1.7 I wanted to tackle a ton of them to really bring Apollo to new heights. I ended up adding a lot more than I originally intended (I contemplated calling this the Apollo 2.0 update) but I think the work paid off and there’s really a ton of awesome stuff in this update that I just can’t live without now.\n\n- Ctrl/Command-F searching in comments! Just like on desktop Reddit you can now search through a comments thread for keywords and jump directly to them, it’s so handy for seeing if something specific was mentioned, or finding a user, or a mirror for a video. So. Handy.\n- A new Ultra icon by the incredibly talented Alexa Grafera depicting good ol’ Apollo as a tasty birthday cake.\n- Community icon pack! Finally. The Apollo community/subreddit has a ton of talented people in it, and from time to time a really cool icon gets submitted to the subreddit that people really want to see added to the app. So I talked to the creators of some of the most popular icons and purchased the icons from them to include in a new Community Icon Pack section.\n- GIF sounds! A new phenomenon on Reddit as of late has been GIFs that have audio. Is that basically a video? Totally, but it’s great in a pinch on Imgur and Gfycat to give a little more life to a GIF of a kitty yawning. (Don’t worry the audio won’t play without you tapping on it directly.)\n- Enhanced filtering! A few parts to this. Now you can filter well beyond the normal Reddit limitation of 100 subreddits in r/All and r/Popular. Also it’s a lot easier to add filters now, you can filter subreddits directly from the post/subreddit and you can block users directly from their profile.\n- Choose which photo album to select from when uploading!\n- Save photos to an “Apollo” folder option!\n- Upload via paste! When creating comments or messages if you have an image (or set of images) on your clipboard, you can now paste them directly into the text field and it’ll offer to upload them for you.\n- Live comments sort! No more needing to manually refresh live TV episode threads or sports threads!\n- View parent comments! If you go directly to a specific comment and it’s deep into a discussion, now you can load the upper comments directly inline!\n- Compact thumbnail size options! Now you can choose between three different thumbnail sizes for Compact Mode: small (default), medium, or large!\n- Subreddit icon options! You now have the option to show subreddit icons by posts and by the subreddit in the subreddits list.\n- Search saved items! The saved section is a treasure trove for your favorite posts, and now you can find them so much easier with a quick and very fast search bar.\n- Easier multireddit adding! You can now now add a subreddit to a multireddit directly from the subreddit.\n- Mute/unmute comment threads.\n- Mark text as a spoiler in a comment/message!\n- Option to disable Auto-Hide Read Posts in specific subreddits.\n- When you go to the About screen it’ll now show your current icon rather than just the default one. :)\n- Imgur uploads are now catalogued so you can go back and see them later or even delete them if you want.\n- If a moderator removes an entire comment thread Apollo now auto-collapses it so you don’t have to scroll past a wasteland.\n- A ton of other small additions and tweaks to make things more pleasant!\n- Lots of little bug fixes!\n\nAppreciate the patience while I worked on this big update and I hope it was worth the wait. 2020 is going to be a crazy year for Apollo, I have so many awesome things planned and this update feels like a great way to open up the decade. :) Appreciate all your generosity and kindness and letting me do this as a full time job, this is genuinely a dream job for me.\n\n- Christian\n\n[This changelog is sponsored by Raid Shadow Legends.]\n\n[Just kidding.]"},{"version_id":"834531220","version_name":"1.7.1","version_date":"2020-01-30 09:00:41.000 +0800","version_description":"Apollo 1.7 IS HERE! I’ve been working around the clock on this update for months and months, it’s a doozy! I’ve been keeping track of the most requested features/additions and for 1.7 I wanted to tackle a ton of them to really bring Apollo to new heights. I ended up adding a lot more than I originally intended (I contemplated calling this the Apollo 2.0 update) but I think the work paid off and there’s really a ton of awesome stuff in this update that I just can’t live without now.\n\n- Ctrl/Command-F searching in comments! Just like on desktop Reddit you can now search through a comments thread for keywords and jump directly to them, it’s so handy for seeing if something specific was mentioned, or finding a user, or a mirror for a video. So. Handy.\n- A new Ultra icon by the incredibly talented Alexa Grafera depicting good ol’ Apollo as a tasty birthday cake.\n- Community icon pack! Finally. The Apollo community/subreddit has a ton of talented people in it, and from time to time a really cool icon gets submitted to the subreddit that people really want to see added to the app. So I talked to the creators of some of the most popular icons and purchased the icons from them to include in a new Community Icon Pack section.\n- GIF sounds! A new phenomenon on Reddit as of late has been GIFs that have audio. Is that basically a video? Totally, but it’s great in a pinch on Imgur and Gfycat to give a little more life to a GIF of a kitty yawning. (Don’t worry the audio won’t play without you tapping on it directly.)\n- Enhanced filtering! A few parts to this. Now you can filter well beyond the normal Reddit limitation of 100 subreddits in r/All and r/Popular. Also it’s a lot easier to add filters now, you can filter subreddits directly from the post/subreddit and you can block users directly from their profile.\n- Choose which photo album to select from when uploading!\n- Save photos to an “Apollo” folder option!\n- Upload via paste! When creating comments or messages if you have an image (or set of images) on your clipboard, you can now paste them directly into the text field and it’ll offer to upload them for you.\n- Live comments sort! No more needing to manually refresh live TV episode threads or sports threads!\n- View parent comments! If you go directly to a specific comment and it’s deep into a discussion, now you can load the upper comments directly inline!\n- Compact thumbnail size options! Now you can choose between three different thumbnail sizes for Compact Mode: small (default), medium, or large!\n- Subreddit icon options! You now have the option to show subreddit icons by posts and by the subreddit in the subreddits list.\n- Search saved items! The saved section is a treasure trove for your favorite posts, and now you can find them so much easier with a quick and very fast search bar.\n- Easier multireddit adding! You can now now add a subreddit to a multireddit directly from the subreddit.\n- Mute/unmute comment threads.\n- Mark text as a spoiler in a comment/message!\n- Option to disable Auto-Hide Read Posts in specific subreddits.\n- When you go to the About screen it’ll now show your current icon rather than just the default one. :)\n- Imgur uploads are now catalogued so you can go back and see them later or even delete them if you want.\n- If a moderator removes an entire comment thread Apollo now auto-collapses it so you don’t have to scroll past a wasteland.\n- A ton of other small additions and tweaks to make things more pleasant!\n- Lots of little bug fixes!\n\nAppreciate the patience while I worked on this big update and I hope it was worth the wait. 2020 is going to be a crazy year for Apollo, I have so many awesome things planned and this update feels like a great way to open up the decade. :) Appreciate all your generosity and kindness and letting me do this as a full time job, this is genuinely a dream job for me.\n\n- Christian\n\n[1.7.1 has a few bug fixes to 1.7]\n\n[This changelog is sponsored by Raid Shadow Legends.]\n\n[Just kidding.]"},{"version_id":"834544358","version_name":"1.7.2","version_date":"2020-01-31 11:56:16.000 +0800","version_description":"Apollo 1.7 IS HERE! I’ve been working around the clock on this update for months and months, it’s a doozy! I’ve been keeping track of the most requested features/additions and for 1.7 I wanted to tackle a ton of them to really bring Apollo to new heights. I ended up adding a lot more than I originally intended (I contemplated calling this the Apollo 2.0 update!) but I think the work paid off and there’s really a ton of awesome stuff in this update that I just can’t live without now.\n\n- Ctrl/Command-F style searching in comments! Just like on desktop Reddit you can now search through a comments thread for keywords and jump directly to them, it’s so handy for seeing if something specific was mentioned, or finding a user, or a mirror for a video. So. Handy.\n- A new Ultra icon by the incredibly talented Alexa Grafera depicting good ol’ Apollo as a tasty birthday cake.\n- Community icon pack! Finally. The Apollo community/subreddit has a ton of talented people in it, and from time to time a really cool icon gets submitted to the subreddit that people really want to see added to the app. So I talked to the creators of some of the most popular icons and purchased the icons from them to include in a new Community Icon Pack section.\n- GIF sounds! A new phenomenon on Reddit as of late has been GIFs that have audio. Is that basically a video? Totally, but it’s great in a pinch on Imgur and Gfycat to give a little more life to a GIF of a kitty yawning. (Don’t worry the audio won't auto play, but if you preferred the old style there's an option in Settings to revert back)\n- Enhanced filtering! A few parts to this. Now you can filter well beyond the normal Reddit limitation of 100 subreddits in r/All and r/Popular. Also it’s a lot easier to add filters now, you can filter subreddits directly from the post/subreddit and you can block users directly from their profile.\n- Choose which photo album to select from when uploading!\n- Save photos to an “Apollo” folder option!\n- Upload via paste! When creating comments or messages if you have an image (or set of images) on your clipboard, you can now paste them directly into the text field and it’ll offer to upload them for you.\n- Live comments sort! No more needing to manually refresh live TV episode threads or sports threads!\n- View parent comments! If you go directly to a specific comment and it’s deep into a discussion, now you can load the upper comments directly inline!\n- Compact thumbnail size options! Now you can choose between three different thumbnail sizes for Compact Mode: small (default), medium, or large!\n- Subreddit icon options! You now have the option to show subreddit icons by posts and by the subreddit in the subreddits list.\n- Search saved items! The saved section is a treasure trove for your favorite posts, and now you can find them so much easier with a quick and very fast search bar.\n- Easier multireddit adding! You can now now add a subreddit to a multireddit directly from the subreddit.\n- Mute/unmute comment threads.\n- Mark text as a spoiler in a comment/message!\n- Option to disable Auto-Hide Read Posts in specific subreddits.\n- When you go to the About screen it’ll now show your current icon rather than just the default one. :)\n- If a moderator removes an entire comment thread Apollo now auto-collapses it so you don’t have to scroll past a wasteland.\n- A ton of other small additions and tweaks to make things more pleasant!\n- Lots of little bug fixes!\n\nAppreciate the patience while I worked on this big update and I hope it was worth the wait. 2020 is going to be an amazing year for Apollo, thank you so much for your generosity and giving me my genuine dream job. :) \n\n- Christian\n\n[This changelog is sponsored by Raid Shadow Legends.]\n\n[Just kidding.]\n\n[1.7.2 has a few bug fixes, plus an option to revert/disable audio in GIFs back to the old behavior until I get a chance in 1.8 to make it a little more flexible overall]"},{"version_id":"834923712","version_name":"1.7.3","version_date":"2020-03-02 05:43:16.000 +0800","version_description":"Just a small (but delightful!) update today bringing this month’s Apollo Ultra icon, created by the incredibly talented Mark Jardine of Tapbots/Tweetbot fame. I’ve been a big fan of his art style for a long time used throughout their apps, so it’s an absolute honor to have him do a really amazing icon for Apollo: Apollobot! In addition to this amazing icon, this update brings a 1-2 punch with another awesome icon for the Community Icon Pack by the awesome flashboy131 (this is his second icon included!), I love this icon and it was a very popular one amongst the community, so I’m very happy to have it included.\n\nThe 1.7 version has had an such incredibly warm reception and I’ve been so floored, thank you so much for the kindness and I’m really, really glad you like it. I’ve been working a ton on 1.8 as a result (I mean 1.7 was great, but gotta keep going!) and I think you’re going to really love it as well, can’t wait to show you. :) The support means the world!\n\n– Christian"},{"version_id":"835353650","version_name":"1.7.4","version_date":"2020-04-02 04:09:20.000 +0800","version_description":"Weeee update today, featuring this month's Apollo Ultra icon. I wanted to have the full 1.8 version available for you all for this update (long story short it's a bunch of awesome improvements surrounding the media viewing experience among some other nice things) but if you've seen my Twitter essentially a few nice to have features that I really want to ship with it have proved a little more challenging to build than anticipated, so I'm hoping to finish up a few more things then get it out to y'all as soon as I can, just don't want to rush something good! \n\nFor this month's icon, it's by the awesomely talented Huang Zitao. I love the art style, it's so cute and fun so it seemed fitting due to a recent game release and in spite of the gloomy news as of late, and the name (Stringfish) represents a fun fish some have fought with in the month of March. \n\nAll the best everyone and stay safe, your support in these challenging times genuinely means the world to me and my family,\n\n- Christian"},{"version_id":"836080323","version_name":"1.8","version_date":"2020-05-24 07:14:38.000 +0800","version_description":"Here we goooo! Apollo 1.8 is now available, it brings a ton of awesome improvements, focusing specifically around the media viewer, but also extending to a ton of different areas of the app. Apollo already makes consuming media from Reddit a super smooth and enjoyable experience, and this update really brings it to another level, especially alongside all the other goodies. So without further ado, here’s all the awesome stuff!\n\n# Media Viewer (Images, GIFs, Videos, etc.)\n\n- In addition to GIFs, videos now also play inline in the feed, so you no longer have to tap into them in order to see what’s going on at a glance. \n\n- Save/share as GIF!\n\n- Pause GIFs! \n\n- Sharing the video file for Reddit videos now automatically merges the video and audio stream\n\n- Fixes a longstanding bug where when playing music in the background Apollo sometimes wouldn’t resume the audio if it interrupted it because you wanted to play a video.\n\n- Media is also more clear if there was an issue loading it (say, the site’s having some trouble) \n\n- Sharing’s much improved and more streamlined, so you can share content even easier.\n\n- On iOS 13 and later you can use haptic touch to long press on an image/video/GIF to preview it quickly\n\n# Share Comment or Post as an Image\n\n- If you’re the type that likes to screenshot a funny comment or post and send to a friend, now you don’t have to mess around with screenshoting, then cropping, or piecing together multiple images, Apollo will handle it all for you. Just tap “Share as Image” and Apollo will generate an image of the post or comment(s) ready for you to share, and stitch together as many screens as necessary. You can even share image posts as well, for instance if you want to have the title merged with the image for context.\n\n# 5 (Five!) New App Icons to Choose From\n\nI was working so hard on this update that I blasted right through April so I’m including April’s as well as May’s Ultra icons in this update. And as a thank you for your patience as I worked away at this update it also includes 3 brand new, highly requested icons for the Community Icon Pack. I really love these icons, the beautiful jungle theme is by Ilya Shapko, the ethereal astronaut is from Lalit, and for the community icons, the sketch icon is from Charlie Chapman and his podcast, the incredible knight by ben5292001, and crazy cool fiery icon from joeyeatsfridays.\n\n# New Reddit Awards\n\n- Reddit recently updated the award system to evolve from just Silver, Gold, and Platinum to a variety of fun, new awards. You can view them and gift them, or turn them off completely!\n\n# Reddit Polls\n\n- Support for the new Reddit Polls! Have fun voting in heated community discussions about the intricacies of crocheting. \n\n# Comment Parent Previewing\n\n- On iOS 13 and later comments now get a nice context menu when you use haptic touch on them, but beyond just having some nice options it’ll now actually show you the parent comment to the comment you selected!\n\n# iPad Pointer Support\n\n- iOS 13.4 added a ton of awesome functionality around iPads and mouse/trackpad cursor support. Apollo now supports this thoroughly!\n\n# Misc\n\nI also improved icons in small ways across the app, to make things feel a little more crisp, nice, and pretty. Select Mode is also available in more places, and it automatically selects the text right away to be even faster/friendlier. In addition to this, the new modern iOS 13 Context Menus are supported fully across the app, which makes Apollo feel even more like the iOS first class citizen it is! And of course, there is a bunch of awesome bug fixes and performance improvements across the board, should make Apollo feel even snappier.\n\n# Thank You\n\nY’all are genuinely the best community, thank you so much for all the support and I really hope you enjoy this update, a ton of work went into it! I have some really great updates in the pipeline for the rest of 2020 as well. :)\n\n- Christian"},{"version_id":"836085072","version_name":"1.8.1","version_date":"2020-05-25 02:12:16.000 +0800","version_description":"[1.8.1 has a few bug fixes to version 1.8 described below]\n\nHere we goooo! Apollo 1.8 is now available, it brings a ton of awesome improvements, focusing specifically around the media viewer, but also extending to a ton of different areas of the app. Apollo already makes consuming media from Reddit a super smooth and enjoyable experience, and this update really brings it to another level, especially alongside all the other goodies. So without further ado, here’s all the awesome stuff!\n\n# Media Viewer (Images, GIFs, Videos, etc.)\n\n- In addition to GIFs, videos now also play inline in the feed, so you no longer have to tap into them in order to see what’s going on at a glance. \n\n- Save/share as GIF!\n\n- Pause GIFs! \n\n- Sharing the video file for Reddit videos now automatically merges the video and audio stream\n\n- Fixes a longstanding bug where when playing music in the background Apollo sometimes wouldn’t resume the audio if it interrupted it because you wanted to play a video.\n\n- Media is also more clear if there was an issue loading it (say, the site’s having some trouble) \n\n- Sharing’s much improved and more streamlined, so you can share content even easier.\n\n- On iOS 13 and later you can use haptic touch to long press on an image/video/GIF to preview it quickly\n\n# Share Comment or Post as an Image\n\n- If you’re the type that likes to screenshot a funny comment or post and send to a friend, now you don’t have to mess around with screenshoting, then cropping, or piecing together multiple images, Apollo will handle it all for you. Just tap “Share as Image” and Apollo will generate an image of the post or comment(s) ready for you to share, and stitch together as many screens as necessary. You can even share image posts as well, for instance if you want to have the title merged with the image for context.\n\n# 5 (Five!) New App Icons to Choose From\n\nI was working so hard on this update that I blasted right through April so I’m including April’s as well as May’s Ultra icons in this update. And as a thank you for your patience as I worked away at this update it also includes 3 brand new, highly requested icons for the Community Icon Pack. I really love these icons, the beautiful jungle theme is by Ilya Shapko, the ethereal astronaut is from Lalit, and for the community icons, the sketch icon is from Charlie Chapman and his podcast, the incredible knight by ben5292001, and crazy cool fiery icon from joeyeatsfridays.\n\n# New Reddit Awards\n\n- Reddit recently updated the award system to evolve from just Silver, Gold, and Platinum to a variety of fun, new awards. You can view and gift them!\n\n# Reddit Polls\n\n- Support for the new Reddit Polls! Have fun voting in heated community discussions about the intricacies of crocheting. \n\n# Comment Parent Previewing\n\n- On iOS 13 and later comments now get a nice context menu when you use haptic touch on them, but beyond just having some nice options it’ll now actually show you the parent comment to the comment you selected!\n\n# iPad Pointer Support\n\n- iOS 13.4 added a ton of awesome functionality around iPads and mouse/trackpad cursor support. Apollo now supports this thoroughly!\n\n# Misc\n\nI also improved icons in small ways across the app, to make things feel a little more crisp, nice, and pretty. Select Mode is also available in more places, and it automatically selects the text right away to be even faster/friendlier. In addition to this, the new modern iOS 13 Context Menus are supported fully across the app, which makes Apollo feel even more like the iOS first class citizen it is! And of course, there is a bunch of awesome bug fixes and performance improvements across the board, should make Apollo feel even snappier.\n\n# Thank You\n\nY’all are genuinely the best community, thank you so much for all the support and I really hope you enjoy this update, a ton of work went into it! I have some really great updates in the pipeline for the rest of 2020 as well. :)\n\n- Christian"},{"version_id":"836315557","version_name":"1.8.2","version_date":"2020-06-09 02:25:25.000 +0800","version_description":"1.8.2 builds on 1.8 with a bunch of improvements and fixes based on awesome feedback from the community! I really appreciate all the terrific support the last update received, as well as a bunch of terrific feedback that’s serving to make the update even better (as well as squash some bugs!) Read on!\n\n- For video playback, controls automatically fade out now\n- “Remember” setting for video audio, where it remembers if you unmuted the video until you either re-mute it or leave the app (or you can set to always unmute, or never unmute)\n- On iPad you can go to the Jump Bar with the command-L keyboard shortcut’\n- Can now use headphones control to pause video \n- Apollo now is more intelligent with autoplaying GIFs/videos and only starts them playing them once a majority is on-screen\n- Fixed crash that could occur with live videos\n- Fixed bug where some GIFs wouldn’t play\n- Fixed bug that could cause app to slow down after watching a bunch of videos\n- If user has thumbnails disabled in their Reddit prefs, Apollo will offer to enable them since it’s normally done accidentally\n- Marking posts read is now harder to do accidentally\n- Fixed bug where you could upvote and downvote at the same time (sidevote?)\n- Fixed bug around tapping awards after collapsing comment\n- Fixed bug with play arrow overlapping video for some GIFs\n- Fixed bug with mouse scroll-wheel support on iPad\n- Fixed bug where some weird GIFs would open in Safari instead of in the app\n- Support for new Reddit/subreddit posting requirements for communities that have more strict posting requirements\n- With large posts mode, the voting arrows have larger tap targets\n- When sharing with “Share Includes Post Title” enabled, it will now put the post title properly as the subject in an email\n\nAs always, if you have any further suggestions I’d love to hear them! Thanks for being so awesome! And if you missed all the goodies in 1.8, here’s a quick summary of them!\n\n# Media Viewer (Images, GIFs, Videos, etc.)\n\n- In addition to GIFs, videos now also play inline in the feed, so you no longer have to tap into them in order to see what’s going on at a glance. \n\n- Save/share as GIF!\n\n- Pause GIFs! \n\n- Sharing the video file for Reddit videos now automatically merges the video and audio stream\n\n- Sharing’s much improved and more streamlined, so you can share content even easier.\n\n- On iOS 13 and later you can use haptic touch to long press on an image/video/GIF to preview it quickly\n\n# Share Comment or Post as an Image\n\n- If you’re the type that likes to screenshot a funny comment and send to a friend, now you don’t have to mess around with screenshoting, then cropping, or piecing together multiple images, Apollo will handle it all for you!\n\n# Portrait Lock Buddy\n\n- Apollo now has a Smart Rotation Lock as well as a Portrait Lock Buddy! Check out Settings > General for more info.\n\n# 5 (Five!) New App Icons to Choose From\n\nTwo new Apollo Ultra icons, as well as 3 new additions to the Community Icon Pack!\n\n# New Reddit Awards\n\n- Reddit recently updated the award system to evolve from just Silver, Gold, and Platinum to a variety of fun, new awards. You can view and gift them!\n\n# Reddit Polls\n\n- Support for the new Reddit Polls! Have fun voting in heated community discussions about the intricacies of crocheting. \n\n# Comment Parent Previewing\n\n- On iOS 13 and later comments now get a nice context menu when you use haptic touch on them, but beyond just having some nice options it’ll now actually show you the parent comment to the comment you selected!\n\n# iPad Pointer Support\n\n- iOS 13.4 added a ton of awesome functionality around iPads and mouse/trackpad cursor support. Apollo now supports this thoroughly!\n\n# Thank You\n\nY’all are genuinely the best community, thank you so much for all the support and I really hope you enjoy this update!\n\n- Christian"},{"version_id":"836348846","version_name":"1.8.3","version_date":"2020-06-11 02:39:41.000 +0800","version_description":"1.8.3 builds on 1.8 with a bunch of improvements and fixes based on awesome feedback from the community! I really appreciate all the terrific support the last update received, as well as a bunch of terrific feedback that’s serving to make the update even better (as well as squash some bugs!) Read on!\n\n- For video playback, controls automatically fade out now\n- “Remember” setting for video audio, where it remembers if you unmuted the video until you either re-mute it or leave the app (or you can set to always unmute, or never unmute)\n- On iPad you can go to the Jump Bar with the command-L keyboard shortcut’\n- Can now use headphones control to pause video \n- Apollo now is more intelligent with autoplaying GIFs/videos and only starts them playing them once a majority is on-screen\n- Fixed crash that could occur with live videos\n- Fixed bug where some GIFs wouldn’t play\n- Fixed bug that could cause app to slow down after watching a bunch of videos\n- If user has thumbnails disabled in their Reddit prefs, Apollo will offer to enable them since it’s normally done accidentally\n- Marking posts read is now harder to do accidentally\n- Fixed bug where you could upvote and downvote at the same time (sidevote?)\n- Fixed bug around tapping awards after collapsing comment\n- Fixed bug with play arrow overlapping video for some GIFs\n- Fixed bug with mouse scroll-wheel support on iPad\n- Fixed bug where some weird GIFs would open in Safari instead of in the app\n- Support for new Reddit/subreddit posting requirements for communities that have more strict posting requirements\n- With large posts mode, the voting arrows have larger tap targets\n- When sharing with “Share Includes Post Title” enabled, it will now put the post title properly as the subject in an email\n- Subreddit icon fixes\n- Some weird crash fixes\n\nAs always, if you have any further suggestions I’d love to hear them! Thanks for being so awesome! And if you missed all the goodies in 1.8, here’s a quick summary of them!\n\n# Media Viewer (Images, GIFs, Videos, etc.)\n\n- In addition to GIFs, videos now also play inline in the feed, so you no longer have to tap into them in order to see what’s going on at a glance. \n\n- Save/share as GIF!\n\n- Pause GIFs! \n\n- Sharing the video file for Reddit videos now automatically merges the video and audio stream\n\n- Sharing’s much improved and more streamlined, so you can share content even easier.\n\n- On iOS 13 and later you can use haptic touch to long press on an image/video/GIF to preview it quickly\n\n# Share Comment or Post as an Image\n\n- If you’re the type that likes to screenshot a funny comment and send to a friend, now you don’t have to mess around with screenshoting, then cropping, or piecing together multiple images, Apollo will handle it all for you!\n\n# Portrait Lock Buddy\n\n- Apollo now has a Smart Rotation Lock as well as a Portrait Lock Buddy! Check out Settings > General for more info.\n\n# 5 (Five!) New App Icons to Choose From\n\nTwo new Apollo Ultra icons, as well as 3 new additions to the Community Icon Pack!\n\n# New Reddit Awards\n\n- Reddit recently updated the award system to evolve from just Silver, Gold, and Platinum to a variety of fun, new awards. You can view and gift them!\n\n# Reddit Polls\n\n- Support for the new Reddit Polls! Have fun voting in heated community discussions about the intricacies of crocheting. \n\n# Comment Parent Previewing\n\n- On iOS 13 and later comments now get a nice context menu when you use haptic touch on them, but beyond just having some nice options it’ll now actually show you the parent comment to the comment you selected!\n\n# iPad Pointer Support\n\n- iOS 13.4 added a ton of awesome functionality around iPads and mouse/trackpad cursor support. Apollo now supports this thoroughly!\n\n# Thank You\n\nY’all are genuinely the best community, thank you so much for all the support and I really hope you enjoy this update!\n\n- Christian"},{"version_id":"836385047","version_name":"1.8.4","version_date":"2020-06-13 12:21:07.000 +0800","version_description":"1.8.4 builds on 1.8 with a bunch of improvements and fixes based on awesome feedback from the community! I really appreciate all the terrific support the last update received, as well as a bunch of terrific feedback that’s serving to make the update even better (as well as squash some bugs!) Read on!\n\n- Fixed \"save image\" disappearing\n- For video playback, controls automatically fade out now\n- “Remember” setting for video audio, where it remembers if you unmuted the video until you either re-mute it or leave the app (or you can set to always unmute, or never unmute)\n- On iPad you can go to the Jump Bar with the command-L keyboard shortcut’\n- Can now use headphones control to pause video \n- Apollo now is more intelligent with autoplaying GIFs/videos and only starts them playing them once a majority is on-screen\n- Fixed crash that could occur with live videos\n- Fixed bug where some GIFs wouldn’t play\n- Fixed bug that could cause app to slow down after watching a bunch of videos\n- If user has thumbnails disabled in their Reddit prefs, Apollo will offer to enable them since it’s normally done accidentally\n- Marking posts read is now harder to do accidentally\n- Fixed bug where you could upvote and downvote at the same time (sidevote?)\n- Fixed bug around tapping awards after collapsing comment\n- Fixed bug with play arrow overlapping video for some GIFs\n- Fixed bug with mouse scroll-wheel support on iPad\n- Fixed bug where some weird GIFs would open in Safari instead of in the app\n- Support for new Reddit/subreddit posting requirements for certain communities\n- With large posts mode, the voting arrows have larger tap targets\n- When sharing with “Share Includes Post Title” enabled, it will now put the post title properly as the subject in an email\n- Subreddit icon fixes\n- Creating links fix\n- Audio resume bug\n- Picture position on iPad\n- Some weird crash fixes\n\nAs always, if you have any further suggestions I’d love to hear them! Thanks for being so awesome! And if you missed all the goodies in 1.8, here’s a quick summary of them!\n\n# Media Viewer (Images, GIFs, Videos, etc.)\n\n- In addition to GIFs, videos now also play inline in the feed, so you no longer have to tap into them in order to see what’s going on at a glance. \n\n- Save/share as GIF!\n\n- Pause GIFs! \n\n- Sharing the video file for Reddit videos now automatically merges the video and audio stream\n\n- Sharing’s much improved and more streamlined, so you can share content even easier.\n\n- On iOS 13 and later you can use haptic touch to long press on an image/video/GIF to preview it quickly\n\n# Share Comment or Post as an Image\n\n- If you’re the type that likes to screenshot a funny comment and send to a friend, now you don’t have to mess around with screenshoting, then cropping, or piecing together multiple images, Apollo will handle it all for you!\n\n# Portrait Lock Buddy\n\n- Apollo now has a Smart Rotation Lock as well as a Portrait Lock Buddy! Check out Settings > General for more info.\n\n# 5 (Five!) New App Icons to Choose From\n\nTwo new Apollo Ultra icons, as well as 3 new additions to the Community Icon Pack!\n\n# New Reddit Awards\n\n- Reddit recently updated the award system to evolve from just Silver, Gold, and Platinum to a variety of fun, new awards. You can view and gift them!\n\n# Reddit Polls\n\n- Support for the new Reddit Polls! Have fun voting in heated community discussions about the intricacies of crocheting. \n\n# Comment Parent Previewing\n\n- On iOS 13 and later comments now get a nice context menu when you use haptic touch on them, but beyond just having some nice options it’ll now actually show you the parent comment to the comment you selected!\n\n# iPad Pointer Support\n\n- iOS 13.4 added a ton of awesome functionality around iPads and mouse/trackpad cursor support. Apollo now supports this thoroughly!\n\n# Thank You\n\nY’all are genuinely the best community, thank you so much for all the support and I really hope you enjoy this update!\n\n- Christian"},{"version_id":"836849970","version_name":"1.8.5","version_date":"2020-07-16 10:41:20.000 +0800","version_description":"Bunch of bug fixes, plus an awesome new Ultra icon – Mechapollo Part II – included as well!\n\n- Fixed bug where haptic touch on vote went away\n- Native Reddit album support\n- Archived posts have the voting arrows gray plus more minimal alert if voted on\n- Fixed a bug with some links being unclickable\n- Added auto-load for new comments in a thread\n- Fixed bug with GIFs not being able to be scrubbed back to the beginning\n- Fixed bug with accidentally muting background audio\n- Fixed bug with crashing when download a GIF\n- Fixed bug where some GIFs/videos wouldn't save\n- Fixed bug with missing gild notifications\n- Fixed bug where Apollo could show half a screen weirdly and become unresponsive\n- Fixed potential crash bug with media viewer\n\nThanks y'all! More goodies to come!\n\n- Christian"},{"version_id":"837017361","version_name":"1.8.6","version_date":"2020-07-28 03:18:35.000 +0800","version_description":"Mostly bug fixes in this one plus a thank you! \n\n- Fixed an annoying crash that could occur with galleries\n- Fixed a bug where the slider in the video controls wouldn't go right to the edges (AHHH)\n- iOS' Low Data Mode is now properly handled in Apollo and GIFs/videos won't autoplay in the feed if it's enabled for your cellular connection or WiFi\n- The username of the person submitting the post is now included in Share as Image as many requested (good idea!)\n- Fixed bug where \"Continue thread…\" sometimes wouldn't be tappable\n- Fixed two silly typos\n\nAlso a very VERY big thank you to everyone who uses Apollo. The proceeds for Apollo sales over the weekend were donated to my local SPCA Animal Shelter and we managed to raise over $42,000 from the community really coming together for an awesome cause. Y'all are the best. At the time I'm writing this tomorrow morning I'm going to meet up with the SPCA and see some kitties so I'll pass the kindness from the community into the kitties and puppies via pets and head scratches. :)\n\n- Christian"},{"version_id":"837687326","version_name":"1.8.7","version_date":"2020-09-08 06:08:27.000 +0800","version_description":"Just a quick update that fixes some issues when watching videos uploaded to Reddit. "},{"version_id":"837744225","version_name":"1.9","version_date":"2020-09-13 00:19:32.000 +0800","version_description":"WAPOW! This has been a massive update bringing to life a ton of incredible ideas from the community. Lately the state of the world can feel a little dreary sometimes, so you know what you need? An awesome, bursting at the seams, feature-packed update to your favorite app for Reddit! Read on for all the juicy details, and there's a version of this changelog with images inside Apollo!\n\n# Crosspost Viewing\nCrossposting (taking an existing post and reposting it to a similar subreddit) has been a big part of Reddit for ages, but recently it became a full-fledged feature where you can see exactly which subreddit it came from, and quickly jump to the original post. Apollo now supports this fully!\n\n# Crossposting\nSimilar to being able to view crossposts, you can also easily perform a crosspost if you want as well!\n\n# Image Flair\nFlair is a little “tag” users can add to their usernames in subreddit, and some subreddits even allow small images/icons to be added in addition to text, like the icon for your favorite sports team, or a character from your favorite TV show. Apollo now shows these beautifully!\n\n# Setting Your Flair\nIn addition to being able to view the flair as discussed in the previous item, you can now set your own flair! Simply go to the subreddit of your choosing, and you can choose from a list of customizable flairs!\n\n# View Long Flair\nSome users set loooong flair, and as a result it can get off, which can be annoying when you’re trying to figure out what it says. Well be annoyed no longer, for you can simply tap on the long flair to bring up a window that expands it fully!\n\n# Find Posts with Same Flair\nIf the subreddit lets users tag their posts with individual flairs (say, being able to tag whether your question is about a certain character, or a certain topic), you can now simply tap on that flair and Apollo will show you all the other posts in the subreddit that have been tagged with that same flair.\n        \n# 5 (Yeah, Five!) New App Icons!\nThe first three are Ultra icons, all made by the same incredibly talented designer, Matthew Skiles, who I’ve been a fan of for a long time. Next up, we have a beautiful new Apollo icon representing the trans pride flag (originally created by Monica Helms), which came out really awesome and is a great addition. And last but not least, our incredible community designer, FutureIncident, created the Japanese-inspired Apollo-san icon!\n\n# Easy Language Translation\nReddit is home to a diverse set of communities, but sometimes it’s tricky to understand what’s being said if the conversation is in a language you’re not familiar with. Now Apollo will be able to detect if the language of a comment or post is different than the language of your iOS device, and if so, offer to quickly translate it so you can understand the conversation! \n\n# Fast Subreddit Selector\nWhethering you’re trying to add a single subreddit to a filter, or adding multiple subreddits at a time to a multireddit, Apollo is now even faster at doing these tasks, with an auto-completing window that makes it super fast to search and add subreddits.\n\n# Total Collapsed Comments & Remembering Collapsed Comments\nTwo handy new additions to collapsing comments in Apollo. The first, Apollo will show you at a glance how many comments are in the collapsed conversation. The second thing, if you collapse a bunch of comments, and then come back to that same comment section later, Apollo will now remember which comments you had collapsed, and keep them collapsed for you!\n\n# And So Much More!\nTweaks, bug fixes, and more! For even more details, check out the in-app changelog!\n\n# Thank You!\nI’ll sound like a YouTuber for a second, but if you're enjoying these really thorough changelogs (they take a lot of time to put together!) as well as all the awesome new additions I worked on, leaving a tip of literally any size inside the app helps me so much, as it’s just me building Apollo!"},{"version_id":"837814399","version_name":"1.10","version_date":"2020-09-17 04:29:54.000 +0800","version_description":"Massive update ahead! iOS 14 features like Widgets, Picture in Picture Video, new Photo Picker, plus tons of other stuff like crossposting, flair improvements, translation features, and so much more! Read on!\n\n# Widgets\nApollo now includes a bunch of awesome, customizable iOS 14 home screen widgets to show posts, shortcuts, and more! To add, simply long-press on the home screen, tap the + in the top corner, and select Apollo!\n\n# Picture in Picture Video\n\nApollo now lets you enjoy Picture in Picture video so you can continue watching video from Apollo when you're doing other things!\n\n# Crossposts\nCrossposting (taking an existing post and reposting it to a similar subreddit) has been a big part of Reddit for ages, but recently it became a full-fledged feature where you can see exactly which subreddit it came from, and quickly jump to the original post. Apollo now supports this fully! You can perform crossposts too!\n\n# Image Flair\nFlair is a little “tag” users can add to their usernames in subreddit, and some subreddits even allow small images/icons to be added in addition to text, like the icon for your favorite sports team, or a character from your favorite TV show. Apollo now shows these beautifully!\n\n# Setting Your Flair\nIn addition to being able to view the flair as discussed in the previous item, you can now set your own flair! Simply go to the subreddit of your choosing, and you can choose from a list of customizable flairs!\n\n# View Long Flair\nSome users set loooong flair, and as a result it can get off, which can be annoying when you’re trying to figure out what it says. Well be annoyed no longer, for you can simply tap on the long flair to bring up a window that expands it fully!\n\n# Find Posts with Same Flair\nIf the subreddit lets users tag their posts with individual flairs, you can now simply tap on that flair and Apollo will show you all the other posts in the subreddit that have been tagged with that same flair.\n        \n# 5 (Yeah, Five!) New App Icons!\nThe first three are Ultra icons, all made by the same incredibly talented designer, Matthew Skiles, who I’ve been a fan of for a long time. Next up, we have a beautiful new Apollo icon representing the trans pride flag (originally created by Monica Helms), which came out really awesome and is a great addition. And last but not least, our incredible community designer, FutureIncident, created the Japanese-inspired Apollo-san icon!\n\n# Easy Language Translation\nReddit is home to a diverse set of communities, but sometimes it’s tricky to understand what’s being said if the conversation is in a language you’re not familiar with. Now Apollo will be able to detect if the language of a comment or post is different than the language of your iOS device, and if so, offer to quickly translate it so you can understand the conversation! \n\n# Fast Subreddit Selector\nWhethering you’re trying to add a single subreddit to a filter, or adding multiple subreddits at a time to a multireddit, Apollo is now even faster at doing these tasks, with an auto-completing window that makes it super fast to search and add subreddits.\n\n# Total Collapsed Comments & Remembering Collapsed Comments\nTwo handy new additions to collapsing comments in Apollo. The first, Apollo will show you at a glance how many comments are in the collapsed conversation. The second thing, if you collapse a bunch of comments, and then come back to that same comment section later, Apollo will now remember which comments you had collapsed, and keep them collapsed for you!\n\n# And So Much More!\nTweaks, bug fixes, and more! For even more details, check out the in-app changelog!\n\n# Thank You!\nI’ll sound like a YouTuber for a second, but if you're enjoying these really thorough changelogs (they take a lot of time to put together!) as well as all the awesome new additions I worked on, leaving a tip of literally any size inside the app helps me so much, as it’s just me building Apollo!"},{"version_id":"837862987","version_name":"1.10.1","version_date":"2020-09-19 23:13:33.000 +0800","version_description":"Massive update ahead! iOS 14 features like Widgets, Picture in Picture Video, new Photo Picker, plus tons of other stuff like crossposting, flair improvements, translation features, and so much more! Read on!\n\n# Widgets\nApollo now includes a bunch of awesome, customizable iOS 14 home screen widgets to show posts, shortcuts, and more! To add, simply long-press on the home screen, tap the + in the top corner, and select Apollo!\n\n# Picture in Picture Video\nApollo now lets you enjoy Picture in Picture video so you can continue watching video from Apollo when you're doing other things!\n\n# Crossposts\nCrossposting (taking an existing post and reposting it to a similar subreddit) has been a big part of Reddit for ages, but recently it became a full-fledged feature where you can see exactly which subreddit it came from, and quickly jump to the original post. Apollo now supports this fully! You can perform crossposts too!\n\n# Image Flair\nFlair is a little “tag” users can add to their usernames in subreddit, and some subreddits even allow small images/icons to be added in addition to text, like the icon for your favorite sports team, or a character from your favorite TV show. Apollo now shows these beautifully!\n\n# Setting Your Flair\nIn addition to being able to view the flair as discussed in the previous item, you can now set your own flair! Simply go to the subreddit of your choosing, and you can choose from a list of customizable flairs!\n\n# View Long Flair\nSome users set loooong flair, and as a result it can get off, which can be annoying when you’re trying to figure out what it says. Well be annoyed no longer, for you can tap on the long flair to bring up a window that expands it fully!\n\n# Find Posts with Same Flair\nIf the subreddit lets users tag their posts with individual flairs, you can now simply tap on that flair and Apollo will show you all the other posts in the subreddit that have been tagged with that same flair.\n        \n# 5 (Yeah, Five!) New App Icons!\nThe first three are Ultra icons, all made by the same incredibly talented designer, Matthew Skiles, who I’ve been a fan of for a long time. Next up, we have a beautiful new Apollo icon representing the trans pride flag (originally created by Monica Helms), which came out really awesome and is a great addition. And last but not least, our incredible community designer, FutureIncident, created the Japanese-inspired Apollo-san icon!\n\n# Easy Language Translation\nReddit is home to a diverse set of communities, but sometimes it’s tricky to understand what’s being said if the conversation is in a language you’re not familiar with. Now Apollo will be able to detect if the language of a comment or post is different than the language of your iOS device, and if so, offer to quickly translate it so you can understand the conversation! \n\n# Fast Subreddit Selector\nWhethering you’re trying to add a single subreddit to a filter, or adding multiple subreddits at a time to a multireddit, Apollo is now even faster at doing these tasks, with an auto-completing window that makes it super fast to search and add subreddits.\n\n# Total Collapsed Comments & Remembering Collapsed Comments\nTwo handy new additions to collapsing comments in Apollo. The first, Apollo will show you at a glance how many comments are in the collapsed conversation. The second thing, if you collapse a bunch of comments, and then come back to that same comment section later, Apollo will now remember which comments you had collapsed, and keep them collapsed for you!\n\n# And So Much More!\nTweaks, bug fixes, and more! For even more details, check out the in-app changelog!\n\n# Thank You!\nI’ll sound like a YouTuber for a second, but if you're enjoying these really thorough changelogs (they take a lot of time to put together!) as well as all the awesome new additions I worked on, leaving a tip of literally any size inside the app helps me so much, as it’s just me building Apollo!\n\n[This .1 update includes bug fixes to widgets and more]"},{"version_id":"837876201","version_name":"1.10.2","version_date":"2020-09-21 12:33:24.000 +0800","version_description":"Massive update ahead! iOS 14 features like Widgets, Picture in Picture Video, new Photo Picker, plus tons of other stuff like crossposting, flair improvements, translation features, and so much more! Read on!\n\n# Widgets\nApollo now includes a bunch of awesome, customizable iOS 14 home screen widgets to show posts, shortcuts, and more! To add, simply long-press on the home screen, tap the + in the top corner, and select Apollo!\n\n# Picture in Picture Video\nApollo now lets you enjoy Picture in Picture video so you can continue watching video from Apollo when you're doing other things!\n\n# Crossposts\nCrossposting (taking an existing post and reposting it to a similar subreddit) has been a big part of Reddit for ages, but recently it became a full-fledged feature where you can see exactly which subreddit it came from, and quickly jump to the original post. Apollo now supports this fully! You can perform crossposts too!\n\n# Image Flair\nFlair is a little “tag” users can add to their usernames in subreddit, and some subreddits even allow small images/icons to be added in addition to text, like the icon for your favorite sports team, or a character from your favorite TV show. Apollo now shows these beautifully!\n\n# Setting Your Flair\nIn addition to being able to view the flair as discussed in the previous item, you can now set your own flair! Simply go to the subreddit of your choosing, and you can choose from a list of customizable flairs!\n\n# View Long Flair\nSome users set looong flair, and as a result it can get off, which can be annoying when you’re trying to figure out what it says. Now you can tap on the long flair to bring up a window that expands it fully!\n\n# Find Posts with Same Flair\nIf the subreddit lets users tag their posts with individual flairs, you can now simply tap on that flair and Apollo will show you all the other posts in the subreddit that have been tagged with that same flair.\n        \n# 5 (Yeah, Five!) New App Icons!\nThe first three are Ultra icons, all made by the incredibly talented designer, Matthew Skiles! Next, we have a beautiful new icon representing the trans pride flag (originally by Monica Helms), which came out awesome! And our incredible community designer, FutureIncident, created the Japanese-inspired Apollo-san icon!\n\n# Easy Language Translation\nReddit is home to a diverse set of communities, but sometimes it’s tricky to understand what’s being said if the conversation is in a language you’re not familiar with. Now Apollo will be able to detect if the language of a comment or post is different than the language of your iOS device, and if so, offer to quickly translate it so you can understand the conversation! \n\n# Fast Subreddit Selector\nWhethering you’re trying to add a single subreddit to a filter, or adding multiple subreddits at a time to a multireddit, Apollo is now even faster at doing these tasks, with an auto-completing window that makes it super fast to search and add subreddits.\n\n# Total Collapsed Comments & Remembering Collapsed Comments\nTwo handy new additions to collapsing comments in Apollo. The first, Apollo will show you at a glance how many comments are in the collapsed conversation. Second, if you collapse a bunch of comments, and then come back to that same comment section later, Apollo will now remember which comments you had collapsed, and keep them collapsed for you!\n\n# And So Much More!\nTweaks, bug fixes, and more! For even more details, check out the in-app changelog!\n\n# Thank You!\nI’ll sound like a YouTuber for a second, but if you're enjoying these really thorough changelogs (they take a lot of time to put together!) as well as all the awesome new additions I worked on, leaving a tip of literally any size inside the app helps me so much, as it’s just me building Apollo!\n\n[This .2 update includes bug fixes to widgets and accounts randomly signing out, if in this update your account is signed out, please send me your logs and mention this issue. Settings tab > About > Logs]"},{"version_id":"837910512","version_name":"1.10.3","version_date":"2020-09-23 10:13:01.000 +0800","version_description":"Massive update ahead! iOS 14 features like Widgets, Picture in Picture Video, new Photo Picker, plus tons of other stuff like crossposting, flair improvements, translation features, and so much more! Read on!\n\n# Widgets\nApollo now includes a bunch of awesome, customizable iOS 14 home screen widgets to show posts, shortcuts, and more! To add, simply long-press on the home screen, tap the + in the top corner, and select Apollo!\n\n# Picture in Picture Video\nApollo now lets you enjoy Picture in Picture video so you can continue watching video from Apollo when you're doing other things!\n\n# Crossposts\nCrossposting (taking an existing post and reposting it to a similar subreddit) has been a big part of Reddit for ages, but recently it became a full-fledged feature where you can see exactly which subreddit it came from, and quickly jump to the original post. Apollo now supports this fully! You can perform crossposts too!\n\n# Image Flair\nFlair is a little “tag” users can add to their usernames in subreddit, and some subreddits even allow small images/icons to be added in addition to text, like the icon for your favorite sports team, or a character from your favorite TV show. Apollo now shows these beautifully!\n\n# Setting Your Flair\nIn addition to being able to view the flair as discussed in the previous item, you can now set your own flair! Simply go to the subreddit of your choosing, and you can choose from a list of customizable flairs!\n\n# View Long Flair\nSome users set looong flair, and as a result it can get off, which can be annoying when you’re trying to figure out what it says. Now you can tap on the long flair to bring up a window that expands it fully!\n\n# Find Posts with Same Flair\nIf the subreddit lets users tag their posts with individual flairs, you can now simply tap on that flair and Apollo will show you all the other posts in the subreddit that have been tagged with that same flair.\n        \n# 5 (Yeah, Five!) New App Icons!\nThe first three are Ultra icons, all made by the incredibly talented designer, Matthew Skiles! Next, we have a beautiful new icon representing the trans pride flag (originally by Monica Helms), which came out awesome! And our incredible community designer, FutureIncident, created the Japanese-inspired Apollo-san icon!\n\n# Easy Language Translation\nReddit is home to a diverse set of communities, but sometimes it’s tricky to understand what’s being said if the conversation is in a language you’re not familiar with. Now Apollo will be able to detect if the language of a comment or post is different than the language of your iOS device, and if so, offer to quickly translate it so you can understand the conversation! \n\n# Fast Subreddit Selector\nWhethering you’re trying to add a single subreddit to a filter, or adding multiple subreddits at a time to a multireddit, Apollo is now even faster at doing these tasks, with an auto-completing window that makes it super fast to search and add subreddits.\n\n# Total Collapsed Comments & Remembering Collapsed Comments\nTwo handy new additions to collapsing comments in Apollo. The first, Apollo will show you at a glance how many comments are in the collapsed conversation. Second, if you collapse a bunch of comments, and then come back to that same comment section later, Apollo will now remember which comments you had collapsed, and keep them collapsed for you!\n\n# And So Much More!\nTweaks, bug fixes, and more! For even more details, check out the in-app changelog!\n\n# Thank You!\nI’ll sound like a YouTuber for a second, but if you're enjoying these really thorough changelogs (they take a lot of time to put together!) as well as all the awesome new additions I worked on, leaving a tip of literally any size inside the app helps me so much, as it’s just me building Apollo!\n\n[This .3 update includes bug fixes to widgets and accounts randomly signing out, if in this update your account is signed out, please send me your logs and mention this issue. Settings tab > About > Logs]"},{"version_id":"838146006","version_name":"1.10.4","version_date":"2020-10-10 06:21:47.000 +0800","version_description":"A bunch of bug fixes as well as two new icons, including a spooky Halloween themed icon! Happy Halloween season!\n\n- Apollowe'en icon by the incredibly talented Anthony Piraino from The Iconfactory depicting our loveable hiding under a spooky bedsheet, getting in that Hallowe'en spirit and hoping for some candy, included as this month's Apollo Ultra Icon. But that's not all *infomercial voice*, unlock Apollo Ultra now and you won't get just one new awesome icon, we'll double the offer! TWO ICONS! Also included with Ultra is a new community icon pack called Rimuru, depicting a loveable slime by u/StevSarm.\n- Fixes bug where widgets would show posts from the Popular feed rather than posts from your Home feed.\n- Fixed bug where when scrolling over a comment it was way too easily to accidentally collapse the comment.\n- Fixed bug where when rotating device and then back it could throw you up the feed like a fun but annoying rollercoaster.\n- Fixed bug where audio from a previous video could be randomly duplicated into the next video.\n- Fixed bug where \"comment submitted\" banner would sometimes not show up.\n- Better error states for widgets.\n- Fixes text being cut off when making a cross post.\n- Larger accessibility text sizes now better track the system default sizes.\n- Filters affect widgets properly (as well as searches).\n- Fixed bug where when uploading a bunch of photos Apollo could crash from high memory usage.\n- If device has room the Posts Feed Widget will now show 5 entries instead of 4.\n- For iOS 14 I changed the option to save photos/GIFs/videos to a specific “Apollo” album due to some permission requirements/changes and made it so saving GIFs and videos requires less permissions.\n- If you want to remove r/Popular, r/All, or a Moderator multireddit from the top of your subreddit listing you can simply swipe to do so, or re-enable it via Settings tab > General.\n- General bug fixes for widgets and other general parts across the app to make everything even smoother.\n\nAnd of course all the goodies from 1.10 and 1.9:\n\n- Awesome, customizable iOS 14 home screen widgets to show posts, shortcuts, and more! To add, simply long-press on the home screen, tap the + in the top corner, and select Apollo!\n- Picture in Picture video so you can continue watching video from Apollo when you're doing other things!\n- Viewing and performing crosspots!\n- Icons/images in flair!\n- Set your own flair! Simply go to the subreddit of your choosing, and you can choose from a list of customizable flairs!\n- Tap on the long flair to bring up a window that expands it fully!\n- If the subreddit lets users tag their posts with individual flairs, you can now simply tap on that flair and Apollo will show you all the other posts in the subreddit that have been tagged with that same flair.\n- 5 new icons, the first three are Ultra icons, all made by the incredibly talented designer, Matthew Skiles! Next, we have a beautiful new icon representing the trans pride flag (originally by Monica Helms), which came out awesome! And our incredible community designer, FutureIncident, created the Japanese-inspired Apollo-san icon!\n- Detect if the language of a comment or post is different than the language of your iOS device, and if so, offer to quickly translate it so you can understand the conversation! \n- New auto-completing window that makes it super fast to search and add subreddits.\n- Two handy new additions to collapsing comments in Apollo. The first, Apollo will show you at a glance how many comments are in the collapsed conversation. Second, if you collapse a bunch of comments, and then come back to that same comment section later, Apollo will now remember which comments you had collapsed, and keep them collapsed for you!\n\nThank you so much! I really hope you enjoy the update! More to come!\n\n- Christian"},{"version_id":"838558769","version_name":"1.10.5","version_date":"2020-12-07 08:43:38.000 +0800","version_description":"Hey all! I've been hard at work on this update that includes some awesome tweaks and additions, as well as a bunch of bug fixes to some areas you have messaged me about that have been a teensy bit annoying. Read on!\n\n- Two new awesome icons! Getting everything together for this update took a bit of time, so we have two Apollo Ultra icons in one this release: the icons for November AND December. The November icon is an absolutely gorgeous, very happy and cute icon from the incredible Raphael Lopes, I just love how this came out and it makes me smile. For December, something festive is in order, so we have a very tasty gingerbread man rendition (named George) of the Apollo icon by the awesomely talented Qi Sandor (who did the Christmas icon two years ago as well) that will spruce your home screen up for the holiday season and whatever you celebrate\n- Fixed some issues around videos loading improperly or slowly\n- Fixed bug where audio wouldn’t come unmuted sometimes, leaving you awkwardly alone with your thoughts\n- Some fixes around some widget bugs that could occur where the widgets might not load, or potentially show old content. If you run into any further bugs, should me an email with details and include your logs by going to Settings tab > About > Logs\n- Fixed bug with hiding r/All, r/Popular, etc. and added confirmation/explanation dialog\n- On the screen with your list of subreddits the stars and collapse buttons are now spaced further from the right\n- Fixed bug where reading a message sometimes wouldn't mark it as read\n- Fixed bug where “Save to ‘Apollo’ Photo Album” option in Settings > General wasn’t working\n- The video/GIF progress bars now only show if the content is more than a few seconds long\n- Fixed bug where posts could show up as having an error when they really didn’t\n- Fixed bug where crossposted albums weren’t swipable\n- Fixed bug where user comments on their profile could repeat infinitely\n- Fixed bug where sometimes GIFs would just save as images\n- Fixed bug where subreddit icons wouldn’t show in crossposts\n- Fixed bug where custom moderator removal reasons wouldn’t stick\n- Fixed bug where the “successfully posted” banner wouldn’t show up\n- Added option to disable tap to collapse on just comment headers\n- Should look a little sharper on new iOS devices\n- Fixed bug where keyboard could disappear after first key typed in Search tab\n- Added some more bugs for me to find in the future\n\n- Christian"},{"version_id":"840356589","version_name":"1.10.6","version_date":"2021-02-06 01:27:01.000 +0800","version_description":"Hey all! Here's a delicious update with a bunch of new features and bug fixes! Read on for details!\n\nFEATURES\n\n- A BUNCH more custom home screen icons, two new Ultra ones (both by the awesome Matthew Skiles), two new community icon pack ones (by berrymetal and johnnysilverpaw), and a BUNCH of secret ones included in Pro as well. (Reminder: Apollo Ultra includes all of them!) See if you can find them all! A bunch of them are homages to some of my favorite video content creators.\n- Apollo now supports Family Sharing across all in-app purchases and subscriptions, so if you have a family member wanting to get in on the Apollo goodness they easily can now!\n- Added ability to \"follow\" users you find interesting, just like a subreddit!\n- Added back option to open Reddit links on your clipboard in Apollo. It's off by default but you can enable it in Settings > General\n- Improved photo uploading in private messages\n- Added a suspicious looking text face to list of Text Faces in the comment composer\n- Added option to hide usernames in Share as Image (sometimes subreddits ask you to hide them when sharing, or sometimes people just have weird usernames)\n- Also in Share as Image you can now share link posts and it'll include the cute little thumbnail and everything!\n- Includes \"Privacy Nutritional Label\" information! Apollo is a good privacy citizen!\n- Added support for Reddit's new \"awarder and awardee\" karma that you get for giving and receiving awards. If you tap your/another user's karma header in their profile it will detail it.\n- Added support for Reddit's new \"Snoomoji\". It seems to only be a test in a few subreddits, but you'll be able to see little Reddit style emoji in comments.\n- Apollo now properly displays inline GIFs that Reddit has added to certain subreddits in the same inline way Apollo shows other GIFs in comments\n- Added subscribe and follow options to subreddits and users in the haptic touch context menus!\n- If a comment or post has been edited you can now tap the little pencil icon and it'll show you when the comment was edited\n\nBUG FIXES\n\n- Everyone upvoted a bug with a GIF of a fluffy dog in it so I fixed that bug too. Not going to lie the cute dog distracted me a little but I think it was something to do with GIF progress not updating in crossposts.\n- Fixed bug where you couldn't fully disable \"tap to collapse\", so now you can!\n- Fixed bug where subreddits in subreddit listing in dark mode had slightly lighter background color\n- Fixed some issues with video playback\n- Fixed crash that could occur when downloading some GIFs\n- Fixed background color of inbox boxes in dark mode\n- Fixed occasional crash that could happen with opening videos in media viewer\n- Fixed bug where haptic touch context menus would be reversed for subreddit and user\n- Fixed bug with moderators setting flair where custom flair wouldn't get set\n- Fixed bug where when refreshing your Inbox some messages could randomly disappear for a second or cause the badge count to be incorrect\n- Fixed another crashing bug that could occur with formatting dates (calendrical, not the fruit)\n- Some other tiny bug fixes and tweaks and tidies that make everything just a little bit spiffier\n\nI would have had even *more* features and bug fixes in this update but I've been working around the ham sandwich on the juicy iPad update (no olives), stay tuned for details on that!\n\nAs always, thank you for supporting Apollo and my work and I'll do my best to keep impressing you with awesome things to come! Have a great one!\n\n- Christian"},{"version_id":"841261141","version_name":"1.10.7","version_date":"2021-04-08 22:36:31.000 +0800","version_description":"As the winter season draws to a close it's time to harvest our winter crops, turning some annoying bugs into some delightful tweaks and features as a result. \\o/\n\nI'm pullin' a big turnip out of the ground, and this turnip's name is Apollo 1.10.7. That's one juicy turnip right there. Inside the turnip is delicious, flavorful changelog:\n\n- It's not an Apollo update without some custom new home screen icons. :) This update we have three new ones, the first two being Apollo Ultra monthly icons for last month and this month. The first is a gorgeous icon by Gleptech called 'Sasageyo', picturing a cute (potentially monstrous?) depiction of our friend peering out. The second is a terrific, sleuthy detective version of Apollo by Matthew Skiles, and lastly we have an awesome community icon pack icon called 'Floaty Boy', showing a very cute and minimally metallic floating rendition of the icon!\n- 'New User Highlightenator' is a new feature suggested by users to help spot potential misinformation or suspicious users by optionally highlighting new accounts that are less than one month old (it adds a little icon with their age by the comment or post). The vast majority of Reddit newcomers are awesome, but sometimes users create a bunch of new accounts to try to brigade a subreddit with a silly opinion, and it's nice to be able to instantly see, \"Hey, this account is 4 hours old and came right to this subreddit saying some silly things. Little suspicious, you are\" rather than having to look up each account manually. Let Apollo do the heavy lifting!\n- If you're linked to a specific comment (direct link or by tapping on your inbox, for instance) and that linked comment has parent comments above it, you can now long-press any of the parent comments to view any additional replies to those parent comments in addition to your own\n- When signing in Apollo will now alert you if your thumbnails are disabled (sometimes this Reddit setting gets disabled for one reason or another, and it can cause the posts feed to look a little blank)\n- If a comment is in a foreign language from what your iOS device is set to, when long-pressing the option to translate that comment will now be at the top\t\n- Rewrote some areas of Apollo's home screen widgets to fix some bugs and make things faster so now they should run smoother for everyone\n- If a subreddit can't be accessed it'll now state the reason (private subreddit, etc.)\n- Fixed bug where when tapping \"load more comments\" could duplicate infinitely\n- When saving images/GIFs/videos Apollo now uses the title of the post (if available) as the file name\n- Fixed an issue where VoiceOver wouldn't read the account username if 'Always Show Usernames' was enabled\n- Identified a bug where for some users Apollo could take up more storage space than intended, if you find this to be the case just go to Apollo > Settings tab > General > Clear Cache and it will walk you through tidying things up nicely\n- Fixed bug where an error could occur when trying to gift an award\n- Improved detection for when a thread of comments has been deleted by a moderator, will now auto-collapse properly and label it\n- Improved detection for 'Auto-Collapse Auto Moderator Stickies' setting for subreddits that have a big ol' wall of text stickied to every thread\n- Fixed bug where lists with multiple levels of indentation wouldn't show further indentation after first level\n- Fixed bug where scrolling when composing a crosspost could get messed up\n- Fixed bug where trying to open an image or GIF in Safari could cause a crash\n- Fixed bug where when dragging your finger sometimes Apollo would tap to collapse\n- Added some new 'text faces' to Apollo's comment/post composer\n- Performance improvements in general, should have smaller memory footprint overall\n\nOops, ran out of text. For the full changelog see the r/ApolloApp subreddit!\n\nThanks as always for the support everyone, I'll continue to work hard to make Apollo even greater!\n\n- Christian"},{"version_id":"841274921","version_name":"1.10.8","version_date":"2021-04-09 06:21:29.000 +0800","version_description":"As the winter season draws to a close it's time to harvest our winter crops, turning some annoying bugs into some delightful tweaks and features as a result. \\o/\n\nI'm pullin' a big turnip out of the ground, and this turnip's name is Apollo 1.10.8. That's one juicy turnip right there. Inside the turnip is delicious, flavorful changelog:\n\n- It's not an Apollo update without some custom new home screen icons. :) This update we have three new ones, the first two being Apollo Ultra monthly icons for last month and this month. The first is a gorgeous icon by Gleptech called 'Sasageyo', picturing a cute (potentially monstrous?) depiction of our friend peering out. The second is a terrific, sleuthy detective version of Apollo by Matthew Skiles, and lastly we have an awesome community icon pack icon called 'Floaty Boy', showing a very cute and minimally metallic floating rendition of the icon!\n- 'New User Highlightenator' is a new feature suggested by users to help spot potential misinformation or suspicious users by optionally highlighting new accounts that are less than one month old (it adds a little icon with their age by the comment or post). The vast majority of Reddit newcomers are awesome, but sometimes users create a bunch of new accounts to try to brigade a subreddit with a silly opinion, and it's nice to be able to instantly see, \"Hey, this account is 4 hours old and came right to this subreddit saying some silly things. Little suspicious, you are\" rather than having to look up each account manually. Let Apollo do the heavy lifting!\n- If you're linked to a specific comment (direct link or by tapping on your inbox, for instance) and that linked comment has parent comments above it, you can now long-press any of the parent comments to view any additional replies to those parent comments in addition to your own\n- When signing in Apollo will now alert you if your thumbnails are disabled (sometimes this Reddit setting gets disabled for one reason or another, and it can cause the posts feed to look a little blank)\n- If a comment is in a foreign language from what your iOS device is set to, when long-pressing the option to translate that comment will now be at the top\t\n- Rewrote some areas of Apollo's home screen widgets to fix some bugs and make things faster so now they should run smoother for everyone\n- If a subreddit can't be accessed it'll now state the reason (private subreddit, etc.)\n- Fixed bug where when tapping \"load more comments\" could duplicate infinitely\n- When saving images/GIFs/videos Apollo now uses the title of the post (if available) as the file name\n- Fixed an issue where VoiceOver wouldn't read the account username if 'Always Show Usernames' was enabled\n- Identified a bug where for some users Apollo could take up more storage space than intended, if you find this to be the case just go to Apollo > Settings tab > General > Clear Cache and it will walk you through tidying things up nicely\n- Fixed bug where an error could occur when trying to gift an award\n- Improved detection for when a thread of comments has been deleted by a moderator, will now auto-collapse properly and label it\n- Improved detection for 'Auto-Collapse Auto Moderator Stickies' setting for subreddits that have a big ol' wall of text stickied to every thread\n- Fixed bug where lists with multiple levels of indentation wouldn't show further indentation after first level\n- Fixed bug where scrolling when composing a crosspost could get messed up\n- Fixed bug where trying to open an image or GIF in Safari could cause a crash\n- Fixed bug where when dragging your finger sometimes Apollo would tap to collapse\n- Added some new 'text faces' to Apollo's comment/post composer\n- Performance improvements in general, should have smaller memory footprint overall\n\nOops, ran out of text. For the full changelog see the r/ApolloApp subreddit!\n\nThanks as always for the support everyone, I'll continue to work hard to make Apollo even greater!\n\n- Christian"},{"version_id":"842352264","version_name":"1.10.9","version_date":"2021-05-26 08:24:06.000 +0800","version_description":"Hey all!\n\nToday I bring you a delightful release with that has some great quality of life improvements and some fixes so things work even smoother. Read on, adventurer!\n\n- New Apollo Ultra icon, a beautifully cute version of the Apollo mascot holding an upvote lovingly. A big thank you to the incredible Alfrey Davilla for designing it!\n- Improvements to widgets, should load faster and have less issues if you occasionally had a blank one. If you see an error, email me a screenshot!\n- Fixed a bug where some links in subreddit sidebars wouldn't load properly\n- \"Share as Image\" can now share links as well as GIFs and thumbnails (it'll use a thumbnail for the latter two)\n- Realigned a thumb-tack in the post composer\n- When composing a post or comment, if you have an external keyboard attached you can now quickly submit the post or comment with the ⌘Enter keyboard shortcut\n- Fixed bug where if you wanted to keep thumbnails disabled Apollo would bug you over and over again to re-enable until you began cackling in frustration (sorry)\n- If you tap on a URL to a specific subreddit search Apollo will now resolve it in-app\n- Fixed bug where tapping on a user link would sometimes fail to load\n- Fixed issue with video playback occasionally\n- Fixed bug where VoiceOver could be tricky to navigate with on user profiles\n- Fixed bug with the built-in translation function for citizens of the EU\n- Fixed bug where some symbols in code blocks wouldn't be decoded properly\n- Fixed bug where video time length could be wrong, which could affect video progress bars too\n- Fixed issue where the nbsp symbol could randomly show up in comments\n- Some other small tweaks and bug fixes to lower the coefficient of friction further\n\nThank you all so much for using Apollo and providing excellent suggestions, feedback, and support. I will keep listening and keep making Apollo better!\n\n- Christian"},{"version_id":"842892713","version_name":"1.10.11","version_date":"2021-07-02 01:18:13.000 +0800","version_description":"Hey all!\n\n- New icon by the ever brilliant Matthew Skiles, called Coconut Head. This declassified icon pays homage to the very warm start to the summer season many of us have experienced. \n- Fixed random crash that could occur on launch for some users\n- Fixed bug on Apple Silicon Mac version of Apollo where closing the media viewer could sometimes result in a crash\n- Fixed bug on Apple Silicon Mac version of Apollo where pasting could sometimes cause the app to just spin indefinitely\n- Fixed issue with videos bouncing you to Safari sometimes\n- Fixed issue where GIFs could seem somewhat stuttery when scrolling, especially around their progress bar\n- Fixed issue where home screen widgets would sometimes get a little annoyed when trying to refresh during poor network conditions\n- Improved widget timing/reloading logic \n- Fixed issue where some GIFs with audio would be weirdly quiet sometimes\n- Fixed bug where GIF progress bar couldn't be hidden if you weren't a fan (how dare you)\n- Fixed trending subreddits in Search tab not updating\n- A few other little things to make everything a tad bit smoother\n\nBeen working on some cool stuff behind the scenes in between these quality of life releases, can't wait to show you more soon. :)\n\n- Christian"},{"version_id":"843566821","version_name":"1.10.12","version_date":"2021-08-13 01:25:48.000 +0800","version_description":"Hey all! Been hard at work on a bunch of goodies this summer. In the meantime, here's a quality of life update that adds and fixes some nice things.\n\n- New YouTube player! This update features a new YouTube player, since the old one could be a wee bit fragile at times, the new one is super-powerful, and uses the system video player so you'll feel right at home on iOS, and still with video-scrubbing capabilities like you know and love. \n- Twitter functionality restored! There was a small bug a little while back around tweets showing inline in Apollo, so I took the time to rewrite the engine for Apollo's tweet previews, and that's now live in this version, so everything should work just lickety-split!\n- New icon! There's a brand new Ultra icon by Alfrey Davilla, lovingly called Gorilla Gus. I hope you love Gorilla Gus as much as I do. He's a very kind-hearted gorilla.\n- Known issues: there's a small bug around the new YouTube player and Low Power Mode being active, so it'll kick you off to the web browser while Low Power Mode is active. That will be fixed shortly!\n\nGot some goodies coming your way soon, can't wait to share more in the next update! :)\n\n- Christian"},{"version_id":"844197560","version_name":"1.11","version_date":"2021-09-21 04:17:16.000 +0800","version_description":"KABOOM! That’s the sound of a juicy new update dropping. Here’s some of the really cool things I've been working on this summer, focused around the new iOS 15 update. (Apollo’s always gotta have the latest and great, right?) There’s a lot of awesome features and fixes in this update that I think you're going to love, so read on!\n\nMORE WIDGETS\n\nWidgets are too much fun, so I couldn’t stop there. iPadOS 15 introduced the absolutely gargantuan “Extra Large Widgets” and of course I wanted to take advantage of that with Apollo. So now you have FOUR new choices there for widgets, all being hit with whatever the opposite of a shrink ray is. You have an enormous photo widget that just oozes details from your favorite subreddits, as well as a variant that shows photos at a time in a beautiful gallery look. You can also now display your feeds in the Extra Large style as well, with a media-rich version that shows a large item to the left before the rest of your feed, or a more info-dense variant that shows up to 10 items from your feed all at a glance in the widget, you can basically browse Reddit right from there!\n\nNEW ICONS\n\nI worked with the delightful Michael Flarup to create these two awesome new Ultra icons (okay he did all the heavy lifting, he’s so talented). Apple isn't the only ones with new silicon this fall! Introducing the Apollo A1 and its mascot, Chippie! Both of these icons are delightfully cute, and show the powerful (if imaginary) chip that powers Apollo’s super fast and super customizable experience. Fun fact: did you know Apollo now has over 100 icons available?\n\nAND ANOTHER FUN ONE TO MATCH\n\nApollo’s icons are so gorgeous (I can say that without bragging because most of them I had designers do, hehe) that wouldn’t it be great if you could see them up close in even more luxurious detail? The new “Jumbopollo Widget” can take an icon of your choosing and blow it up to a gorgeous size, so you can have all the beauty of your favorite icon even bigger! Gather your friends around to marvel at the detail of the new Apollo A1 icon on your home screen. That’s a thing people do, right?\n\nOPEN LINKS IN APOLLO\n\nWith iOS 15 adding support for Safari Extensions, it's now easier than ever to read Reddit links in Apollo via the Apollo Safari Extension available through the iOS Settings app!\n\nEVEN MORE\n\nWith iOS 15 if you’re composing a comment, you can now swipe down from the top to shrink your writing and reference the thread for a second, before swiping back up to finish writing your comment. \n\nYou also have Quick Note support in Apollo, as well as Siri easily being able to share with friends. For Quick Note, just summon it from the bottom corner and you can easily add a link to the thread or subreddit you’re currently reading. And with Siri, simply say something like “Share this with Tim” and Siri will share your thread, subreddit, etc. with a friend named Tim. And even better, it’s not restricted to people named Tim! Tom is allowed too!\n\nAlso fixed some issues up around GIFs, plus a bunch of other little tweaks and improvements to speed things up. If you have any feedback or issues please reach out!\n\nTHANK YOU\n\nThanks for always being so awesome and supporting my work, I love my job so much! I'm continuing to work hard on some really great updates that I can't wait to show you! Always got something better and better coming. :)\n\n- Christian"},{"version_id":"844215775","version_name":"1.11.1","version_date":"2021-09-21 22:41:40.000 +0800","version_description":"KABOOM! That’s the sound of a juicy new update dropping. Here’s some of the really cool things I've been working on this summer, focused around the new iOS 15 update. (Apollo’s always gotta have the latest and great, right?) There’s a lot of awesome features and fixes in this update that I think you're going to love, so read on!\n\nMORE WIDGETS\n\nWidgets are too much fun, so I couldn’t stop there. iPadOS 15 introduced the absolutely gargantuan “Extra Large Widgets” and of course I wanted to take advantage of that with Apollo. So now you have FOUR new choices there for widgets, all being hit with whatever the opposite of a shrink ray is. You have an enormous photo widget that just oozes details from your favorite subreddits, as well as a variant that shows photos at a time in a beautiful gallery look. You can also now display your feeds in the Extra Large style as well, with a media-rich version that shows a large item to the left before the rest of your feed, or a more info-dense variant that shows up to 10 items from your feed all at a glance in the widget, you can basically browse Reddit right from there!\n\nNEW ICONS\n\nI worked with the delightful Michael Flarup to create these two awesome new Ultra icons (okay he did all the heavy lifting, he’s so talented). Apple isn't the only ones with new silicon this fall! Introducing the Apollo A1 and its mascot, Chippie! Both of these icons are delightfully cute, and show the powerful (if imaginary) chip that powers Apollo’s super fast and super customizable experience. Fun fact: did you know Apollo now has over 100 icons available?\n\nAND ANOTHER FUN ONE TO MATCH\n\nApollo’s icons are so gorgeous (I can say that without bragging because most of them I had designers do, hehe) that wouldn’t it be great if you could see them up close in even more luxurious detail? The new “Jumbopollo Widget” can take an icon of your choosing and blow it up to a gorgeous size, so you can have all the beauty of your favorite icon even bigger! Gather your friends around to marvel at the detail of the new Apollo A1 icon on your home screen. That’s a thing people do, right?\n\nOPEN LINKS IN APOLLO\n\nWith iOS 15 adding support for Safari Extensions, it's now easier than ever to read Reddit links in Apollo via the Apollo Safari Extension available through the iOS Settings app!\n\nEVEN MORE\n\nWith iOS 15 if you’re composing a comment, you can now swipe down from the top to shrink your writing and reference the thread for a second, before swiping back up to finish writing your comment. \n\nYou also have Quick Note support in Apollo, as well as Siri easily being able to share with friends. For Quick Note, just summon it from the bottom corner and you can easily add a link to the thread or subreddit you’re currently reading. And with Siri, simply say something like “Share this with Tim” and Siri will share your thread, subreddit, etc. with a friend named Tim. And even better, it’s not restricted to people named Tim! Tom is allowed too!\n\nAlso fixed some issues up around GIFs, plus a bunch of other little tweaks and improvements to speed things up. If you have any feedback or issues please reach out!\n\nTHANK YOU\n\nThanks for always being so awesome and supporting my work, I love my job so much! I'm continuing to work hard on some really great updates that I can't wait to show you! Always got something better and better coming. :)\n\n- Christian\n\n[Note: this .1 version fixes a potential issue around Apollo Pro that a few users encountered]"},{"version_id":"844234011","version_name":"1.11.2","version_date":"2021-09-22 22:36:17.000 +0800","version_description":"KABOOM! That’s the sound of a juicy new update dropping. Here’s some of the really cool things I've been working on this summer, focused around the new iOS 15 update. (Apollo’s always gotta have the latest and great, right?) There’s a lot of awesome features and fixes in this update that I think you're going to love, so read on!\n\nMORE WIDGETS\n\nWidgets are too much fun, so I couldn’t stop there. iPadOS 15 introduced the absolutely gargantuan “Extra Large Widgets” and of course I wanted to take advantage of that with Apollo. So now you have FOUR new choices there for widgets, all being hit with whatever the opposite of a shrink ray is. You have an enormous photo widget that just oozes details from your favorite subreddits, as well as a variant that shows photos at a time in a beautiful gallery look. You can also now display your feeds in the Extra Large style as well, with a media-rich version that shows a large item to the left before the rest of your feed, or a more info-dense variant that shows up to 10 items from your feed all at a glance in the widget, you can basically browse Reddit right from there!\n\nNEW ICONS\n\nI worked with the delightful Michael Flarup to create these two awesome new Ultra icons (okay he did all the heavy lifting, he’s so talented). Apple isn't the only ones with new silicon this fall! Introducing the Apollo A1 and its mascot, Chippie! Both of these icons are delightfully cute, and show the powerful (if imaginary) chip that powers Apollo’s super fast and super customizable experience. Fun fact: did you know Apollo now has over 100 icons available?\n\nAND ANOTHER FUN ONE TO MATCH\n\nApollo’s icons are so gorgeous (I can say that without bragging because most of them I had designers do, hehe) that wouldn’t it be great if you could see them up close in even more luxurious detail? The new “Jumbopollo Widget” can take an icon of your choosing and blow it up to a gorgeous size, so you can have all the beauty of your favorite icon even bigger! Gather your friends around to marvel at the detail of the new Apollo A1 icon on your home screen. That’s a thing people do, right?\n\nOPEN LINKS IN APOLLO\n\nWith iOS 15 adding support for Safari Extensions, it's now easier than ever to read Reddit links in Apollo via the Apollo Safari Extension available through the iOS Settings app!\n\nEVEN MORE\n\nWith iOS 15 if you’re composing a comment, you can now swipe down from the top to shrink your writing and reference the thread for a second, before swiping back up to finish writing your comment. \n\nYou also have Quick Note support in Apollo, as well as Siri easily being able to share with friends. For Quick Note, just summon it from the bottom corner and you can easily add a link to the thread or subreddit you’re currently reading. And with Siri, simply say something like “Share this with Tim” and Siri will share your thread, subreddit, etc. with a friend named Tim. And even better, it’s not restricted to people named Tim! Tom is allowed too!\n\nAlso fixed some issues up around GIFs, plus a bunch of other little tweaks and improvements to speed things up. If you have any feedback or issues please reach out!\n\nTHANK YOU\n\nThanks for always being so awesome and supporting my work, I love my job so much! I'm continuing to work hard on some really great updates that I can't wait to show you! Always got something better and better coming. :)\n\n- Christian\n\n[Note: this .2 version fixes a potential issue around Apollo Pro that a few users encountered, as well as Face ID and the Apple Silicon/iPad version]"},{"version_id":"844829459","version_name":"1.11.3","version_date":"2021-10-22 07:00:10.000 +0800","version_description":"Happy Halloween everyone (if you're in a country that celebrates)! Here's a quick update that provides a fun icon, plus some bug fixes to some weird edge case behavior that you were kind enough to report!\n\n# GORDON RAMESSES\n\nGet it?? Like the pharaoh? Because he’s a mummy! Here is Apollo’s Halloween 2021 icon, created by the incredible Matthew Skiles. Available in Settings tab > App Icon!\n\n# FIXES AND TWEAKS\n\nThis update improves on a few issues you fine folks were great enough to report. First off, some issues around an occasional GIF playing weirdly should be fixed now (such as starting/restarting from a weird point, or not playing at all).\n\nAlso fixes some issues around theming, specifically the search bar could occasionally look weird against the top navigation bar. Further, there were reports of Apollo occasionally not properly switching between light and dark modes, that should be fixed too.\n\nLastly fixed an issue around GIFs sometimes starting to play after you paused them and unmuted the video, and a somewhat related issue around pressing the volume buttons on your iOS device not turning the sound on properly for a video.\n\nOh, and if you missed it in the last bug fix update, for Face ID / Touch ID locking Apollo, you can now set a timer delay so it optionally won’t activate immediately!\n\nAs always if you’re having any other issues please reach out! Thank you for being so awesome!\n\n- Christian"},{"version_id":"844876546","version_name":"1.11.5","version_date":"2021-10-25 00:18:53.000 +0800","version_description":"Happy Halloween everyone (if you're in a country that celebrates)! Here's a quick update that provides a fun icon, plus some bug fixes to some weird edge case behavior that you were kind enough to report!\n\n# SHAREPLAY INTEGRATION\n\nApollo has full support for Apple’s new SharePlay technology, so when you’re on a FaceTime call, Apollo just leveled up to a whole new experience. You can share the subreddit you’re viewing with other participants, as well as media, and even browse comment threads together (say, for your favorite new movie discussion thread) and highlight specific comments for others to look at.\n\nHop on a FaceTime call, make sure participants have Apollo, and they should be prompted to join. It’s a delight, and really cool if I may say so myself!\n\n# GORDON RAMESSES\n\nGet it?? Like the pharaoh? Because he’s a mummy! Here is Apollo’s Halloween 2021 icon, created by the incredible Matthew Skiles. Available in Settings tab > App Icon!\n\n# FIXES AND TWEAKS\n\nThis update improves on a few issues you fine folks were great enough to report. First off, some issues around an occasional GIF playing weirdly should be fixed now (such as starting/restarting from a weird point, or not playing at all).\n\nAlso fixes some issues around theming, specifically the search bar could occasionally look weird against the top navigation bar. Further, there were reports of Apollo occasionally not properly switching between light and dark modes, that should be fixed too.\n\nFurther, an issue around uploading images to Imgur should now be fixed!\n\nLastly fixed an issue around GIFs sometimes starting to play after you paused them and unmuted the video, and a somewhat related issue around pressing the volume buttons on your iOS device not turning the sound on properly for a video.\n\nOh, and if you missed it in the last bug fix update, for Face ID / Touch ID locking Apollo, you can now set a timer delay so it optionally won’t activate immediately!\n\nAs always if you’re having any other issues please reach out! Thank you for being so awesome!\n\n- Christian"},{"version_id":"844902473","version_name":"1.11.6","version_date":"2021-10-27 09:26:44.000 +0800","version_description":"Happy Halloween everyone (if you're in a country that celebrates)! Here's a quick update that provides a fun icon, new SharePlay integration, plus some bug fixes to some weird edge case behavior that you were kind enough to report!\n\n# SHAREPLAY INTEGRATION\n\nApollo has full support for Apple’s new SharePlay technology (requires most recent version of iOS), so when you’re on a FaceTime call, Apollo just leveled up to a whole new experience. You can share the subreddit you’re viewing with other participants, as well as media, and even browse comment threads together (say, for your favorite new movie discussion thread) and highlight specific comments for others to look at.\n\nHop on a FaceTime call, make sure participants have Apollo, and they should be prompted to join. It’s a delight, and really cool if I may say so myself!\n\n# GORDON RAMESSES\n\nGet it?? Like the pharaoh? Because he’s a mummy! Here is Apollo’s Halloween 2021 icon, created by the incredible Matthew Skiles. Available in Settings tab > App Icon!\n\n# FIXES AND TWEAKS\n\nThis update improves on a few issues you fine folks were great enough to report. First off, some issues around an occasional GIF playing weirdly should be fixed now (such as starting/restarting from a weird point, or not playing at all).\n\nAlso fixes some issues around theming, specifically the search bar could occasionally look weird against the top navigation bar. Further, there were reports of Apollo occasionally not properly switching between light and dark modes, that should be fixed too.\n\nFurther, an issue around uploading images to Imgur should now be fixed!\n\nLastly fixed an issue around GIFs sometimes starting to play after you paused them and unmuted the video, and a somewhat related issue around pressing the volume buttons on your iOS device not turning the sound on properly for a video.\n\nOh, and if you missed it in the last bug fix update, for Face ID / Touch ID locking Apollo, you can now set a timer delay so it optionally won’t activate immediately!\n\nAs always if you’re having any other issues please reach out! Thank you for being so awesome!\n\n- Christian"},{"version_id":"845128942","version_name":"1.11.7","version_date":"2021-11-05 00:38:22.000 +0800","version_description":"Here's a quick little update with some quality of life/bug fixes, and two new icons!\n\n- Improvements to SharePlay support (requires iOS 15.1 and greater), if you elect not to use it for the FaceTime call Apollo will remember that and not prompt you continually (appreciate the feedback there!). Also includes a banner when highlighting comments to other participants.\n- Two new icons! The first is a terrific icon named Dr. Spaceman by Jeff Broderick. The second is a beautiful icon named N.E.L.S.O.N. by Gavin Nelson. Together the two icons make an excellent pair. :)\n- Fixed a crash that could occur on Apple silicon Macs\n- Fixed an issue with keyboard navigation on iPad\n\n- Christian"},{"version_id":"846208115","version_name":"1.12","version_date":"2021-12-26 04:38:26.000 +0800","version_description":"Merry Christmas!! Santa has arrived with a bug full of Apollo updates for you to enjoy! HO HO HO!\n\n+ Added three awesome new icons! First, you've been visited by Santapollo, created by the perpetually ingenious Matthew Skiles and depicts our jolly Father Christmas as if he was the Apollo mascot. Second, we have Broby, a beautifully hand made depiction of our Apollo mascot made by u/burkybang’s 5 year old son. Yes three, icons!\n+ New Markdown renderer using Apple's new efficient library. Loads comments even faster, and brings benefits like inline table rendering (finally!), syntax highlighted code blocks, better list rendering, and more!\n+ Improved SidebarViewController to use the new renderer as well, so sidebars load richer with tables inline, links open in Apollo, etc.\n+ Improved the viewing of random subreddits with r/random in Apollo. Now it loads even faster, and you can simply pull down to refresh and it'll load you a new subreddit each time, even remembering which sort you had set\n+ If you long-press on a link the context menu will now have a quick Open in Browser option (thanks u/2-718!)\n+ Added inline Wikipedia previews to comments, including a thumbnail and brief article preview, so you can get a gist of what the article is about without having to summon one of the wiki bots.\n+ Added Dracula theme (thanks u/IsoPhoenix!)\n+ Added Mint theme (thanks u/BobQuentok!)\n+ Fixed bug where on some iPads in comments for a post with a GIF they would lag badly when scrolling, update iOS to make doubly sure though (thanks u/cats-lock!)\n+ Fixed bug where some linked posts in Apollo would just try to load the Reddit homepage because they had weird symbols in their URLs (thanks u/BasementDweller3000!)\n+ You can now zoom in further on images, even if low res (ENHANCE!)\n+ Fixed issue where sometimes the media viewer could think you were zoomed in a hair and be hard to swipe to dismiss\n+ If you compose a comment and type an author, it'll now offer to autocomplete the actual post's author as well.\n+ You can now easily add subreddits to a specific multireddit directly from your list of subreddits\n+ Polls are now properly accessible to VoiceOver\n+ You can now scrub YouTube videos to go forward and backward in time easily if you have Apollo Pro\n+ If Apollo shows a tweet and the user is verified, there will be a little checkmark icon now\n+ Option to hide the subreddit when choosing Share as Image\n+ Fixed bug where when Sharing as Image the comments could appear out of order\n+ Removed legacy modmail option as Reddit no longer supports\n+ Added accessibility labels to all app icons and themes, so now if you're curious what an app icon or theme looks like and are using VoiceOver, it will describe it to you\n+ Fixed bug where YouTube player wouldn't work well with Low Power Mode\n+ New Chumbus content\n+ Command/Control-F style \"Find in Comments\" search now also searches the post's text as well if present\n+ Fixed issue where if a gallery/album's first item liked to a YouTube video it would try to open that\n+ Improved \"Select Text Mode\"\n+ Fixed issue where sometimes albums could be hard to scroll between \n+ Updated Gfycat API\n+ Fixed a potential crash when running on Apple silicon Macs \n+ Added a Doomscroll Defeater™ which if turned on will disable infinite scrolling and allow you to choose to load the next page each time (in Settings it's just called \"Infinite Scrolling\" on/off)\n+ Properly matches Reddit's recent changes to collapsing blocked users\n+ Improved comment composer preview\n+ Mods can comment on locked posts now\n+ Fixed a GIF download crash\n+ If a comment is collapsed, the username and score is now untappable so you don't tap accidentally\n+ Added a better indicator if you manage to reach the end of a subreddit's available posts\n+ Crossposts now match the subreddit they're posted to's content settings\n\nHoping you all have the happiest of holidays, and I can't wait to show you what I have cooking for 2022. :)\n\n- Christian"},{"version_id":"846667769","version_name":"1.12.1","version_date":"2022-01-18 07:27:28.000 +0800","version_description":"Here's an update with some handy bug fixes and improvements based on great feedback from the Christmas update. Read on!\n\n+ A new, really cool icon from Yannick Lung. It's of the Apollo mascot in an old school scuba suit by the incredible Yannick Lung, and I love how the details really make it feel like an icon from a nostalgic era of time passed. Have been enjoying it a lot on the ol' home screen.\n+ Improvements to table rendering. Thanks y'all for sending in some great examples of tables that (alongside Apollo's new inline table renderer) weren't quite displaying properly, so I've tidied those all up so they should display gorgeously now.\n+ Also tweaked layout algorithm a bit so that some tables that were a bit cramped should display nicer now.\n+ Fixed bug where the \"Quote\" option in \"Select Text\" mode and in the comment composer wouldn't show up.\n+ Fixed bug where the subscriber count and number of currently active accounts wasn't showing up in the sidebar (and also added the short subreddit description to the top of it).\n+ Fixed bug where some links wouldn't be tappable or only the subreddit/user part would be if it was a Reddit link.\n+ Fixed a bug where tapping on some user or subreddit links could jump you into the browser/out of Apollo rather than staying in the app (same with Wikipedia links, fixed too).\n+ Fixed bug where preview text (like for a text post in a subreddit, or underneath an Inbox item) was too dark, made it a bit lighter like before so as to blend in better\n+ Fixed a bug with some escaped Markdown characters and those inside code blocks.\n+ Fixed a bug around newlines/line breaks in Markdown.\n+ Fixed a bug where sometimes you could get a duplicate notification.\n+ Fixed bug where text in private messages could be visually hard to read due to low contrast.\n+ If you tap on a link to u/me, it'll properly load your profile now.\n+ Added option in Settings tab > General to share Reddit links as their \"old.reddit\" version.\n+ Fixed bug where Apollo was mean to usernames with hyphens in them.\n+ Fixed bug where when comments loaded self text could refresh/flash in a non-cool way.\n+ Fixed bug where couldn't select the title of the post in \"Select Text\" mode.\n+ If you tap on a timestamped YouTube video it will now open to that time.\n+ Limits comment link previews to 5.\n+ Fixed bug where subreddit rules could get cut off at the top slightly.\n+ Flattened large groups of newlines in a comment/post into just two.\n+ Fixed bug where code blocks could get cut off at the bottom.\n+ Fixed bug where widgets would not show up on iOS 14.\n+ A fix for a crash that could occur on iOS 12 devices. Really sorry about that one, strange bug that was but everything should be in tip top shape now. As a note, after this update (1.12.1) Apollo will likely require iOS 14 and higher for further updates. You'll still be able to run Apollo on iOS 12 and 13 just as you were before, but new updates will require iOS 14 and higher. Statistically very few Apollo users are still on these older versions (well under 1% of users) and the work to maintain these older versions and put off using nice, newer iOS features in full (SwiftUI, SceneDelegate, Combine, Swift Concurrency, etc.) is beginning to get a bit tough to maintain given the small userbase (and I'm just one person building this app), so I figure now's a good a time as for iOS 14 to become the base. Hope that's understandable.\n\nHope these first two weeks of 2022 have served you well, and if not, well I endeavour to make the rest happier through Apollo updates!\n\n- Christian"},{"version_id":"846732490","version_name":"1.12.2","version_date":"2022-01-20 01:28:17.000 +0800","version_description":"Version 1.12.2:\n\nThis update improves an open in Apollo issue, as well as a few other small issues.\n\nVersion 1.12.1:\n\nHere's an update with some handy bug fixes and improvements based on great feedback from the Christmas update. Read on!\n\n+ A new, really cool icon from Yannick Lung. It's of the Apollo mascot in an old school scuba suit by the incredible Yannick Lung, and I love how the details really make it feel like an icon from a nostalgic era of time passed. Have been enjoying it a lot on the ol' home screen.\n+ Improvements to table rendering. Thanks y'all for sending in some great examples of tables that (alongside Apollo's new inline table renderer) weren't quite displaying properly, so I've tidied those all up so they should display gorgeously now.\n+ Also tweaked layout algorithm a bit so that some tables that were a bit cramped should display nicer now.\n+ Fixed bug where the \"Quote\" option in \"Select Text\" mode and in the comment composer wouldn't show up.\n+ Fixed bug where the subscriber count and number of currently active accounts wasn't showing up in the sidebar (and also added the short subreddit description to the top of it).\n+ Fixed bug where some links wouldn't be tappable or only the subreddit/user part would be if it was a Reddit link.\n+ Fixed a bug where tapping on some user or subreddit links could jump you into the browser/out of Apollo rather than staying in the app (same with Wikipedia links, fixed too).\n+ Fixed bug where preview text (like for a text post in a subreddit, or underneath an Inbox item) was too dark, made it a bit lighter like before so as to blend in better\n+ Fixed a bug with some escaped Markdown characters and those inside code blocks.\n+ Fixed a bug around newlines/line breaks in Markdown.\n+ Fixed a bug where sometimes you could get a duplicate notification.\n+ Fixed bug where text in private messages could be visually hard to read due to low contrast.\n+ If you tap on a link to u/me, it'll properly load your profile now.\n+ Added option in Settings tab > General to share Reddit links as their \"old.reddit\" version.\n+ Fixed bug where Apollo was mean to usernames with hyphens in them.\n+ Fixed bug where when comments loaded self text could refresh/flash in a non-cool way.\n+ Fixed bug where couldn't select the title of the post in \"Select Text\" mode.\n+ If you tap on a timestamped YouTube video it will now open to that time.\n+ Limits comment link previews to 5.\n+ Fixed bug where subreddit rules could get cut off at the top slightly.\n+ Flattened large groups of newlines in a comment/post into just two.\n+ Fixed bug where code blocks could get cut off at the bottom.\n+ Fixed bug where widgets would not show up on iOS 14.\n+ A fix for a crash that could occur on iOS 12 devices. Really sorry about that one, strange bug that was but everything should be in tip top shape now. As a note, after this update (1.12.1) Apollo will likely require iOS 14 and higher for further updates. You'll still be able to run Apollo on iOS 12 and 13 just as you were before, but new updates will require iOS 14 and higher. Statistically very few Apollo users are still on these older versions (well under 1% of users) and the work to maintain these older versions and put off using nice, newer iOS features in full (SwiftUI, SceneDelegate, Combine, Swift Concurrency, etc.) is beginning to get a bit tough to maintain given the small userbase (and I'm just one person building this app), so I figure now's a good a time as for iOS 14 to become the base. Hope that's understandable.\n\nHope these first two weeks of 2022 have served you well, and if not, well I endeavour to make the rest happier through Apollo updates!\n\n- Christian"}]