[{"version_id":"812228492","version_name":"1.0.0","version_date":"2015-05-05 08:34:24.000 +0800","version_description":""},{"version_id":"815728651","version_name":"2.0.0","version_date":"2016-02-16 07:46:37.000 +0800","version_description":"RED by SFR fait peau neuve&nbsp;! Nouvelle charte, nouveau design, des performances améliorées, tout a été pensé pour simplifier votre quotidien et faciliter vos usages.<br><br>Vous aimez Red&nbsp;&amp;&nbsp;moi&nbsp;? Alors notez l’application et faites savoir aux développeurs que vous aimez leur travail, ils en seront ravis&nbsp;!<br><br>Vous avez des suggestions, des idées&nbsp;? N’hésitez pas à les partager avec nous sur le store en donnant votre avis, il est précieux pour nous faire avancer et vous proposer toujours plus de nouveautés."},{"version_id":"818348973","version_name":"2.1.0","version_date":"2016-08-03 06:31:02.000 +0800","version_description":"RED by SFR évolue ! Vous n’avez pas de temps à perdre ? Oubliez les temps d’attente ! Avec l’option SERVICE CLIENT PRIORITAIRE, chattez en priorité avec nos conseillers ou contactez-les par téléphone à tout moment.<br> <br>Vous aimez RED &amp; Moi ? Alors notez l’application et faites savoir aux développeurs que vous aimez leur travail, ils en seront ravis !<br> <br>Vous avez des suggestions, des idées ? N’hésitez pas à les partager avec nous sur le store en donnant votre avis, il est précieux pour nous faire avancer et vous proposer toujours plus de nouveautés."},{"version_id":"819963952","version_name":"2.2.0","version_date":"2016-12-08 08:59:17.000 +0800","version_description":"Il y a du nouveau chez RED !<br><br>Découvrez notre nouvelle page d’accueil relookée pour vous donner accès en un clin d’œil à toutes les infos de votre compte. <br><br>Et pour ne pas perdre une miette des actus RED by SFR, suivez désormais notre fil d’infos depuis l’appli grâce à un simple clic sur le lien Twitter présent sur la page d’accueil&nbsp;!"},{"version_id":"821277202","version_name":"2.3.0","version_date":"2017-03-14 10:08:06.000 +0800","version_description":"L’appli RED &amp; Moi évolue pour vous simplifier la vie encore davantage&nbsp;!<br>&nbsp;<br>Pour vous, client box :<br>- Besoin d’assistance &nbsp;? Grâce à RED &amp; Moi, vous pouvez désormais réaliser vous-même le diagnostic de votre box !<br>- Envie de connaître l’état de votre commande ou d’un incident ? Accédez à votre suivi personnalisé en un simple clic&nbsp;!<br>- Des questions&nbsp;? Vous pouvez accéder directement à toute l’assistance en ligne et aux FAQ.<br>&nbsp;<br>Pour vous, client mobile&nbsp;:<br>Envie de changer d’offre ou profiter d’options ? Découvrez vite notre catalogue !"},{"version_id":"822018100","version_name":"2.4.0","version_date":"2017-05-11 09:05:11.000 +0800","version_description":"Votre appli RED &amp; Moi se refait une petite beauté !"},{"version_id":"822711077","version_name":"3.1.0","version_date":"2017-10-02 08:13:14.000 +0800","version_description":"L’appli RED &amp; Moi évolue encore pour vous simplifier la vie !<br>Une assistance enrichie pour mieux répondre à toutes vos questions.<br>En plus, pour vous client box :<br>- toutes les étapes de votre commande pour suivre au plus près son état d’avancement,<br>- nos conseillers à votre écoute en cas de besoin."},{"version_id":"823592615","version_name":"3.1.0","version_date":"2017-10-02 08:13:14.000 +0800","version_description":"L’appli RED &amp; Moi évolue encore pour vous simplifier la vie !<br>Une assistance enrichie pour mieux répondre à toutes vos questions.<br>En plus, pour vous client box :<br>- toutes les étapes de votre commande pour suivre au plus près son état d’avancement,<br>- nos conseillers à votre écoute en cas de besoin."},{"version_id":"823886740","version_name":"3.1.1","version_date":"2017-10-03 06:00:18.000 +0800","version_description":"L’appli RED &amp; Moi évolue encore pour vous simplifier la vie !<br>Une assistance enrichie pour mieux répondre à toutes vos questions.<br>En plus, pour vous client box :<br>- toutes les étapes de votre commande pour suivre au plus près son état d’avancement,<br>- nos conseillers à votre écoute en cas de besoin."},{"version_id":"824636337","version_name":"3.4.0","version_date":"2018-04-09 05:33:09.000 +0800","version_description":"Pour vous, l’appli RED&nbsp;&amp;&nbsp;Moi s’enrichit&nbsp;!<br>Avec sa nouvelle home, vous consultez votre compte et l’actu RED en un clin d’œil.<br>Vous êtes désormais informés de la mise à disposition de votre nouvelle facture.<br>En toute simplicité, vous pouvez suivre votre conso que vous soyez en France ou à l’étranger. <br>Pour vous, nouveaux clients box RED, vous avez la possibilité de changer votre RDV avec le technicien directement depuis votre application."},{"version_id":"827341917","version_name":"3.6.0","version_date":"2018-06-13 08:14:18.000 +0800","version_description":"Votre appli RED &amp; Moi se refait une petite beauté avec corrections &amp; optimisations diverses !<br>De plus, vous pouvez désormais gérer vos informations personnelles, n'hésitez pas à aller voir dans «&nbsp;Mes infos&nbsp;», d’autres possibilités seront prochainement disponibles."},{"version_id":"828028805","version_name":"3.7.0","version_date":"2018-08-02 17:54:08.000 +0800","version_description":"Votre appli RED &amp; Moi continue à se refaire une beauté.<br>Pour trouver les réponses à toutes vos questions, découvrez notre nouvelle «&nbsp;Assistance&nbsp;» plus simple, plus claire.<br>Client mobile, vous pouvez dorénavant changer de mobile et profiter d’une expérience enrichie d’achat d’options.<br>La Team RED vous donne rendez-vous à la rentrée. En attendant pas de panique, notre messagerie 100% humaine est là pour vous répondre à tout moment cet été.<br>La Team RED vous donne donc rendez-vous à la rentrée. En attendant pas de panique, notre messagerie 100% humaine est là pour vous répondre à tout moment cet été."},{"version_id":"828820259","version_name":"3.8.0","version_date":"2018-10-29 08:47:28.000 +0800","version_description":"Votre appli RED &amp; Moi vous présente sa nouvelle home enrichie d’infos attendues par nombreux d’entre vous !<br>Client RED&nbsp; Box, &nbsp;ajoutez ou résiliez vos options comme vous le souhaitez. Vous pouvez également supprimer les messages dont vous n’avez plus besoin dans votre centre de notif.<br>Pour les clients possédant plusieurs lignes RED, le nouveau menu va vous simplifier la vie. <br>La Team RED reste à votre écoute et vous donne RDV dans quelques semaines pour d’autres nouveautés&nbsp;!"},{"version_id":"829563574","version_name":"3.9.0","version_date":"2019-01-31 08:11:33.000 +0800","version_description":"RED &amp; Moi conserve son habit de fêtes et présente ses nouveautés pétillantes 2019! Vous avez la possibilité de modifier votre RIB et même passer en prélèvement automatique, dans «&nbsp;Mes infos&nbsp;». <br>Votre suivi conso est simplifié pour accéder au détail de vos achats multimédia.<br>Pour les clients possédant plusieurs lignes RED, le menu s’enrichit avec les notif, la possibilité de regrouper ses lignes dans le même compte. Détenteur de lignes SFR? Pas de problème, le menu vous permet de basculer facilement d’un univers à l’autre.<br>Un correctif sur le bug de résiliation d’option fixe est embarqué.<br>La Team RED toujours à votre écoute !"},{"version_id":"831818356","version_name":"4.0.0","version_date":"2019-08-05 08:34:08.000 +0800","version_description":"RED &amp; Moi donne la tendance avec son nouveau look été 2019 !<br>En plus, dans cette nouvelle version, facilitez-vous la vie avec Siri, accédez à l’état de votre conso ou le montant de votre facture. Vous pouvez aussi activer Touch ID ou Face ID pour renforcer la sécurisation de l’accès à vos données.<br>Un conseiller RED souhaite vous contacter ? Vous êtes alors alertés par une notification sur la barre de navigation, rubrique « Assistance&nbsp;» et vous reprenez l’échange en cours. <br><br>D’autres nouveautés sont à découvrir dans les paramètres de votre compte accessibles depuis le menu à côté de votre nom : modifier votre mot de passe et se déconnecter de l’application.\n<br>De plus, nous avons apporté quelques améliorations. Merci, grâce à vos commentaires l’appli évolue en permanence.<br>La Team RED toujours à votre écoute !"},{"version_id":"832570090","version_name":"4.0.1","version_date":"2019-09-02 06:53:37.000 +0800","version_description":"RED &amp; Moi surfe toujours sur la tendance avec son look été 2019 revu pour quelques écrans supplémentaires ! Des nouveautés sont aussi à découvrir dans les paramètres de votre compte accessibles depuis le menu à côté de votre nom ( modifier votre mot de passe, se déconnecter ou ajouter/retirer une ligne à votre compte).\n<br>Des correctifs sont embarqués suite à vos remontées sur le store, merci de participer à l’amélioration de notre appli.\n<br>La Team RED toujours à votre écoute !"},{"version_id":"832648620","version_name":"4.0.2","version_date":"2019-09-05 13:21:50.000 +0800","version_description":"RED &amp; Moi se refait une petite beauté avec corrections &amp; optimisations diverses en cette rentrée.<br>De plus, profitez-en pour découvrir notre nouvelle option RMC sport .<br>La Team RED toujours à votre écoute !"},{"version_id":"833088906","version_name":"4.1.0","version_date":"2019-10-09 15:06:22.000 +0800","version_description":"RED &amp; Moi facilite encore un peu plus le quotidien&nbsp;de ses clients RED Box en simplifiant la rubrique «&nbsp;Offre&nbsp;» avec une présentation plus claire de l’offre et des équipements. Grâce à cette nouvelle version, vous pourrez également gérer votre ligne internet de façon plus précise.\n<br>De plus, pour vous tous, nous avons apporté quelques améliorations. \n<br>Merci, grâce à vous, l’appli se perfectionne chaque jour un peu plus&nbsp;!\n<br>L’équipe RED, toujours à votre écoute"},{"version_id":"833963350","version_name":"4.2.0","version_date":"2019-12-12 08:24:50.000 +0800","version_description":"RED &amp; Moi facilite encore un peu plus le quotidien.&nbsp;Pouvoir rajouter le nom sur chaque numéro de téléphone ? C’est désormais possible. A vous de personnaliser vos lignes !\n<br>Nous avons également apporté quelques améliorations et finissons l’année en beauté avec un nouveau coup de pinceau. Découvrez&nbsp;nos nouveaux pictos&nbsp;! \n<br>Merci, car, grâce à vous, l’appli se perfectionne chaque jour un peu plus&nbsp;!\n<br>L’équipe RED, toujours à votre écoute,&nbsp;vous&nbsp;souhaite de bonnes fêtes de fin d’année."},{"version_id":"834386783","version_name":"4.3.0","version_date":"2020-02-10 07:48:20.000 +0800","version_description":"Pour la nouvelle année, RED &amp; Moi s’est refait une petite beauté avec diverses optimisations.<br>Venez également découvrir Amazon Prime qui est désormais disponible chez nous.<br>L’équipe RED reste toujours à votre écoute !"},{"version_id":"835256526","version_name":"4.4.0","version_date":"2020-06-04 12:12:17.000 +0800","version_description":"Parce que votre avis compte, RED &amp; Moi travaille pour s'améliorer chaque jour en prenant compte de vos remarques. Découvrez la nouvelle version dès à présent. L’équipe RED reste toujours à votre écoute et vous donne rendez-vous dans quelques semaines."},{"version_id":"836747651","version_name":"4.5.0","version_date":"2020-07-21 12:02:28.000 +0800","version_description":"RED &amp; Moi&nbsp;améliore le quotidien de ses clients RED mobile en simplifiant la rubrique «&nbsp;Mon forfait&nbsp;» avec une présentation plus claire de l’offre, du renouvellement de mobiles &amp; l’achat de montres connectées.<br>Grâce à cette nouvelle version,  vous aurez un accès direct dans «&nbsp;Aide&nbsp;» pour dépanner votre mobile ou box. <br>Nos conseillers restent bien sûr joignables par messagerie tout l’été et l’équipe RED vous donne rendez-vous dans quelques semaines&nbsp;!!"},{"version_id":"837539026","version_name":"4.5.1","version_date":"2020-09-07 06:55:43.000 +0800","version_description":"RED &amp; Moi améliore le quotidien de ses clients RED mobile en simplifiant la rubrique « Mon forfait » avec une présentation plus claire de l’offre, du renouvellement de mobiles &amp; l’achat de montres connectées.<br>Grâce à cette nouvelle version, vous aurez un accès direct dans « Aide » pour dépanner votre mobile ou box.<br>Nos conseillers restent bien sûr joignables par messagerie tout l’été et l’équipe RED vous donne rendez-vous dans quelques semaines !!"},{"version_id":"837963237","version_name":"4.6.0","version_date":"2020-09-28 16:23:56.000 +0800","version_description":"C’est l’heure de la rentrée ! RED &amp; Moi vous simplifie l’accès à vos « Factures », cette rubrique reste accessible depuis l’accueil dans « Ma dernière facture ».&nbsp; Besoin de plus d’infos? En un coup d’œil tous vos documents indispensables sont dans « Mes infos ». Vérifiez bien si tout est renseigné, par un message nous pouvons vous inviter à le faire! Pensez à la nature, dématérialisez votre facture.<br>L’équipe RED à votre écoute pour améliorer votre expérience, rendez-vous dans quelques semaines !!"},{"version_id":"839328789","version_name":"4.7.0","version_date":"2020-11-30 07:49:54.000 +0800","version_description":"Parce que tout devrait être aussi facile que RED, ce mois-ci dans RED &amp; Moi, contacter nos conseillers c’est encore plus simple&nbsp;! <br>Une question? Posez-là directement depuis la rubrique «&nbsp;Aide&nbsp;». <br>Déjà en contact avec notre service client? Consultez vos notifications, votre conseiller RED vous a probablement déjà répondu&nbsp;!&nbsp;<br>Toujours à votre écoute et dans le souci d’améliorer votre expérience, RDV en 2021 pour découvrir de nouvelles fonctionnalités sur l’appli RED &amp; Moi&nbsp;!"},{"version_id":"839730612","version_name":"4.8.0","version_date":"2021-02-15 11:27:22.000 +0800","version_description":"Et boom du nouveau en 2021 dans l’univers appli de RED ! Vous l’avez demandé, on l’a fait ! Téléchargez et découvrez RED TV depuis l’application RED &amp; Moi dans les paramètres de l’appli ou directement sur l’App Store. RED TV c’est l’application pour profiter d’une expérience TV personnalisée sur tous vos écrans ! Vos émissions et séries RED préférées, maintenant disponibles sur l’appli RED TV."},{"version_id":"840941495","version_name":"4.9.0","version_date":"2021-03-31 20:01:58.000 +0800","version_description":"Correction de l’accès à tous vos documents contractuels et bugs mineurs.<br>Cela passe peut-être inaperçu mais grâce à vos avis, les équipes RED réalisent régulièrement des améliorations sur l’application.<br>A très vite sur RED &amp; Moi !"},{"version_id":"840941495","version_name":"4.9.0","version_date":"2021-03-31 20:01:58.000 +0800","version_description":"Correction de l’accès à tous vos documents contractuels et bugs mineurs.<br>Cela passe peut-être inaperçu mais grâce à vos avis, les équipes RED réalisent régulièrement des améliorations sur l’application.<br>A très vite sur RED &amp; Moi !"},{"version_id":"841226393","version_name":"4.9.1","version_date":"2021-04-09 08:12:16.000 +0800","version_description":"Correction de l’accès à tous vos documents contractuels et bugs mineurs.<br>Cela passe peut-être inaperçu mais grâce à vos avis, les équipes RED réalisent régulièrement des améliorations sur l’application.<br>A très vite sur RED &amp; Moi !"},{"version_id":"841226393","version_name":"4.9.1","version_date":"2021-04-09 08:12:16.000 +0800","version_description":"Correction de l’accès à tous vos documents contractuels et bugs mineurs.<br>Cela passe peut-être inaperçu mais grâce à vos avis, les équipes RED réalisent régulièrement des améliorations sur l’application.<br>A très vite sur RED &amp; Moi !"},{"version_id":"842451634","version_name":"5.0.0","version_date":"2021-06-22 20:27:50.000 +0800","version_description":"Client RED Box, cette nouvelle version vous offre un accompagnement plus fluide et détaillé&nbsp;: suivi de dossier en temps réel, gestion de RDV facilité, historique des actions en cours ou réalisées. Cela passe peut-être inaperçu mais grâce à vos avis, les équipes RED réalisent régulièrement des améliorations sur l’application.<br>A très vite sur RED &amp; Moi !"},{"version_id":"842451634","version_name":"5.0.0","version_date":"2021-06-22 20:27:50.000 +0800","version_description":"Client RED Box, cette nouvelle version vous offre un accompagnement plus fluide et détaillé&nbsp;: suivi de dossier en temps réel, gestion de RDV facilité, historique des actions en cours ou réalisées. Cela passe peut-être inaperçu mais grâce à vos avis, les équipes RED réalisent régulièrement des améliorations sur l’application.<br>A très vite sur RED &amp; Moi !"}]