[{"version_id":"819598012","version_name":"2.1.8","version_date":"","version_description":""},{"version_id":"819863024","version_name":"2.2.4","version_date":"","version_description":""},{"version_id":"820447266","version_name":"2.3.6","version_date":"","version_description":""},{"version_id":"820944798","version_name":"2.4.0","version_date":"","version_description":""},{"version_id":"821389222","version_name":"2.4.2","version_date":"","version_description":""},{"version_id":"821485930","version_name":"2.4.4","version_date":"","version_description":""},{"version_id":"821705877","version_name":"2.4.8","version_date":"","version_description":""},{"version_id":"821960487","version_name":"2.5.0","version_date":"","version_description":""},{"version_id":"822302878","version_name":"2.5.2","version_date":"","version_description":""},{"version_id":"822824790","version_name":"2.6.2","version_date":"","version_description":""},{"version_id":"822966909","version_name":"2.6.4","version_date":"","version_description":""},{"version_id":"829806480","version_name":"3.1.22","version_date":"2019-01-08 22:34:09.000 +0800","version_description":"Thanks for using Aura! To give you the best possible experience, we regularly update our app with bug fixes, improvements, and new features.<br><br>In this update, we've fixed a few bugs affecting Sign In and Sign Up for a small number of users.<br><br>Please don’t hesitate to reach out to us at help@auraframes.com with any questions, problems, or feedback."},{"version_id":"830080931","version_name":"3.1.24","version_date":"2019-01-25 21:01:18.000 +0800","version_description":"Thanks for using Aura! In this release we fixed some minor bugs that were resulting in app crashes. We also made some improvements to the overall flow of the app. As always, please don’t hesitate to reach out to us at help@auraframes.com with any questions, problems, or feedback. We love hearing from you!"},{"version_id":"830096625","version_name":"3.1.28","version_date":"2019-02-13 19:39:00.000 +0800","version_description":"Thanks for using Aura! In this release we’ve added some logging to help us resolve issues reported by some users related to album and photo syncing in the app. This will allow us to troubleshoot and fix the underlying bugs so you have a better experience adding photos to your frame. As always, please don’t hesitate to reach out to us at help@auraframes.com with any questions, problems, or feedback. We love hearing from you"},{"version_id":"830364685","version_name":"3.1.30","version_date":"2019-02-21 18:20:28.000 +0800","version_description":"Thanks for using Aura! In this release we added some analytics to help us resolve issues related to album and photo syncing in the app. This will allow us to troubleshoot and fix the underlying bugs so you have a better experience. As always, please don’t hesitate to reach out to us at help@auraframes.com with any questions, problems, or feedback."},{"version_id":"830475869","version_name":"3.1.32","version_date":"2019-03-05 00:41:48.000 +0800","version_description":"Thanks for using Aura! In this release we improved how Aura syncs with your photo library. Now, any edits you make to photos on your phone (cropping, adding a filter, etc.) will be reflected in the app and on your frame. We also made some improvements to the \"Frame Members\" page, so it's easier than ever to invite others to your frame via text or email. As always, please don’t hesitate to reach out to us at help@auraframes.com with any questions, problems, or feedback. We love hearing from you!"},{"version_id":"830497771","version_name":"3.1.34","version_date":"2019-03-06 19:19:10.000 +0800","version_description":"Thanks for using Aura! In this release we added analytics in an effort to resolve a particularly stubborn bug affecting some users. As always, please don’t hesitate to reach out to us at help@auraframes.com with any questions, problems, or feedback."},{"version_id":"830657944","version_name":"3.1.36","version_date":"2019-03-20 19:31:01.000 +0800","version_description":"Thanks for using Aura! Our latest update includes a new and improved Google Photos integration so you can easily add photos to your frame on the go - shared albums included! We also fixed some bugs related to saved edits and photo syncing so Aura always reflects your photo library in real time. Reach out to us at help@auraframes.com with any questions or feedback!"},{"version_id":"830829036","version_name":"3.1.38","version_date":"2019-04-05 17:56:48.000 +0800","version_description":"Thanks for using Aura! Our latest release addresses software bugs that were affecting a handful of users. We hope this update makes it even easier to add photos to your frame on the go. Reach out to us at help@auraframes.com with any questions, problems, or feedback. We love hearing from you!"},{"version_id":"830886945","version_name":"3.1.40","version_date":"2019-04-12 23:26:51.000 +0800","version_description":"Thanks for using Aura! In this release, we fixed some minor bugs affecting our iPad users. We also made some improvements to the overall flow of the app. As always, please don't hesitate to reach out to us at help@auraframes.com with any questions, problems, or feedback. We love hearing from you!"},{"version_id":"830970717","version_name":"3.1.42","version_date":"2019-04-19 18:32:38.000 +0800","version_description":"Thanks for using Aura! In this release, we fixed some minor bugs affecting our iPad users and resolved an issue that resulted in a handful of saved crops getting lost. As always, please don’t hesitate to reach out to us at help@auraframes.com with any questions, problems, or feedback. We love hearing from you!"},{"version_id":"831098301","version_name":"3.1.44","version_date":"2019-04-25 20:09:47.000 +0800","version_description":"Thanks for using Aura! In this release we made some minor bug fixes and improvements to the overall flow of the app. Reach out to us at help@auraframes.com with any questions, problems, or feedback!"},{"version_id":"831245346","version_name":"3.1.46","version_date":"2019-05-10 17:45:37.000 +0800","version_description":"Thanks for using Aura! In this release, we've improved the settings UI and made the loading of your photo collections speedier. As always, please don’t hesitate to reach out to us at help@auraframes.com with any questions, problems, or feedback. We love hearing from you!"},{"version_id":"831423387","version_name":"3.1.48","version_date":"2019-05-28 18:50:56.000 +0800","version_description":"Thanks for using Aura! This release addresses some minor bugs affecting iOS 9 users. As always, please don’t hesitate to reach out to us at help@auraframes.com with any questions, problems, or feedback. We love hearing from you!"},{"version_id":"831522253","version_name":"3.1.50","version_date":"2019-06-05 17:09:10.000 +0800","version_description":"Thanks for using Aura! In this release we updated some help center links and fixed a minor bug that was resulting in app crashes. As always, please don't hesitate to reach out to us at help@auraframes.com with any questions, problems, or feedback. We love hearing from you!"},{"version_id":"832019565","version_name":"3.1.54","version_date":"2019-07-16 18:56:44.000 +0800","version_description":"Thanks for using Aura! In this release, we’ve worked on a bunch of bug fixes related to the way Aura displays your photos in the app and on your frame. Please don’t hesitate to reach out to us at help@auraframes.com with any questions, problems, or feedback. We love hearing from you!"},{"version_id":"832081365","version_name":"3.1.56","version_date":"2019-07-20 21:18:30.000 +0800","version_description":"Thanks for using Aura! In this release, we’ve continued work on squashing bugs, especially ones related to the way Aura displays your photos in the app and on your frame. Please don’t hesitate to reach out to us at help@auraframes.com with any questions, problems, or feedback. We love hearing from you!"},{"version_id":"832247527","version_name":"3.1.58","version_date":"2019-08-05 17:35:15.000 +0800","version_description":"Thanks for using Aura! In this release, we’ve continued work on squashing bugs, especially ones related to the way Aura displays collections of photos in the app. Please don’t hesitate to reach out to us at help@auraframes.com with any questions, problems, or feedback. We love hearing from you!"},{"version_id":"832418362","version_name":"3.1.60","version_date":"2019-08-20 01:11:02.000 +0800","version_description":"Thanks for using Aura! In this release, we’ve responded to feedback from our users to make it clearer when you add Smart Albums to your frame. Please keep the feedback coming! It’s thanks to your input that we are able to continually improve the Aura experience. Email help@auraframes.com with any questions, problems, or just to say hi!"},{"version_id":"832529768","version_name":"3.1.62","version_date":"2019-08-28 18:53:51.000 +0800","version_description":"Thanks for using Aura! In this release we fixed a few minor bugs related to photo collections in the app. Please don’t hesitate to reach out to us at help@auraframes.com with any questions, problems, or just to say hi!"},{"version_id":"834109038","version_name":"3.3.14","version_date":"2019-12-23 04:54:40.000 +0800","version_description":"Happy Holidays from Aura! This is the the last update before the holidays, and has one last bugfix to make your family's holiday as smooth as it can be. As always, we love hearing from you so reach out to us at help@auraframes.com with your questions, concerns, or anything else on your mind."},{"version_id":"839769919","version_name":"3.7.20","version_date":"2020-12-23 01:08:13.000 +0800","version_description":"Happy Holidays from Aura!<br><br>This update contains a number of bug fixes. We've also made it a littler clearer how to remove photos from your frames.<br><br>This week we are turning on some enhanced verification features for preloaded gift frames to ensure your photos are safe and secure. It is now easier than ever to make Aura the perfect gift for your loved ones this holiday season.<br><br>As always, thanks for being a loyal Aura customer. We love to hear from you and your family, so drop us a line at help@auraframes.com."}]