[{"version_id":"815531301","version_name":"1.0.9","version_date":"","version_description":""},{"version_id":"816155903","version_name":"1.1.0","version_date":"","version_description":""},{"version_id":"816245479","version_name":"1.1.1","version_date":"","version_description":""},{"version_id":"816313571","version_name":"1.1.2","version_date":"","version_description":""},{"version_id":"816387497","version_name":"1.1.3","version_date":"","version_description":""},{"version_id":"816793633","version_name":"1.1.4","version_date":"","version_description":""},{"version_id":"816928310","version_name":"1.1.5","version_date":"","version_description":""},{"version_id":"817047523","version_name":"1.2.0","version_date":"","version_description":""},{"version_id":"817658219","version_name":"1.2.1","version_date":"","version_description":""},{"version_id":"817721142","version_name":"1.2.2","version_date":"","version_description":""},{"version_id":"818027100","version_name":"1.2.3","version_date":"","version_description":""},{"version_id":"818709386","version_name":"1.2.4","version_date":"","version_description":""},{"version_id":"818791313","version_name":"1.2.5","version_date":"","version_description":""},{"version_id":"818836141","version_name":"1.2.6","version_date":"","version_description":""},{"version_id":"819059835","version_name":"1.2.7","version_date":"","version_description":""},{"version_id":"819132100","version_name":"1.2.8","version_date":"","version_description":""},{"version_id":"819652599","version_name":"1.2.9","version_date":"","version_description":""},{"version_id":"819679326","version_name":"1.2.91","version_date":"","version_description":""},{"version_id":"819999412","version_name":"1.3.0","version_date":"","version_description":""},{"version_id":"820044975","version_name":"1.3.1","version_date":"","version_description":""},{"version_id":"820253772","version_name":"1.3.2","version_date":"","version_description":""},{"version_id":"820301610","version_name":"1.3.3","version_date":"2017-01-24 06:53:48.000 +0800","version_description":"We've done some nice changes!"},{"version_id":"820856867","version_name":"1.4.0","version_date":"2017-02-08 10:34:05.000 +0800","version_description":"We are constantly improving getir"},{"version_id":"821016773","version_name":"1.4.1","version_date":"2017-02-22 12:19:22.000 +0800","version_description":"You asked. We delivered. <br><br>Finally, finally, debit cards can be used on our always-improving app. <br><br>We'll admit it took a while. Our users have been asking for this feature since the beginning. It was somewhat out of our control but now the stars have aligned and Getir is more accessible than before. We can't even begin to express how excited we are about this.<br><br>Long live debit cards!"},{"version_id":"821130989","version_name":"1.4.2","version_date":"2017-03-02 07:25:59.000 +0800","version_description":"You asked. We delivered. <br><br>Finally, finally, debit cards can be used on our always-improving app. <br><br>We'll admit it took a while. Our users have been asking for this feature since the beginning. It was somewhat out of our control but now the stars have aligned and Getir is more accessible than before. We can't even begin to express how excited we are about this.<br><br>Long live debit cards!"},{"version_id":"821364490","version_name":"1.4.3","version_date":"2017-03-27 09:04:15.000 +0800","version_description":"General bug fixes and performance improvements"},{"version_id":"821826846","version_name":"1.4.4","version_date":"2017-04-22 12:15:15.000 +0800","version_description":"There was a small bug with showing crossed out prices on iOS 10.3. Turns out our development team got a bit carried away with playing FIFA that day. It’s all cool though since they noticed it and fixed it remarkably quickly.<br><br>Our mission at Getir is to make life easier and help you win time. Even when we do something small that wins you a couple seconds, that makes us really happy."},{"version_id":"822142132","version_name":"1.4.5","version_date":"2017-05-22 15:43:49.000 +0800","version_description":"Hello avid update text readers!<br><br>You’re a very special group of people, you know? It makes us really happy to know that some people care so much about the things we develop in our ever-developing app.<br><br>In order to better analyze what difference our updates have, we’ve adopted a system of A/B testing. In this new update, we’re testing out something related to adding items to your basket, but only with a certain percentage of our users. Once we gather data and fine-tune the new feature, it will immediately be rolled out to all users.<br><br>Also, don’t forget that no delivery fee is charged when you pay with BKM Express!"},{"version_id":"822583877","version_name":"1.4.6","version_date":"2017-06-19 13:17:11.000 +0800","version_description":"Now, you can add items to your basket from promotions screen while you are checking out our cool promos."},{"version_id":"822754163","version_name":"1.4.7","version_date":"2017-07-06 12:59:05.000 +0800","version_description":"Search is a beautiful thing isn’t it? Especially when you’re browsing 800+ products. So what we did is, we made it a bit easier for you find the items you want through the search field at the top of the screen. You don’t necessarily have to write the item, but the concept of the item (fruits instead of apples, shampoo instead of Head&amp;Shoulders) to find relevant items you’re searching for.<br><br>That’s the side of the update that you can see and experience. Apart from that we’ve developed many things in the back that drive the beautiful machine that is getir. If you want a detailed explanation, tweet us \";)\" emoji and we’ll get back to you with the details."},{"version_id":"822841415","version_name":"1.4.8","version_date":"2017-07-11 13:38:29.000 +0800","version_description":"With every update text, I (the anonymous writer), feel pressure to write something relevant, pack it with jokes, and entertain our fellow detail-oriented users.<br><br>This update unfortunately lacks such material. All we’ve done (that users can experience) is fix a bug that prevented users with iPhone 4/4S from seeing all the items. Kind of a big deal when you think about it. How are we supposed to sell you products if we can’t properly show them to you? At least our mistakes are honest mistakes and we fix them quickly.<br><br>Let’s end today’s update with a random quote that you can apply to some aspect of your life: “If you want to be successful, you must respect one rule: never lie to yourself.” -Paolo Coelho"},{"version_id":"823078127","version_name":"1.4.9","version_date":"2017-08-04 11:45:40.000 +0800","version_description":"Hello! Anonymous update text writer here again! I have the best job at Getir. I just wait around until the developer team decides to release an update, and I just put some words together.<br>Unlike our last mundane update, this update text will not be difficult to craft because there’s something MAJOR we must address. It turns out all credit cards in Turkey will automatically be deactivated from online shopping on August 17, UNLESS you reply to a text from your bank, stop by an ATM, call the bank, or use the bank’s mobile app.<br>However, we estimate that some people will not have done so by August 17, and they will want to continue saving time by using Getir, so we built a feature that will seamlessly forward them to their bank’s respective mobile apps.<br>We really do think about you. Whenever we can make your life easier, save you a couple of seconds, we develop technology. When you, your neighbour, your friend, and the random man/woman down the street all save seconds, society ultimately saves hours and days. Society wins.<br>Just kidding about not doing anything other than writing update texts. I do a bunch of other stuff actually, this I just do on the side. It’s fairly entertaining."},{"version_id":"823382799","version_name":"1.4.10","version_date":"2017-08-24 11:17:56.000 +0800","version_description":"Hi! It’s me again! <br><br>Apple’s coming out with iOS 11! Wuhuu! Thanks Apple. This means we had to adapt our app to the new version of iOS. Kind of a big deal. If we hadn’t done this, your app would freeze, malfunction, and make you sad. <br><br>Of course, we didn’t just stop there. Now when you’re at the final checkout, but someone else bought the product before you do and we don't have enough for you, we have to take a product out of your basket (so unfortunate, yeah I know!), we will now tell you which product(s) we had to take out. I’m starting to wonder why we didn’t do that before…<br><br>Furthermore, we re-structured our email infrastructure so that we can provide a tailored experience to email addresses with certain corporate/educational domains. This is somewhat secretive, so you didn’t hear this from me! <br><br>Finally, and most importantly, we have been working on making Getir accessible for the vision-impaired. Most of the work is in this update, but the complete feature will be fully released in our next update (which will be very very soon!) <br><br>Please do no take screenshots of this and put it on Twitter. I could lose my job. See you soon!"},{"version_id":"823874594","version_name":"1.4.11","version_date":"2017-10-10 08:09:36.000 +0800","version_description":"Hi,<br>I’m Selçuk (@sellcukucar) <br><br>I am a visually impaired Getir user.<br>I couldn’t use the app easily and efficiently.<br>To be honest, the app was not accessible for me.<br>I expressed my displeasure to the team at Getir.<br>Thankfully, they replied to me in a couple of days and we started working on making the app accessible to visually impaired people.<br>Ultimately, we got to release this update together.<br>Now, us visually-impaired people are able to use the app comfortably like you.<br>The developers at Getir improved VoiceOver technology support in the app for us.<br>During the process, we were included and developments were made based on our feedback.<br>We would like to thank the team at Getir for their sensitivity."},{"version_id":"824390628","version_name":"1.4.12","version_date":"2017-11-24 16:06:23.000 +0800","version_description":"I’m back. In our last update text, we lent our text-pseudo-blog to Selçuk, who advocates for the rights of visually-impaired people so that he could describe the update we developed for visually-impaired people. All the responses we got were incredible, so thanks to all the avid app update text readers out there!<br><br>We’re proud of the accessibility features we added, however we can’t go without admitting that there were a few bugs. For example when your courier set out to deliver your order and the ETA decreased, accessibility wouldn’t announce that through audio. So we fixed that. Simple bug, simple fix. Nice.<br><br>Also it turned out that products with really long names sometimes looked funny in your basket. Now they don’t look funny, they just look normal. Here at Getir, we like unordinary people (we are mostly unordinary), yet we try to keep the app interface clean and simplistic. No room for abnormal stuff there.<br><br>In other news, Apple released this new phone called X. It’s super big and has animojis. Soon, the screen will be bigger than the phone itself. For those who have found a way to get their hands on one, we made sure our app looks pretty on the X. <br><br>Needless to say we probably added some nifty bugs for you to face and for us to fix. This is a two-way relationship after all, isn’t it?<br><br>Some readers have asked about my identity. I am not a single person. I am Getir. A girl is no one."},{"version_id":"825223338","version_name":"1.4.13","version_date":"2017-12-08 16:16:11.000 +0800","version_description":"iPhone X is pretty awesome. Our bug was not so awesome. The bug fix we did is pretty neat though.<br><br>That is all this time. Here’s something to make you think: <br><br>“The way to get started is to quit talking and start doing.”  –Walt Disney"},{"version_id":"825648574","version_name":"1.4.14","version_date":"2018-01-23 08:28:06.000 +0800","version_description":"Hello fellow Getir users! You know what? I’ve missed you. Why? Because you are simply awesome. You not only save time by using Getir but you enjoy the details so much that you click to expand so you can read what we’ve developed. I get incredibly excited every time the engineering team tells me it’s time to write an app update text. We’ve got some small but nice features in this update: <br>While the ringing of a doorbell might be one of the most anticipated sounds after you place a Getir order, not all people may always want their doorbell ringed upon delivery. Maybe you’ve put the kids to sleep. Maybe you’re secretly awake at night. Maybe you’ve bought a secret gift for your special someone who is in the other room. Now you can select “Do not ring the bell” so our couriers will be more discreet when making their delivery. Just make sure to have your phone nearby in case they call you to make their delivery!<br>You can select this in multiple stages. Choose between the “Add Note” button on the top right of the checkout screen or the contact button on the bottom right of tracking screen that appears once you place an order. <br>Furthermore, we’ve made it easier for you to see what you’ve ordered in the past. The “Orders” is now on the main menu. If you go into the detail of an order, you’ll see a much more vivid depiction of what you ordered, as well as the payment details. We simply made that more user-friendly, more beautiful, because that’s how apps should be!<br>We always want to make our app better. Most of our features come from feedback we get from you awesome people. So please keep giving us constructive criticism so that we can be better for you. <br>Getir out."},{"version_id":"825991768","version_name":"1.4.16","version_date":"2018-02-27 19:22:51.000 +0800","version_description":"TOUCH HERE FOR AWESOMENESS<br>So while we work on something truly big, we’re busy developing small features on the side, you know, to keep you happy, because that’s what we do.<br><br>Now when you go to your previous orders you will be able to select and delete orders from that list. Maybe you don’t want to see a certain specific order you previously made. Things happen. That’s OK. We don’t judge. It’s OK if you don’t want other people to judge you as well. Enough said.<br><br>Sometimes you search for a product through the search bar but then you don’t see exactly what you want. That is a sad scenario for both you and for us. To turn sad scenarios into happy ones, we will now prompt you to suggest new products when this happens. We do our best to add products to our portfolio that a significant number of our users suggest. It is how we got to the number of products we currently have."},{"version_id":"825991768","version_name":"1.4.15","version_date":"2018-02-13 23:14:03.000 +0800","version_description":"- Bug fix"},{"version_id":"826111702","version_name":"1.4.16","version_date":"2018-02-27 19:22:51.000 +0800","version_description":"TOUCH HERE FOR AWESOMENESS<br>So while we work on something truly big, we’re busy developing small features on the side, you know, to keep you happy, because that’s what we do.<br><br>Now when you go to your previous orders you will be able to select and delete orders from that list. Maybe you don’t want to see a certain specific order you previously made. Things happen. That’s OK. We don’t judge. It’s OK if you don’t want other people to judge you as well. Enough said.<br><br>Sometimes you search for a product through the search bar but then you don’t see exactly what you want. That is a sad scenario for both you and for us. To turn sad scenarios into happy ones, we will now prompt you to suggest new products when this happens. We do our best to add products to our portfolio that a significant number of our users suggest. It is how we got to the number of products we currently have."},{"version_id":"826766902","version_name":"1.4.17","version_date":"2018-04-21 07:38:11.000 +0800","version_description":"In July of 2015, we launched Getir with no more than 300 products. To be honest, we didn’t have a sufficient product selection, but we still delivered in about 10 minutes. <br><br>We continue to deliver in 10 minutes, throughout our favorite city on planet earth, yet we now have more than 1000+ items. That’s 1000+ reasons to use Getir. We also bring you time, but that’s not really tangible, so we won’t go into the abstract here!<br><br>Details are important and many of our users want to know the finer details regarding the products in Getir, so we’ve adapted our product detail screens so that there is much more information that is relevant to you, the user. <br><br>Now when you tap a product, relevant detail information will come up automatically instead of requiring another unnecessary finger tap. The answer to “What’s in the quinoa salad?” is much easier to find now!<br><br>Products may also now have multiple pictures, so feel free to swipe through them. You can also zoom in on product images as if you’re zooming in on Instagram posts! (What did we do before Instagram developed that feature? Thanks ‘Gram)<br><br>We like to bundle cool products together and create even cooler bundles. The new design enables you to examine all the individual products inside the bundle so you precisely what you’re getting. Regarding bundles, our marketing team tries really hard to come up with creative names for those bundles and we personally like them, however we’re always open to new bundle name (and combination) suggestions that you may have (Twitter: getir_istanbul)"},{"version_id":"827183007","version_name":"1.4.18","version_date":"2018-05-17 17:37:48.000 +0800","version_description":"We like people who are detail-oriented. You obviously are, otherwise you wouldn't be looking at this.<br><br>Interested in perhaps not just using Getir, but being a part of Getir? Go to our webpage getir.com/en and simply click \"Careers\" on the top right. That will directly forward you to a page with all of our open positions. You too can be a part of Getir :)"},{"version_id":"827218703","version_name":"1.4.19","version_date":"2018-05-22 15:42:32.000 +0800","version_description":"We like people who are detail-oriented. You obviously are, otherwise you wouldn't be looking at this.<br>Interested in perhaps not just using Getir, but being a part of Getir? Go to our webpage getir.com/en and simply click \"Careers\" on the top right. That will directly forward you to a page with all of our open positions. You too can be a part of Getir :)"},{"version_id":"827301002","version_name":"1.4.20","version_date":"2018-05-26 00:16:15.000 +0800","version_description":"We like people who are detail-oriented. You obviously are, otherwise you wouldn't be looking at this.<br>Interested in perhaps not just using Getir, but being a part of Getir? Go to our webpage getir.com/en and simply click \"Careers\" on the top right. That will directly forward you to a page with all of our open positions. You too can be a part of Getir :)"},{"version_id":"827676816","version_name":"1.4.21","version_date":"2018-06-29 21:01:05.000 +0800","version_description":"“Life is like a box of chocolates. You never know what you're going to get” - Forest Gump<br><br>Some app updates bring you big features, some bring minor (yet significant) bug fixes, while some bring some more clarity and easiness to your overall Getir experience. This app update is one of those.<br><br>Users using BKM Express as a payment method used to not be able to change their card within BKM Express. Now they can. Simple and cool.<br>Our \"Don't ring my doorbell\" feature was really appreciated by many users, however users that got calls from numbers starting in 0850 were a bit hesitant in picking up the call. Now we'll inform you about our 0850 number so that we can get you your items at that time in which you do not want to be disturbed.<br><br>These are the pieces of chocolate we have in store for you this time around. Tune in for something big that's coming in for the next update."},{"version_id":"827800978","version_name":"1.4.22","version_date":"2018-07-09 17:07:28.000 +0800","version_description":"“Life is like a box of chocolates. You never know what you're going to get” - Forest Gump<br>Some app updates bring you big features, some bring minor (yet significant) bug fixes, while some bring some more clarity and easiness to your overall Getir experience. This app update is one of those.<br><br>Users using BKM Express as a payment method used to not be able to change their card within BKM Express. Now they can. Simple and cool.<br>Our \"Don't ring my doorbell\" feature was really appreciated by many users, however users that got calls from numbers starting in 0850 were a bit hesitant in picking up the call. Now we'll inform you about our 0850 number so that we can get you your items at that time in which you do not want to be disturbed.<br><br>These are the pieces of chocolate we have in store for you this time around. Tune in for something big that's coming in for the next update."},{"version_id":"827993337","version_name":"1.4.23","version_date":"2018-07-31 21:25:50.000 +0800","version_description":"Hi fellow awesome human beings!<br>So apart from a simple scroll bar inside of categories, we really don’t have any big developments in this update. In an attempt to get some more info from our developers, I asked them: “Is there anything you want to tell our users?”<br>Our lead backend developer replied: “Tell them we really like them.”<br>So that’s that. Our people really like you. Thank you for being you."},{"version_id":"828532531","version_name":"1.4.24","version_date":"2018-09-19 13:55:00.000 +0800","version_description":"Thank you. Thank you for being you and using Getir. We have not always been perfect, but with your feedback and our culture of determination we have constantly improved ourselves. What simply started out more than 3 years ago with the idea of delivering everyday items in about 10 minutes has evolved into a mature business, supported by an incredible human organization. You gave us a chance. You helped us improve. You spread the word. You... yes you, are a fundamental part of our success. We hope to continue that success, growing even faster than we grow today, and ultimately prove that unique and disruptive technology companies can grow out of Turkey and have a global presence. <br><br>You probably opened up this update text to see what we have in store for you and instead you found an emotional message from us. Well that’s life sometimes. What about the updates? Here they are:<br>- The home screen now shows our minimum order amount and our delivery fee. We like to decrease the amount and the fee when we can, so we’ll inform you in your first glance.<br>- When you first click for your basket and see the products in your basket, we now show you promotions that our algorithms suggest are relevant for you. We wouldn’t want you to miss out on free ice cream or discounted paper towels! <br><br>That is all for this update. We’ve got some major changes in store in the near future, so expect that text to be far more informative than emotional."},{"version_id":"828532531","version_name":"2.1.1","version_date":"2019-02-21 11:44:14.000 +0800","version_description":"Food.<br>You eat it multiple times a day. You think about it, a lot. You even talk about food when you are eating food. It is a central part of all our lives.<br><br>The time has come. The worst-kept secret is now public. We are in the food business and we are here to make a difference, break some rules, and change old habits.<br><br>Open our recently redesigned app and you will notice that alongside the flagship “Getir” business model, there is “Getir Yemek”, the new baby in the Getir family.<br><br>Getir Yemek strives to provide you with a seamless food-ordering experience, from A to Z. Simply choose from one of several restaurants that we have selected to be a part of Getir Yemek. Average delivery times appear on the restaurant to give you a better idea. We will only list restaurants that are within a proximity in which our Getir couriers can deliver the meal hot/fresh. We are essentially obsessed with the concept of time, meaning that we will lose sleep if a hot meal gets delivered cold.<br><br>Select your restaurant and the ordering process is pretty easy. Browse through the restaurant’s menu, select the items you want, fill out the order details (spicy/not spicy, 150g/200g, Cola/Ayran, etc.) and the items will be added to your Getir Yemek basket. Yemek orders cannot be combined with normal Getir orders. Getir Yemek will use the payment methods and addresses you have already added to your account. Simplicity at its finest.<br><br>Do we even have to say that you can track your food order on our awesome map? You were probably expecting that anyway. The historic question of “where is my food?” is thus answered. However feel free to contact your courier through the app if there happens to be an issue. Customer Services will also gladly rush to your assistance. Happy you = Happy Getir.<br><br>Orders placed with Getir Yemek will be delivered by the always-friendly Getir couriers who all take safe driving lessons and are insured with private health insurance. Our technology minimizes the need for human interference, resulting in faster delivery times.<br><br>We like to do things fast and surprise our users, which means that some food-related features (ratings, sorting, etc.) will roll out in the following weeks. Thank you for being you and using Getir, allowing us to dare to enter this market knowing that we can make a difference. Restaurants who want to be a part of Getir Yemek can apply through our app, and users can always provide feedback to us via Twitter or Customer Services.<br><br>Bon Appetit."},{"version_id":"828532531","version_name":"2 is so good that it quickly deserves some awsome updates. Complacency is not en our vocabulary. We have:Due to new environment-protecting regulation","version_date":"","version_description":""},{"version_id":"829506418","version_name":"2.0","version_date":"2018-12-13 17:41:17.000 +0800","version_description":"The time has come. It is here. Welcome to Chapter 2 in the story of Getir, the mobile app. Version II is here. <br><br>It has been 4 years since we started diligently working on this simple yet complex app. While we have always enjoyed our initial design, and the subsequent features we’ve added on, we’ve been working on something fresh, something even simpler, something even more pleasing to the eye for a while now.<br><br>Features that matter for you:<br><br>Hamburger menus on the top left of the screen are so 2014 and we’re about to enter 2019, so we brought everything relevant to you within a thumb’s reach on the bottom of the screen. Click the categories button on the left to quickly get back to items, the search icon on the center-left to search for your favorite goodies, the profile icon on the center-right to access your fundamentals, and the promos icon on the right to access our entire range of promotions and announcements. <br><br>We know you like our promos. We like them too, although not as much as we like you. For even easier access to our promos we’ve decided to put our best, most beautiful promotions and announcements onto the home page. Thus we can better communicate with you while you continue to experience the original Getir experience of product categories and a map, reminding you each time that we are only a short delivery away from you. <br><br>Our products page is optimized to show you more of what is relevant for you. Simply add a product by clicking the plus button on its top right. Click the image of the product to go into product details, which now feature multiple pictures as well as nutritional value (for respective products). To add to your favorites, click the sweet heart icon on the top right of any product in the product detail page.<br><br>Click the search button to journey to our new search page, where you can search either by text or by voice. We’ve added current popular searches so that you know what the people of Istanbul are up to! <br><br>The profile page is revamped to give you easier access to the things that matter for you: your addresses, your favorite items, previous orders, payment methods, and your password. Feel free to change the language of the app as well! <br><br>Now onto the promos page, the page we know you’re bound to spend time looking for the newest promos that excite you the most. We’ve divided the page into two tabs: promotions and announcements. Commercial promotions will be on the left while announcements that are not necessarily commercial will appear in the announcements tab. <br><br>The basket icon is now on the top right. Simply click the new suave icon to move on and see your current basket. Continue from here to access the final payment page. All your addresses and payment methods are already here in Version II. Simply click ‘Order Now’ to place your first Version II order.<br><br>The small cool things we’re excited about:<br><br>When adding or editing an address, choose from one of dozens of emojis we’ve selected to better represent your location, or your lifestyle! Emojis are cool. We may not be a social media app, but rather the world’s fastest mobile delivery app, but that doesn’t mean that we too can’t have emojis, right? <br><br>I don’t know about you but I’m a fan of those small animations that you don’t see, but you feel. Add a product to your basket and the frame around it will turn Getir Purple, while the basket icon on the top right will move sideways and back as it refreshes your basket total. Coolio. <br><br>There’s many more things that I can write about but maybe it’s better if you find them on your own and share them with us? Tag us on Twitter with @getir_istanbul with screenshots of your favorite new features/design elements and comment on our new app. <br><br>We like it and we truly hope you will too.<br><br>Special thanks to the ridiculously awesome humans who put together technology and design to make this happen. You know who you are. <br><br>Now time to start thinking about Version III..."},{"version_id":"829652860","version_name":"2.0.1","version_date":"2018-12-16 18:16:58.000 +0800","version_description":"The time has come. It is here. Welcome to Chapter 2 in the story of Getir, the mobile app. Version II is here.<br>It has been 4 years since we started diligently working on this simple yet complex app. While we have always enjoyed our initial design, and the subsequent features we’ve added on, we’ve been working on something fresh, something even simpler, something even more pleasing to the eye for a while now.<br><br>Features that matter for you:<br><br>Hamburger menus on the top left of the screen are so 2014 and we’re about to enter 2019, so we brought everything relevant to you within a thumb’s reach on the bottom of the screen. Click the categories button on the left to quickly get back to items, the search icon on the center-left to search for your favorite goodies, the profile icon on the center-right to access your fundamentals, and the promos icon on the right to access our entire range of promotions and announcements.<br><br>We know you like our promos. We like them too, although not as much as we like you. For even easier access to our promos we’ve decided to put our best, most beautiful promotions and announcements onto the home page. Thus we can better communicate with you while you continue to experience the original Getir experience of product categories and a map, reminding you each time that we are only a short delivery away from you.<br><br>Our products page is optimized to show you more of what is relevant for you. Simply add a product by clicking the plus button on its top right. Click the image of the product to go into product details, which now feature multiple pictures as well as nutritional value (for respective products). To add to your favorites, click the sweet heart icon on the top right of any product in the product detail page.<br><br>Click the search button to journey to our new search page, where you can search either by text or by voice. We’ve added current popular searches so that you know what the people of Istanbul are up to!<br><br>The profile page is revamped to give you easier access to the things that matter for you: your addresses, your favorite items, previous orders, payment methods, and your password. Feel free to change the language of the app as well!<br><br>Now onto the promos page, the page we know you’re bound to spend time looking for the newest promos that excite you the most. We’ve divided the page into two tabs: promotions and announcements. Commercial promotions will be on the left while announcements that are not necessarily commercial will appear in the announcements tab.<br><br>The basket icon is now on the top right. Simply click the new suave icon to move on and see your current basket. Continue from here to access the final payment page. All your addresses and payment methods are already here in Version II. Simply click ‘Order Now’ to place your first Version II order.<br><br>The small cool things we’re excited about:<br><br>When adding or editing an address, choose from one of dozens of emojis we’ve selected to better represent your location, or your lifestyle! Emojis are cool. We may not be a social media app, but rather the world’s fastest mobile delivery app, but that doesn’t mean that we too can’t have emojis, right?<br><br>I don’t know about you but I’m a fan of those small animations that you don’t see, but you feel. Add a product to your basket and the frame around it will turn Getir Purple, while the basket icon on the top right will move sideways and back as it refreshes your basket total. Coolio.<br><br>There’s many more things that I can write about but maybe it’s better if you find them on your own and share them with us? Tag us on Twitter with @getir_istanbul with screenshots of your favorite new features/design elements and comment on our new app.<br><br>We like it and we truly hope you will too.<br><br>Special thanks to the ridiculously awesome humans who put together technology and design to make this happen. You know who you are.<br><br>Now time to start thinking about Version III..."},{"version_id":"829761852","version_name":"2.0.2","version_date":"2019-01-03 07:42:19.000 +0800","version_description":"Version 2 is so good that it quickly deserves some awsome updates. Complacency is not en our vocabulary. We have:<br><br>Due to new environment-protecting regulation, we have implemented a bag price. Our algorithms have been developed so that there will ne no excess bag use. <br><br>Improved accessibility developments. <br><br>Pending approval, you’ll be able to use Siri to initiate order tracking. <br><br>Better user experience when you try to use the map in the home screen.<br><br>That’s all for this round!"},{"version_id":"829848354","version_name":"2.0.3","version_date":"2019-01-06 22:17:05.000 +0800","version_description":"Version 2 is so good that it quickly deserves some awsome updates. Complacency is not en our vocabulary. We have:<br>Due to new environment-protecting regulation, we have implemented a bag price. Our algorithms have been developed so that there will ne no excess bag use.<br><br>Improved accessibility developments.<br><br>Pending approval, you’ll be able to use Siri to initiate order tracking.<br><br>Better user experience when you try to use the map in the home screen.<br><br>That’s all for this round!"},{"version_id":"829848354","version_name":"2 is so good that it quickly deserves some awesome updates. Complacency is not in our vocabulary. We have:Due to new environment-protecting regulation","version_date":"","version_description":""},{"version_id":"829880373","version_name":"2.0.4","version_date":"2019-01-16 17:03:45.000 +0800","version_description":"Version 2 is so good that it quickly deserves some awesome updates. Complacency is not in our vocabulary. We have:<br>Due to new environment-protecting regulation, we have implemented a bag price. Our algorithms have been developed so that there will no excess bag use.<br>Improved accessibility developments.<br><br>Pending approval, you’ll be able to use Siri to initiate order tracking.<br><br>Better user experience when you try to use the map in the home screen.<br><br>That’s all for this round!"},{"version_id":"830244163","version_name":"2.1.0","version_date":"2019-02-11 09:39:50.000 +0800","version_description":"Food.<br><br>You eat it multiple times a day. You think about it, a lot. You even talk about food when you are eating food. It is a central part of all our lives.<br><br>The time has come. The worst-kept secret is now public. We are in the food business and we are here to make a difference, break some rules, and change old habits.<br><br>Open our recently redesigned app and you will notice that alongside the flagship “Getir” business model, there is “Getir Yemek”, the new baby in the Getir family. <br><br>Getir Yemek strives to provide you with a seamless food-ordering experience, from A to Z. Simply choose from one of several restaurants that we have selected to be a part of Getir Yemek. Average delivery times appear on the restaurant to give you a better idea. We will only list restaurants that are within a proximity in which our Getir couriers can deliver the meal hot/fresh. We are essentially obsessed with the concept of time, meaning that we will lose sleep if a hot meal gets delivered cold. <br><br>Select your restaurant and the ordering process is pretty easy. Browse through the restaurant’s menu, select the items you want, fill out the order details (spicy/not spicy, 150g/200g, Cola/Ayran, etc.) and the items will be added to your Getir Yemek basket. Yemek orders cannot be combined with normal Getir orders. Getir Yemek will use the payment methods and addresses you have already added to your account. Simplicity at its finest. <br><br>Do we even have to say that you can track your food order on our awesome map? You were probably expecting that anyway. The historic question of “where is my food?” is thus answered. However feel free to contact your courier through the app if there happens to be an issue. Customer Services will also gladly rush to your assistance. Happy you = Happy Getir. <br><br>Orders placed with Getir Yemek will be delivered by the always-friendly Getir couriers who all take safe driving lessons and are insured with private health insurance. Our technology minimizes the need for human interference, resulting in faster delivery times.<br><br>We like to do things fast and surprise our users, which means that some food-related features (ratings, sorting, etc.) will roll out in the following weeks. Thank you for being you and using Getir, allowing us to dare to enter this market knowing that we can make a difference. Restaurants who want to be a part of Getir Yemek can apply through our app, and users can always provide feedback to us via Twitter or Customer Services.<br><br>Bon Appetit."},{"version_id":"830359107","version_name":"2.1.1","version_date":"2019-02-21 11:44:14.000 +0800","version_description":"Food.<br>You eat it multiple times a day. You think about it, a lot. You even talk about food when you are eating food. It is a central part of all our lives.<br><br>The time has come. The worst-kept secret is now public. We are in the food business and we are here to make a difference, break some rules, and change old habits.<br><br>Open our recently redesigned app and you will notice that alongside the flagship “Getir” business model, there is “Getir Yemek”, the new baby in the Getir family.<br><br>Getir Yemek strives to provide you with a seamless food-ordering experience, from A to Z. Simply choose from one of several restaurants that we have selected to be a part of Getir Yemek. Average delivery times appear on the restaurant to give you a better idea. We will only list restaurants that are within a proximity in which our Getir couriers can deliver the meal hot/fresh. We are essentially obsessed with the concept of time, meaning that we will lose sleep if a hot meal gets delivered cold.<br><br>Select your restaurant and the ordering process is pretty easy. Browse through the restaurant’s menu, select the items you want, fill out the order details (spicy/not spicy, 150g/200g, Cola/Ayran, etc.) and the items will be added to your Getir Yemek basket. Yemek orders cannot be combined with normal Getir orders. Getir Yemek will use the payment methods and addresses you have already added to your account. Simplicity at its finest.<br><br>Do we even have to say that you can track your food order on our awesome map? You were probably expecting that anyway. The historic question of “where is my food?” is thus answered. However feel free to contact your courier through the app if there happens to be an issue. Customer Services will also gladly rush to your assistance. Happy you = Happy Getir.<br><br>Orders placed with Getir Yemek will be delivered by the always-friendly Getir couriers who all take safe driving lessons and are insured with private health insurance. Our technology minimizes the need for human interference, resulting in faster delivery times.<br><br>We like to do things fast and surprise our users, which means that some food-related features (ratings, sorting, etc.) will roll out in the following weeks. Thank you for being you and using Getir, allowing us to dare to enter this market knowing that we can make a difference. Restaurants who want to be a part of Getir Yemek can apply through our app, and users can always provide feedback to us via Twitter or Customer Services.<br><br>Bon Appetit."},{"version_id":"830391506","version_name":"2.1.2","version_date":"2019-03-21 17:25:42.000 +0800","version_description":"IS IT REALLY BEEN A MONTH SINCE WE LAST SPOKE!?<br><br>It’s not you, it’s me. Is there someone else? Never! No one can come between us.  <br><br>About a month ago we spilled our latest secret “GetirYemek” and we knew we weren’t perfect, but we didn’t want you to accept us the way we were. Since the beginning, we‘ve found the right way together. Followed the light together. <br><br>This time, with your guidance, we changed a few things starting with ‘Order History’. Now you are able to view your past orders from your profile page. Your favorite restaurants will also be right under your finger. <br><br>You might remember that we’ve said we are obsessed with the concept of time and we meant it. We’ve made some small touches to save you more time. Now, with our new filter button placed right at the top-left of the screen, to search for a food of your choosing has become well… easy peasy. By tapping the filter button, you can simply filter by the type of cuisine or view the recommendations, popular orders or the options with fastest delivery. <br><br>We know it can get a little hard to choose from all the delicious photos of the items on a menu. That’s why we’ve put a search button right at the top of the menus of all restaurants. You simply type down your choices name. We’ll find and get it for you. While still smoking hot.  <br><br>See you on the next update. <br><br>Ever Yours,<br>Getir"},{"version_id":"830792395","version_name":"2.1.3","version_date":"2019-03-30 23:57:27.000 +0800","version_description":"We’ve brought you an alternative: the returnable deposit bag.<br>Now, on the order confirmation page you’ll be able to select one of these three options; ”I want a plastic bag”, “I want to buy a returnable deposit bag”, or ”I have a returnable deposit bag”."},{"version_id":"830936515","version_name":"2.1.4","version_date":"2019-04-10 23:52:52.000 +0800","version_description":"We’ve brought you an alternative: the returnable deposit bag.<br>Now, on the order confirmation page you’ll be able to select one of these three options; ”I want a plastic bag”, “I want to buy a returnable deposit bag”, or ”I have a returnable deposit bag”."},{"version_id":"831186003","version_name":"2.1.5","version_date":"2019-05-03 17:15:21.000 +0800","version_description":"We’ve brought some search features, each one more awesome than the other!<br>Now, both in Getir and GetirYemek, if you’re interested in any sliding banner located at the top of the screen, you can click on it and make a search! <br>Do you crave a delicious lahmacun and don’t want to see anything else? We solved that problem too! Now, when you search a food from the main menu, we’re not only providing you a list of restaurants including your search, but also we carry your search to the selected restaurant’s page. In other words, you won't need to re-enter “lahmacun” to the search bar on the restaurant’s page, but the delicious lahmacun options will be right in front of you.<br><br>Although not as much as we like you, we do like to offer sliding alternatives on the screen. That's why we added a sliding banner of restaurants where you can shift through options, exclusive for Ramadan. <br>We hope you like it too!"},{"version_id":"831506632","version_name":"2.1.6","version_date":"2019-05-31 19:24:00.000 +0800","version_description":"“What everyone knows exist but can’t see is a Backend Development”<br>- Anonymous"},{"version_id":"831626394","version_name":"2.2","version_date":"2019-06-11 14:32:03.000 +0800","version_description":"“What everyone knows exist but can’t see is a Backend Development”<br>- Anonymous"},{"version_id":"831631115","version_name":"2.2.1","version_date":"2019-06-12 11:20:09.000 +0800","version_description":"“What everyone knows exist but can’t see is a Backend Development.”<br>- Anonymous"},{"version_id":"831662746","version_name":"2.2.2","version_date":"2019-06-14 13:40:58.000 +0800","version_description":"“What everyone knows exist but can’t see is a Backend Development.”<br>- Anonymous"},{"version_id":"831977050","version_name":"2.3","version_date":"2019-07-18 01:38:13.000 +0800","version_description":"Beautiful developments continue within GetirYemek.<br>Now you can rate restaurants, contributing to make them even better!<br>Your awesome feedback will allow us to provide restaurant ratings in our next update..."},{"version_id":"832483526","version_name":"2.3.1","version_date":"2019-08-29 06:56:10.000 +0800","version_description":"Hello again dear awesome people!<br><br>To chase your worries away while waiting, we've made some improvements on the address which will enable easier access. <br>It looked liked you’ve had a small problem while adding notes on the order tracking screen. Did you think we wouldn’t notice? Well, we fixed it for you. While we remind you that some of the products you recommend are already in Getir, we wanted to note that we've made some search improvements to help you find them easily.<br><br>We look forward to your feedback!"},{"version_id":"832956384","version_name":"2.3.2","version_date":"2019-09-30 16:31:33.000 +0800","version_description":"Amazing stuff, these algorithms!<br><br>In a past update, we’ve asked for a little time to properly show you restaurant ratings… Now, you can see the scores of restaurants and also review their details through your past orders!<br><br>While we are always excited about the performance improvements that beautify our service, we’ve felt even more pleasure working on a development, special to this time of the year;) If you are wondering, follow the changes we will make in our application between 1-4 October!"},{"version_id":"833061676","version_name":"2.3.3","version_date":"2019-10-11 20:31:12.000 +0800","version_description":"There are some updates that bring great innovations, while others eliminate minor problems and enhance your experience. This update is the latter ;)"},{"version_id":"833516126","version_name":"2.4.0","version_date":"2019-11-08 22:11:35.000 +0800","version_description":"Restaurant courier option is now on GetirYemek!<br>It’s up to you! You can choose whether you wish your meal to be delivered by our or the restaurant’s courier. Regardless of your choice, we will always be ready to answer your every question through ‘Live Support’;)<br>We know that sometimes you wanted to order food from your account with a friend, but a discussion rose and resulted with your separation, just because you couldn't order simultaneously from two different restaurants.<br>We may not bring your friend back, but we can have you place multiple orders at GetirYemek! And what’s more, you can also rule out cutlery by using our new ‘Save the Planet’ feature;)<br>Food is on the way and it's time for Getir now? Go ahead, don’t let us keep you!"},{"version_id":"833548619","version_name":"2.4.1","version_date":"2019-11-11 16:33:11.000 +0800","version_description":"Restaurant courier option is now on GetirYemek!<br>It’s up to you! You can choose whether you wish your meal to be delivered by our or the restaurant’s courier. Regardless of your choice, we will always be ready to answer your every question through ‘Live Support’;)<br>We know that sometimes you wanted to order food from your account with a friend, but a discussion rose and resulted with your separation, just because you couldn't order simultaneously from two different restaurants.<br>We may not bring your friend back, but we can have you place multiple orders at GetirYemek! And what’s more, you can also rule out cutlery by using our new ‘Save the Planet’ feature;)<br>Food is on the way and it's time for Getir now? Go ahead, don’t let us keep you!"},{"version_id":"833632460","version_name":"2.5.0","version_date":"2019-11-16 09:34:30.000 +0800","version_description":"We're at our beloved Izmir at last!<br>You said “We wish you'd come\" and through watery eyes we replied \"We will, just wait for us\"... You said \"Is it too much to ask for you to bring us happiness?” and with hands on our chest we replied \"Hang on just a little while longer\"... Yes, the story of the starcrossed may be unforgettable, but those who do end up together also write unforgettable stories.<br>Izmir, are you ready to write the story of those who end up together?"},{"version_id":"833952895","version_name":"2.5.1","version_date":"2019-12-11 01:15:14.000 +0800","version_description":"\"What everyone knows exist but can't see is a back-end development\" - Anonymous"},{"version_id":"834067998","version_name":"2.5.2","version_date":"2019-12-20 22:37:18.000 +0800","version_description":"There are some updates that bring great innovations, while others eliminate minor problems and enhance your experience. This update is the latter ;)"},{"version_id":"834579258","version_name":"2.5.3","version_date":"2020-02-04 17:03:20.000 +0800","version_description":"Hello dear awesome person, how are you? <br>You know how people are said to be different than they were 5 minutes ago, let alone 5 years ago? I doesn't even take 5 seconds for us. <br>You couldn't see it, but we changed for you again and wanted to take this opportunity to wish you a wonderful week!"},{"version_id":"834709915","version_name":"2.5.4","version_date":"2020-02-13 22:56:11.000 +0800","version_description":"Hi there! We're letting some fresh air into our app. You can't visually see the change but it definitely feels great!"},{"version_id":"835136625","version_name":"2.5.5","version_date":"2020-03-17 00:35:38.000 +0800","version_description":"Precautions against coronavirus (COVID-19)! Our new feature \"Leave order at the door\" allows you to take your order without any interaction. Our priority is the safety and health of you and our employees, so we care to provide a reliable, hygienic service and to reduce the spread of the virus through social interaction. You too, wash your hands frequently, follow a balanced, healthy diet and ventilate your environment. Avoid contact and crowded places. Let's get through this together!"},{"version_id":"835177366","version_name":"2.5.6","version_date":"2020-03-27 13:26:23.000 +0800","version_description":"You.. The one who’ve had to bottle up all the things you’ve wished to share… this update is for you.<br>Since the first day, while we were bringing \"happiness\" to you, we‘ve found strength in your trust and support. Especially these days, our couriers show an important effort to work outside and deliver your needs. We know, you want to support them the same way but you couldn’t, to avoid contact. Rest assured now, you can digitally tip through the app following this update and bring them “happiness”."},{"version_id":"835526637","version_name":"2.5.7","version_date":"2020-04-14 08:50:05.000 +0800","version_description":"We hope you’re healthy and well because a brand new GetirYemek experience is here, one that we couldn’t share due to recent priorities. Catalog or list? Actually we were just asking casually because now you can view restaurants both in catalogs or lists. You remember the name of that great restaurant you ordered? Well you don’t have to, we’ll find it from your past searches. And the filters! Now you can also filter restaurants according to the minimum basket amount. Bon Appétit!"},{"version_id":"835718828","version_name":"2.5.8","version_date":"2020-05-01 16:40:02.000 +0800","version_description":"If there are two types of people, ‘those who live to eat’ and ‘those who eat to live’, we are the former! If you’re always dreaming about the next meal too, we’re sure you’ll love this update as much as we do. Whether you’re alone, with your loved ones, or in front of the video chat screen, please enjoy delicious meals on time with the “Now”, “Schedule a Time” aaand “Deliver for İftar” options you’ll see on the check out :wink: Bon Appetit!"},{"version_id":"835878346","version_name":"2.5.9","version_date":"2020-05-09 14:27:24.000 +0800","version_description":"They say hope is the strongest human feeling. We believe that too and work to bring you hope. That’s why we’re changing our slogan to “Getir bi umutluluk” -a merge of hope and happiness words in Turkish- for a while. Don’t lose hope, beautiful days are at our door!"},{"version_id":"836225678","version_name":"2.5.10","version_date":"2020-06-02 14:20:52.000 +0800","version_description":"Are you one of those who forget how time passes while watching your favorite show or listening to your treasured playlist? With this update, we follow the time that passes for you! You can now see how many minutes it has been since you placed your food order and its current status on the live support screen."},{"version_id":"836291626","version_name":"2.6.0","version_date":"2020-06-11 17:04:34.000 +0800","version_description":"Before, you’ve had to wait for your grocery order to reach you to be able to request your hot meal through Getirfood, or had to make a choice between your Getir and Getirmore orders.<br>Now, with this update, you can place multiple orders from Getir, Getirfood, Getirmore and wait for it, Getirwater at the same time and follow the live status of your active orders from the main page. Yes, you have not read it wrong, we now deliver your Kuzeyden 19 L orders with our new service Getirwater!"},{"version_id":"836388841","version_name":"2.6.1","version_date":"2020-06-14 00:30:12.000 +0800","version_description":"Before, you’ve had to wait for your grocery order to reach you to be able to request your hot meal through Getirfood, or had to make a choice between your Getir and Getirmore orders.<br>Now, with this update, you can place multiple orders from Getir, Getirfood, Getirmore and wait for it, Getirwater at the same time and follow the live status of your active orders from the main page. Yes, you have not read it wrong, we now deliver your Kuzeyden 19 L orders with our new service Getirwater!"},{"version_id":"836590807","version_name":"2.6.2","version_date":"2020-07-02 20:54:48.000 +0800","version_description":"Hello dear awesome people!<br>Actually all the things that we did for you in this update were all done in the background, But still we couldn't stop ourselves from using this opportunity to remind you that you're pretty awesome. Thanks.<br>Have a great day and take care of yourself until next time!"},{"version_id":"837313379","version_name":"2.6.3","version_date":"2020-08-21 17:30:38.000 +0800","version_description":"Food. We don't simply just eat it. We look for new tastes. We also seek comforting tastes again and again. To facilitate this dynamic yet delightful relationship with food, we've developed features. You'll now see complementing items when ordering through GetirFood. Also, you can now “Reorder” one your previous orders and quickly reach that ridiculously delicious meal you had the other day. Tipping? We've also streamlined that. Your most recent payment method will automatically be charged now."},{"version_id":"837924380","version_name":"2.6.4","version_date":"2020-09-25 13:07:27.000 +0800","version_description":"There are some updates that bring great innovations, while others eliminate minor problems and enhance your experience. This update is the latter ;)"},{"version_id":"838015138","version_name":"2.6.5","version_date":"2020-10-01 03:57:06.000 +0800","version_description":"We think it’s quite cool to add new features to this app that millions of people in Turkey use. This update brings the option to pay with Istanbulkart, the omnipresent card that’s a staple of life in Istanbul. Just select Istanbulkart on the payment screen, bring the card closer to your phone and scan it. Payment by Istanbulkart is valid through Getir, GetirMore, and GetirWater and is not limited to Istanbul, but also available in all of our beloved cities! Cool, right?"},{"version_id":"838122729","version_name":"2.6.6","version_date":"2020-10-09 04:48:01.000 +0800","version_description":"Hello awesome people who read app updates. You really are one-of-a-kind. To be honest, there’s not too much to be seen in this update. It’s a simple update with bug fixes. Big or small, updates are updates. At Getir we believe it’s very important to keep updating yourself. If you also appreciate this value and find it exciting as well, why don’t you check our career pages to see our open positions? getir.breezy.hr"},{"version_id":"838947530","version_name":"2.6.7","version_date":"2020-11-13 13:08:08.000 +0800","version_description":"Thousands of men and women put on Getir’s purple delivery outfit every day, embarking upon the streets, navigating your orders to your doorstep with a smile on their face. In our post-pandemic world, you often don’t even get to see their all-smiles faces. As a people-first, people-second company, we really value our delivery people. They are the backbone of our company. We’d like to use this opportunity to thank them in your presence.<br><br>In technical terms, the Getir app will now display individually-relevant pop-ups. Without overdoing it, we believe it’s important to make you aware of the benefits that you can derive from our offerings, all the while maintaining the same seamless Getir experience. Let us know if you have any feedback!"},{"version_id":"839112106","version_name":"2.6.8","version_date":"2020-11-14 23:54:49.000 +0800","version_description":"Thousands of men and women put on Getir’s purple delivery outfit every day, embarking upon the streets, navigating your orders to your doorstep with a smile on their face. In our post-pandemic world, you often don’t even get to see their all-smiles faces. As a people-first, people-second company, we really value our delivery people. They are the backbone of our company. We’d like to use this opportunity to thank them in your presence.<br><br>In technical terms, the Getir app will now display individually-relevant pop-ups. Without overdoing it, we believe it’s important to make you aware of the benefits that you can derive from our offerings, all the while maintaining the same seamless Getir experience. Let us know if you have any feedback!"},{"version_id":"839574017","version_name":"2.6.10","version_date":"2020-12-22 10:24:31.000 +0800","version_description":"Chat-support is cool. Keyboard-typed words, lasting mere seconds, have overtaken minute-long phone calls. With our focus on saving time for you, we’re now rolling out text-based chat support to Getir, GetirMore, and GetirWater. Already having been piloted at GetirFood, chat support is ready to go across the rest of the Getir services. Thank you all dearly for the input you provided! We mean it. Really.<br><br>Oh, let’s not forget to support our dear restaurants in these remarkably challenging times. At GetirFood, we’ve gone commission-free to support our restaurants in these remarkably challenging times. Do you part by placing an order? See you at the next update."},{"version_id":"840118757","version_name":"2.6.11","version_date":"2021-01-22 06:06:50.000 +0800","version_description":"Hi all. We’re so busy with the next chapter in the story of Getir that we couldn’t write a long, witty, and creative app update, for one which contains both bug fixes and something so big we’re not allowed to write it here..."},{"version_id":"840202743","version_name":"2.6.12","version_date":"2021-01-26 18:23:30.000 +0800","version_description":"Hi London. We’re Getir, the pioneers of super-fast delivery. We chose London for our first step in international expansion because it’s absolutely amazing. From its diverse set of people, all with their unique stories; to its boroughs that all have a unique character; to how it embraces tech startups like ourselves, London rocks. Thank you for having us. As the people who work at Getir UK, we look forward to introducing you to super-fast delivery. We will always listen to you and value your feedback, and work towards both addressing your concerns, as well as delighting you with surprises."},{"version_id":"840644248","version_name":"2.6.13","version_date":"2021-03-03 06:05:03.000 +0800","version_description":"Hey London! We’d like to take this opportunity to thank you for your overwhelming support in our first month. Your demand has exceeded our expectations and we’re working hard to serve even more Londoners.<br><br>Regarding the app update, we’ve enriched the information of products and made it accessible for you under Details, Ingredients, and Nutrition Table. Also, did you know that in each Getir order, you can get a promo on one of our select products? Don’t leave without a discount!"},{"version_id":"840728752","version_name":"2.6.14","version_date":"2021-03-03 22:22:57.000 +0800","version_description":"Hey London! We’d like to take this opportunity to thank you for your overwhelming support in our first month. Your demand has exceeded our expectations and we’re working hard to serve even more Londoners.<br><br>Regarding the app update, we’ve enriched the information of products and made it accessible for you under Details, Ingredients, and Nutrition Table. Also, did you know that in each Getir order, you can get a promo on one of our select products? Don’t leave without a discount!"},{"version_id":"840950769","version_name":"2.6.15","version_date":"2021-03-26 16:59:15.000 +0800","version_description":"Update o’clock! Our app no longer requires location services access to use the app. Ultimately we do need an address from you to make the delivery, while maintaining your super-easy Getir experience.<br><br>Next up, if you open the Getir app, but for many reasons are not in the coverage area (travel perhaps? Oops forgot that we’re in 2021), we’ll connect you to a virtual location so you can still get a vibe for what Getir offers. Great vibes. That’s what we offer, plus groceries delivered in minutes.<br><br>Over and out! See you at the next update."},{"version_id":"841754628","version_name":"2.6.16","version_date":"2021-04-23 17:05:02.000 +0800","version_description":"[insert unicorn emoji] but this field doesn't support emojis! Jokes aside, thank you all for believing in us, giving us a shot, and being awesome customers as our global company is now in the exclusive list of unicorn companies. We're only valuable because you're immensely valuable. <br><br>Now back to the technicalities! We're rolling out some new tools where we'll ask you to rate your overall experience. Why? Because it's our job to constantly make your app experience better! <br><br>Over and out! See you at the next update."},{"version_id":"842089601","version_name":"2.6.17","version_date":"2021-05-07 17:48:02.000 +0800","version_description":"This update is for your security. Now, after logging out of your Getir account via \"Logout\" option, we’ll send you an SMS while logging back in. Thus, you will be able to continue to use Getir more securely with the SMS verification code we will send to your registered mobile phone.<br><br>That's all for now :)"}]