[{"version_id":"832471994","version_name":"1.0.0","version_date":"2020-03-17 22:03:38.000 +0800","version_description":""},{"version_id":"835168401","version_name":"1.0.1","version_date":"2020-03-21 03:58:11.000 +0800","version_description":"We heard your feedback and squashed some bugs in this release! Be sure to send us your feedback on how you're using GitHub for iOS.<br><br>• FIXED Navigating to a pull request or issue from within the context of another pull request or issue now renders c"},{"version_id":"835443178","version_name":"1.1.0","version_date":"2020-04-13 23:29:53.000 +0800","version_description":"We are listening to all of your wonderful feedback, and this update includes some of the most-requested features as well as improves the overall experience. Here's just the highlights of this update:<br><br>• Typing \"@\" in a comment, issue, or review will"},{"version_id":"835688456","version_name":"1.1.1","version_date":"2020-04-28 23:18:25.000 +0800","version_description":"We are listening to all of your wonderful feedback, and this update includes some new features and workflow improvements. Here's just the highlights of this update:<br><br>• New preference to open links in external browsers<br>• Text rendering now support"},{"version_id":"835773553","version_name":"1.1.2","version_date":"2020-05-13 05:06:39.000 +0800","version_description":"We are listening to all of your wonderful feedback, and this update includes some new features and workflow improvements. Here's just the highlights of this update:<br><br>• Improved code review flow on iPad<br>• Improved comment scrolling performance<br>"},{"version_id":"836181564","version_name":"1.2.0","version_date":"2020-06-09 17:51:37.000 +0800","version_description":"• Improved pull request review experience — support for marking files as viewed, collapsing files, deleted files, and more. <br>• Markdown, image, and PDF files now render when clicked on while browsing code<br>• Organization badges on user profiles link "},{"version_id":"836341875","version_name":"1.2.1","version_date":"2020-06-26 03:18:36.000 +0800","version_description":"New Features:<br>• Delete a branch after merging a pull request! Keep that repo tidy and prune branches as your merge your pull requests<br>• Introducing line numbers on Browse Files! Make it easier to discuss a line of code by referencing the exact line "},{"version_id":"836745660","version_name":"1.2.2","version_date":"2020-07-11 02:20:34.000 +0800","version_description":"New Features:<br>• Introducing Explore! Find new trending repositories, recommended just for you.<br>• Introducing a new editor for new Issues and comments with Markdown highlighting!<br>• Introducing code display settings! Tweak font sizes, show line num"},{"version_id":"837046062","version_name":"1.2.3","version_date":"2020-08-04 02:45:45.000 +0800","version_description":"Improvements: <br>- The search bar always appears on Explore to make it easier to find what you’re looking for.<br>- Improved color contrast for icons throughout the app<br>- Improved accessibility for VoiceOver users.<br>- Enabled support for multiple wi"},{"version_id":"837225393","version_name":"1.2.4","version_date":"2020-08-12 05:25:00.000 +0800","version_description":"Improvements:<br>• Updated design of repositories on the Home tab.<br>• Introducing a new sidebar-style layout for iPad. To enable it, go to settings under Feature Preview. <br>• New \"marked as draft\" timeline event for pull requests<br>• Buy a GitHub Pro"},{"version_id":"837338422","version_name":"1.2.5","version_date":"2020-09-03 05:04:16.000 +0800","version_description":"What is New:<br>- You can now view markdown files as a raw file.<br>- User avatars are now rendered as circles and organizations are rounded rectangles, helping to distinguish them more easily.<br>- We introduced a beautiful button for adding your review "},{"version_id":"837700299","version_name":"1.2.6","version_date":"2020-09-10 02:50:02.000 +0800","version_description":"What's new:<br><br>- We added a new sidebar to the iPad app, making it easier to navigate the app and faster to browse your stuff. If it's ever in the way, you can collapse the sidebar.<br>- We improved the pull request merge flow by fixing several icon, "},{"version_id":"837890156","version_name":"1.2.7","version_date":"2020-09-22 20:48:29.000 +0800","version_description":"What's new:<br>- View Readmes on people's profiles<br>- Enable the new \"Multiline Comments\" Feature Preview and long-press (or two-finger drag) to leave a comment on multiple lines of code.<br><br>Bug fixes:<br>- Several iPad side bar loading bugs and cra"},{"version_id":"837903907","version_name":"1.2.8","version_date":"2020-09-24 00:34:10.000 +0800","version_description":"What's New:<br>• View Readmes on people's profiles<br>• Enable the new \"Multiline Comments\" Feature Preview and long-press (or two-finger drag) to leave a comment on multiple lines of code.<br><br>Bug Fixes:<br>• Several iPad sidebar loading bugs and cras"},{"version_id":"837926290","version_name":"1.2.9","version_date":"2020-09-29 20:00:08.000 +0800","version_description":"# What's New<br><br>• Introducing a localized experience with GitHub for iOS! Enjoy using the app in Spanish, Japanese, Chinese and Brazilian Portuguese<br>• Introducing merge options for merge commits, squash and merge, and rebase and merge commits! Cust"},{"version_id":"838100237","version_name":"1.3.0","version_date":"2020-10-14 18:55:52.000 +0800","version_description":"What's New<br><br>• Introducing horizontal scrolling for code within pull requests, commits, and browsing code! Don't want to see your code line wrapped? Set your preferred line wrapping setting in Profile &gt; Settings &gt; Code Settings.<br>• Introducin"},{"version_id":"838308170","version_name":"1.3.1","version_date":"2020-10-26 21:24:44.000 +0800","version_description":"## What's New<br><br>• Introducing suggested changes within comments! Create suggestions on pull requests after selecting lines, and apply them with the tap of a button.<br>• Introducing ability to edit commit message for the merge commits.<br>• Trigger h"},{"version_id":"838505455","version_name":"1.3.2","version_date":"2020-11-10 18:15:21.000 +0800","version_description":"What's new<br><br>• Cross-referenced issues and commits have an updated design in pull requests and issues.<br>• Copy file paths and browse specific files within pull requests by tapping the ••• button when browsing diffs.<br>• Check-run badges now show w"},{"version_id":"839259000","version_name":"1.3.3","version_date":"2020-11-24 20:11:56.000 +0800","version_description":"What's new<br><br>- Search has moved from the Explore tab to the Home tab, allowing you to quickly search for issues, pull requests, repositories and more.<br>- A new Profile tab makes it easier to get to your profile from anywhere in the app.<br>- Long-p"},{"version_id":"839448190","version_name":"1.3.4","version_date":"2020-12-08 23:22:39.000 +0800","version_description":"What's new<br><br>- Introducing bulk actions for your Notifications! Select multiple notifications to mark them as done or save them for later with just a few taps. <br>- Get through your notifications faster with the right swipe actions for your workflow"}]