[{"version_id":"815575765","version_name":"1.1.1","version_date":"2015-12-29 16:19:24.000 +0800","version_description":"• Fixed a bug that caused crashes on Apple Watch;<br>• Improved URL Schemes;<br>• Fixed a problem with Cups unit symbol in the Cooking category;<br><br>If you like Amount Plus, please consider leaving an App Store review!"},{"version_id":"815843018","version_name":"1.1.2","version_date":"2016-01-12 15:05:40.000 +0800","version_description":"• Fixed a bug with compound unit conversion: now it’s possibile to input numbers with trailing zeros like 5.10;<br>• Fixed a bug that sometimes caused the freezing of the app when swiping between screens;<br>• Currency conversions now doesn’t use scientific notation anymore;<br>• You can now dismiss the Compare screen by swiping down (iPhone);<br>• Improved responsiveness when reordering lists;<br>• Fixed some minor glitches;<br><br>If you like Amount Plus, please consider leaving an App Store review!"},{"version_id":"816603370","version_name":"1.1.3","version_date":"2016-03-06 20:10:37.000 +0800","version_description":"• You can now add 18 maximum starred shortcuts on every device (iPhone);<br>• Added shortcut “sorting” and “clear all” options;<br>• Added “Sound”, “Transportation Cost” and “Textile Yarn” categories;<br>• Added new units in the “Length and Distance” category;<br>• You can now long press the keyboard number to paste a new one from the clipboard;<br>• Fixed some issues with the keyboard while using the filter bar;<br>• Fixed an issue that caused the keyboard to show 0.0000 when opening the app from the Notification Center;<br>• Fixed some UI issues with dark themes;<br><br>If you like Amount Plus, please consider leaving an App Store review!"},{"version_id":"817452281","version_name":"1.2","version_date":"2016-06-08 07:07:57.000 +0800","version_description":"So, here I am, writing in the changelog section what I changed from the previous version of Amount Plus, even if you probably won’t read this at all. Because let’s say that, who reads the changelogs? Anyway, let’s begin!<br><br>As a details maniac and a tireless perfectionist, I changed the user interface a bit, again, to provide a better user experience for you, so now some buttons are more understandable and it’s clear what the heck they do. Also, if you are using dark themes the search fields are now darker, because you know, dark themes are supposed to be, well, dark ;)<br><br>Animations are now smoother, and cooler, and better. Because I like animations, and so you do, right? <br><br>Now the interesting part: you can now change units when you’re in the compare screen. If you don’t know what the compare screen is, it’s the screen that appears when you select a starred shortcut or use the Notification Center. This will come in handy if you are converting more than a unit at once and want to easily swap the values. So now, you can convert units in a new way, which is cool since this app is a unit converter, after all.<br><br>Also, there are a lot of minor changes, like click sounds on the keyboard, a new copy and paste function, and some other fixes to bugs that you probably didn’t know about.<br><br>That’s it. Wow, that’s a lot of text, but again, you probably are not reading this, so I can continue writing some useless and senseless stuff. Blablabla, abracadabra alakazam! abcdefghijklnm... No wait, it’s lmno... Yeah, lmnopqrstuvwxyz! Finally, I completed the alphabet! So difficult man :D But... Wait a minute. If I change the order of the letter is technically still the alphabet, right? So, writing abijklceyzfgopqnturdxsvwhm is still the alphabet. Whoa! Mind. Blown. But it sound SO wrong. Better stick with abcdefghijklmnopqrstuvwxyz. Yup, so much better. <br><br>Oh! You’re still here! Well, in this case let me thank you for your patience and support then! You deserve it!<br>If you like Amount Plus please feel free to leave a review on the App Store! They’re free and really useful for me and other users, and you will make me a happy person (but only if it’s a 5 star review, otherwise I’ll be really sad and you should never make a person sad). <br>And you can also contact me to let me know how much you like the app or just because you don’t have anything better to do right now (you can do it from inside the app, because the button works now :D)<br><br>See you, and have fun with the new version of Amount Plus!"},{"version_id":"824374086","version_name":"1.2.1","version_date":"2017-11-12 23:37:08.000 +0800","version_description":"Hi! Long time we no see! I know, I know, you're angry because I left you alone for quite a while, but don't panic, the app has been working pretty fine ;) Even with the new iPhone X the app never had one problem, except for that notch at the top of the screen that required my intervention. <br><br>So, if you're one of those extremely lucky that has an iPhone X, from now on you'll be even more lucky because you can use Amount Plus completely optimized for your new device (if I was you I'd tell everyone about that, it's not something you see every day, such an exquisite app that works so well).<br><br>Everything else is the same as before, solid and functional. I just added a little small feature, but I won't tell you what it is, you have to find that yourself!<br><br>\\m/"},{"version_id":"828188200","version_name":"1.2.2","version_date":"2018-08-10 19:24:35.000 +0800","version_description":"This app has been updated by Apple to use the latest Apple signing certificate.<br><br>• Currencies fixed! :D"}]