[{"version_id":"818329062","version_name":"1.0.1","version_date":"2016-08-07 23:07:16.000 +0800","version_description":""},{"version_id":"819030465","version_name":"1.0.3","version_date":"2016-09-27 03:18:30.000 +0800","version_description":"New!【2016年9月29日更新内容】<br>=====为祖国庆生，国庆节主题活动上线！=====<br>9月29日-10月9日，丰富精彩的国庆节活动等待勇士们体验！<br>1）每日登录游戏即可领取豪华国庆大礼包；<br>2）活动期间参与每日活动可获得国庆道具卡，集齐指定卡片即可兑换丰富道具奖励；<br>3）完成系列任务将获得开启豪华宝箱的钥匙，开启宝箱可获得惊喜大奖；<br>4）奥兰回响收集解封道具，了解永恒大陆的过去的同时，更可获得国庆专属称谓哦！<br>=====善恶终有报，通缉玩法开启！=====<br>在PVP区域被敌方击杀后，可以发布通缉任务给自己的好友或公会成员，通缉敌方的队长；40级以上玩家可接取通缉任务，击杀被通缉的对象可以获得大量的金币及战功奖励。<br><br>【其他优化调整】<br>1、永恒之战击杀巡逻队分数下调20%；<br>2、封魔活动：击败魔王和魔物后获得的道具奖励小幅上调；<br>3、找回功能：增加“职业挑战”活动、“武道会”活动、“海贼入侵”活动的奖励找回；<br>4、55级（含）以上增加了“精灵崛起”的支线任务；<br>5、牧师系伙伴的第三天赋变更，原附加“命中”修改为“抗暴”；<br>6、参加公会战时，在战场中每隔一段时间就会获得一定的经验奖励；<br>7、参与公会战时，击杀敌人获得的积分上调；<br>8、摘星塔增加至9层，可以参与8场摘星塔战斗；<br>9、摘星塔匹配规则优化，变得更容易匹配到对手了；<br>10、常用表情在聊天界面的排序放在了前面；<br>11、队伍中离线托管的时间上调，在队伍中时，离线后依然能保持30分钟在线状态（从20分钟上调）；<br>12、商人罗伦处的元素兑换增加混沌石，需消耗5颗万能元素可兑换1颗混沌石；<br>13、在聊天时发送的屏蔽字，由原本的\"**\"修改为“—哔—”的字样；<br>14、巡逻队修正：转阵营后，不会再入选原阵营的巡逻队；<br>15、背包中，公会建设令的排序前移；<br>16、背包中，混沌石和万能元素的最大堆叠数量修改至999；<br>17、职业挑战礼包改为可以批量快捷使用；<br>18、EXO转盘功能放入福利，和登录转盘合并，原登录转盘入口改为EXO转盘，可使用标签切换2个转盘；<br>19、宝石城堡委托扫荡一次的价格由5钻下调为1钻；<br>20、现在可以在公会排行榜上点击指定公会名称，弹出“申请加入”和“联系会长\"按钮；<br>21、公会宣言输入界面位置上调，解决部分iOS设备上按钮被输入框挡住的问题。"},{"version_id":"819226626","version_name":"1.0.9","version_date":"2016-10-19 23:02:36.000 +0800","version_description":"New!【2016年10月20日更新内容】<br>=====幻想之翼，开启全民翎羽纪元！=====<br>幻想之翼翅膀系统绚丽登场，主角等级达到50级即可开启，60级开启翅膀技能。29级完成幻想之翼任务，可获得翅膀外观体验道具，穿戴翅膀。<br>1）翅膀培养属性加成：翅膀升级和升星可为主角增加属性，翅膀技能为伙伴增加属性；<br>2）华丽外观等你解锁：翅膀升星到三阶将解锁全新的翅膀外观，炫酷拉风，羡煞旁人；<br>3）终极翅膀技能登场：【神圣抵抗】：可让主角在战斗中抵抗致死伤害；【狼牙降临】：使主角在战斗开场变身灵祭神狼牙，对敌方造成持续性毒伤害。<br>=====积分竞技场，伙伴接力挑战巅峰！=====<br>主角等级达到70级后，竞技场中开启了积分竞技场模式。可通过在积分竞技场中战斗获取积分，每周凭积分排行榜来获取丰厚奖励，包含幻翼技能箱、星魂石、轻羽等翅膀培养相关道具。前3名还将获得炫酷称谓！在积分竞技场中可使用最多8个伙伴，4个主力伙伴4个替补伙伴，替补出场的伙伴将满怒气登场！<br>=====限时鲜花榜，夺炫酷称谓，赢神魂碎片！=====<br>活动时间：10月20日维护后至10月27日21:00，前十名有丰厚奖励，包含60级橙装碎片、60级万能残卷，最高可得乌拉、不知火舞招募卡，更有神魂碎片等你拿！前三名还有绝美称谓哦！（可通过【社交】-【魅力鲜花榜】预览排名奖励）<br>=====恭迎勇士回归，代金券等奖励登录领！=====<br>活动时间：10月20日-11月4日。活动参与条件：10月20日10:00前连续未登录达到5日或15日，角色等级达到40级以上，可获得不同的回归礼包，达到回归条件的玩家可领取回归大礼，且连续登录7日每日均可领取丰厚回归奖励，达到连续15日未登录的玩家还可领取现金代金券奖励。<br><br>【其他优化调整】<br>1、重置了首充状态，10月20日维护后可再次享受首充奖励、钻石档位首充翻倍奖励；<br>2、新增75级野外BOSS，几率掉落70级橙色装备材料、神魂碎片等；<br>3、众神试炼活动奖励中增加了星魂石道具；<br>4、增加了拒收陌生人消息的设置；<br>5、优化了藏宝图使用机制，队长可以使用藏宝图了；<br>6、优化了自动接受组队，在公会地图中将不再接收组队平台的邀请；<br>7、战斗中怒气未满的状态下人物模型在原地也会出现虚影，方便操作；<br>8、增加了收徒次数限制，每个师父每天最多只能收徒3次；<br>9、优化了iOS下聊天消息发送按钮的位置，不再被键盘遮挡；<br>10、解决了队伍列表排序问题，根据进入队伍先后排序；<br>11、解决了战斗内队员站位问题，根据进入队伍先后站位；<br>12、解决了伙伴献祭界面显示错乱导致出现重复伙伴的问题；<br>13、修正了不知火舞必杀技能辅目标无法命中状态的错误；<br>14、修正了哥布林死亡后BUFF技能未正确清除的错误；<br>15、解决了战斗内无法正确释放必杀技的异常状态问题；<br>16、聊天语音消息发出后，增加“正在翻译中”的提示；<br>17、限购商城增加翅膀相关道具幽梦恶魔残片、星魂石、灵羽。"},{"version_id":"819411935","version_name":"1.0.10","version_date":"2016-10-24 02:56:22.000 +0800","version_description":"New!【2016年11月24日更新内容】<br>===== 开启异界时空之门，寻找散落着的伙伴记忆碎片！=====<br>1）主角65级组队可以进入威尔港的异界之门，进行高难度战斗，通关后可以获得对应伙伴魂石；<br>2）首次通关可领取首通大礼，内含大量相应伙伴魂石、60级万能残卷、60级橙装碎片等，每完成3关可以获得一份神秘大礼；<br>3）异界之门战斗时有机会遇到黄金喵喵，击败后可获得黄金喵喵的背包，打开后有机会获得高级藏宝图、神魂碎片等稀有道具；<br>4）带领没有通关的玩家时，还会获得额外奖励哦；<br>5）异界之门每天可以参与3次。<br>=====高级师徒功能上线，丰厚奖励等你拿！=====<br>1）新增高级师徒玩法，可以通过【社交】界面的【师徒】标签参与；<br>2）等级达到75级，且战力达到40万，可以进入高级导师列表；<br>3）等级达到60级，可以找到高级导师列表中战力高于自身15万的导师拜师；<br>4）高级徒弟等级达到75级，且战力在徒弟期间提升15万（战力至少要达到35万）时可以完成高级出师；<br>5）35万战力以上的高级徒弟，每次提升到整数万战力时，师徒双方都会获得徒弟提升礼包，可以随机获得万能元素、天赋残卷、职业魂石包、幽梦恶魔残片、幻羽、大经验药水中的任意一种；<br>6）高级师徒采用的是历史最高战力，战力一旦提升，不会下降。<br>=====神级伙伴开放炫酷外显特效！=====<br>神级伙伴达到红色三星后，可以获得更加炫酷的外显特效！<br><br>【其他优化调整】<br>1、11月24日至11月29日，限时商城增加感恩回馈礼包和感恩回馈小礼包，每天可购买一个，超值价格丰富奖励；<br>2、巅峰等级开放至200级；<br>3、降低了公会战中采集到炸弹的概率；<br>4、系统公告优化，现在获得的所有稀有道具都会在一条公告中显示；<br>5、优化了积分竞技场的阵法显示，现在可以看到对方阵法了；<br>6、解决了偷看离线跳舞的玩家，称谓显示错误的问题；<br>7、解决了在返回封地时，自动寻路中特效不消失的问题；<br>8、解决了永恒之路78级任务无法完成的问题；<br>9、解决了摘星塔可能无法匹配的问题；<br>10、解决了15级解锁阵营时，阵营标签显示错误的问题；<br>11、解决了展示财富包时，地牢钥匙数量显示错误的问题；<br>12、积分竞技场界面增加“我的排名”显示；<br>13、去掉奥兰城中的双十一活动大使NPC。"},{"version_id":"820067741","version_name":"1.0.13","version_date":"2016-12-09 03:48:34.000 +0800","version_description":"New!【2016年12月8日更新内容】<br>=====水晶之恋，爱与正义的冒险之旅！=====<br>全新结婚系统登场，角色达到50级，好友度达到800的两名勇士即可共赴红毯，进入婚姻殿堂！<br>1）转换性别：战士、法师的默认性别为男性；牧师、弓手的默认性别为女性；各位勇士可以在安德里神父处更改自己的性别，首次更改性别免费；<br>2）订婚：订婚是迈入婚姻殿堂的第一步，勇士大人可以带着自己的异性伴侣，举行订婚仪式；<br>3）婚礼：结婚共分为简约、经典、奢华三种品质，不同品质婚礼仪式不同，获得的婚戒属性不同，奢华婚礼将获得超炫称谓，并加入称谓收集；<br>4）离婚：可以在安德里神父处离婚，分为协议离婚、强制离婚两种方式；<br>5）伴侣树：结婚后将获得伴侣树，伴侣树会通过大家的浇灌成长，伴侣树越高，婚戒的加成属性越高。每周日23:59，伴侣树排行榜第一名的夫妻将会获得【模范夫妻】酷炫称谓，同时该称谓也将加入称谓收集。<br><br>=====远古战场，公会伙伴协力作战！=====<br>1）远古战场为定时活动，每周三21:00-21:30开启，需要同公会至少两人组队才可进入；<br>2）远古战场共4层，首次传入战场时，队长选择从八个入口的任意一个入口传入第一层；<br>3）活动开始后先刷小怪，5分钟后在随机点位刷出BOSS，击杀BOSS后自行寻找入口进入下一层；<br>4）活动中可以击杀非同公会的玩家，被杀死3次后传出活动场景，本次活动时间内无法再次进入，争取存活下来夺取最终奖励。<br><br>=====新章节！第八章·恐惧国度来袭！=====<br>1）通关第七章试炼、等级达到78级的玩家将开启第八章新试炼。集星宝箱，新成就，新圣晶碎片等你来拿；<br>2）等级达到78级的玩家，可自动接取第八章新主线任务，揭开在死神手中虚幻圣晶碎片的幻境之旅，完成任务，得豪华奖励：海量经验、金币、技能点，更有精炼材料、职业魂石包、万能元素等丰厚奖励。<br><br>=====恭迎勇士回归，代金券等奖励登录领！=====<br>1）活动时间：12月8日10:00:00 至 12月18日23:59:59；<br>2）活动期间，角色达到40级且满足5日及以上天数未登录玩家再次登录，可参与该活动，可领取：钻石，橙色经验卡等道具，每日都有不同好礼，第七日更可获得10元代金券，月光精灵残片，幻翼技能箱等；<br>3）满足15日及以上天数未登录玩家再次登录，奖励豪华升级！第七日更有50元代金券等你来拿。<br><br>【其他优化调整】<br>1、重置了首充状态，12月8日维护后可再次享受钻石档位首充翻倍奖励；<br>2、挖宝排行榜奖励调整，名次越高奖励越好；<br>3、武道会活动修改为每周周五一场，奖励提升；<br>4、VIP商城新增精炼卷轴强化材料礼包；<br>5、永恒之路奖励预览优化，长按道具图标可查看道具说明；<br>6、异界之门界面优化，战斗结束后，不再重复播放动画；<br>7、异界之门首次通关玩家展示优化，玩家昵称完整显示，不再换行显示；<br>8、解决了公会答题求助按钮概率性失效的问题；<br>9、修复了永恒之战通过进场提示框，可将等级不符合参与条件的角色传送至战场的错误。"},{"version_id":"820418412","version_name":"1.0.14","version_date":"2017-01-18 18:07:53.000 +0800","version_description":"New!【2017年3月2日更新内容】<br>==全新玩法灵脉争夺上线，运送！抢夺！激烈开战！==<br>1）活动时间：每周三、周六19：30至19：50；<br>2）活动限制：70级以上且加入公会；<br>3）勇士可在公会场景内寻找灵脉争夺使参与该活动；<br>4）活动持续期间，使用伙伴运送晶矿或者抢夺其他玩家的晶魄，可获得70级万能残券等高额奖励；<br>5）成功运送晶矿后，可在短时间内为伙伴增加可观的战斗属性。<br><br>===== 女生节任务来袭，开启浪漫邂逅！=====<br>1）活动时间：2017-03-06 00:00:00至2017-03-08 23:59:59；<br>2）活动等级：30级以上单人参加；<br>3）女生节来啦！！全民女生节！！男神女神们都准备好了吗？！做单身狗一直想入非非的事情，比如：给她超级惊喜送她鲜花；以约会为目的的送她回家；想到最浪漫的事情就是陪她躲雨；帮她赶走巷口的小怪兽……小声告诉你，完成任务会有意外惊喜的礼品哦！（青玉锦、碧水丝、洗炼沙）事不宜迟，赶紧行动起来吧！<br><br>【其他优化调整】<br>1、神秘商店出售75级野外BOSS魔契，每日限购1个；<br>2、武道会每场战斗结束后奖励增加竞技场积分；<br>3、赤焰地牢排行榜增加奖励预览界面，同时调整排行榜奖励，增加时装洗练道具奖励；<br>4、公会战分配奖励，最强王者组的冠军公会可分配的70级万能残卷数量提高到5个；<br>5、招募奖励调整，各招募类型都添加了翅膀、时装和伙伴饰品的道具奖励；<br>6、新开放5个可觉醒的伙伴，分别为：死神路德维希、堕天使露西比、哥布林基诺、树怪戈隆和幼龙多拉格；<br>7、修复了C级时装融合成功率超过100%后，融合失败的问题；<br>8、修复了爱护萌新状态进入战斗，自动战斗未开启的问题；<br>9、修复了同时建造两个建筑，一个建造完成之后，战斗力显示异常的问题；<br>10、修复了公会战分配奖励，分配完后红点仍然显示的问题；<br>11、修复了被死神复活的单位，2个回合后不会死亡的问题。"},{"version_id":"821444347","version_name":"1.0.15","version_date":"2017-03-27 05:43:04.000 +0800","version_description":"New!【2017年3月23日更新内容】<br>===== 全新等级开放，迎接崭新旅程！ =====<br>1）主角和伙伴等级上限开放至89级，全新主支线剧情到来；<br>2）主角和伙伴80级技能全新效果，部分伙伴80级技能得到调整；<br>3）主角达到80级时可以接取8阶任务，高难度战斗等你挑战；<br>4）精炼等级、翅膀等级、时装强化、饰品精炼等均开放新阶段，可继续提升；<br>5）全新80级橙装，助力属性提升，解锁炫酷外观；<br>6）新野外BOSS、众神试炼等将在之后版本陆续登场，敬请期待。<br><br>===== 答题新姿势，博学达人一争高低！ =====<br>1）活动时间：每隔一周的周五19:30到20:00；首次开放时间：2017-03-31 19:30；<br>2）活动等级：50级以上可以参加；<br>3）答题活动全面升级！在这里，无关等级、无关战力，只要你的知识储备够丰富，就能捧走丰富奖励！在活动场景内不仅会持续获得金币和经验，优秀者还会获得露西比魂石、70级万能残卷、时装等丰厚奖励！快去一决高下吧！<br>4）活动前三名玩家还将获得全新称谓，可以激活称谓收集的属性哦！<br>5）每周五到下周四(7天)内，只需要有任意5天参与公会答题即可获得两枚公会答题令牌，使用令牌可在博学达人活动中让系统自动作答选择正确答案，快去参与公会答题温故知新吧！<br><br>===== 丰厚福利限时商城精彩放送！ =====<br>1）3月24日至3月29日期间，限时商城增加多种限时礼包，多折优惠，一定要来看看哦；<br>2）72级项链戒指残卷礼包首次加入限时商城，活动期间内，该种礼包最多可购买10次。<br><br>【其他优化调整】<br>1、修复了灵脉争夺增加的属性未及时消失的问题；<br>2、修复了阵营领袖发言没有屏蔽字限制的问题；<br>3、修复了升级低级翅膀技能-灵动，属性显示错误的问题；<br>4、修复了被死神复活的单位可能不会死亡的问题；<br>5、修复了模范夫妻称谓在有效期内可能消失的问题。"},{"version_id":"821507150","version_name":"1.0.17","version_date":"2017-04-05 18:12:48.000 +0800","version_description":"New!【最新版本更新内容】<br>1、全新坐骑系统登场，角色达到71级即可开启坐骑系统，可萌可酷，绚丽拉风！<br>2、全新等级解锁，主角和伙伴等级上限开放至89级，全新主支线剧情到来！<br>3、80级野外BOSS震撼来袭，延续经典，组队策略战斗！<br>4、休闲小游戏入驻永恒之歌，在紧张的冒险之余快来和小伙伴们比拼手速吧！<br>5、全新时装——学院派系列，体味那段青葱岁月带给我们的欢笑与感动！<br>6、老朋友好久不见，重登永恒大陆与战友并肩作战，专属福利等您领取！"},{"version_id":"821956749","version_name":"1.0.18","version_date":"2017-05-04 02:14:20.000 +0800","version_description":"New!【最新版本更新内容】<br>1、全新坐骑系统登场，角色达到71级即可开启坐骑系统，可萌可酷，绚丽拉风！<br>2、全新等级解锁，主角和伙伴等级上限开放至89级，全新主支线剧情到来！<br>3、80级野外BOSS震撼来袭，延续经典，组队策略战斗！<br>4、休闲小游戏入驻永恒之歌，在紧张的冒险之余快来和小伙伴们比拼手速吧！<br>5、全新时装——学院派系列，体味那段青葱岁月带给我们的欢笑与感动！<br>6、老朋友好久不见，重登永恒大陆与战友并肩作战，专属福利等您领取！"},{"version_id":"823223620","version_name":"1.0.19","version_date":"2017-08-16 00:12:11.000 +0800","version_description":"New!【最新版本更新内容】<br>1、周年庆典燃情来袭，登陆就送稀有道具，大家嗨起来！<br>2、周年最强福袋，只有你想不到的，没有你得不到的！<br>3、全新野外BOSS震撼来袭，延续经典，组队策略战斗！<br>4、最强夏日时装-清新夏日系列清凉来袭，让你在盛夏中清凉度过！<br>5、老朋友好久不见，重登永恒大陆与战友并肩作战，专属福利等您领取！"},{"version_id":"825781984","version_name":"1.0.20","version_date":"2018-01-29 05:20:40.000 +0800","version_description":"New!【最新版本更新内容】<br>~~~重要：机型已经适配Iphone X<br>1、周年庆典燃情来袭，登陆就送稀有道具，大家嗨起来！<br>2、周年最强福袋，只有你想不到的，没有你得不到的！<br>3、全新野外BOSS震撼来袭，延续经典，组队策略战斗！<br>4、最强夏日时装-清新夏日系列清凉来袭，让你在盛夏中清凉度过！<br>5、老朋友好久不见，重登永恒大陆与战友并肩作战，专属福利等您领取！"}]