[{"version_id":"817337008","version_name":"1.1","version_date":"2016-05-18 03:02:40.000 +0800","version_description":"• There are now charts so you can view trends over a period of a week, month, or year. Look for the chart icon in the toolbar of the habit's detail page.\n\n• The habit/task bar is now customizable. The habit name and your goal progress will always be there. You can now choose whether to see streaks (default), number of times in your goal period, or number of times to go till your goal is completed.\n\n• You can also customize the text below the habit name. You can now choose to see a goal summary (default), last time since you logged the habit, current streak, or a motivational message (that you set in the create/edit habit screen).\n\n• You can now export a CSV file with all your data (Premium Version Only). Look for this in the Settings.\n\nThanks to all for the feedback and suggestions!"},{"version_id":"817651584","version_name":"1.1.1","version_date":"2016-06-07 09:23:50.000 +0800","version_description":"Some users were receiving notifications for habits they had deleted or were receiving multiple notifications for a habit. These have been fixed! Sorry for the inconvenience.\n\nThanks to all who emailed us with feature requests or bug notifications. More features are in the works.\n\nAnd thanks to all for using DONE."},{"version_id":"818845757","version_name":"1.2","version_date":"2016-10-12 06:57:28.000 +0800","version_description":"• You can now manually order your Habits  (go to SETTINGS to set the order)\n• CREATE screen now has ideas for new habits\n• Some fun new sounds\n• Habit detail screen remembers your last view (chart or calendar)\n• Improved performance using the calendar\n• QUIT habits can now set a goal target of '0'\n• You must now explicitly set a '0' for QUIT habits - each period starts at with a  count of ‘--‘ rather than 0. (We did this because some users said they weren't sure if the count was in fact '0' or if they just forgot to enter a count for that day) \n\nThanks for your emails - more features are on the way. And thanks for using DONE!"},{"version_id":"819782212","version_name":"1.3","version_date":"2016-11-23 02:11:03.000 +0800","version_description":"• You can now create a save notes for your habit each and every day.\n• Have a habit that you want to take a break from and come back to later? Now you can ARCHIVE the habit, which will remove it from your main list, but save it for later use in an 'ARCHIVE' list (found in Settings).\n• Do you have a habit you only want to track on weekdays? Now you can choose which days will count toward your goals/streaks. DONE will still keep track of activities you add on untracked days, it just won't count them towards your goal completions and streaks.\n• Not sure what which habit you've done TODAY? Now you'll see a checkmark on habits with an activity logged TODAY.\n• Now you can track your goals on a YEARLY basis. You'll see this option when you ‘Add a Habit’\n\nThanks for all your emails and suggestions - more features are on the way. \nAnd most of all, thanks for using DONE!"},{"version_id":"820399100","version_name":"1.3.1","version_date":"2017-01-07 05:51:53.000 +0800","version_description":"• Fixed a bug that was causing the app to freeze when creating a new habit with NO days selected in the 'TRACK GOALS ON WHICH DAYS?' section.\n• Fixed bug that was causing DONE to hang/freeze on the splash screen when opening. You should now be able to open the app with your data intact.\n\nThanks to those who contacted us and helped us track down the bug. And thanks to all for using DONE."},{"version_id":"821151350","version_name":"1.4","version_date":"2017-05-11 00:37:02.000 +0800","version_description":"New in DONE 1.4:\n• A new summary screen shows stats on all your habit stats in one place.\n• You can now filter your habit list by time period (day, week, etc.), habit type (quit, build), and tracking (active, inactive)\n• Backup your data on Dropbox.\n• Make your data private with a Passcode.\n• Swipe on the habit list, detail and summary views to change days.\n• Habits now display a small (x) in the habit list on days that they are not tracked.\n\nThanks to everyone for the emails and reviews. We are listening! More features are on the way."},{"version_id":"823717979","version_name":"1.5","version_date":"2018-03-08 12:24:17.000 +0800","version_description":"• It‘s now even easier (and faster) to log activity. Now to add a count, just TAP the number on the right side of your habit progress bar. To see your stats and details, just TAP on the HABIT NAME on the left side of your habit progress bar. \n• You can organize your habits into smaller 'GROUPS' for easier viewing. Use the filter to display your habits in a meaningful way.  [Premium Feature]\n• Multiple reminders are finally here! Set as many reminders as you need for each habit. Just keep in mind iOS limits each app to just 64 notifications. [Premium Feature]\n• For those reminders, there's also now a SNOOZE feature as well as a bunch of new sounds to choose from. Looks for these in the SETTINGS.\n• A new icon 'TO-DO' badge will tell you how many habits have no activity. Choose whether to include a habit in the badge when you CREATE/EDIT the habit.\n• A new filter option will show you which habits have counts on that day and which do not. This helps you see which habits still require attention. You can pull down to refresh the list.\n• You can now see that target on the weekly, monthly and yearly charts. QUIT habits have a red target.\n• You can now a custom units label to the bottom of your habit progress bar.\n• If you are viewing habits through a FILTER, the filter icon will now show it is activated.\n\nAs always, thanks to our users for the feedback and suggestions. We are listening!"},{"version_id":"826339652","version_name":"1.5.1","version_date":"2018-04-04 23:34:02.000 +0800","version_description":"• New haptic feedback when you log activity and meet your goals.\n• Due to user feedback, we've converted FILTER: ACTIVITY LOGGED to FILTER: GOAL STATUS. This will allow you to filter on whether a habit's goal has been met or not met, rather than just whether activity has been logged that day. \n• Badges have also been converted accordingly. If you've set a habit to receive badges, you will now see a badge if your habit's goal is UNMET today. If you've logged activity, but your goal is still unmet, you will receive a badge. QUIT habits will never receive a badge, regardless of whether the goal has been met or unmet.\n• Also due to user feedback, we‘ve decided to make the TARGET line in the habit charts optional. You can turn the target line ON/OFF in your habit‘s settings.\n• The current group in the filter is now being saved if the app is restarted. The previous version would only show ALL habits each time the app was restarted."},{"version_id":"826640018","version_name":"1.6","version_date":"2018-04-24 23:36:07.000 +0800","version_description":"• New Done Widget! Easily check progress, log activity and view which goals are still unmet. The widget only shows habits/goals that are tracked today and not yet met.\n\nFor more details, got to SETTINGS -> WHAT‘S NEW\n\nAs always, thanks to our users for the feedback and suggestions. We are listening! And a huge thanks to all who have submitted ratings and reviews. They really help."},{"version_id":"826824167","version_name":"1.6.1","version_date":"2018-04-27 07:48:29.000 +0800","version_description":"• New Done Widget! Easily check progress, log activity and view which goals are still unmet. The widget only shows habits/goals that are tracked today and not yet met. \n• Fixed issue in previous update where users could not see their data if they initially opened the widget before opening the app after the update.\n\nAs always, thanks to our users for the feedback and suggestions. We are listening! And a huge thanks to all who have submitted ratings and reviews. They really help."},{"version_id":"827182754","version_name":"1.7","version_date":"2018-05-31 12:17:28.000 +0800","version_description":"• Now with Apple Watch support\n• New ‘Remove All Icon Badges' button in SETTINGS lets you delete all habit badge reminders at once\n• New general reminder lets you set notifications to remind you to log activity, etc.\n\nThanks again to all our users for the feedback and suggestions. We are listening! And a huge thanks to all for the ratings and reviews for our latest update."},{"version_id":"827722965","version_name":"1.13","version_date":"2019-12-06 05:57:16.000 +0800","version_description":"• Now integrated with Apple’s Health App. You can create goals that link to activities tracked in the Health app such as Calories Burned, Steps, and Stand Hours. To create a Health linked goal, add a new habit and tap the 'IDEAS' button.\n• New support for iOS Shortcuts. Activity logged in the app can now be found in the iOS Shortcuts app and added to a shortcut or Siri. \n• New and improved Apple Watch App. Better performance when syncing activity. You can now hard press to UNDO the LAST activity logged or to manually refresh the watch app.\n• We changed Averages to Completion Rate in your habit stats. See how often you've met your goal.\n• New sounds. Hear a 'celebration' sound when you've completed ALL goals for the day.\n• Widget now supports new iOS 13 Dark Mode.\n\nThanks to all the users who emailed us with feedback. We are listening! And as always, thanks for using DONE."},{"version_id":"827722965","version_name":"1.11","version_date":"2019-05-29 04:31:36.000 +0800","version_description":"Apple Watch:\n• Complications for Apple Watch Series 4 now supported. Progress bars display (# goals with activity / # tracked goals unmet at today).\n• You will now see a checkmark on a habit with activity on the current day.\n\nSmart Reminders:\n• You can now set a reminder to fire 'ALWAYS', only when there is 'NO ACTIVITY,' or only when the goal is 'UNMET'. All existing reminders default to 'ALWAYS'. Note: Reminders will only fire on Tracked Days for Daily and Weekday reminders.\n\nNotes/Journal:\n• You can now access the Journal from the main Habit List by triple tapping (3x) the habit name. \n• Bug Fix: Notes added on previous days from main list now have correct timestamps.\n• Bug Fix: Notes and counts edited in Journal keep original timestamp.\n• Bug Fix: CSV file export now contains all journal notes.\n\nIcon Badge/Notification:\n• Badge now resets after the day is reset (ex. midnight).\n• Badge number now shows number of goals with NO activity, rather than number of goals UNMET.\n\niCloud / Dropbox Backups:\n• Bug Fix: Backups are now faster and working more reliably.\n\nThanks to all for your feedback and reviews. We are listening! And as always, thanks for using DONE."},{"version_id":"827722965","version_name":"1.8","version_date":"2018-10-05 05:01:14.000 +0800","version_description":"• Updated for iOS 12 and new iPhones (iPhone XS Max, iPhone XS and iPhone XR)\n• You can now set the 'Week Start' for WEEKLY habits to any day of the week.\n• You can now set the 'Day Start' to a time after midnight.\n• Habit names can now be up to 40 characters long.\n• Habits now remain in Widget and Apple Watch after goals are met.\n• You can now export all habit activity data with date and timestamps to a CSV file.\n• CSV data can now be exported to Dropbox as well as through Apple Mail (email)\n• Fixed bug where WEEKLY habits were being reset at the wrong time.\n• Fixed bug where archived habits were still showing badge notifications.\n\nAs always, thanks to our users for the feedback and suggestions. We are listening! And a huge thanks to all for the ratings and reviews for our latest update."},{"version_id":"828835391","version_name":"1.8.1","version_date":"2018-10-08 23:53:00.000 +0800","version_description":"• Fixed crashing in Apple Watch"},{"version_id":"828901490","version_name":"1.8.2","version_date":"2018-11-07 01:42:48.000 +0800","version_description":"• Choose between displaying ALL habits or UNMET GOALS  for the Apple Watch's habit list (SETTINGS).\n• Choose between displaying ALL habits or UNMET GOALS  for the Widget habit list (SETTINGS).\n• Widget now shows habit in same sort order as in the app.\n• Exported CSV Files can now be saved directly to your iPhone or to email, SMS, etc. You no longer need to email or save to Dropbox.\n\nThanks again to users for all the feedback. A big thanks to all who have left ratings and reviews as well. All your efforts are a huge help.\n\nHas DONE impacted your life in some way? Help us improve the app by telling us all about it. Look for the link in SETTINGS to share your story."},{"version_id":"829233167","version_name":"1.9","version_date":"2018-11-30 03:12:05.000 +0800","version_description":"• iCloud Backup is finally here! Backup your data to your iCloud account in the SETTINGS.\n• DONE is now part of our new Growth Bundle. Get discounted premium access to our most popular productivity and lifestyle apps. Look for 'What's the Growth Bundle?' in the SETTINGS to learn more. \n• Passcode access now with Face ID.\n• If your day is set to reset AFTER midnight, DONE will now show you your habit list based on your 'adjusted day' rather than the current time. We also fixed a bug where counts were being added to the previous day if you added the count after midnight. \n\nHas DONE impacted your life in some way? Help us improve the app by telling us all about it. Look for the link in SETTINGS to share your story.\n\nAs always, thanks to users for all the feedback. A big thanks to all who have left ratings and reviews as well. All your efforts are a huge help."},{"version_id":"829510338","version_name":"1.9.1","version_date":"2018-12-18 00:01:57.000 +0800","version_description":"• Update for our new Growth Bundle, which now includes journaling apps GRATEFUL and MOODY. For more info about the Growth Bundle, go to http://growthbundle.com or go to Done‘s SETTINGS->WHAT‘S THE GROWTH BUNDLE?\n\nAs always, thanks to our users for all the feedback. A big thanks to all who have left ratings and reviews as well. All your efforts are a huge help."},{"version_id":"830448416","version_name":"1.10","version_date":"2019-03-12 00:12:06.000 +0800","version_description":"1. SUPPORT FOR ENTERING CUSTOM COUNTS \nNo more tapping 5 times to add 5 counts. You can now just type in 5. Or 5.0 because DONE now also supports decimals. As a default, the app works as it did before. A tap on the number will add a count automatically. To add a custom value, go to the habit's settings and under ‘LOG ACTIVITY USING’ select ‘CUSTOM VALUE’. Now every time you tap the number, you‘ll see a popup which will allow you to enter a custom value.\n\n2. NEW REDESIGNED JOURNAL WITH COUNTS & TIMESTAMPS\nWe've redesigned the Note/Journal section of each habit to show both notes AND logged activity. Add notes and log counts directly from this screen. Swipe on the count or note to quickly delete. You can also edit past counts and their timestamps from this screen. \n\n3. ADD MULTIPLE NOTES PER DAY\nThere’s no longer a limit of 1 note per day. Add a note from the main list by double-tapping the HABIT NAME.\n\n4. NEW TIMESTAMP CHARTS\nYou can now see a timestamp graph for each habit. Look for this in each habit's ’Detail’ page as well as in the Summary Charts section.\n\n5. SHAKE TO UNDO\nAdded a count accidentally? You can now UNDO the last count added by shaking the device.\n\n6. BACKUP REMINDERS\nYou will now get backup reminders if you haven't backed up in the past 5 days. If you’d prefer not to receive these, you can turn them off in the SETTINGS.\n\n7. BETA PROGRAM\nWould you like join our Beta Program and get early access to new features as well as give feedback on product development? Tap 'JOIN OUR BETA PROGRAM' in the SETTINGS to register.\n\n8. FUTURE UPDATES\nWant to help us make DONE even better? Tap on the 'HELP US IMPROVE DONE' link in the SETTINGS and give us your thoughts and feedback.\n\n9. THANK YOU\nAs always, thanks for using DONE. A big thanks to all who have left ratings and reviews as well. It’s a huge help."},{"version_id":"830874462","version_name":"1.10.1","version_date":"2019-04-15 23:09:27.000 +0800","version_description":"TIMESTAMPS SIMPLIFIED\n\n1. Timestamp charts now have their own separate page in the Summary section. If you do not wish to see the timestamp charts, you can turn this section off in the app SETTINGS under SUMMARY SETTINGS->TIMESTAMP CHARTS.\n\n2. We’ve simplified adding custom counts and notes in the habit's 'detail screen’ by removing the timestamp selection from the popup. To edit the timestamp of an added count or note, go to that habit's JOURNAL.\n\nThanks to all the users who emailed us with feedback. We are listening! And as always, thanks for using DONE."},{"version_id":"831356354","version_name":"1.11","version_date":"2019-05-29 04:31:36.000 +0800","version_description":"Apple Watch:\n• Complications for Apple Watch Series 4 now supported. Progress bars display (# goals with activity / # tracked goals unmet at today).\n• You will now see a checkmark on a habit with activity on the current day.\n\nSmart Reminders:\n• You can now set a reminder to fire 'ALWAYS', only when there is 'NO ACTIVITY,' or only when the goal is 'UNMET'. All existing reminders default to 'ALWAYS'. Note: Reminders will only fire on Tracked Days for Daily and Weekday reminders.\n\nNotes/Journal:\n• You can now access the Journal from the main Habit List by triple tapping (3x) the habit name. \n• Bug Fix: Notes added on previous days from main list now have correct timestamps.\n• Bug Fix: Notes and counts edited in Journal keep original timestamp.\n• Bug Fix: CSV file export now contains all journal notes.\n\nIcon Badge/Notification:\n• Badge now resets after the day is reset (ex. midnight).\n• Badge number now shows number of goals with NO activity, rather than number of goals UNMET.\n\niCloud / Dropbox Backups:\n• Bug Fix: Backups are now faster and working more reliably.\n\nThanks to all for your feedback and reviews. We are listening! And as always, thanks for using DONE."},{"version_id":"832771761","version_name":"1.12","version_date":"2019-09-16 22:39:46.000 +0800","version_description":"• Fixed numerous stability issues occurring in beta of next version of iOS.\n• Custom values entered with a ',' rather than a '.' for decimal point will now log correctly.\n• Stats now showing average values (beta).\n• 'MET' button in FILTER now working.\n• Smart reminders now working for QUIT habits."},{"version_id":"832894548","version_name":"1.12.1","version_date":"2019-09-27 06:39:02.000 +0800","version_description":"• Fixed some stability issues occurring on iOS 13.\n"},{"version_id":"833843529","version_name":"1.13","version_date":"2019-12-06 05:57:16.000 +0800","version_description":"• Now integrated with Apple’s Health App. You can create goals that link to activities tracked in the Health app such as Calories Burned, Steps, and Stand Hours. To create a Health linked goal, add a new habit and tap the 'IDEAS' button.\n• New support for iOS Shortcuts. Activity logged in the app can now be found in the iOS Shortcuts app and added to a shortcut or Siri. \n• New and improved Apple Watch App. Better performance when syncing activity. You can now hard press to UNDO the LAST activity logged or to manually refresh the watch app.\n• We changed Averages to Completion Rate in your habit stats. See how often you've met your goal.\n• New sounds. Hear a 'celebration' sound when you've completed ALL goals for the day.\n• Widget now supports new iOS 13 Dark Mode.\n\nThanks to all the users who emailed us with feedback. We are listening! And as always, thanks for using DONE."},{"version_id":"833916805","version_name":"1.14","version_date":"2020-06-08 13:19:29.000 +0800","version_description":"New in this version of DONE:\n• Add custom counts, add a note, undo counts, and edit directly from your habit list by swiping left/right on the habit.\n• Reorder your list or view a habit's journal by doing a hard-press on the habit (iOS 13 only)\n• Apple Watch app can now show habits based on GROUP. If you select a GROUP via the FILTER , that GROUP will be displayed in the watch app.\n• A Habit's GROUP is now part of the CSV Activity file.\n\nThanks to all the users who emailed us with feedback. We are listening! And as always, thanks for using DONE."},{"version_id":"836395002","version_name":"1.14.1","version_date":"2020-06-16 00:18:29.000 +0800","version_description":"• Fixed bug that sometimes caused a delay after adding a goal-completing count.\n• Fixed bug that cleared the previous custom value when editing an existing custom count."},{"version_id":"836480149","version_name":"1.14.2","version_date":"2020-06-23 08:06:58.000 +0800","version_description":"• When adding a custom value, text box is now empty rather than showing a default value. "},{"version_id":"836536310","version_name":"1.14.3","version_date":"2020-07-01 21:39:21.000 +0800","version_description":"A few small bug fixes."},{"version_id":"837478605","version_name":"1.15.0","version_date":"2020-08-25 09:49:33.000 +0800","version_description":"Increases performance and fixes some small pesky bugs.\n\nIf you're loving Done, please let us know by leaving a review! :)"},{"version_id":"837502473","version_name":"1.15.1","version_date":"2020-08-26 13:36:45.000 +0800","version_description":"Increases performance and fixes some small pesky bugs.\n\nIf you're loving Done, please let us know by leaving a review! :)"},{"version_id":"838525503","version_name":"1.15.2","version_date":"2020-11-11 04:21:43.000 +0800","version_description":"Increases performance and fixes some small pesky bugs.\n\nIf you're loving Done, please let us know by leaving a review! :)"},{"version_id":"839034559","version_name":"1.15.3","version_date":"2020-11-15 13:01:04.000 +0800","version_description":"Increases performance and fixes some small pesky bugs.\n\nIf you're loving Done, please let us know by leaving a review! :)"},{"version_id":"839581467","version_name":"1.15.4","version_date":"2020-12-13 14:26:09.000 +0800","version_description":"Increases performance and fixes some small pesky bugs.\n\nIf you're loving Done, please let us know by leaving a review! :)"},{"version_id":"839644116","version_name":"1.16.0","version_date":"2020-12-16 01:39:34.000 +0800","version_description":"Increases performance and fixes some small pesky bugs.\n\nIf you're loving Done, please let us know by leaving a review! :)"},{"version_id":"839970738","version_name":"1.16.1","version_date":"2021-01-10 04:22:15.000 +0800","version_description":"Increases performance and fixes some small pesky bugs.\n\nIf you're loving Done, please let us know by leaving a review! :)"},{"version_id":"840303876","version_name":"1.16.2","version_date":"2021-02-02 09:26:22.000 +0800","version_description":"Increases performance and fixes some small pesky bugs.\n\nIf you're loving Done, please let us know by leaving a review! :)"},{"version_id":"841161825","version_name":"1.16.4","version_date":"2021-04-01 21:57:25.000 +0800","version_description":"Increases performance and fixes some small pesky bugs.\n\nIf you're loving Done, please let us know by leaving a review! :)"},{"version_id":"841639196","version_name":"1.16.5","version_date":"2021-04-21 06:06:44.000 +0800","version_description":"Increases performance and fixes some small pesky bugs.\n\nIf you're loving Done, please let us know by leaving a review! :)"},{"version_id":"843055200","version_name":"1.17.2","version_date":"2021-07-17 17:46:57.000 +0800","version_description":"Increases performance and fixes some small pesky bugs.\n\nIf you're loving Done, please let us know by leaving a review! :)"},{"version_id":"843545368","version_name":"1.17.3","version_date":"2021-08-13 01:35:47.000 +0800","version_description":"Increases performance and fixes some small pesky bugs.\n\nIf you're loving Done, please let us know by leaving a review! :)"},{"version_id":"843806717","version_name":"1.17.4","version_date":"2021-09-02 01:33:11.000 +0800","version_description":"Increases performance and fixes some small pesky bugs.\n\nIf you're loving Done, please let us know by leaving a review! :)"},{"version_id":"844306956","version_name":"1.18.0","version_date":"2021-09-30 05:04:33.000 +0800","version_description":"Introducing the new Done home screen widget! \n\nKeep track of your most important habits directly from your home screen. Select exactly which habits you want displayed on the small widget or use the larger widget to keep track of up to 4 habits at once.\n\nThis update also includes minor increases to performance and fixes some small pesky bugs.\n\nIf you're loving Done, please let us know by leaving a review! :)"},{"version_id":"844631608","version_name":"1.18.1","version_date":"2021-10-28 03:01:17.000 +0800","version_description":"Introducing the new Done home screen widget! \n\nKeep track of your most important habits directly from your home screen. Select exactly which habits you want displayed on the small widget or use the larger widget to keep track of up to 4 habits at once.\n\nThis update also includes minor increases to performance and fixes some small pesky bugs.\n\nIf you're loving Done, please let us know by leaving a review! :)"},{"version_id":"846273377","version_name":"1.19.1","version_date":"2021-12-31 09:16:11.000 +0800","version_description":"Introducing the new Done home screen widget! \n\nKeep track of your most important habits directly from your home screen. Select exactly which habits you want displayed on the small widget or use the larger widget to keep track of up to 4 habits at once.\n\nThis update also includes minor increases to performance and fixes some small pesky bugs.\n\nIf you're loving Done, please let us know by leaving a review! :)"},{"version_id":"846398371","version_name":"1.19.2","version_date":"2022-01-07 17:59:52.000 +0800","version_description":"Introducing the new Done home screen widget! \n\nKeep track of your most important habits directly from your home screen. Select exactly which habits you want displayed on the small widget or use the larger widget to keep track of up to 4 habits at once.\n\nThis update also includes minor increases to performance and fixes some small pesky bugs.\n\nIf you're loving Done, please let us know by leaving a review! :)"},{"version_id":"847641585","version_name":"2.0.3","version_date":"2022-03-14 15:45:28.000 +0800","version_description":"Update, ahoy!\n\nWe've been busy rebuilding the engine running Done, and this update includes a lot of these \"under the hood\"-improvements. This mainly centers around performance and stability fixes, which allows us to bring many great features to Done in the future.\n\nRemember to check out the Done home screen widget!\nKeep track of your most important habits directly from your home screen. Select exactly which habits you want displayed on the small widget or use the larger widget to keep track of up to 4 habits at once.\n\nIf you're loving Done, please let us know by leaving a review! :)"}]