[{"version_id":"826693933","version_name":"5.0.2","version_date":"2018-04-17 17:29:35.000 +0800","version_description":"First public release.<br><br>Join the Drafts Community at forums.getdrafts.com for update to date information."},{"version_id":"826790390","version_name":"5.0.3","version_date":"2018-04-24 14:06:44.000 +0800","version_description":"#### Quick fixes for issues found in the initial release:<br><br>- **New:** Better drag and drop in action list. Actions can now be dragged between groups by switching group tabs, and also dropped on a different group in the group list to move them.<br>- **Fix:** Automatic theme change would loose cursor position and not update keyboard appearance.<br>- **Fix:** Rework implementation of \"Insert text\" to be faster and work better with TextExpander snippets.<br>- **Fix:** Better updating of app badge when background sync completes or Siri creates draft.<br>- **Fix:** [[selection]] tag not return correct result when selection was at very end of draft.<br>- **Fix:** If a query was left in the draft list search field, it would get restored on a cold start of the app, but the not show in the search text in the text box making you wonder where all your drafts went.<br>- **Fix:** Changes to tags made in scripting might not save if the action had after success setting.<br>- **Fix:** Share extension might not immediately unlock pro features when subscription is initiated.<br>- **Fix:** Clear button in recent tag suggestions would not stay in scrollable view.<br>- **Fix:** Make sure custom template tags generated in an action are cleared when action is finished running.<br>- **Fix:** Remove some overhead from scripts which manipulate editor selections to prevent some race conditions with the selection when actions are run quickly, repeatedly, like from a keyboard shortcut.<br>- **Fix:** Case where bad tag filter could get applied to draft list after launching to search from widget. <br>- **Fix:** Changing syntax highlighting for draft without making any other changes to draft did not save change.<br>- **Fix:** Add \"after success\" label in group editing.<br>- **Fix:** Scripting theme change should require Pro subscription.<br><br>Note we are aware of issues logging into Evernote-China and are looking into them. We hope to have a fix soon.<br><br>Join the Drafts Community at forums.getdrafts.com for update to date information."},{"version_id":"827786089","version_name":"5.3.0","version_date":"2018-07-10 17:55:32.000 +0800","version_description":"#### New in 5.3<br><br>- **TODOIST SUPPORT**<br>  - For full details, see our new [Todoist integration guide](https://forums.getdrafts.com/c/integration-guides).<br>  - Todoist action step. Adds task to Todoist inbox, which optional configuration to specify reminder and comment. [Details](http://getdrafts.com/actions/steps/todoist.html)<br>  - `Todoist` script object access any methods on the Todoist REST API. Allow creation and updating and reading of tasks, projects, comments, labels and more. See [reference for details](http://reference.getdrafts.com/objects/Todoist.html)<br>- **Three new alternate app icons** options for Pro subscribers, accessed via \"Aa\" appearance settings.<br>- **Prompt improvements**<br>  - `addPicker` method on Prompt object to add iOS picker style control for selecting values. Details in [reference](http://reference.getdrafts.com/objects/Prompt.html)<br>  - Prompt `addButton` method can now take optional second value parameter.  When provided, the the `buttonPressed` property will be returned as the value instead of the button name. Value can be any data type. Useful for associating non-string values with a prompt button, or simply alternate string values.<br>  - Prompt addTextField and addTextView options parameter can now accept a `wantsFocus` boolean value to hint that the field should be focused for editing when the prompt is displayed. Should only be set on one field in the prompt.<br>  - Prompts with only one button will treat that one button as the default action and continue with CMD-Return on external keyboard as if that button was pressed.<br>- ReminderList object now has `getAllReminderLists()` and `find(title)` methods to match those on `Calendar` object.<br>- Learning resources page in Settings for easy access to community site, screencasts, etc.<br><br>#### Other Fixes and Changes in 5.3<br><br>- **Change:** Allow higher paragraph spacing settings to work better with larger font sizes.<br>- **Change:** More aggressively attempt to re-process Watch transactions which may have failed. Should avoid cases where some drafts created on the watch were stuck an not transferred to the phone.<br>- **Change:** Tighten tolerances of side-panel display gestures to cancel if the swipe moves too much up or down to avoid accidental swipes.<br>- **Fix:** Changing draft list filters should scroll to top of list.<br>- **New:** Add several small animation and visual tweaks.<br>- **Fix:** Insert text step after a script step that called `draft.update()` might not get freshest draft content.<br>- **Change:** Reset tag entry field when tag is selected in tag suggestions.<br>- **New:** Add `uuid` parameter to x-success callbacks for the /create URL scheme (also supports retParam to specify parameter name to use).<br>- **Fix:** Embedded iframes in HTML preview action steps were triggering redirects.<br>- **Change:** Refactored all handling of \"after success\" settings on actions to avoid a few edge cases where the move to archive/trash might not get saved properly.<br>- **Change:** General pass of tweaks to prompts to better support Dynamic text and display better.<br>- **Change:** Tweaks to Markdown bold/italic syntax definitions.<br>- **Fix:** Subproject syntax highlighting in Taskpaper.<br>- **Change:** Text views will also be focused if provided in a prompt.<br>- **Fix:** Issue where \"after success\" settings on an action might not take properly when in focus mode.<br>- **Fix:** Deleting an action group in manage view should not leave edit mode.<br><br>Join the Drafts Community at forums.getdrafts.com for update to date information, tips, tricks and integration guides!"},{"version_id":"827978795","version_name":"5.3.1","version_date":"2018-08-07 17:09:34.000 +0800","version_description":"Bug fix release. Stay tuned for lots of great new stuff in the coming months!<br><br>- **Fix:** Undo functions might not work properly in some situations.<br>- **Fix:** Importing action from Action Directory created in beta version of Drafts could fail with \"Import Error\".<br>- **Fix:** Issue where changes made to current draft in the editor made via Select &gt; Operations or in action could get ignored.<br>- **Fix:** Reminder import with notes could add unnecessary text.<br>- **Fix:** Provide defaults for Prompt `addPicker` if the caller does not.<br><br>Join the Drafts Community at forums.getdrafts.com for update to date information, tips, tricks and integration guides!"},{"version_id":"828292399","version_name":"5.4.0","version_date":"2018-09-14 12:14:27.000 +0800","version_description":"Lots of new things! For more complete information, example actions and more, visit https://getdrafts.com/changelog. All the details don't fit here!<br> <br>### Siri &amp; Shortcuts Support<br><br>- \"Run Shortcut\" action step. Pass text to the Shortcuts app and trigger a Shortcut by name with a single tap.<br>- Siri Intents:<br>- \"Capture clipboard\" Siri shortcut. This shortcut allows capture of the current clipboard content to a new draft in Drafts without launching the app.<br>- \"View draft\" Siri Shortcut. Allows creation of a shortcut which displays the content of a specific draft in the Siri interface - with the ability to tap and open that draft in the app.<br>- \"Add to Siri\" buttons to create voice shortcuts to functions in Drafts directly in the app in the following locations (iOS 12 only):<br>- Add shortcut to open a specific draft in the (i) detail view.<br>- Add shortcut to load a workspace on Workspace edit screen.<br>- Add shortcut to run an action without input text from the action edit screen.<br>- Drafts creates shortcuts as the app is used for a variety of other tasks, such as using the Drafts dictation interface. As you use Drafts, these become available in iOS Settings &gt; Siri &amp; Search and can be attached to custom Voice Shortcuts. A common example would be to create a \"Dictate\" voice shortcut that launches Drafts directly to dictation of a new draft.<br><br>### Other New Features in 5.4<br><br>- Separators in action groups. Separators act like headings and allow for visual organization of actions in a large action group or keyboard rows.<br>- Light Gray theme.<br>- WordPress Support. New WordPress action step for basic posting, and scripting support for the entire WordPress XML-RPC API.<br>- Expanded Dropbox Scripting Support New methods wrap and expose the entire Dropbox API. Create share links, list files, folders, query files and version, create Paper documents, etc. Anything you can do with the API.<br>- Google Drive action step enhancements allow creation of Google Docs and PDFs on Google Drive. <br>- `XMLRPC.request(url, methodName, params)` script method to interface with XML-RPC based services like the MetaWeblog API or others.<br>- `HTTP` script object now supports `parameters` setting to specific URL query args as a javascript object.<br>- Draft detail (i) screen now has button to copy UUID or draft text to clipboard, in addition to existing copy link option.<br>- More summary information in Draft detail (i) screen.<br>- `addLabel(name, label, options)` method on `Prompt` scripting object allows adding text labels, captions and headings in a prompt.<br>- `strftime(date, format)` global script method. Returns formatted date string.<br>- Toggle device sleep off and on via script. `app.isIdleDisabled` and `app.setIdleDisabled(bool)` script methods to allow disabling of system sleep timer to keep the screen from dimming.<br>- Ability to clear all version history for draft in Details (i) &gt; Versions, or individually delete specific versions (swipe to left).<br>- Markdown list auto-complete will now try to enable capitalization for first word of new list line if Sentence auto-capitalization is enabled.<br><br>### Other Fixes and Changes in 5.4<br><br>Several dozen additional changes, fixes and improvements have been made in this release. More than will fit in the allowed characters for updates notes. For complete details, please visit https://getdrafts.com/changelog."},{"version_id":"828598082","version_name":"5.4.1","version_date":"2018-09-19 11:51:21.000 +0800","version_description":"Lots of new things! For more complete information, example actions and more, visit https://getdrafts.com/changelog. All the details don't fit here!<br><br># 5.4.1<br><br>- All the great additions of 5.4 (below) and full support for the latest iPhone and Apple Watch models!<br>- Apple Watch app settings have been moved inside the app. Look for the \"Apple Watch\" section in settings.<br>- New Watch setting to hide the inbox count on complications - configure in Drafts Settings on phone.<br><br># 5.4 updates...<br><br>### Siri &amp; Shortcuts Support<br><br>- \"Run Shortcut\" action step. Pass text to the Shortcuts app and trigger a Shortcut by name with a single tap.<br>- Siri Intents:<br>- \"Capture clipboard\" Siri shortcut. This shortcut allows capture of the current clipboard content to a new draft in Drafts without launching the app.<br>- \"View draft\" Siri Shortcut. Allows creation of a shortcut which displays the content of a specific draft in the Siri interface - with the ability to tap and open that draft in the app.<br>- \"Add to Siri\" buttons to create voice shortcuts to functions in Drafts directly in the app in the following locations (iOS 12 only):<br>- Add shortcut to open a specific draft in the (i) detail view.<br>- Add shortcut to load a workspace on Workspace edit screen.<br>- Add shortcut to run an action without input text from the action edit screen.<br>- Drafts creates shortcuts as the app is used for a variety of other tasks, such as using the Drafts dictation interface. As you use Drafts, these become available in iOS Settings &gt; Siri &amp; Search and can be attached to custom Voice Shortcuts. A common example would be to create a \"Dictate\" voice shortcut that launches Drafts directly to dictation of a new draft.<br><br>### Other New Features in 5.4<br><br>- Separators in action groups. Separators act like headings and allow for visual organization of actions in a large action group or keyboard rows.<br>- Light Gray theme.<br>- WordPress Support. New WordPress action step for basic posting, and scripting support for the entire WordPress XML-RPC API.<br>- Expanded Dropbox Scripting Support New methods wrap and expose the entire Dropbox API. Create share links, list files, folders, query files and version, create Paper documents, etc. Anything you can do with the API.<br>- Google Drive action step enhancements allow creation of Google Docs and PDFs on Google Drive. <br>- `XMLRPC.request(url, methodName, params)` script method to interface with XML-RPC based services like the MetaWeblog API or others.<br>- `HTTP` script object now supports `parameters` setting to specific URL query args as a javascript object.<br>- Draft detail (i) screen now has button to copy UUID or draft text to clipboard, in addition to existing copy link option.<br>- More summary information in Draft detail (i) screen.<br>- `addLabel(name, label, options)` method on `Prompt` scripting object allows adding text labels, captions and headings in a prompt.<br>- `strftime(date, format)` global script method. Returns formatted date string.<br>- Toggle device sleep off and on via script. `app.isIdleDisabled` and `app.setIdleDisabled(bool)` script methods to allow disabling of system sleep timer to keep the screen from dimming.<br>- Ability to clear all version history for draft in Details (i) &gt; Versions, or individually delete specific versions (swipe to left).<br>- Markdown list auto-complete will now try to enable capitalization for first word of new list line if Sentence auto-capitalization is enabled.<br><br>### Other Fixes and Changes in 5.4<br><br>Several dozen additional changes, fixes and improvements have been made in this release. More than will fit in the allowed characters for updates notes. For complete details, please visit https://getdrafts.com/changelog."},{"version_id":"828788792","version_name":"5.4.2","version_date":"2018-10-02 17:38:30.000 +0800","version_description":"Small bug fix update:<br><br>- **Change:** Work to more aggressively restore Watch-Phone sessions if they get stuck and are not passing information.<br>- **Fix:** Crash with some WebDAV step configurations.<br>- **Fix:** Case where creating a draft using Siri could create duplicate drafts.<br>- **Fix:** VoiceOver actions not working on action rows in the action list.<br>- **Fix:** Some entity encoding issues in XML created by WordPress/XML-RPC requests.<br>- **Fix:** Undo causing scrolling on longer drafts.<br>- **Change:** Remove \"Run Workflow\" action step as option for new steps (replaced by Run Shortcut).<br>- **Fix:** Spotlight indexing a bit too agressive reindexing some content.<br>- **Fix:** Do not donate Siri \"View\" intents for blank drafts.<br><br>For complete details, please visit https://getdrafts.com/changelog."},{"version_id":"829021936","version_name":"5.4.3","version_date":"2018-10-24 18:19:18.000 +0800","version_description":"#### General Additions<br><br>- Searching drafts in the draft list now supports \"quoted strings\" and -negated strings, Google style. e.g. You can search for `\"red dress\" -blue` and only drafts containing the full phrase `red dress` and NOT containing `blue` will be returned.<br>- Global `shift-command-F` search drafts external keyboard shortcut.<br>- \"Merge\" operation now has option to place originals in archive, trash or leave them where they are.<br>- \"Rename Tag\" and \"Delete Tag\" operations in drafts list operations to globally rename or remove a tag across all drafts.<br>- `[[template|path.txt]]` template tag to load a template from a file in the /Drafts/Library/Templates folder in iCloud Drive. Allows for reuse of templates across actions.<br><br>#### Scripting Additions<br><br>- `Workspace` scripting object now has full support for creation and editing of workspaces, as well as the ability to query for drafts contained in a workspace.<br>- `require(path);` global script function which imports content of script in the /Drafts/Library/Scripts folder in iCloud Drive. <br>- Additional parameters to `Draft.query` function to omit tags, and specify sort order. <br><br>#### Other fixes and changes<br><br>- **Fix:** Some improvement pushing data to Apple Watch more actively.<br>- **Fix:** Work on some cases where the search field would not display correctly.<br>- **Fix:** Taskpaper indentation on wrapped lines not working properly.<br>- **Fix:** Case where action with Callback URL step might not archive after success properly when run from a keyboard key.<br><br>For complete details, please visit https://getdrafts.com/changelog."},{"version_id":"829135529","version_name":"5.4.4","version_date":"2018-11-05 13:43:24.000 +0800","version_description":"For complete details, please visit https://getdrafts.com/changelog.<br><br>- **Change:** Ready for the latest iPad screen sizes.<br>- **Fix:** Fix a couple of obscure watch-phone communication issues.<br>- **New:** Periodic backup settings now have frequency option allowing choice of daily, weekly or month backup schedule.<br>- **Change:** Change trash can sweep to keep 30 days instead of only 7.<br>- **Fix:** Crasher in template processing.<br>- **Fix:** Some layout issues on SE size phones.<br>- **Fix:** If only omitted tags were in the draft list tag filter, the filter status did not display properly."},{"version_id":"829455248","version_name":"5.5.0","version_date":"2018-12-03 14:14:31.000 +0800","version_description":"For complete details and change history, please visit https://getdrafts.com/changelog.<br><br>#### Markdown Updates<br><br>Drafts 5.5 brings significant new customizations for advanced Markdown users, letting you tailor the Markdown used in Drafts to specific needs. These customizations are in two parts.<br><br>First, in addition to the default \"Markdown\" syntax highlighting option, there are new \"MultiMarkdown\" and \"GitHub Markdown\" syntax options which add highlight for some of the extensions specific to those flavors of Markdown.  The default \"Markdown\" syntax has been simplified to more closely match the original Markdown specification as well.<br><br>Second, Markdown options have been added in setting to control the Markdown rendering used in templates and previews. It is now possible to choose between MultiMarkdown and GitHub Markdown when rendering, as well as control many advanced options provided by these renderers. [More details](https://getdrafts.com/settings/markdown)<br><br>#### Workspace, List Options Additions<br><br>The draft list, and Workspaces, can now optionally sort flagged drafts to the top of the list in the inbox and archive - and the option to omit flagged drafts that has been available for the inbox is now also available for the archive. The `Workspace` script object has also been extended to support these features.<br><br>#### Other Additions, Changes and Fixes<br><br>- **New:** `[[line]]` template tag now has support for negative indexes in ranges which count back from last line, like `[[line|-1]]` returns last line draft, `[[line|-2..-1]]` returns last two lines.<br>- **Fix:** Margin sizing on iPad accidently broken in previous release.<br>- **Change:** Merge operation should remember last selected destination (archive, trash, etc.)<br>- **New:** Add additional step summaries for more types of action steps when viewing steps in the action editor.<br>- **Change:** Add \"keepit\" URL scheme to whitelist to work in link mode.<br>- **Fix:** Better handling of keyboard accessory positioning to avoid issue with Chinese keyboards on X style phones."},{"version_id":"829636677","version_name":"5.5.1","version_date":"2018-12-20 17:53:41.000 +0800","version_description":"A few general improvements and fixes...details...<br><br>- **New:** Arrange mode now has additional swipe actions to move a line to the top or bottom.<br>- **New:** When searching action list, include separators displaying action group name in results.<br>- **New:** Import file function (Tap and hold +, \"Import File\") now recognizes drafts export, backups and action files and offers to individually import contents.<br>- **Fix:** Adjustments to swipe gestures to avoid accidentally triggering the action list when scrolling.<br>- **Fix:** Properly theme clear button and placeholder text in search fields and a number of fields in settings and action configurations.<br>- **Change:** Updates document icons for associated file types.<br>- **Change:** Adjust launch image slightly.<br>- **Change:** Tapping on tag in recent tag suggestions should not reorder the list.<br>- **Fix:** Using `[[line|n..]]` range could omit last line. This was a regression in the previous release.<br>- **Fix:** Auto-list completion now participates correctly in the undo history.<br>- **Fix:** List auto-completion now enabled for MultiMarkdown syntax.<br><br>For complete details and change history, please visit https://getdrafts.com/changelog."},{"version_id":"829912435","version_name":"5.6.0","version_date":"2019-01-15 16:02:25.000 +0800","version_description":"#### Workspace improvements<br><br>Workspaces learned a few new tricks in this release:<br>- Workspaces can now optionally load action groups in the action list and extended keyboard when applied. This is useful when a workspace is configured for working draft of a particular syntax, or project, and you want the related actions handy.<br>- Workspaces can now optionally switch the selected list tab (inbox, flagged, etc.) when applied. Saves some taps if a workspace is used to browse the archive primarily or similar.<br><br>#### Other updates and changes<br>- **New:** Return of the \"All\" tab in the draft list. This tab shows both inbox and archived drafts at the same time - which is sometimes handy when searching.<br>- **New:** Convenience URL scheme `drafts5://create_shortcut_action?name=ShortcutName` allow easy creation of Drafts actions which trigger Shortcuts. For more information and sample \"Add to Drafts\" shortcut, visit our community forums.<br>- **New:** `FileManager` script object methods to support listing directory contents, moving and copying files:<br>    - `listContents(path)`<br>    - `createDirectory(folder, path)`<br>    - `moveItem(fromPath, toPath, overwrite)`<br>    - `copyItem(fromPath, toPath, overwrite)`<br>    - See [reference](http://reference.getdrafts.com/objects/FileManager.html) for details<br>- **New:** Prompts now support a default button which appears fixed at bottom with cancel button.<br>    - In prompt action step, if only one button is used, it will be made the default button.<br>    - In scripted prompts, the `addButton` method can now take an additional `isDefault` boolean parameter. So, `p.addButton(\"Name\", \"value\", true)` would make that button the default button fixed at the bottom of the prompt. Only one button can be the default. If a scripted prompt only adds one button, it will be assumed to be the default button.<br>    - The default button will be the one to respond to CMD-Return external keyboard shortcut.<br>- **New:** Template markdown blocks (%% %%) can now take a format type specifier to override default Markdown options. Useful when a specific action needs to render using a different Markdown engine.<br>    - `%%text%%` will render text with default Markdown options as always<br>    - `%%githubmarkdown|text%%` will force use of GitHub Markdown.<br>    - `%%multimarkdown|text%%` will force use of MultiMarkdown<br>- **New:** `Base64.encode(string)` and `Base64.decode(string)` methods for handling Base64 in scripts.<br>- **New:** Add coloring for Critic Markup highlights in MultiMarkdown syntax.<br><br>#### Other Fixes<br><br>- **Change:** General pass of minor UI improvements<br>- **Fix:** Address issue where actions which altered text in the editor being called repeatedly and quickly - typically via repeating keyboard shortcut or quickly tapping extended keyboard row button - could cause the draft to revert to a previous version when sync changes were processed in the background.<br>- **Fix:** Workaround VoiceOver issue preventing access to row actions (edit, duplicate, etc.) in the action list.<br>- **Fix:** Inline code blocks in Markdown should be exclusive ranges to avoid accidental confusion with other markup.<br>- **Fix:** Be sure draft state is saved before showing (i) detail screen.<br>- **Change:** Update some of the actions configured on initial installation to include (if installed) actions for Agenda, Good Task and a few other apps (these examples are also in the Action Directory for existing users).<br>- **New:** Add news link in resources reached in Settings.<br>- **Change:** Refactoring in URL schemes and routing to better share code with Mac and avoid duplication.<br>- **Fix:** File type registration issue for action group export files which made it difficult to re-import them backups of action groups from the Files app.<br>- **Change:** Sort trash by modified, not accessed.<br>- **Fix:** Add OneDrive action step summary in action editor.<br><br>For complete details and change history, please visit https://getdrafts.com/changelog."},{"version_id":"829997328","version_name":"5.6.1","version_date":"2019-01-19 14:49:42.000 +0800","version_description":"Quick fix release for two regression bugs in previous release:<br><br>- **Fix:** Issue where the same draft loaded on multiple devices could trigger rollback to a previous version of a draft when sync occurred.<br>- **Fix:** Problem with row actions in draft list for VoiceOver users.<br><br>Lot so great new additions were made in 5.6 including Workspace enhancements and more, for complete details and change history, please visit https://getdrafts.com/changelog."},{"version_id":"830047677","version_name":"5.6.2","version_date":"2019-01-28 19:45:05.000 +0800","version_description":"- **Fix:** Fixes for weird text version rollback issue while typing which appeared in previous release. Not everyone was seeing it, but very annoying for those who did.<br>- **Change:** Improvements to query tokenizer to better support searches for punctuation and single character searches.<br>- **Fix:** Improve TaskPaper project syntax recognition and project navigation markers.<br>- **Change:** When Safari View Controller is used in-app to open links, respect currently selected theme.<br><br>Lot so great new additions were made in 5.6 including Workspace enhancements and more, for complete details and change history, please visit https://getdrafts.com/changelog."},{"version_id":"830220090","version_name":"5.7","version_date":"2019-02-22 15:20:39.000 +0800","version_description":"- **New:** Three new monochrome alternate app icon options for Pro subscribers. As with existing options, these can be selected from the \"Aa\" appearance settings screen. These icons may suit your tastes in any case, but were designed to blend into the background when combined with pure black wallpapers as follows:<br>    - Pure black background. When used on the home screen with a black wallpaper, the icon seems to blend into the background and show only the app logo.<br>    - Dark gray background. Matches the gray of the iPhone dock when a pure black wallpaper is behind it.<br>    - Light gray background. Matches the gray of the iPad dock when a pure black wallpaper is behind it.<br>- **New:** Dictation using Drafts custom dictation interface now uses AirPods (or other bluetooth headsets) to listen when they are connected.  This makes it easier to walkabout dictating while your iPhone sit on a desk or in your pocket.<br>- **Change:** Editor in share extension should syntax highlight and respond to editor settings for syntax selected for use for the Share extension in Settings.<br>- **Change:** When Safari View Controller is used in-app to open links, respect currently selected theme for the navigation bars.<br>- **New:** `app.currentThemeMode` scripting property. This is a read-only property which returns \"dark\" or \"light\". This allows you to branch on whether dark or light mode active if automatic theme switching is active, which the existing `themeMode` property did not.<br>- **Change:** Updates to some of the default action groups created on first time installation.<br>- **Change:** Refactoring of several minor operations in sync process to shake out a threading issue and work better with the upcoming Mac version of Drafts.<br>- **Change:** Some improvements to sync logging.<br>- **New:** add `accord` url scheme to whitelist to support using it in link mode.<br>- **Fix:** Rollback change to editor script object to avoid iOS issue adding smart quotes using `setSelectedText` method.<br>- **Change:** Better behavior of infograph watch complication when displaying inbox count is disabled.<br><br>For complete details and change history, please visit https://getdrafts.com/changelog."},{"version_id":"830398626","version_name":"5.7.1","version_date":"2019-03-01 23:17:10.000 +0800","version_description":"Quick fix for an issue preventing action completion notifications from appearing.<br><br>(See previous update for new features, like additional app icons and AirPod support in dictation)<br><br>For complete details and change history, please visit https://getdrafts.com/changelog."},{"version_id":"830634656","version_name":"5.8","version_date":"2019-03-26 02:00:24.000 +0800","version_description":"- **New:** Look for Mac version of Drafts on the Mac App Store, available now!<br>- **Fix:** Address several minor sync issues.<br>- **Fix:** Issue with audio configuration that could cause long dictation sessions from failing to reset and continue properly.<br>- **New:** Whitelist `ms-outlook` URL scheme to work in link mode.<br><br>For complete details and change history, please visit https://getdrafts.com/changelog."},{"version_id":"830811611","version_name":"5.9","version_date":"2019-03-31 21:41:45.000 +0800","version_description":"Quick fix for a sync issue, monospace  fenced code blocks, and more. In case you missed it, Drafts is available for Mac now as well!<br><br>- **New:** `setAllSort(sortBy, sortDescending, sortFlaggedToTop)` method on `Workspace` script object.<br>- **New:** Fenced code blocks (```) will be highlighted in monospace font in MultiMarkdown and GitHub Markdown syntaxes.<br>- **Fix:** Sync sometime would not fail to properly update other devices when a draft was move archived/trashed.<br><br>For complete details and change history, please visit https://getdrafts.com/changelog."},{"version_id":"830924589","version_name":"5.10","version_date":"2019-04-11 00:53:06.000 +0800","version_description":"OneNote integration, \"New in Workspace\" option, hide action groups in list and more...<br>-- ICYMI, Drafts for Mac is now available in the Mac App Store! --<br><br>#### What's New<br><br>- **OneNote action step.** Similar to Evernote action step. Allows creating, appending, prepending to OneNote pages. <br>    - See OneNote integration guide on the community forum for ready to use actions: https://forums.getdrafts.com/<br>- **New:** Visibility of action groups in the action list can now be configured like visibility as a keyboard. If the group is not \"available in list\", it will not be displayed in group select sidebar or quick access tabs in action list. If a group is not available in either the list or keyboard, it can still be accessed/edited in \"Manage\" view. <br>- **New:** \"New in Workspace...\" options in the new draft options menu that opens when you tap and hold the \"+\" button. Create a new draft with tags already assigned to place it in a workspace with tag-based filters.<br>- **New:** `HTMLPreview` script object to show HTML preview, has one method:<br>    - `show(html)` -&gt; boolean - see Reference for details: https://reference.getdrafts.com/<br>- **New:** `Share` script object to support scripting of system share sheet. Includes class methods:<br>    - `Share.shareAsText(text)` -&gt; boolean<br>    - `Share.shareAsURL(url)` -&gt; boolean<br>    - `Share.shareAsFile(filename, text)` -&gt; boolean<br><br>#### Other Changes and Fixes<br><br>- **Change:** Some improvements to error messages logged from failed Dropbox actions.<br>- **Change:** Better HTML output for fenced code block when using GitHub Markdown option.<br>- **Fix:** Separators not displayed properly when using Operations &gt; Run Action from draft list. <br>- **Change:** Updates default action sets."},{"version_id":"830966897","version_name":"16.1","version_date":"2019-12-18 18:17:28.000 +0800","version_description":"- **New:** Print action steps can now specify page margins (in points). This allows margins less than the default 72pt (1 inch) setting. <br>- **Change:** Switch to custom link identifier in Link mode to fix a few issues with URL highlighting with data detectors. Among other things, `message:` links now work properly.<br>- **Fix:** Improve usability of share extension on small phones.<br>- **Change:** Tighten authorization scopes requested by Gmail actions based to avoid Google verification issue. <br><br>For a complete history of updates, visit the changelog: https://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"830966897","version_name":"Numbering**: *Moving forward","version_date":"","version_description":""},{"version_id":"830966897","version_name":"5.10.1","version_date":"2019-04-12 23:51:16.000 +0800","version_description":"Quick fix for issue with Dropbox actions which append/prepend to files which did not already exist.<br><br>See previous release notes for regarding new OneNote integration and more!"},{"version_id":"831066815","version_name":"11.0","version_date":"2019-04-23 15:04:21.000 +0800","version_description":"Gmail, Outlook integration and more<br><br>This release brings support for sending email directly with Gmail and Outlook.com based email accounts via new action steps and scripting interfaces. These new integrations allow single-tap actions which send mail in the background through your email accounts on these services – useful for quick send actions to recipients and groups you send to often, and also for integration with services that allow you to email text into the service, but require those email come \"From\" a known address. Because of the direct integration, messages will come \"From\" your own address and be in your \"Sent\" folder on these services.<br><br>- **New:** Gmail Action Step<br>    - Send mail using Gmail accounts (via Gmail API)<br>    - Sends in background, so must be fully configured with recipients, etc.<br>    - Uses OAuth to authenticate to Google accounts. Use credential identifier for multiple accounts.<br>    - Docs: https://getdrafts.com/actions/steps/gmail<br>- **New:** `GmailMessage` script object<br>    - Send email using Gmail accounts (via Gmail API) in script<br>    - Enables things like looping over addresses to send emails individually to separate \"To\" recipients, etc.<br>    - Docs: https://reference.getdrafts.com/objects/GmailMessage.html<br>- **New:** Outlook Action Step<br>    - Send mail using Outlook.com accounts (via Microsoft Graph API)<br>    - Sends in background, so must be fully configured with recipients, etc.<br>    - Enables things like looping over addresses to send emails individually to separate \"To\" recipients, etc.<br>    - Uses OAuth to authenticate to Microsoft accounts. Should work with Personal/Work-School accounts, as long as they are Outlook.com integrated. Use credential identifier for multiple accounts.<br>    - Docs: https://getdrafts.com/actions/steps/outlook<br>- **New:** `OutlookMessage` script object<br>    - Send email using Outlook accounts (via Microsoft Graph API) in script<br>    - Docs: https://reference.getdrafts.com/objects/OutlookMessage.html<br><br>#### Other Additions, Changes and Fixes<br><br>- **New:** `MustacheTemplate` script object.<br>    - Process mustache style templates in script.<br>    - Can take template string or be created pointing to directory of `.mustache` template files in iCloud Drive<br>    - You also must contruct and pass the data object to use for values.<br>    - Not all scriptable objects are exposed to templates, but `Draft` objects are.<br>    - Docs: https://reference.getdrafts.com/objects/MustacheTemplate.html<br>- **Fix:** Case where a URL-based action which leaves Drafts could result in \"after success\" archive/trash happening but not getting properly synced to other devices.<br>- **Change:** Add error messages alerts for invalid states in a number of action steps. There are for invalid states that prevent a step from executing. Throwing an alert error help save a trip to the action log in these configuration error cases - like a script that will not compile.<br>- **Change:** If HTML passed to HTML Prevew has a `title` element, use that title as the window title.<br>- **Fix:** Better focus on text field returning to app after the new draft creation timeout is passed.<br>- **Change:** Add warning trying to use URL actions for multiple selected drafts via Select &gt; Operations in the draft list.<br>- **Fix:** Filter button over draft list not properly themed when automatic theme switching occured while draft list was visible.<br>- **Fix:** `FileManager.moveItem(src, dest, overwrite)` would not successfully overwrite an existing item even if `overwrite` was true. <br>- **Fix:** Oops, the fix in the last release for appending to Dropbox did not fix it for prepending. Fixed now.<br><br>**New Version Numbering**: *Moving forward, each feature release of Drafts will get a major version number. Minor version numbers will still be used for bug fix and minor releases. If you look back, it's the same thing we've been doing, but we're dropping the \"5\".*<br><br>For complete update history, visit: https://getdrafts.com/changelog"},{"version_id":"831257090","version_name":"12.0","version_date":"2019-05-13 12:56:57.000 +0800","version_description":"#### What's New<br><br>- **New:** HTML Preview action steps now have a share button. Allows sharing of the raw HTML generated by the preview, but also the ability to copy as rich text and print.<br>- **New:** HTML Preview step editing now has import and export options to load templates from files, and \"Reset\" button replacing buttons which set the default styles.<br>- **New:** Badge notification settings now allow badge count to be based on a selected workspace's inbox only.<br>- **New:** New \"default tags\" setting for Share extension to create initial tag assignments for share extension captures.<br>- **New:** Watch app \"default tag\" setting can now take a comma-separated list of default tags, not just one.<br>- **New:** Display device along with created, modified dates in draft detail. Allows referencing whether a draft was created or last modified on iPhone, iPad or Mac.<br>- **New:** Track device action is executed on and display in action log.<br>- **New:** `Version` script object to access a draft's version history. Can be useful for comparing or exporting past versions.<br>    - Access version history of draft via `draft.versions`.<br>    - Script creation of a new version with `draft.saveVersion()`<br><br>#### Other Changes and Fixes<br><br>- **Fix:** Resolve occasional issue where launching to search from the Today widget would fail.<br>- **Fix:** Better handling of sync changes which trash/delete drafts which are loaded in the editor.<br>- **Change:** Add `anylist:`, `googlechrome:` URL schemes to whitelist for link mode support.<br><br>For complete update history, visit: https://getdrafts.com/changelog"},{"version_id":"831337052","version_name":"12.1","version_date":"2019-05-17 17:19:16.000 +0800","version_description":"- **Fix:** Issue with inability to use swipe gestures when returning to app in specific cases.<br>- **New:** Update to MultiMarkdown 6.4.0 (was on 6.3.2).<br>- **Change:** Add custom drag and drop handler to support direct drop of Goodnotes handwriting recognition images dragged to a draft on iPad.<br><br>For complete update history, visit: https://getdrafts.com/changelog"},{"version_id":"831460169","version_name":"13.0","version_date":"2019-05-29 10:34:31.000 +0800","version_description":"- **New:** Arrange mode now supports arranging by sentence in addition to block and line. This feature requires iOS 12.<br>- **Change:** Disable auto-list capitalization until I can find another approach which is compatible with third party keyboards.<br>- **Fix:** Hopefully a workaround for issue where display of text, particularly in code blocks, turns to garbage characters with certain specific text and font combinations.<br>- **Fix:** Displayed modified date not updated in draft list when changes made to a draft.<br>- **Change:** Alpha sort tags when displayed in draft list.<br><br>For complete update history, visit: https://getdrafts.com/changelog"},{"version_id":"831597965","version_name":"14.0","version_date":"2019-06-13 13:53:17.000 +0800","version_description":"- **New:** Updates to Workspaces and standard Today widget designs.<br>- **New:** `drafts5://refresh_text_expander` URL to trigger TextExpander refresh.<br>- **Fix:** Issue for first time installs not getting a keyboard row assigned.<br>- **Fix:** Fix for case where keyboard row could appear blank on initial launch.<br>- **Fix:** Workaround a couple of minor issues specific to as yet unreleased software.<br>- **Fix:** Issue with improper handling of expired OAuth tokens in some cases. Notably affecting Gmail and Outlook mail steps which could report successfully sending mail when they did not when not used for a while.<br>- **Fix:** Sync timing issue that could cause some changes (typically archiving or trashing of a draft) to not get synced to other devices properly.<br><br>For details and change history at https://getdrafts.com/changelog"},{"version_id":"831699664","version_name":"14.1","version_date":"2019-06-19 11:48:12.000 +0800","version_description":"- **Fix:** Rewrote link mode (it was broken in last release). Should behave the same, other than links now being underlined.<br>- **Fix:** Avoid race condition attempting to trigger new TextExpander refresh URL from an action inside Drafts. Look for example action to trigger TextExpander refresh in Action Directory (https://actions.getdrafts.com)<br>- **Fix:** Fix performance and excessive logging issue in sync.<br><br>For details and change history at https://getdrafts.com/changelog"},{"version_id":"831835412","version_name":"14.2","version_date":"2019-06-28 17:51:33.000 +0800","version_description":"- **Fix:** Glitch with link mode and checkboxes.<br><br>For details and change history at https://getdrafts.com/changelog"},{"version_id":"832525935","version_name":"15.0","version_date":"2019-09-22 12:19:50.000 +0800","version_description":"For more detail, links to docs, and change history, visit: https://getdrafts.com/changelog<br><br>## Related Updates<br><br>Along with this update, we will also be launching new User Guide and Scripting Reference websites, please visit these sites for more information and to get involved in the Drafts community:<br><br>https://docs.getdrafts.com<br>https://scripting.getdrafts.com<br>https://forums.getdrafts.com<br><br>## Interface and Functional Improvements<br><br>- **Rewritten main user interface and gesture interface**<br>- Improvements to responsiveness of gestures.<br>- Pinning both drafts and actions on larger screens, easier access to pinning, remembering pin states.<br>- Lots of little improvements to icons, the keyboard switcher, and other user interface elements.<br>- **Support for multiple windows** _(iPadOS 13 only)_.<br>    - Dragging draft from the draft list to a new window. <br>    - Edit actions in separate window.<br>    - Live Markdown previews in a separate window.<br>- **Automatic dark and light mode switching** _(iOS 13 only)_<br>- **Contextual menus where appropriate** _(iOS 13 only)_<br>- **New Quick Capture action extension**. Similar to the existing share extension, but requires no user interaction - just captures the shared content and returns.<br>- **Live Markdown Previews** _(iPadOS 13 only)_. A live preview can be opened in a separate window to allow a draft to be edited and preview viewed simultaneously.<br>- **Support for new iOS 13 font selection panels**<br>- **Dictation interface now has an optional silence timeout**. Useful for those who trigger dictation hands-free.<br>- Refreshing of icons and a variety of minor improvements throughout the app.<br><br>## Shortcuts<br><br>- **Extensive support for new features of Shortcuts on iOS/iPadOS 13**. A full set of shortcuts, with parameter support, allow you to create, update, append and prepend to drafts, query drafts, run actions, and more. Use of advanced Shortcuts automation requires a pro subscription.<br><br>## Workspaces &amp; Draft List<br><br>- **Default Workspace**. This is a special workspace that stores the preferred default settings for the draft list, and is applied when filters are cleared.<br>- **\"Show Date\" display option for drafts list and workspaces**. Hide/show the date in the list.<br><br>## Other Changes and Updates<br><br>- **Fix:** Update Todoist integrations to use new API endpoints.<br>- **New:** Keyboard shortcut support in the Share extension (cmd-return to save, cmd-T for tag entry, etc.)<br>- **Change:** If a selection is present in the editor, the character/word counts now include a selection count as well.<br>- **Change:** All default HTML preview templates have been updated with CSS-based support for dark mode. Update them by editing the action and using the \"reset\" button to update the template - or reinstall the latest versions from the action directory.<br>- **New:** `HTML.escape(string)` and `HTML.unescape(string)` javascript functions to encode and decode HTML entities in a string.<br>- **New:** `Event` script object now support `url` property.<br>- **Change:** Long press on link in link mode will now fall through to options menu (with Preview on iOS 13).<br>- **Change:** Regular expression find will now treat escaped whitespace characters (e.g. <br>, \\t) in replacement text as those characters, rather than expecting the whitespace itself.  More consistent with how regex replacements are done in other editors.<br>- **Fix:** Improvements to Markdown syntax definitions.<br>- **Fix:** Navigating drafts list with keyboard shortcuts should scroll the list if necessary.<br>- **Fix:** `editor.load()` method should touch the accessed date of the draft.<br>- **Change:** Allow \"new draft after\" timeout to be set to \"Never\" to allow it to be disabled separately from focus mode.<br>- **New:** Select &gt; Operations &gt; Export now supports text file option, which merges draft contents into one text file.<br>- **Fix:** Issue where API calls in actions could fail improperly if the OAuth token expired and needed to be refreshed.<br>- **Change:** Require iOS 12."},{"version_id":"832989952","version_name":"15.1","version_date":"2019-10-01 00:43:33.000 +0800","version_description":"For more detail, links to docs, and change history, visit: https://getdrafts.com/changelog<br><br>All the great iOS 13 updates and additions from 15.0, and some fixes:<br><br>- **Change:** Apple Watch now requires watchOS 5.0 or greater.<br>- **New:** `File Draft` shortcut action which can update folder, tags and flagged status of draft without affecting content.<br>- **Fix:** \"Create Draft\" shortcut was not allowing selection of the new draft as a return value.<br>- **Fix:** Better handling of dark mode switching on iOS 12.<br>- **Fix:** Landscape editing on iPhone did not take notch into account properly.<br>- **Change:** \"Backup Now\" option for drafts now prompts for destination, rather than automatically saving to iCloud Drive.<br>- **Fix:** Several minor layout issues."},{"version_id":"833184766","version_name":"15.2","version_date":"2019-10-16 18:07:50.000 +0800","version_description":"For more detail, links to docs, and change history, visit: https://docs.getdrafts.com/docs/misc/changelog-ios<br><br>- **New:** Create and Update Draft shortcuts can now set syntax definition for the draft. Also, shortcut actions which return drafts will contain syntax information.<br>- **Fix:** Some tweaks to gestures which open the side panels to avoid conflicts with some of the new iOS 13 text selection gestures.<br>- **Fix:** Case where using a Drafts URL could disable the new draft timeout the next time you return to Drafts.<br>- **Fix:** Some tweaks to background refresh on watchOS.<br>- **Fix:** Better syntax highlighting for [id][] style reference links in Markdown syntaxes.<br>- **New:** MultiMarkdown syntax now supports embedded LaTeX markup with \\\\[ \\\\], \\\\( \\\\) or $$ $$ style delimiters."},{"version_id":"833656513","version_name":"15.3","version_date":"2019-11-19 14:27:12.000 +0800","version_description":"For more detail, links to docs, and change history, visit: https://docs.getdrafts.com/docs/misc/changelog-ios<br><br>- **Fix:** Improvements to sync prioritization to avoid some issues where sync changes were not being delivered in a timely fashion.<br><br>More feature updates coming soon!"},{"version_id":"833873875","version_name":"16.0","version_date":"2019-12-10 11:52:22.000 +0800","version_description":"The Mac version of Drafts now has full support for actions. Most of the updates in this iOS release are part of supporting those updates on the Mac. But also expect big launch time improvements and bugs fixes! Details below.<br><br>For more complete details, links to docs, and change history, visit: https://docs.getdrafts.com/docs/misc/changelog-ios<br><br>#### New<br><br>- **New:** 20-30% initial launch speed improvement for cold starts of the app.<br>- **New:** File import features, configured in settings, to automatically import text files in the \"Inbox\" folder in iCloud Drive/Drafts/Inbox. Similar to existing Reminders import feature.<br>- **New:** Support \"tagged\" filtering in tag filters and workspaces. The inverse of the existing \"untagged\" special value - will match any draft with one or more tags assigned.<br>- **New:** Include draft syntax in (i) draft detail summary<br>- **New:** \"Disable action bar\" option in Aa editor settings allowing the row above the keyboard to be completely disabled.<br>- **New:** Enable and disable individual actions steps by platform. Allows a single action to have different steps on different platforms to account for platform behavior differences when appropriate/necessary.<br>- **New:** Action list filtering setting and support for new action visibility settings (in \"...\" Options).<br>- **New:** Set visibility in lists/keyboard for individual actions within action groups.<br>- **New:** \"Change Syntax\" operation added to draft list options.<br>- **New:** `Get Draft by UUID` shortcut action to allow retrieval of a specific Draft by UUID.<br>- **New:** \"Markdown to HTML\" shortcut action provides access to Drafts' built-in MultiMarkdown and GitHub markdown processors.<br><br>#### Other Fixes and Changes<br><br>- **Fix:** Sync fixes address a number of issues, particularly ones that have arisen on the latest OS releases.<br>- **Fix:** Using Siri directly to create notes on Apple Watch  (e.g. \"Hey Siri, create a note using Drafts\") would not work properly in many cases.<br>- **Change:** Streamlining pass through syntax highlighting code. Improves performance and resolves (hopefully) a few little oddities. Please test with large documents, and generally report any syntax highlighting and editing weirdness/regressions.<br>- **Fix:** Red dotted underline of misspelled words should no longer disappear after typing additional text.<br>- **Change:** Deprecate `app.loadKeyboardActionGroup` - replaced with `app.loadActionBarGroup` (old method still works, the later is just preferred now).<br>- **Fix:** Possible fix for some scrolling weirdness moving between multiple open windows on iPad.<br>- **Fix:** Workaround issue where system is processing smart dashes ever when they are not enabled on existing text. Triggered primarily when tapping task marks.<br>- **Change:** Updating some labelling to call the row above the keyboard the \"action bar\" for consistency with Mac version.<br>- **Fix:** Issue preventing the \"60 minutes\" draft creation timeout setting from working properly.<br>- **Fix:** Crash using HTTP script object with invalid data parameters.<br>- **Fix:** Allow editor scrolling to bounce vertically even when content does not exceed visible space.<br>- **Change:** When calling `Workspace.create()`, the initial state of the workspace will be based on the current Default workspace.<br>- **Fix:** Startup timing issue that could result in one of the side panels remaining open after the new draft timeout was fired to create a new draft.<br>- **Fix:** Scrolling issue sometimes affecting actions which change text in the editor.<br>- **Change:** Change \"automatic\" theme label to \"system\" when running on iOS 13. <br>- **Change:** In Markdown syntaxes, continue markdown quotes like lists are continued."},{"version_id":"834051802","version_name":"16.1","version_date":"2019-12-18 18:17:28.000 +0800","version_description":"- **New:** Print action steps can now specify page margins (in points). This allows margins less than the default 72pt (1 inch) setting. <br>- **Change:** Switch to custom link identifier in Link mode to fix a few issues with URL highlighting with data detectors. Among other things, `message:` links now work properly.<br>- **Fix:** Improve usability of share extension on small phones.<br>- **Change:** Tighten authorization scopes requested by Gmail actions based to avoid Google verification issue. <br><br>For a complete history of updates, visit the changelog: https://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"834368571","version_name":"17.0","version_date":"2020-01-16 09:56:11.000 +0800","version_description":"Editor improvements, Medium support, new themes, and more...<br><br>### Editor Improvements<br><br>- Highlight insertion point option to draw different background for current cursor position.<br>- Editor setting to limit max characters per line. Works along with margin settings to determine a maximum line length. Great for use with full screen mode to prevent excessively long lines.<br>- New configuration options for visibility of action bar, toolbar and iPad keyboard shortcut bar allowing them to be hidden when editing, or optionally hidden only when external keyboard is connected.<br><br>### Other Additions<br><br>- App Icon menu options: The menu displayed when long pressing the app icon on the home screen can now be configured to display recent drafts (the previous behavior), common commands, or workspaces. This setting now defaults to common commands, and can be changed in Settings.<br>- Two new monochrome editor themes. Available to select in `Aa` editor settings.<br>- Draft select view updated to allow filtering by workspace. This view is used in the share extension, iMessages app, and `app.selectDraft()` script interface.<br>- `Medium` action step type to post to Medium.com. Visit action directory for example actions.<br>- `Medium` script object to support scripting Medium API.<br>- Script steps now have a new \"Allow asynchronous execution\" option. When enabled, the action will wait for a call to `script.complete()` to know if a script step is finished. This allows use of async/await, Promises and other async function calls...but your script *must* call `script.complete()` of the action will timeout and fail after 60 seconds.<br>- `CallbackURL` objects have a read-only `url` property to debug the URL which will be used with the configured parameters.<br><br>### Other Fixes and Changes<br><br>- **Fix:** `Filemanager.readString` would not return undefined properly when file was not found.<br>- **Fix:** Inaccurate action directory URLs used for opening actions posted to the directory.<br>- **Fix:** \"New draft after\" timeout not always working on cold start of the app.<br>- **Fix:** Issue with action bar visibility on cold start.<br>- **Fix:** Issue with incorrect syntax highlighting styles when editing drafts with different syntax options in multiple windows on iPadOS.<br>- Misc. additional fixes and stability improvements.<br><br>For a complete history of updates, visit the changelog: https://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"834388500","version_name":"17.1","version_date":"2020-01-16 23:37:18.000 +0800","version_description":"Quick fix for a crashing issue affecting devices running iOS 12. See 17.0 release notes for new features."},{"version_id":"834506274","version_name":"17.2","version_date":"2020-01-28 13:55:53.000 +0800","version_description":"- **New:** Workspace sharing. Workspaces can now be shared via URL or export file which can be installed in other instances of Drafts. This can be used to backup workspaces, or to share configured workspaces with other Drafts users.<br>- **New:** `Reminder` script object has new `dueDateIncludesTime` boolean property. If true, the time components of the dueDate will be ignored allow Reminders to be set to be due on a date without assigning a time.<br>- **Fix:** Clipping issue printing from HTML previews if images are included.<br>- **Change:** Enable focus mode on additional iPad draft windows opened by drag and drop. User intent is to keep that draft active if opening in another window and focus mode prevents the \"new draft after\" timeout from overriding that intent.<br>- **Change:** Remember tag drawer expanded state across cold starts of the app.<br>- **Change:** Updates to default action groups created on first installation.<br>- **Change:** Updates to document type icons for exported files.<br>- **Fix:** Enabling and disabling link mode could leave the action bar disabled.<br>- **Change:** Better logging in Dropbox actions.<br>- **Change:** OneNote actions will now prompt for the selection of a notebook if a notebook name is not specified and the default notebook cannot be determined.<br>- Misc. improvements and minor fixes for several sync and useability issues.<br><br>For a complete history of updates, visit the changelog: https://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"834846409","version_name":"18.0","version_date":"2020-02-25 12:18:54.000 +0800","version_description":"- Tappable tasks in TaskPaper syntax. Tapping the list mark at the beginning of a TaskPaper task line will now add-remove the `@done` status for that line in drafts using TaskPaper syntax.<br>- TaskPaper example action group. If you are interested in using TaskPaper, we have created an example TaskPaper action group designed for use in the Action Bar with many common TaskPaper commands, to add tasks, assign due/start dates to selected lines and archive done items. Visit the Action Directory to download this group. (https://actions.getdrafts.com/)<br>- Lots of new iOS 13 contextual menus. Tap and hold (or force touch where available) on top toolbar items in the editor, drafts in the draft list, actions in the action list. Some options were already available, but we have dramatically enhanced these contextual menus to allow easy access to a variety of common functions - like creating drafts with syntax/tags, moving tags - even running actions without opening the action list. Take the time to tap and hold on things to see the new options.<br>- Arrange mode now has compact/expanded mode toggle. Compact mode truncates longer items to allow more to be displayed when working with longer blocks/lines. Compact mode also disabled inline editing of elements.<br><br>### Other Changes and Updates<br>- **Fix:** Addressed most known crashing issues.<br>- **Fix:** We have updated our fork of the Evernote SDK to remove dependencies on some deprecated iOS APIs, and to again support authentication for users who login to Evernote using their Google account.<br>- **Change:** Audit of how/when draft version history entries are automatically created. Should be more reliable capturing some state changes and avoiding duplicate versions.<br>- **Fix:** Targeting specific OneNote notebook might not work in some cases with OneNote action steps.<br>- **Fix:** Issue with reordering action groups not working properly with certain data sets.<br>- **Fix:** Possible issue reordering workspaces with certain data sets.<br>- **Change:** Periodically reset sync log if logging is enabled to prevent excessive log sizes.<br>- **Fix:** Workaround alignment issue for strings beginning line with a smart quote.<br>- **Change:** Refactor some initialization code to try to better troubleshoot a couple of minor crashing issues.<br>- **Change:** Remove \"Create Draft with Clipboard\" shortcut action. This can be handled better with new \"Create Draft\" intent.<br>- **Change:** Enable raw URLs in preview windows to be tappable.<br>- **Fix:** Background colors applied by syntax highlighting (as inline code) might not get cleared immediately if the text changed it ways that should disable that background color.<br>- **Fix:** Avoid state where action list gets left open after creating a new draft when returning to the app.<br>- Lots of other minor tweaks and fixes.<br><br>For a complete history of updates, visit the changelog: https://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"834958652","version_name":"18.1","version_date":"2020-03-04 12:57:30.000 +0800","version_description":"- New alternate app icon choices. Tap the app icon in `Aa` editor settings screen for new neon, six colors and other app icon options.<br>- Several dozen new action/workspace icon options. Edit actions and tap the icon to see the options.<br><br>### Other Changes<br><br>- **Change:** The `/workspace` URL action can now accept the `name=Default` argument to clear filters and load the default workspace.<br>- **Change:** Adjusted the gray app icons to work to blend into the dock on iOS 13, one for dark mode, one for light mode.<br>- **Fix:** Task marks in TaskPaper syntax should only be recognized at beginning of lines.<br>- **Fix:** Remember setting if the action bar has been set to be hidden temporarily.<br>- **Fix:** Initial positioning of action bar group selector could be wrong on app cold launch.<br>- **Fix:** Fix for header styling regression in \"Markdown\" syntax.<br>- **Change:** Refactor and simplify a bunch of code around keyboard visibility.<br>- **Fix:** Top-Bottom navigation options in navigation contextual menu would not always work.<br>- **Fix:** Case where keyboard could be displayed erroneously when returning to app with a view other than the editor open.<br><br>For a complete history of updates, visit the changelog: https://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"835363911","version_name":"19.0","version_date":"2020-04-02 11:59:48.000 +0800","version_description":"- **Quick Search**: Global quick search feature to query for drafts, actions, workspaces and common commands in one place. <br>  - Accessed via search button at bottom of editor, by pulling down past the top of any draft in the editor, or with the shift-command-F keyboard shortcut.<br>  - `/quickSearch?query=` URL action to open directly to quick search.<br>  - `app.showQuickSearch(initialQuery)` scripting function.<br>  - _Quick Search feature requires iOS 13.1 or greater._<br><br>- Better mouse/trackpad hover state support for iPadOS 13.4 and up.<br><br>- `FileManager` script object additions:<br>  - `baseURL` and `basePath` properties return full `file:///` URL or POSIX path to the base directory used by the FileManager instance. This can be useful in cases where the full location of files is needed.<br>  - `writeJSON(path, obj)` and `readJSON(path)` convenience functions for saving and restoring JavaScript objects in files.<br>- `app.showDraftInfo(draft?)` function to display details of a draft.<br>- Additional `Workspace` script object properties:<br>    - `loadActionListGroup` (ActionGroup)<br>    - `loadActionBarGroup` (ActionGroup)<br>    - `loadFolder` (\"inbox\" | \"archive\" | \"trash\" | \"flagged\")<br><br>### Other Changes<br><br>- **Change:** Searches in the draft list now also search tag names in addition to searching full text.<br>- **Fix:** Display issue in workspaces widget for unsubscribed users.<br>- **Change:** Better visibility of empty states<br>- **Fix:** \"After success\" filing options on actions could cause the next draft to be selected in other windows than the one triggering the action on iPad.<br>- **Fix:** Bug affected restoring tag filter \"all/any\" status in workspaces saved in state restoration sessions.<br>- **Change:** Improve identification of HTML tags in Markdown syntax.<br>- Misc. other reliability and performance improvements.<br><br>For a complete history of updates, visit the changelog: https://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"835478515","version_name":"19.1","version_date":"2020-04-10 13:24:28.000 +0800","version_description":"Be sure to check out the great new Quick Search feature from 19.0 as well as...<br><br>- **New:** Contextual (long press) menu on \"Aa\" appearance button for changing themes and syntax.<br>- **Change:** Improved keyboard navigation in find panel.<br>- **Change:** Custom mouse-trackpad pointer states for buttons with contextual menus.<br>- **Fix?:** Possible fix for crash at start for a few users on 13.4, related to enabling pointer hover states.<br>- **Change:** A few minor UI tweaks, like improved separators in drafts/actions lists.<br><br>For a complete history of updates, visit the changelog: https://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"835621915","version_name":"19.2","version_date":"2020-04-22 13:13:29.000 +0800","version_description":"- **New:** Editor settings have new tab key options, allowing you to select whether the tab key inserts a tab, two spaces or four spaces.<br>- **New:** Workspaces can be shared via directory (still not visible in public site, but can be posted).<br><br>- **Fix:** Trackpad/Magic Mouse swiping can be used like touch swiping to open drafts/actions lists.<br>- **Fix:** Syntaxes (like TaskPaper) which apply strikethough styles, the style might not get cleared if edits (like removing @done from a task) no longer required it.<br>- **Fix:** Problems reordering actions in the action list in groups with hidden actions.<br>- **Fix:** Editor margins not updating after pinned side panels hidden/shown on iPad.<br>- **Fix:** Issue with editor not reflecting changes to a draft made in a scripted action if the draft was loaded in the script via `Draft.find` instead of referenced as the global `draft` variable.<br>- **Fix:** Hopefully a fix for an issue causing the app to not launch properly on iOS 13.4 for a few users.<br><br>For a complete history of updates, visit the changelog: https://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"836007510","version_name":"20.0","version_date":"2020-05-19 08:51:12.000 +0800","version_description":"For additional details, sample actions utilizing new features and more, visit the online release notes at http://docs.getdrafts.com/docs/misc/changelog-ios<br><br>#### What's New<br><br>- Wiki-style markup for cross-linking between drafts, and executing basic Drafts commands. When embedded in a draft, these become tappable links which open URLs as described below:<br>  - `[[Title of Draft]]` : Creates a link which will open a draft by title (first line) when clicked/tapped. Will create draft with the title if it does not exist.<br>  - `[[u:UUID-OF-DRAFT]]` : Link to a specific draft by UUID.<br>  - `[[s:Search Term]]` : Link to open a quick search to the specified search.<br>  - `[[w:Workspace Name]]` : Link to load the named workspace<br>  - `[[google:Search term]]` : Opens a Google search for \"Search term\" when clicked/tapped.<br>  - `[[wikipedia:Search term]]` : Opens a Wikipedia page for \"Search term\" when clicked/tapped.<br>  - `[[bear:Title of Bear Note]]` : Opens a note titled \"Title of Bear Note\" in Bear, if it exists. <br>  - Link markers are only available when using Markdown, MultiMarkdown or GitHub Markdown syntax definitions.<br>- \"Typewriter Scrolling\" option fixes the cursor position in the middle of the editor, moving the text as you type. Feature can be enabled/disabled in the \"Aa\" editor settings, or via contextual menu (tap and hold) on the \"Aa\" button.<br>- Contextual (tap and hold) menu improvements:<br>  - Menus on Inbox/Archive/Flagged/All folder buttons in draft list to change sort options.<br>  - Navigation contextual menu, including \"Last Draft\", \"Next-previous draft in list\" and access to recent drafts. Also navigation menu is now attached to next/previous buttons at bottom of screen.<br>  - Quick search button now has contextual menu including \"Find in Draft...\" option.<br>  - Draft results in quick search now have contextual menus allowing opening in new window and other common commands.<br>- Scripting additions:<br>  - JavaScript objects now support `new` keyword. So `new Draft()` now works in lieu of `Draft.create()` (old syntax still works).<br>  - `Draft` object additions and changes:<br>    - `title` property now strictly returns first line of draft<br>    - `displayTitle` property returns cleaned up title as it would be displayed in draft list.<br>    - `lines` returns content as array of strings split on line feeds. <br>  - `editor.recentDrafts` returns array of recent drafts loaded in the editor, with the most recent previous draft as the first index.<br>  - `app.openInNewWindow(draft)` script method. (iPad/Mac).<br>  - Scripting access to editor navigation markers, as displayed in the Navigation window/menu. Allows for the creation of actions which navigate within the current document.<br>    - `editor.navigationMarkers`: Array of navigation markers available in the document.<br>    - `editor.navigationMarkerAfter(location: number)` and `editor.navigationMarkerBefore(location: number)` convenience methods to get the next/previous navigation markers relative to a location in the text.<br>    - Visit reference for details.<br>  - `FileManager` has new `getCreationDate(path)`, `getModificationDate(path)`, and `setCreationDate(path, date)` and `setModificationDate(path, date)` functions.<br>  - `File` action step has new \"Maintain dates\" option which will set the creation/modification date of the newly created file to match those of the current draft. <br>- Add option to copy title to clipboard in locations where there are copy options.<br>  <br>#### Other Changes and Updates<br><br>Too many other updates to fit here, for full details visit the changelog: https://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"836144770","version_name":"20.1","version_date":"2020-05-27 00:28:13.000 +0800","version_description":"Mostly a few tweaks to new features released with v20!<br><br>- **New:** `Draft.queryByTitle(title)` returns array of drafts matching the title. This exposes the logic used by internal links to find drafts with a specific title.<br>- **New:** Link definitions now support `[[url:http://full.url.com/]]` option to enable a full URL link external to drafts.<br>- **Change:** Fine-tune the link matching regex a bit to avoid some nesting oddities.<br>- **Fix:** Starting a line with a smart quote could temporarily align it to the right.<br>- **Fix:** Editing an action from the results of a search in the action list should refresh the search to get the new version of the action.<br>- **Change:** Locating draft by title should not be case-sensitive.<br>- **Fix:** Crasher using down arrow on external keyboard past the last result in quick search.<br>- **Fix:** TextExpander could not be enabled on iOS 12.<br>- **Change:** Make \"text\" sort of draft list case-insensitive.<br><br>For additional details visit the online release notes at http://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"836426447","version_name":"21.0","version_date":"2020-06-17 08:46:41.000 +0800","version_description":"Better undo support, advanced HTML Previews and more...<br><br>#### What's New<br><br>- **Undo for most commands in the draft list.** Most actions and operations on the draft list are now undoable. After moving a draft to the trash, moving between inbox and archive, flagging, add-remove tags, etc., you can undo that operation. To access undo: Shake to Undo, use Command-Z on an external keyboard, or three-finger swipes left-right to undo/redo (iOS 13 only).<br>- **Interactive HTML Previews** HTML Previews (via action step or script) now provide access to the JavaScript functions that can be called from scripts embedded in the preview document to pass values out for use in Drafts script steps, or to control flow (Cancel/Continue). Using these functions, you can build user-interfaces for actions using HTML forms, and gather and submit data or user selections for use in other script steps. Available functions:<br>  - `Drafts.send(key, value)`: Send data out to the action context. These values will be available to subsequent scripts using the `context.previewValues` object. So, if you call `Drafts.send(\"mydata\", {\"a\": 1, \"b\": true})` in your preview, you can later retrieve those values in a script step using `context.previewValues[\"mydata\"]`.<br>  - `Drafts.continue()` and `Drafts.cancel()`: Equivalent to pressing the continue/cancel buttons in the preview UI. Allows automatic continuation of script with a form submission, for example, in the HTML document.<br>  - HTML Previews now offer an additional \"Hide Interface\" option that removes toolbars. Used only when the script features above are used to control flow.<br>- **New:** `app.currentWorkspace` property returns a Workspace object configured as the current drafts list is configured. Note this is *not* the same as a named workspace object, even if you have recently applied a workspace to the list. Calling `update()` on this retrieved copy will create a new workspace. It is recommended this be used primarily as a read-only version of the workspace to use to pass to another function, such as `app.selectDraft()`.<br>- **New:** `app.isPro` boolean to determine if the app is pro unlocked.<br>- **New:** `app.selectDraft()` can now optionally take a workspace parameter to set the initial search/filtering in the select window.<br>- **New:** `draft.append(text, separator)` and `draft.prepend(text, separator)` convenience functions on draft object. `separator` is optional and defaults to a line feed. <br><br>#### Other Changes and Updates<br><br>- **Change:** Refactor some of the code for the `FileManager` script object. The `write` methods no longer replace files, just update contents so the creation date is maintained and it interferes less with other apps using the same folders.<br>- **New:** \"Insert Text\" action steps should register an undo point to allow that insertion to be undone atomically.<br>- **Fix:** Clicking on a non-HTTP link in an HTML Preview should close the preview as if the cancel button were pressed.<br>- **Change:** Improve keyboard navigation and selection in Drafts select view (used in Share extension and `app.selectDraft()`).<br>- **Fix:** Calls to `editor.setSelectedRange` could inadvertently scroll to the end of the draft.<br>- **New:** Context menu on drafts in the trash can.<br><br>For additional details visit the online release notes at http://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"836500663","version_name":"21.1","version_date":"2020-06-20 18:39:13.000 +0800","version_description":"Quick fix for a crash in the iMessage app."},{"version_id":"836653726","version_name":"21.2","version_date":"2020-07-01 21:32:34.000 +0800","version_description":"Quick fix for issue appending to Dropbox files due to change in Dropbox's API results."},{"version_id":"837803795","version_name":"22.0","version_date":"2020-09-16 20:19:20.000 +0800","version_description":"Big update! Ready for the new OS, and with some great new features! Highlights below. For complete changelog with documentation links, visit: https://docs.getdrafts.com/docs/misc/changelog-ios<br><br># Design Refresh and Updates<br><br>Significant visual and functional refresh throughout the app. In many places, menus are used more effectively, especially on iOS 14.<br><br># Widgets<br><br>Added support for iOS 14 Widgets. Drafts ships with two types of widget, each available in multiple sizes:<br><br>- Grid Widget: Widgets that can appear in any widget size, with configurable elements that link to workspaces (including default, with inbox counts), pre-defined commands (new, dictate, search, etc.), or any action from your action list.<br>- List Widget: Displays the top drafts from the configurable workspace (include default \"inbox\" workspace).<br>  <br># Workspace and Filtering Changes<br><br>- Workspace date ranges: It is now possible to configure start and end dates for a workspace. <br>- Show search preview: option in drafts list and workspaces. When enabled, if a text search is active in the search field, the body preview displayed in the list will change to show line numbers and text snippets previewing where the match terms appear in the draft to provide additional context when searching.<br>- The tag filter pane can now be set to \"Show All Tags\" (the previous default), or \"Only Tags in Current Filter\". The later is a new option that filters the list of available tags to only show tags assigned to at least one draft in the current query in the draft list.<br><br># Action Versioning<br><br>When editing actions, there is now a version history feature available that allows creating and restore backup snapshots of an action. Versions are automatically stored when an action is installed from outside the app and can be created manually at any time in the version screen. <br><br># Wiki-Style Link Improvements<br><br>Based on feedback, several minor changes have been made to better support the `[[wiki-style]]` crosslinks added in Drafts 20.<br><br>- Linking now supports direct links to markers (such as Markdown headers) within the content of longer drafts. The syntax is `[[Title of Draft/Marker Name]]`.<br>- If a `[[wiki-style]]` title link matches multiple drafts, the app will throw up a warning and open a search for the title to help you disambiguate your intentions and make you aware that more than one match exists.<br>- The `/open` URL, when used with `allowCreate=true` should prompt about the creation of the new draft.<br>- The `/open` URL now supports a `marker` parameter to target a specific marker inside a draft.<br><br># Other New Items<br><br>- \"Vivid Dark\" theme.<br>- Support for new watchOS 7 complications.<br>- Support for \"Wind Down\" shortcuts. <br>- File action step has new \"Tags\" field, which can be configured to assign Finder tags to files when writing them. Use `[[tags]]` to pass through tags assigned to the draft.<br>- Keyboard shortcut assignments now supports using several special keys, notably arrow keys. <br>- Drag and drop of a message from Mail will now insert not just the subject of the dragged message, but the \"message:\" URL linking to the original message.<br>- Backups now have a \"keep\" setting to control how many backups to keep, automatically sweeping older backups to avoid consuming too much space.<br>- `/actionSearch?query=TEXT` URL to open directly to a search of the action list.<br><br>Complete release notes: https://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"838216558","version_name":"23.0","version_date":"2020-10-15 13:51:24.000 +0800","version_description":"Ready for the new OS, and with some great new features! Highlights below. For complete changelog with documentation links, visit: https://docs.getdrafts.com/docs/misc/changelog-ios<br><br>## Draft Widget<br><br>\"Draft\" widget type to display the content of a specific draft. This is in addition to Grid and List widget types released in the previous update. After adding the widget, edit options to select draft and display options. Tapping the widget opens the selected draft. Useful for keeping a scratchpad draft, or similar.<br><br>## Advanced Search Queries<br><br>Drafts searches support powerful new query options. These options apply to anywhere drafts are searched, including the draft list, workspaces quick search, and scripted queries:<br><br>- Not new, but searches can use quotation marks to find \"exact phrases\", and prefix a term with a hyphen to omit it, like `-blue`.<br>- Support for `title:` and `tag:` prefixes to force a query to only look for a term in draft titles or tags. May be combined with exact phrase searching, so `title:\"My Draft\"` will look for only drafts with the string \"My Draft\" in the first line.<br>- `AND` and `OR` operator support. `AND` is not needed, as it is assumed as the operator at any space between terms. Examples:<br>\t- `blue OR green` would find any drafts with either \"blue\" or \"green\" in the text.<br>\t- `blue red OR green` would find drafts with both \"blue\" and \"red\" or only \"green\".<br>- Regular expression terms. Marked by wrapping a term in forward slashes (`/term/`). Examples (not necessarily useful ones):<br>\t- `/.*ABC.*/` would find any drafts with \"ABC\" in the text.<br>\t- `/\\d+/` would find any drafts that *start* with a number.<br>\t- `/.*\\[\\[.*\\]\\].*/` would find drafts with `[[wiki-style]]` links <br><br>## Other Updates<br><br>- Small but useful change: When searching the action list, groups appear as separators. It is now possible to tap on those group separators to load the group in the list.<br>- List widget now has \"All\" as a folder selection option.<br>- List widget supports small widget size, displaying only the one top draft in the workspace.<br>- \"Duplicate\" swipe action in Workspace manager.<br>- \"Open App\" command option for widgets which just opens Drafts like tapping the app icon (not the \"Empty\" option already does this, too, but that's not clear)<br>- `[[display_title]]` and `[[body_preview]]` template tags. These match the trimmed display versions of the title and body displayed in the draft list.   <br>- If `/open` URL with title parameter finds more than one matching draft, the resulting search now opens with `title:\"value\"` search to limit results to only matching titles.<br>- \"Save Current\" option in workspaces menu to create a new workspace based on current list options.<br>- `draft.bodyPreview(maxLength: Int)` function. Returns trimmed body preview similar to what is used in the draft list, removing first line and trimming whitespace and truncating to the requested length.<br>- Disable smart quotes-dashes in find window.<br>- Add way to enable link mode from action bar selection view.<br>- Import from backup might not maintain correct modification dates.<br>- Restore \"Miscellaneous\" category of action icons, which was missing for some reason.<br>- Widget intent configuration options should not appear in the Shortcuts app.<br>- Continuing search from Spotlight should go to quick search when available.<br>- Issue with automatic changes between dark-light mode not updating editor text properly.<br>- XML-RPC requests might improperly entify parameter strings.<br>- Workspaces using date filters would display incorrect counts in a Widget.<br>- `app.showDraftList()` called with a pinned draft list on iPad could result in greyed out editor.<br><br>Complete release notes: https://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"838557643","version_name":"24.0","version_date":"2020-11-07 13:28:52.000 +0800","version_description":"### Support for FlickType keyboard on Apple Watch.<br><br>- FlickType is a convenient on-screen keyboard for use on Apple Watch.<br>- Requires watchOS 7 and the FlickType Apple Watch app.<br>- Use any of the capture methods in the Drafts watch app that offer options - indicated by the pen icon- either to capture from the main screen, or when appending/prepending to existing inbox drafts. Options will include \"FlickType Keyboard\" option, which allows you to go to the FlickType app, enter text, and send it back to Drafts.<br>- For details about FlickType, visit https://www.flicktype.com<br><br>### HTML Previews can now reference local assets<br><br>Both HTML Preview action steps, and Preview windows can now generate HTML that includes references to  images, javascript, stylesheets, or other assets via relative paths. To use, create a folder at `iCloud Drive/Drafts/Library/Previews`, and place images, stylesheets, and other resources in this folder and its subfolders. HTML previews can reference those assets via relative paths. If the `/Library/Previews` does not exist, previews will continue to function as they always have. If it does exist, the HTML will be written to a temporary file in that directory and loaded so that the directory can be used to access other assets. <br>  <br>### Other Updates<br><br>- **Change:** Simplify app icon badge settings and make sure the default correctly align with default workspace settings. <br>- **Fix:** When an action was run from search, it did not respect the default \"After Success\" setting of its action group.<br>- **Fix:** Recent draft with an excessively long first line could create performance problems displaying the navigation menu.<br>- **Fix:** When triggering a share sheet from a script, if you selected a share extension, then canceled, it could result in a crash.  <br>- **Fix:** Wiki-style title links starting with escaped forward slashes failed to find the proper draft.<br>- **Fix:** Address crasher on watchOS versions less than 7.<br>- **New:** \"Purge Transactions\" maintenance task in Settings &gt; iCloud Sync. Not generally necessary, but this task cleans out sync transaction log entries which have been processed, which may improve performance (not much, if any) in long-lived installation. <br>- **New:** Allow search in Action Selection window (used by \"Run Action\" operation in draft list).<br><br>Complete release notes: https://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"839224802","version_name":"24.1","version_date":"2020-11-17 18:57:02.000 +0800","version_description":"A few minor changes, if you relied on flagged-only app icon badges, that functionality has been restored...<br><br>- **Change:** Based on popular demand, changed \"New\" to \"New with Clipboard\" option in long press on app icon.<br>- **Fix:** HTML Previews could incorrectly display multi-byte characters if using the new local assets options introduced in version 24.<br>- **Change:** Ability to based app icon badge on flagged instead of inbox folder of the selected workspace.<br><br>Complete release notes: https://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"839538303","version_name":"24.2","version_date":"2020-12-08 15:49:13.000 +0800","version_description":"Search for the right icon when configuring actions and workspaces, and a few more things...<br><br>#### What's New<br><br>- Icon keyword searching. When selecting icons for workspaces and actions, search is available to help locate useful icons by keyword.<br>- Web capture template used in share extension now supports `[[date]]` and `[[time]]` tags to allow incorporation of timestamps when capturing from Safari.<br>- `ActionGroup` script object has `installURL` [string] property to access the shareable URL to import the group.<br>- `/getCurrentDraft` URL action. Takes no parameters, calls `x-success` URL with parameters for the uuid, url, title, content of current draft. <br>- `context.addSuccessParameter(key, value)` method to assign query arg parameters to be included with the `x-success` callback of `/runAction` URLs.<br><br>#### Other Changes and Update<br>  <br>- **Fix:** Better refresh of widgets after drafts are created/altered outside of the app (via extensions and shortcuts).<br>- **Fix:** On a cold start of app some URLs might not get routed properly.<br>- **Fix:** Complication issue on watchOS versions less than 7.<br>- **Fix:** Display issue with buttons in find window on iOS 12.  <br>- **Fix:** Address several crashers.<br><br>Complete release notes: https://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"839577419","version_name":"24.2.10","version_date":"2020-12-10 00:58:09.000 +0800","version_description":"Quick fix to address some minor issues in the previous update."},{"version_id":"839711949","version_name":"25.0","version_date":"2020-12-18 20:14:13.000 +0800","version_description":"Drafts Pro subscriptions now support Family Sharing! Share your pro features with up to five family members!<br><br>#### What's New<br><br>- It is now possible to use `Tab` and `Shift-Tab` as keyboard shortcuts assigned to actions. This change allows the default \"Indent\" and \"Outdent\" actions (which ship in \"Editing\" group) to be assigned these shortcuts to allow Drafts to behave more like a word processor style editor, if that's your thing, rather than the command-[ and command-] defaults.<br>- Action list option (in \"...\" menu) to display keyboard shortcuts in action list. Useful to help remember to use the keyboard shortcuts you have configured for actions (these can be changed in action edit screen).<br>- Allow wiki-style links with headings, like `[[Title of Draft/Markdown Heading]]`, to navigate to the heading within the same draft.<br>- Simple List syntax now supports `{ }` `{-}` `{x}` three-state curly braces tasks as well as the standard `[ ]` `[x]` square bracket tasks.<br><br>#### Other Changes and Updates<br><br>- Add warning if an action group is reaching the maximum size limit (1 MB) for a single action group's data.<br>- Rewrite of list completion, moving it to syntax definitions to allow better control. For example, TaskPaper list completion will now only complete for \"- \" lines, not \"* \" lines, which are not part of that format.<br>- Encoding agreement issue with remote loaded content in HTML previews<br>- `editor.preferredTabString` property returns the current selected tab insertion type for the editor in the form of a string. Useful for making actions respect that setting when inserting indents, etc. - will return either \"\\t\", \"  \", or \"    \".<br><br>Complete version history with documentation: https://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"839915001","version_name":"25.1","version_date":"2021-01-06 15:34:37.000 +0800","version_description":"Mostly a bug fix/performance release...<br><br>- Performance and memory use improvements.<br>- **New:** Print action step adds option to set font size for plain text format printing.<br>- **New:** Convenience methods on `Todoist` scripgin object to work with Sections.<br>    - `getSections() -&gt; [object]`<br>    - `getProjectSections(projectID: Int) -&gt; [object]`<br>    - `createSection(options: object) -&gt; object`<br>    - `getSection(sectionID: Int) -&gt; object`<br>    - `updateSection(sectionID: Int, options: object) -&gt; object`<br>- **Fix:** Scroll position placed wrong when returning to app without creating a new draft.<br>- **Fix:** Line height not always set properly in a new draft until a character was typed. Mostly visible when \"highlight insertion point\" is enabled.<br>- **New:** `HTTPResponse` script object now has `headers` object property exposing any HTTP headers returned with the response. <br>- **New:** Option to export sync log to Files app for users who do not use the default Mail app.<br><br>Complete version history with documentation: https://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"840994505","version_name":"26.0","version_date":"2021-03-23 11:31:38.000 +0800","version_description":"Huge update! Custom Syntaxes and Themes are here! <br><br>#### Custom Syntaxes and Themes<br><br>Drafts now supports custom editor syntaxes and themes. With this feature, Drafts can be extended to support more different markup languages than the Markdown, TaskPaper, and other syntaxes which come built-in. It also means you can install or create custom theme definitions that control the appearance of the app. <br><br>Be sure to visit the syntaxes and themes documentation in the User Guide to learn more details about using and even creating your own syntaxes and themes!<br><br>https://docs.getdrafts.com/extending/<br><br>Note that the selection and application of syntaxes and themes are scriptable, as well. Visit the Scripting Reference for information on the new `Syntax` and `Theme` objects if you are interested in automating these features.<br><br>#### Drafts Directory Updates<br><br>In addition to actions and workspaces, the Drafts Directory (https://actions.getdrafts.com/) is also now a repository for custom syntaxes and themes. We look forward to seeing many new, ready-to-use examples from the community in the coming weeks.<br><br>The Directory has learned a few new tricks as well. User sharing and updating actions to the Directory can now include update notes explaining what has changed, and these will be displayed on the site.<br><br>Even better, you can now update, download, and install new versions of items installed from the Directory right in Drafts. Because this feature requires a link back to the source, it is currently only possible to find and install updates for items installed after the rollout of this feature. The update process is manual, but we plan to build on this with automatic update features in the future.<br><br>#### Balance While Typing<br><br>While typing, Drafts will automatically match parenthesis (), braces {}, brackets [] and quotes \"\". So typing (, will also insert the ), etc. If you have a text selection when typing one of these pairs, the selected text will be wrapped. This feature is enabled by default, but can be turned off in editor preferences on a per-syntax basis.<br><br>#### Other Changes and Updates<br><br>- Action Group versions. We rolled out the ability to save backup versions of actions in v22. This same feature has been extended to action groups, allowing you to make restorable backup versions of your action groups.<br>- New pink tint color option for actions and workspaces.<br>- Actions which require network access, run via URL/Shortcut, on cold start of the app could sometimes fail with a network error even though network was available.<br>- Better VoiceOver announcements for action completion messages.<br>- Update TextExpander SDK.<br>- Better display of items found in Spotlight search.<br>- Selecting dictation from keyboard bar with external keyboard connected on iPad not working properly.<br>- Hide B/I/U options in share extension text selection menu because they don't do anything.<br>- When creating reminders with Reminders and List in Reminders action steps, only set the \"note\" value if it will contain content. This avoids a bug in the Reminder's watch app that displays tasks with a blank note as having a note (Watch only, this does not happen on iOS).<br>- Action steps disabled on current platform could run when that action is used via an \"Include Action\" step.    <br>- Allow folder tab and action group assignments to be set on default workspace.<br>- Crash passing invalid values to `strftime`<br>- Paragraph number alignment could get off with paragraph spacing values assigned.<br>- Remove \"launch in focus mode\" preference. Session will just launch with focus mode in it's last active state.<br>- Obscure crasher with scripted prompts with multiple pickers with different number of components.<br><br>Complete version history with documentation: https://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"841121456","version_name":"26.1","version_date":"2021-03-30 20:00:00.000 +0800","version_description":"Don't miss the great new custom syntax and theme support in v26! This release address the below items:<br><br>- Better indication of selected themes.<br>- **Fix:** iOS 12 only crash selecting fonts.<br>- **Change:** A few updates to the `indentationPatterns` entries in syntax definitions to allow scope to be specified properly to make sure the indent is calculated using the right font metrics. See docs for details.<br>- **Fix:** Tag field placeholder not themed correctly on cold start.<br>- **Fix:** Custom syntaxes not available for selection in Shortcuts.<br>- **Fix:** Custom syntaxes and themes not properly visible in some menus.<br><br>Complete version history with documentation: https://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"841343245","version_name":"26.2","version_date":"2021-04-14 15:17:28.000 +0800","version_description":"A few tweaks and fixes, plus Workspaces can now switch themes when applied!<br><br>- **New:** Workspaces have options to apply themes when loaded. Similar to options to load action groups, this allows the active theme in Drafts to be changed when a workspace is applied.<br>- **New:** Workspaces have options to apply themes when loaded. Similar to options to load action groups, this allows the active theme in Drafts to be changed when a workspace is applied.<br>- **Fix:** Tweak code block patterns in MultiMarkown and GitHub syntaxes to better support use of a background color in themes.<br>- **Change:** Rename \"balance while typing\" to \"Auto-match\", and disable by default. This is the faeture that matches (), [], {}, and \"\" automatically. It was causing some confusion, and was poorly labelled.<br>- **Fix:** Plain text syntax returning a blank name in scripting.<br>- **Fix:** Auto-match (nee balance while typing) could interfere with text replacement by Services.<br>- **Fix:** Restore missing punctuation action icons.<br>- **Fix:** Some wonky behaviors with \"hide action bar\" and \"hide keyboard bar\" preferences.<br><br>Complete version history with documentation: https://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"842066569","version_name":"26.3","version_date":"2021-05-04 20:19:31.000 +0800","version_description":"Drafts web capture now available! Visit capture.getdrafts.com for details!<br><br>- **IMP:** This will be the last update to support iOS 12!<br>- **Fix:** Missing visibility of workspace directory sharing options.<br>- **Fix:** Address some performance issues.<br><br>Complete version history with documentation: https://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"842354999","version_name":"27.0","version_date":"2021-05-26 19:00:36.000 +0800","version_description":"Custom Widget Themes, Google Tasks and Microsoft To Do integration, and more!<br><br>#### What's New<br><br>### Custom Theme Support for Widgets + New Action Icons <br><br>It is now possible to select custom light and dark themes for Home Screen widgets from the built-in and custom themes you have installed in Drafts. We have also added dozens of new icons for actions/workspaces in categories like Health, Animals, Education, Email, and more.<br><br>If you create custom themes, you may wish to add the following new keys in `colors.interface`: `widgetBackground`, `widgetBackgroundAlternate`, `widgetForeground`, `widgetForegroundAlternate`. If not present, these values will fall back to existing related keys: `background`, `backgroundCollection`, `foreground`, so existing themes should work out of the box without updates.<br><br>### Google Tasks and Microsoft To Do Integration<br><br>Extensive integration with two of the most popular task managers:  Google Tasks and Microsoft To Do. This version adds new action steps which can create individual tasks, or add each line of draft as a task, to lists in either Google Tasks or Microsoft To Do.<br><br>Both services are available via scripting, with powerful script objects with convenience methods for creating and updated tasks and lists, while also exposing the full APIs to advanced users.<br><br>For sample actions, scripts, and integration guides, visit the Drafts Community Forums (https://forum.getdrafts.com).<br><br>### Arrange Mode Improvements<br><br>Arrange mode has better external keyboard support, including:<br>    - `Esc` and `⌘-return` to cancel or accept changes<br>    - Arrow keys navigate up-down in the list<br>    - `⌘-up/down` move the selected line up and down in the list.<br><br>#### Other Updates and Fixes<br><br>- **Change:** iOS 12 no longer supported.<br>- **Fix:** URL scheme could be called twice on cold start of app.<br>- **Fix:** Better support for import of exported files from Drafts 3 or earlier<br>- Script changes:<br>    - `Event` object properties:<br>        - `identifier`<br>        -  `attendees` array to access (readonly) attendee list.<br>        - `availability` string with values `busy`, `free`, `tentative`, `unavailable`, `notSupported`<br>    - `Reminder` object properties:<br>        - `identifier`<br>- **Fix:** Drafts set in the editor via `editor.load` should get added to recent drafts list.<br>- **Fix:** Messages app background in dark mode had issues.<br>- Refactor assets to save on app download size.<br><br>Complete version history with documentation: https://docs.getdrafts.com/docs/misc/changelog-ios"},{"version_id":"842858497","version_name":"27.1","version_date":"2021-06-29 18:04:38.000 +0800","version_description":"Minor quick fix release, details:<br><br>- Link mode button not activating properly<br>- Options menu in filters pane not working properly on iOS 14"}]