[{"version_id":"823112778","version_name":"1.0","version_date":"2017-08-14 19:04:55.000 +0800","version_description":""},{"version_id":"823451505","version_name":"1.2.4","version_date":"2017-08-29 20:39:04.000 +0800","version_description":"- Touching normal &amp; hold notes are now easier<br>- Adjusted the size of drag notes<br>- Fixed critical issues with note timings<br>- Fixed incorrect note priority"},{"version_id":"823535662","version_name":"1.2.5","version_date":"2017-09-04 20:03:11.000 +0800","version_description":"- Remade drag notes<br>- Readjusted note sizes and hitboxes<br>- Shrinks upper-right pause hotspot<br>- Fixed hold notes being judged early when switching fingers<br>- Fixed million master being impossible in some charts"},{"version_id":"823964869","version_name":"1.3","version_date":"2017-10-10 21:28:28.000 +0800","version_description":"- Long-awaited high score system is here!<br>- Individual options (note delay, inverse) for each level!<br>- Screen orientation is now fixed while playing<br>- Levels are now sorted properly (previously, levels start with a lowercase initial would appear at the bottom of the list)<br>- Minor UI adjustments<br>- There might be some bug fixes?<br>- More like introduced some bugs for future me to fix"},{"version_id":"825196881","version_name":"1.3.1","version_date":"2017-12-05 18:01:46.000 +0800","version_description":"It's been a while! \\(*w *)/<br>- Added hit sounds: tambourine, rim and shaker<br>- You can now delete unwanted charts in Options (Finally!)<br>- Now you have to tap the upper right corner TWICE to pause (You know, to prevent accidental pauses...)<br>- The most recently played level would now be selected upon launch<br>- Fixed inverse override being automatically reset"},{"version_id":"826051155","version_name":"1.4","version_date":"2018-03-06 00:52:04.000 +0800","version_description":"1.4 has arrived! (๑¯∀¯๑)<br><br>- Introducing: Ranked Mode! Play and rank among global players!<br>- Two new built-in songs from Trifect and PTB10!<br>- You can now share your scores with others!<br>- Much faster startup time!<br>- Fixed levels being incorrectly vertically inverted: you can now turn off \"Inverse\" for your levels if you were told to turn on it previously<br>- The installed level will now be automatically selected<br>- New option: larger hitboxes &amp; early/late indicator<br>- Many bug fixes<br><br>...and more!"},{"version_id":"827164950","version_name":"1.5","version_date":"2018-08-01 18:57:32.000 +0800","version_description":"Cytoid 1.5 \"Anniversary Update\"<br><br>- New official song \"Ecstatic\" by Delos and a hidden song by PTB10. (Can you find it?)<br>- Flick notes, long hold notes, and variable scanline speed: more freedom to creators, and more fun to players.<br>- Mods: Invisible notes, faster approach rates, health bars... Challenge yourself in different ways!<br>- Player Exp/Rating: Show off your ability, and compete with players from around the world!<br>- In-game integration: You can now rate levels and view level leaderboards directly without leaving the game!<br>- Audio system has been completely overhauled. Now you won't need to tune the chart offset very often! (The level absolute chart offset is now replaced with the level relative chart offset, which is relative to the main chart offset.)<br>- A shiny new UI design and some subtle game animation improvements.<br>- New customization options, including note size, margins, play area boundaries, detailed color customizations, and more!<br>- Did I mention the game runs much smoother as well?"},{"version_id":"829122155","version_name":"1.5.1","version_date":"2018-10-31 17:34:58.000 +0800","version_description":"Happy Halloween! This update brings new, exciting storyboarding features to all charters.<br><br>- Storyboard:<br>    * Triggers: Conditionally spawn stage objects<br>    * Stage objects can now be destroyed to boost performance<br>    * UI/Scanline/Background dim/Storyboard opacity<br>    * Stage objects layer &amp; order<br>    * Note colors, size &amp; opacity<br>    * Sprite/Scanline colors<br>- Added background dim option<br>- Clarified note descriptions in options<br>- Fixed other minor bugs"},{"version_id":"829810872","version_name":"1.5.2","version_date":"2019-01-02 23:28:31.000 +0800","version_description":"Some bug fixes and general improvements. More to come in 2019!"},{"version_id":"832851791","version_name":"Compatibility\r\rIf you are using iOS 10","version_date":"","version_description":""},{"version_id":"832851791","version_name":"1.5.5","version_date":"2019-09-23 17:05:32.000 +0800","version_description":"- Fixed a file compatibility issue with iOS 13.<br>- The latest Unity engine has optimized the audio play offset, which means you may have to reconfigure your level offset settings because of this change! We recommend deducting 0.05-0.1s from your current offset settings. We apologize for this inconvenience!"},{"version_id":"837779050","version_name":"2.0.0","version_date":"2020-09-18 07:13:18.000 +0800","version_description":"◾ iOS 版本兼容<br>\n<br>如果你正在使用 iOS 10、11 或 12，请在运行 Cytoid 之前先更新到 iOS 13，或者更新到当前 iOS 的最新版本（即 10.3.4、11.4.1 或 12.4.8）。<br><br><br>酝酿两年，期待已久的 2.0 版本终于来了！<br><br>我们将 Cytoid 彻底回炉重造，只为了提供更有趣的机制、更棒的 UI、更多样化的游戏模式，打造一流的社区驱动音游体验。<br><br>◆ 全新体验：完全重新设计的 UI 变得更漂亮，也更容易使用<br>◆ 内置社区：无需离开游戏即可浏览和下载 4000+ 用户关卡<br>◆ Rating 体系：重新设计的 Rating 系统，更为公平也更容易取得高 Rating<br>◆ 训练模式：Lv.1 到 Lv.15 的 15 个循序渐进的关卡，专为训练你的 Cytoid 能力而设计<br>◆ 活动模式：参加当季和合作活动，获取专属奖励<br>◆ 段位模式：通过各种难度的段位认定，证明自己的实力<br>◆ 可解锁角色：他/她们会陪伴你的 Cytoid 之旅<br>◆ 更高的创造自由度：新的 Storyboard 功能将彻底颠覆 Cytoid 的传统玩法<br>◆ 更方便的音频/谱面校准：更低的音频延迟、新增的校准模式和一次性的设备偏移向导，彻底解决音频与谱面不同步问题<br>◆ 本地化：Cytoid 现在支持 14 种语言了！其中当然也包括中文，以及...符语<br>——还有更多新功能等待你去发掘！<br><br>Cytoid 的开发与运营离不开一众画师、曲师与谱师的辛勤劳动，与捐赠者们的慷慨支持。请访问 https://cytoid.io/credits 查看致谢名单。"},{"version_id":"838423241","version_name":"2.0.2","version_date":"2020-10-29 18:34:00.000 +0800","version_description":"- 修复了部分 iOS 版本上开幕闪退的问题<br>- 移除了内存警告提示（毕竟全是误报OTL）<br>- 修复了数据库损坏和无法自动重建的问题<br>- 修复了角色不在段位选择界面显示的问题<br>- 修复了部分 Storyboard 的 Drag 鬼畜的问题<br>- 更新了本地化文本"}]