[{"version_id":"828611012","version_name":"1.0","version_date":"2018-09-19 13:07:16.000 +0800","version_description":""},{"version_id":"828823455","version_name":"1.0.1","version_date":"2018-10-25 04:44:49.000 +0800","version_description":"С каждым новым релизом мы улучшаем работу нашего приложения.<br>В этом релизе мы улучшили скорость работы приложения и исправили мелкие ошибки."},{"version_id":"829056629","version_name":"1.0.3","version_date":"2018-10-29 15:29:28.000 +0800","version_description":"С каждым новым релизом мы улучшаем работу нашего приложения. В этом релизе мы оптимизировали работу приложения, а также добавили возможность перехода на Tele2 сохраняя свой номер."},{"version_id":"829634713","version_name":"1.5.0","version_date":"2018-12-19 08:41:09.000 +0800","version_description":"Приложение стало лучше!<br>В этом обновлении мы сумели решить проблему, которая возникала при обмене ресурсов."},{"version_id":"831457338","version_name":"1.5.1","version_date":"2019-05-31 09:54:48.000 +0800","version_description":"В этом обновлении мы отобразили соц сети в полном объеме для тех абонентов у которых услуга подключена. Убрали возможность перехода со своим номером телефона на Tele2 от другого оператора связи. Если вы хотите стать абонентом Tele2, переходите по ссылке https://zaprosto.kz"},{"version_id":"831514511","version_name":"1.5.2","version_date":"2019-06-20 03:46:06.000 +0800","version_description":"Лето, жара, отпуск... Но мы не расслабляемся! <br>С новым обновлением мы улучшили функциональность приложения, решили проблему при обмене ресурсов, а также сделали отображение остатка Интернет-трафика более удобным."},{"version_id":"832124585","version_name":"1.5.3","version_date":"2019-07-26 04:35:24.000 +0800","version_description":"Исправлены ошибки и улучшена стабильность работы мобильного приложения."},{"version_id":"832802714","version_name":"1.5.5","version_date":"2019-09-18 14:13:21.000 +0800","version_description":"С новым обновлением мы улучшили функциональность приложения и добавили отображение остатков по ресурсам"},{"version_id":"833505379","version_name":"1.5.13","version_date":"2019-11-29 06:03:31.000 +0800","version_description":"Мы постоянно работаем нам улучшением функционала.  В новой версии приложения исправлено отображение абонентского номера"},{"version_id":"834160542","version_name":"1.5.17","version_date":"2019-12-31 05:11:53.000 +0800","version_description":"С новой версией приложения для наших абонентов доступен ежедневный пакет за 130 тенге в день на тарифном плане \"Меняй все за 2590\". Теперь вы можете оставаться на связи даже когда вам недостаточно средств на списание полной абонентской платы!"},{"version_id":"834965009","version_name":"1.5.19","version_date":"2020-03-05 05:53:19.000 +0800","version_description":"В новой версии приложения вы можете найти в обновлённых тарифных планах «Меняй всё» еще больше безлимитных сервисов. С услугой «ежедневный пакет», доступной на новых тарифных планах, вы можете оставаться на связи даже когда вам недостаточно средств на списание полной абонентской платы!"},{"version_id":"835273700","version_name":"1.5.20","version_date":"2020-03-26 11:58:16.000 +0800","version_description":"В новой версии приложения мы добавили детализацию расходов. Детализацию за 30 дней вы можете посмотреть на экране смартфона, а выгрузку более 30 дней можно отправить на e-mail. Видео ролик, как обменять ресурсы, https://youtu.be/qPp-FAmPFa8"},{"version_id":"835299348","version_name":"1.5.21","version_date":"2020-03-27 23:30:04.000 +0800","version_description":"В новой версии приложения мы доработали детализацию расходов. Инструкция, как обменять ресурсы, https://youtu.be/qPp-FAmPFa8"},{"version_id":"835833520","version_name":"1.5.23","version_date":"2020-05-06 11:10:46.000 +0800","version_description":"В новой версии приложения доработан раздел \"Детализация\", а именно исправлено отображение коротких номеров."},{"version_id":"836167693","version_name":"1.5.25","version_date":"2020-05-28 12:20:00.000 +0800","version_description":"В новой версии приложения доработан раздел \"Детализация\". Сделаны доработки по части deep Linking. Теперь наши абоненты смогут целенаправленно перемещаться в заранее определенные разделы."},{"version_id":"836373548","version_name":"1.5.26","version_date":"2020-06-15 03:13:18.000 +0800","version_description":"В новой версии приложения для наших абонентов доступен рейтинг самоизоляции. Абоненты, у которых будет зафиксирован максимальный уровень соблюдения карантина, попадут в TOP 10% и получат бесплатные Gb."},{"version_id":"837019792","version_name":"1.5.27","version_date":"2020-07-27 18:40:55.000 +0800","version_description":"В новой версии исправлены ошибки и повышена стабильность работы приложения"},{"version_id":"837796883","version_name":"1.5.28","version_date":"2020-09-16 02:43:03.000 +0800","version_description":"В новой версии приложения мы запустили интернет-пакеты с обновленной логикой работы. Теперь трафик суммируется, а срок действия пакета продлевается согласно сроку последнего подключенного интернет-пакета."},{"version_id":"838136610","version_name":"1.5.29","version_date":"2020-10-09 14:22:27.000 +0800","version_description":"С новой версией приложения вы будете точно знать, сколько осталось интернет-трафика по тарифному плану."},{"version_id":"838224240","version_name":"1.5.30","version_date":"2020-10-15 20:33:15.000 +0800","version_description":"В новой версии приложения мы настроили корректное отображение ежедневного пакета для новой тарифной линейки Tele2 \"Твои правила\"."},{"version_id":"839525017","version_name":"1.5.31","version_date":"2020-12-09 18:15:12.000 +0800","version_description":"Ура! Мы запустили новое мобильное приложение Tele2 Казахстан. Обновляй и передавай свои минуты и гигабайты тому, кому они нужны прямо сейчас."},{"version_id":"839762838","version_name":"1.5.32","version_date":"2020-12-22 23:55:49.000 +0800","version_description":"Теперь в приложении Tele2 Казахстан можно передавать свои минуты и гигабайты тому, кому они нужны прямо сейчас!"}]