[{"version_id":"842977835","version_name":"2.0","version_date":"2021-07-09 04:03:47.000 +0800","version_description":"Active Arcade 2.0 is an entirely redesigned experience that delivers more immersive gameplay, a simplified user interface, and enhanced privacy. Note: some motion games from Active Arcade 1.0 are no longer available, but we're hard at work to regularly launch new games and bring the most popular games to Active Arcade 2.0.<br>• All-new gameplay: We’ve deployed a powerful new game engine and our latest new game “Whack-a-Mole” is more interactive and immersive than anything you’ve played before. Enhanced visual and audio effects will keep you engaged for hours of fun. <br>•&nbsp;Streamlined UI: We’ve made the interface even simpler and easier to get started playing games right away.<br>•&nbsp;Enhanced privacy: Your video recordings will no longer be shown to anyone else and there is no longer a public leaderboard. You will still be able to share your video highlights publicly by exporting them to your photo library or sharing them directly to social media. Your video history from Active Arcade 1.0 will also not be migrated to Active Arcade 2.0. For access to your past videos, please contact our support team.<br>•&nbsp;Fast video sharing: Exporting your video highlight is even faster in this new version, taking just moments for you to export your highlights and share them through your own apps and social media."},{"version_id":"843106563","version_name":"2.1","version_date":"2021-07-16 04:09:54.000 +0800","version_description":"• 2-Player Reaction Flow—Now you can play this popular Reaction game with friends. Tap the targets in order to beat your opponent.<br>• Other minor enhancements and bug fixes."},{"version_id":"843197000","version_name":"2.1.5","version_date":"2021-07-23 04:52:57.000 +0800","version_description":"Thank you for using Active Arcade! We are regularly making updates to our application to create a better experience for the Active Arcade community.<br><br>This update includes improvements to stability and performance."}]