[{"version_id":"812717584","version_name":"11.3","version_date":"2015-07-09 09:54:35.000 +0800","version_description":"• Automatic decimal: the keypad can automatically insert the decimal when entering prices and fuel amounts.\n• Background Sync: Road Trip now automatically syncs with Dropbox in the background when you launch the app.\n• Simplified Dropbox setup.\n• New statistics grouped by Driving Conditions and Fuel Type.\n• Data can be edited directly from the Fuel, Expense, and Trip detail screens.\n• The Fuel detail screen now includes the number of days between fills, as well as distance-per-day since the last fill.\n• Improved support for large fonts and dynamic type.\n• Bug fixes.\n\nThank you for your great suggestions and feedback.\n\nIf you enjoy Road Trip, please consider leaving a review in the App Store.  If you have any questions or suggestions, please send us an email: support@darrensoft.ca"},{"version_id":"813497523","version_name":"11.4","version_date":"2015-10-03 04:03:06.000 +0800","version_description":"• Updated for iOS 9.\n• Improved map location searching.\n• Payment section added to Statistics screen.\n• Support for URL launcher apps.  See Vehicle Info -> Launch URLs."},{"version_id":"818729040","version_name":"12.0","version_date":"2016-09-05 23:07:12.000 +0800","version_description":"• Customizable Shortcuts with support for URL launchers.\n• Customizable 3D-Touch Quick Actions and 3D-Touch Peek and Pop.\n• All New Distance Graph, grouped by day, week, or month.\n• Quickly duplicate an existing entry using a long-press.\n• Additional search fields: Payment, Categories, Notes.\n• Reminders now appear in search results.\n• Reminder notes are now easier to view and edit.\n• Tire Size Correction can now be greater than 50%.\n• Added Month-to-date and Year-to-date report presets.\n• Many small bug fixes and UI enhancements.\n\nIf you enjoy Road Trip please take a moment to leave a review in the App Store.  It helps us out.\n\nQuestions and suggestions?  Please email: support@darrensoft.ca\n\nThanks!"},{"version_id":"822589791","version_name":"13","version_date":"2017-06-19 08:57:48.000 +0800","version_description":"Important: This version includes important updates for Dropbox users.  Please update to ensure that there are no interruptions with your Dropbox syncing and backups.\n\nWhat's New:\n\n• Miles/km conversion.  Road Trip now allows you to switch between miles and km when travelling between countries.\n• Landscape orientation is now fully supported on iPhone 6 and larger devices.\n• Improved error detection when entering data.\n• Hardware keyboard support, including numerous new keyboard shortcuts.\n• Home Currency Conversion: You can convert an existing vehicle to a new home currency using a given exchange rate.\n• Date Format: Added option to exclude the time of day when creating new entries.\n• Distance to empty: New option to include current jerrycans in distance to empty calculation.\n• Odometer field can now be re-ordered along with the other fuel fields.\n• Updated to Dropbox V2 API.\n• Improved Dropbox error reporting and error handling.\n• Automatic decimal option for trip meter fields.\n• BYN (New Belarusian Ruble) currency is now supported.\n• Language selection: Road Trip can now be set to use English regardless of your device's current language settings.\n• Fixed a bug that could prevent Road Trip from exporting CSV files.\n• Added x-callback-url support for using Road Trip with other apps.  Visit http://darrensoft.ca for more info.\n\nIf you enjoy Road Trip please take a moment to leave a review in the App Store.\n\nQuestions and suggestions?  Please email: support@darrensoft.ca\n\nThanks!"},{"version_id":"822612684","version_name":"13.1","version_date":"2017-06-21 00:21:41.000 +0800","version_description":"v13.1: Fixed a problem with iOS 9 devices.\n\nv13.0:\n\nImportant: This version includes important updates for Dropbox users.  Please update to ensure that there are no interruptions with your Dropbox syncing and backups.\n\nWhat's New:\n\n• Miles/km conversion.  Road Trip now allows you to switch between miles and km when travelling between countries.\n• Landscape orientation is now fully supported on iPhone 6 and larger devices.\n• Improved error detection when entering data.\n• Hardware keyboard support, including numerous new keyboard shortcuts.\n• Home Currency Conversion: You can convert an existing vehicle to a new home currency using a given exchange rate.\n• Date Format: Added option to exclude the time of day when creating new entries.\n• Distance to empty: New option to include current jerrycans in distance to empty calculation.\n• Odometer field can now be re-ordered along with the other fuel fields.\n• Updated to Dropbox V2 API.\n• Improved Dropbox error reporting and error handling.\n• Automatic decimal option for trip meter fields.\n• BYN (New Belarusian Ruble) currency is now supported.\n• Language selection: Road Trip can now be set to use English regardless of your device's current language settings.\n• Fixed a bug that could prevent Road Trip from exporting CSV files.\n• Added x-callback-url support for using Road Trip with other apps.  Visit http://darrensoft.ca for more info.\n\nIf you enjoy Road Trip please take a moment to leave a review in the App Store.\n\nQuestions and suggestions?  Please email: support@darrensoft.ca\n\nThanks!"},{"version_id":"823413895","version_name":"13.2","version_date":"2017-08-27 02:09:33.000 +0800","version_description":"• Fuel and expense GPS coordinates can be sent to Apple Maps and Google Maps.\n• Fuel Type, Conditions, Payment, Categories, and Expense Type lists can be sorted alphabetically.\n• Display CO2 emissions in g/km.\n• Fixed a problem with the landscape graph time range selector.\n• Faster Dropbox Sync.\n• Various small bug fixes."},{"version_id":"824440802","version_name":"14","version_date":"2017-11-30 07:47:22.000 +0800","version_description":"• iOS 11 and iPhone X Support\n• Odometer replacement: You can now replace your vehicle's odometer while preserving your existing data.\n• Recently deleted items: Road Trip allows you to restore recently-deleted records and vehicles.\n• Reminder count is now displayed on the Vehicles List.\n• New smaller file format for on-line backups and syncing.\n• Swiping between vehicles is now circular.\n• Road Trip now displays the duration of single-day trips.\n• Resolved a problem where deleted names would re-appear after syncing.\n• Resolved a problem in iOS 11 that caused dates to be displayed in English instead of the native device language.\n• Resolved a problem that prevented Road Trip from fetching the latest foreign currency exchange rates.\n\nIf you enjoy Road Trip please take a moment to leave a review in the App Store.\n\nQuestions and suggestions?  Please email: support@darrensoft.ca\n\nThanks!"},{"version_id":"825779037","version_name":"14.1","version_date":"2018-01-29 04:23:21.000 +0800","version_description":"Bug fixes in v14.1 include:\n\n- Some text could be truncated when large fonts are enabled.\n- File names beginning with \"._\" could interfere with Dropbox syncing.\n- Improved error detection of out-of-order fuel and expense entries.\n- Improved Polish language localization (Thanks Grzegorz Kurnatowski!)\n- Fixed copy-and-paste between vehicles that have used the \"Replace Odometer\" feature.\n- Keypad rows might not deselect properly after scrolling.\n- The search bar could be positioned incorrectly in certain situations."},{"version_id":"826806871","version_name":"14.2","version_date":"2018-04-26 09:27:44.000 +0800","version_description":"• iOS Share Sheets: Vehicle data can now exported using the standard iOS Share Sheet.\n• Report exporting: Individual reports can now be exported as CSV.\n• Added an \"All\" category to the search options.\n• Bug fixes."},{"version_id":"828872946","version_name":"15.0","version_date":"2018-10-25 01:41:46.000 +0800","version_description":"• Siri Shortcuts: Road Trip's shortcuts are now available as Siri Shortcuts.  You can assign a Siri voice command to a Road Trip shortcut and you can use the iOS Shortcuts app to add Road Trip commands to the iOS notificaion center.\n\n• Vehicle Purchase and Deprecation: Road Trip can now include your vehicle's depreciation costs in your expense statistics.  You can enter your vehicle's purchase date and price, as well as any number of current or future vehicle valuations.\n\n\nBug fixes and minor changes:\n\n• Support for iPhone XS Max and iOS 12\n• The fuel price graph now always displays fuel prices in your preferred units, even when travelling in a different country.\n• Reminders may display the estimated due date based on current mileage, if the estimated due date is before the actual due date.\n• Expense entries now differentiate between a zero cost and an empty cost.\n\nIf you enjoy Road Trip please take a moment to leave a review in the App Store.\n\nQuestions and suggestions?  Please email: support@darrensoft.ca\n\nThanks!"},{"version_id":"829300146","version_name":"15.1","version_date":"2018-11-23 06:44:22.000 +0800","version_description":"Version 15.1: Small feature update\n\n• You can now create Siri Voice Shortcuts directly from within Road Trip's shortcut editor.\n• Trip cost calculator can switch between km and miles.\n• URL scheme now supports locationName, latitude, and longitude parameters.\n• URL scheme now supports any combination of fillAmount, unitPrice, and cost parameters.\n\nVersion 15:\n\n• Siri Shortcuts: Road Trip's shortcuts are now available as Siri Shortcuts.  You can assign a Siri voice command to a Road Trip shortcut and you can use the iOS Shortcuts app to add Road Trip commands to the iOS notificaion center.\n\n• Vehicle Purchase and Deprecation: Road Trip can now include your vehicle's depreciation costs in your expense statistics.  You can enter your vehicle's purchase date and price, as well as any number of current or future vehicle valuations.\n\nIf you enjoy Road Trip please take a moment to leave a review in the App Store.\n\nQuestions and suggestions?  Please email: support@darrensoft.ca\n\nThanks!"},{"version_id":"830552743","version_name":"15.2","version_date":"2019-03-15 05:29:23.000 +0800","version_description":"• Vehicle depreciation is now displayed in its own section of the Statistics page.\n• Multiple vehicle export.  You can now export all vehicles at once using the iOS Share Sheet.\n• Wh/mi and Wh/km units, for Tesla drivers.\n• The statistics page can now display multiple units at one time, such as MPG and L/100 km.  Select Graph > Options to configure.\n• Search for empty fields.  Enter a space into the search bar to search for records with empty or unset fields.\n• Improved searching for Chinese, Japanese, and Korean text.\n• Fixed bug where jerrycans were not deleted after being used.\n• Jerrycans can now be partially used.\n• When entering a foreign currency exchange rate, you can now enter both the foreign price and local price rather than just the exchange rate."},{"version_id":"831679193","version_name":"16","version_date":"2019-06-29 10:28:30.000 +0800","version_description":"iCloud Sync.  You can now use iCloud instead of Dropbox to backup and sync your data between multiple iPhones and iPads.  \n\nAttention current Dropbox users:\n\n• Due to a configuration change, you will need to sign in to your Dropbox account again after you install the update.  Road Trip will prompt you to do this when you launch the app.  Sorry for the inconvenience.\n\n• Dropbox's new 3-device limit does not apply to Road Trip.  If the Dropbox app is not installed then Road Trip will allow you to sign in directly to your Dropbox account, and this will not count towards the 3-device limit.\n\n• iCloud Sharing is not yet supported.  If you're using Dropbox to share data between multiple people, you should continue to use Dropbox.\n\n• It's safe to switch between iCloud Sync and Dropbox Sync at any time.  Only one syncing service can be enabled at one time.\n\nQuestions or feedback?  Feel free to send us an email at support@darrensoft.ca, or select \"Email Developer\" in the app."},{"version_id":"832576640","version_name":"16.1","version_date":"2019-09-10 03:29:26.000 +0800","version_description":"Bug fixes, including:\n\n• Fixed an issue where external files with a .roadtrip file extension could not be opened on some devices."},{"version_id":"832731292","version_name":"16.2","version_date":"2019-10-02 02:08:54.000 +0800","version_description":"Road Trip now supports Dark Mode on iOS 13.\n\nIf you enjoy Road Trip please take a moment to leave a review on the App Store.  It helps us out.  Thanks!"},{"version_id":"834070849","version_name":"16.3","version_date":"2019-12-22 05:18:22.000 +0800","version_description":"Added kWh/10 km units for users in Sweden.\n\nFixed a problem with extra large system fonts."},{"version_id":"834899039","version_name":"16.4","version_date":"2020-04-09 04:14:08.000 +0800","version_description":"• When entering back-dated expense entries, Road Trip will automatically fill the odometer field based on the selected date.\n\n• Improved Russian Localization (Thanks Denis Andreadis!)\n\n• Fixed a bug were upcoming service reminders may have appeared in the wrong order."},{"version_id":"838387792","version_name":"16.5.1","version_date":"","version_description":""},{"version_id":"839747404","version_name":"16.5.2","version_date":"2020-12-22 05:32:29.000 +0800","version_description":"Resolves a problem where the on-screen keypad could not be used when iOS Voice Control was enabled."},{"version_id":"844067057","version_name":"17.0","version_date":"2021-09-22 08:09:28.000 +0800","version_description":"You can now tap the title bar to quickly switch between vehicles.\n\niCloud Users: Road Trip can now automatically save CSV backups to your iCloud Drive.\n\nDropbox Users: This update includes support for Dropbox's new permissions system.  You will need to update to this version of Road Trip in order to sign in to your Dropbox account."},{"version_id":"845002387","version_name":"17.1","version_date":"2021-10-30 07:21:09.000 +0800","version_description":"Small bug fix update, including:\n\n- Vehicle list popover could be sized incorrectly when large text sizes are enabled.\n- Fuel cost graph could display the wrong moving average in some currencies."}]