[{"version_id":"813100628","version_name":"1.8.3","version_date":"2015-08-22 07:43:00.000 +0800","version_description":"The crash on start was fixed (we are totally sorry, we got so carried away with the app for Apple Watch that we let this awful bug creep into the update!).<br><br>Please UPDATE YOUR REVIEWS in the App Store, as it is very important to support our app, esp"},{"version_id":"815472786","version_name":"1.8.4","version_date":"2015-12-21 14:33:34.000 +0800","version_description":"Better be prepared in advance for the next semester, right? ;)<br><br>Let’s see what this update is all about:<br>• The update includes super handy complications to complement Watch OS 2. We really like those ;) <br>• 3D Touch Quick Action support - touch"},{"version_id":"816854674","version_name":"1.8.5","version_date":"2016-04-19 03:04:28.000 +0800","version_description":"This update’s nice touch: access upcoming assignments from Today pane by swiping left on your iPhone. <br><br>We also fixed that where-is-the-save-button-when-adding-assignment thing, by the way.<br><br>We have giant plans this year, but obviously only wi"},{"version_id":"819790570","version_name":"1.8.6","version_date":"2016-11-30 16:55:38.000 +0800","version_description":"OK, what’s hot in this update?<br><br>To start with, the app is now watchOS 3 compatible, and<br>• stability is improved<br>• iStudiez Pro complication now supports all available Watch Faces<br><br>iStudiez Pro is also iOS 10 compatible, but here is more:"},{"version_id":"819998197","version_name":"1.8.7","version_date":"2017-01-28 02:36:29.000 +0800","version_description":"This is a rather technical update to maintain smooth operation of our Cloud Sync service.<br>If you were unable to sign in to your iStudiez Pro Cloud Sync account recently, this update fixed the issue.<br><br>We also nailed some bugs (for example – inabil"},{"version_id":"820797610","version_name":"1.9.1We fixed the bug when assignment’s details were eliminated suddenly","version_date":"","version_description":""},{"version_id":"820797610","version_name":"1.9","version_date":"2017-03-25 05:06:28.000 +0800","version_description":"on iPad:<br>• Split Screen support (in case when you need to quickly check on your schedule or assignments while working on something, or if there are moments when you need to compare your class and part-time schedules), helping you gain more while using "},{"version_id":"821509511","version_name":"1.9.1","version_date":"2017-04-15 01:22:14.000 +0800","version_description":"Version 1.9.1<br>We fixed the bug when assignment’s details were eliminated suddenly, now all should work properly. All your info should be back where it belonged now.<br><br>More to that, we noticed it was handy for you to see upcoming exams in Overview "},{"version_id":"822352620","version_name":"1.9.2","version_date":"2017-06-20 12:27:53.000 +0800","version_description":"It is all about Apple Watch this time, guys.<br><br>Ok it took us some time, but it was worth it. We gave the app fresh look by making assignments and exams coexist nicely in the Overview, for you to be able to understand the whole picture at a glance.<br"},{"version_id":"822693985","version_name":"1.9.3","version_date":"2017-06-29 12:56:38.000 +0800","version_description":"This is a minor update which fixes some bugs reported in details by you guys:<br><br>• crash when trying to set Final Grade.<br>• occasional crash on iPhone 5/5c correlated with previously installed iStudiez Pro for Watch.<br>• bug when Calendar events fr"},{"version_id":"823698726","version_name":"1.9.4","version_date":"2017-09-20 05:19:07.000 +0800","version_description":"This update is quite significant, for two reasons:<br>• The app is now fully compatible with iOS 11 (simple, not need to talk a lot about it)<br>• Drag and drop feature is now implemented (slightly more tricky, dive into details below)<br><br>Within the a"},{"version_id":"823759374","version_name":"1.9.5","version_date":"2017-09-29 03:29:18.000 +0800","version_description":"We fixed crash that occasionally happened while editing class location."},{"version_id":"824214061","version_name":"1.9.6","version_date":"2017-12-12 13:42:50.000 +0800","version_description":"Always making the app better for you, guys!<br>This time we decided it would be nice to see course statistics in Planner tab on your iPhones. <br><br>Quite a few bugs related to compatibility with iOS 11 were fixed, and the app now fully supports and runs"},{"version_id":"826039589","version_name":"1.9.7","version_date":"2018-02-28 00:36:55.000 +0800","version_description":"Meet the Grade Graph on iPhone and iPad (earlier introduced in iStudiez Pro for macOS).<br><br>The Graph pictures your academic success in real time. It’s much easier to see how your grades progress (we do hope they are!) and get a nice visualization of h"},{"version_id":"827977100","version_name":"1.9.8","version_date":"2018-09-13 01:24:15.000 +0800","version_description":"New school year is here, and we are nurturing new ideas and thinking on new horizons ;)<br><br>And so far, here is what’s new and great for you right with this update:<br>• We changed the way class icons look, and all of the icons (including medical and r"},{"version_id":"827977100","version_name":"1.9.10","version_date":"2018-12-15 10:31:04.000 +0800","version_description":"That’s a probably one of those minor, but still valuable updates.<br>A few insignificant bugs were fixed. We just can’t stop polishing the app, you know ;) <br><br>Also, we wish the best to all those who’re passing their Finals these days! Good luck!"},{"version_id":"829266370","version_name":"1.9.9","version_date":"2018-12-06 21:25:31.000 +0800","version_description":"This update supports ALL Apple Watch complications, including the new ones for Infograph and Infograph Modular watch faces.<br>There were minor user interface issues some of you got annoyed with when using the app on new Apple devices. Gone and fixed.<br>"},{"version_id":"829647851","version_name":"1.9.10","version_date":"2018-12-15 10:31:04.000 +0800","version_description":"That’s a probably one of those minor, but still valuable updates.<br>A few insignificant bugs were fixed. We just can’t stop polishing the app, you know ;) <br><br>Also, we wish the best to all those who’re passing their Finals these days! Good luck!"},{"version_id":"829680035","version_name":"1.9.11","version_date":"2019-05-01 04:13:09.000 +0800","version_description":"To improve the availability of the app and make it closer to students, we are migrating iStudiez Pro Cloud Sync to the Multiplatform Sync, available via subscription. Active subscription allows to sync iStudiez Pro data on all supported platforms."},{"version_id":"832603820","version_name":"2.0","version_date":"2019-09-19 03:33:01.000 +0800","version_description":"Meet the new elegant interface of iStudiez Pro in Dark Mode on iOS 13, as if you are on a tuxedo party!<br>Also with this update those of you who suffered from the issue with the Settings button on iPad can sigh with relief, it won't bother you anymore. <"},{"version_id":"832902376","version_name":"2.0.1","version_date":"2019-09-27 00:32:06.000 +0800","version_description":"We fixed a small issue with Dark Mode on iPad."}]