[{"version_id":"16129080","version_name":"3.3.0","version_date":"","version_description":""},{"version_id":"314962642","version_name":"3.3.2","version_date":"","version_description":""},{"version_id":"685572641","version_name":"4.0.2","version_date":"2014-08-21 21:10:06.000 +0800","version_description":"- Improve map loading performance\r\n- Stability improvements"},{"version_id":"720452675","version_name":"4.1.1","version_date":"2014-09-25 17:39:45.000 +0800","version_description":"New Features\n\nUpdated for iOS 8 and iPhone 6/6+\n\nAdded buttons on initial page for common flight searches.  \nNew Airport View with Flight Boards accessible via toolbar buttons\nMoved Search button from NavBar to below search fields on Flight Searches\nViews Auto Refresh every 60 seconds - Configurable in Gear Menu Settings\nSped up Airport search\nDetailed airport weather (Cloud button) on Airport Views\nAdd control for viewing Nearby Traffic on Airport Map - Accessible in Layers menu\nAutomatically zoom to complete flight path rather than fixed zoom level.\nAllow zooming in fully on non-FA Classic map base layers. (Map zooms out to lower level when returning to FA Classic)"},{"version_id":"811178319","version_name":"4.4","version_date":"2015-01-28 16:27:40.000 +0800","version_description":"* Tap flight route to copy\n* Detailed flight cells\n* Improved map behavior\n* Logos for all major airlines\n* Bug fixes and performance improvements"},{"version_id":"811767075","version_name":"4.4.1","version_date":"2015-02-25 08:58:43.000 +0800","version_description":"* Add aircraft type to flight cells\n* Add flight status indicator to flight cells\n* Fix issue with last-selected airline\n* Fix status text for canceled flights"},{"version_id":"813250504","version_name":"4.4.2","version_date":"2015-09-16 16:10:11.000 +0800","version_description":"- iOS 9 compatibility \n- Minor bug fixes and functionality tweaks"},{"version_id":"815194521","version_name":"5.0","version_date":"2015-12-10 22:55:05.000 +0800","version_description":"We’re proud and excited to release FlightAware v5.0 — a MAJOR update for iOS 9 with an all-new and improved look and feel, plus lots of additional features for a better user experience!\n\n- Recent searches and alerts are displayed on the landing view.\n- Omnisearch allows you to simultaneously search for flights, tail numbers, airports, and cities.\n- Nearby flights can be displayed in a list and sorted by various data points.\n- Quickly filter search results using just about any data point: airline, flight status, origin, destination, etc.\n- When searching by tail number you can now view aircraft registration details and photos from the flight detail section.\n- Local search history is now synced with web search history.\n- Improved support for Voiceover accessibility."},{"version_id":"815369403","version_name":"5.0.1","version_date":"2015-12-17 09:40:52.000 +0800","version_description":"This maintenance update includes fixes for several of the bugs encountered with the initial release. \n\nWe’re proud and excited to release FlightAware v5.0 — a MAJOR update for iOS 9 with an all-new and improved look and feel, plus lots of additional features for a better user experience!\n\n- Recent searches and alerts are displayed on the landing view.\n- Omnisearch allows you to simultaneously search for flights, tail numbers, airports, and cities.\n- Nearby flights can be displayed in a list and sorted by various data points.\n- Quickly filter search results using just about any data point: airline, flight status, origin, destination, etc.\n- When searching by tail number you can now view aircraft registration details and photos from the flight detail section.\n- Local search history is now synced with web search history.\n- Improved support for Voiceover accessibility."},{"version_id":"816248037","version_name":"5.1","version_date":"2016-02-03 01:03:50.000 +0800","version_description":"Unit Conversion\n - Choose between Fahrenheit and Celsius\n - Choose between US Customary and Metric\n\nSearch Enhancements\n - Airline lookup is now supported when searching by flight\n - Search functionality has been streamlined to allow for searching without first selecting an Omnisearch result \n - When searching by route you can now exchange origin and destination and perform a new search directly from the results page\n - Support for searching by route and tail number has been added to the alert creation workflow\n\nUI Enhancements\n - Pull-to-refresh has been added to the airport view\n - Support for viewing map fullscreen on landing, flight, and airport views\n - Map centering and panning behavior as been improved to account for fullscreen mode\n\nOther Updates\n - More consistent display of flight and weather data with appropriate units \n - Airport view displays delay information on main screen\n - Additional flight information provided on flight detail view\n - Sign In/Sign Out has been added to the settings view\n - Several bug fixes and UI tweaks"},{"version_id":"816372202","version_name":"5.1.1","version_date":"2016-02-08 17:06:57.000 +0800","version_description":"- Bug fixes, including a fix for an issue that was causing a crash for some of our international users.\n- Minor change to map zoom behavior."},{"version_id":"817890851","version_name":"5.2","version_date":"2016-06-27 17:01:53.000 +0800","version_description":"Thank you for using FlightAware! We've made a bunch of improvements based on your feedback!\n\nRelease 5.2 includes the following:\n\n* The search workflow has been updated to better handle slower network connections.\n* The landing page has been updated to better integrate search history with the search bar and to display cached searches and notifications while retrieving updated information in the background.\n* iPhones can be placed in landscape orientation to display the map without a user interface.\n* A “Where's my plane?\" button will display on the flight detail landing screen if the flight has been delayed or has not yet departed.\n* Airport names have been added to the flight details view.\n* We updated terminology to use the word “Notifications” instead of “Alerts.” \n* The dark theme UI background color has been altered to increase readability across all map tile types.\n* The notification creation workflow has been updated with minor improvements to help with the creation and editing of notifications.\n* Additional bug fixes and internal changes.\n\nPlease email support@flightaware.com to leave feedback and suggestions, since we are unable to reply to reviews. Don't forget to rate us 5 stars in iTunes if you love our app. We really appreciate it!"},{"version_id":"817957663","version_name":"5.2.1","version_date":"2016-07-01 16:29:59.000 +0800","version_description":"Thank you for using FlightAware! We've made a bunch of improvements based on your feedback!\n\nRelease 5.2.1 is a quick update that resolves the following issues:\n* Incorrect UI layout when tapping \"Nearby\" button\n* Incorrect search results when tapping \"Search\" button on keyboard when using Omnisearch \n* Startup crash for some devices running iOS8\n* Crash for some users when accessing a flight's track log or detailed flight information\n\nRelease 5.2 includes the following:\n\n* The search workflow has been updated to better handle slower network connections.\n* The landing page has been updated to better integrate search history with the search bar and to display cached searches and notifications while retrieving updated information in the background.\n* iPhones can be placed in landscape orientation to display the map without a user interface.\n* A “Where's my plane?\" button will display on the flight detail landing screen if the flight has been delayed or has not yet departed.\n* Airport names have been added to the flight details view.\n* We updated terminology to use the word “Notifications” instead of “Alerts.” \n* The dark theme UI background color has been altered to increase readability across all map tile types.\n* The notification creation workflow has been updated with minor improvements to help with the creation and editing of notifications.\n* Additional bug fixes and internal changes.\n\nPlease email support@flightaware.com to leave feedback and suggestions, since we are unable to reply to reviews. Don't forget to rate us 5 stars in iTunes if you love our app. We really appreciate it!"},{"version_id":"818924080","version_name":"5.2.2","version_date":"2016-09-26 18:27:47.000 +0800","version_description":"Thanks for using FlightAware! This maintenance release provides updates and bug fixes including:\n\n- Updated internal airport database\n- Scroll position on the flight board will keep its position after data refresh\n- Fixed layout bug when in-call status bar is visible\n- Fixed issues with airport data and timezones\n- Fixed an issue with a confusing error message appearing on startup\n- Fixed an issue with the expand touch target being too large when the UI is minimized\n- Improved status presentation of result-unknown flights\n\nNote: This will be the final release that will support iOS 8 and below. Release 5.3 will support iOS 9 and above.\n\nPlease email support@flightaware.com to leave feedback and suggestions, since we are unable to reply to reviews. Don't forget to rate us 5 stars in iTunes if you love our app. We really appreciate it!"},{"version_id":"819936779","version_name":"5.3.0","version_date":"2016-12-01 00:32:15.000 +0800","version_description":"*ATTENTION* If you are having trouble loading flights with this new version, please try this: Go to Home screen and tap the Settings icon. Tap “Accessibility”, then “Increase Contrast”, then disable “Reduce Transparency”\n\n\n- Nearby airports are now displayed on the map:\n    - When selecting an airport additional information is displayed in an annotation.\n    - Arriving and departing flights for the selected airport become color-coded.\n- We have refined the way flight search results are displayed:\n    - Current and scheduled flights are shown by default along with a button to navigate to flight history. \n    - If only historical flights are available thy are displayed instead.\n- We have updated how filtering works when viewing search results:\n    - We now use iOS’s filter icon and include an instructional prompt. \n    - Filtering is now a modal feature that is enabled by tapping the filter icon in navigation bar.\n- We have updated the notification creation workflow to increase usability:\n    - The creation/editing process has been streamlined. \n    - The visual design has been refined. \n    - The instructions have been updated to be more user-friendly.\n    - When creating a notification only valid flights are displayed in the search results, i.e. - no historical flights.\n    - We also now provide the ability to search for a flight on a specific day in the future.\n- In prior releases were only using color to indicate that an en route flight was delayed. We now also include that information in the status message. \n- We made tweaks to the visual design and layouts of several views.\n- We squashed several bugs."},{"version_id":"820082423","version_name":"5.3.1","version_date":"2016-12-12 21:01:43.000 +0800","version_description":"This update fixes an issue that caused search to hang for some users.  Thanks to everyone who helped us track down this bug! \n\n- Nearby airports are now displayed on the map:\n    - When selecting an airport additional information is displayed in an annotation.\n    - Arriving and departing flights for the selected airport become color-coded.\n- We have refined the way flight search results are displayed:\n    - Current and scheduled flights are shown by default along with a button to navigate to flight history. \n    - If only historical flights are available thy are displayed instead.\n- We have updated how filtering works when viewing search results:\n    - We now use iOS’s filter icon and include an instructional prompt. \n    - Filtering is now a modal feature that is enabled by tapping the filter icon in navigation bar.\n- We have updated the notification creation workflow to increase usability:\n    - The creation/editing process has been streamlined. \n    - The visual design has been refined. \n    - The instructions have been updated to be more user-friendly.\n    - When creating a notification only valid flights are displayed in the search results, i.e. - no historical flights.\n    - We also now provide the ability to search for a flight on a specific day in the future.\n- In prior releases were only using color to indicate that an en route flight was delayed. We now also include that information in the status message. \n- We made tweaks to the visual design and layouts of several views.\n- We squashed several bugs."},{"version_id":"820700549","version_name":"5.3.2","version_date":"2017-01-27 01:35:39.000 +0800","version_description":"This maintenance release includes bug fixes and stability improvements:\n\n- Accessibility bug fixes and improvements.\n- Localization typo fix in the airport delay message.\n- Fixed a bug that would sometimes cause a crash when rotating the phone from landscape to portrait.\n- Bug fix for crash when viewing certain aircraft photos.\n- Bug fixes for the local airport database.\n- Fixed a bug that occasionally caused the map's activity indicator to never disappear.\n- Fixed a bug that would sometimes cause a crash when deleting an airport from the My FlightAware section.\n\nYou can leave us feedback in the app by going to settings and tapping \"Email Support\" or by posting a message on our discussion board at https://discussions.flightaware.com/beta-mobile-apps-f22/"},{"version_id":"820939021","version_name":"5.3.3","version_date":"2017-02-28 15:32:26.000 +0800","version_description":"Enhancements:\n\n- Maps now differentiate between estimated and actual positions of aircraft and path flown\n- Maps now show new icons indicating aircraft general type\n- Improved the way nearby airports are zoomed and allow disabling per map type\n- Adding an aircraft to “My Aircraft” via My FlightAware process requires fewer steps\n- Display format for Aircraft rows in My FlightAware easier to read\n- All aircraft are now displayed in My FlightAware, even ones without recent activity\n- Normalized airport codes to display IATA / ICAO unless codes are subset of each other\n\nBug Fixes:\n\n- Tapping a notification when app is closed will now correctly navigate to flight after app opens\n- Map controls no longer hidden after changing map layers\n- Normalized flight idents to remove spaces\n- Increased space for long airport names\n- Improved display of filed and actual flight data\n- Fixed double load of airport pages\n- Improve search results by eliminating some duplicate results for flights and aircraft categories"},{"version_id":"821466928","version_name":"5.3.4","version_date":"2017-04-05 19:22:55.000 +0800","version_description":"Enhancements\n\n- Improved map zoom behavior for flight maps\n- Display hyphenated tail numbers correctly\n- Improved alert creation editing process\n- Display airport code style based on FlightAware.com website setting\n- Updated airline icons\n- Updated display format of airport callouts on map\n- Updated search scope and nearby flight filter scope selection screen to show current selection\n\nBug fixes\n\n- Display flight duration correctly for completed flights \n- Fixed a few crash bugs"},{"version_id":"822117205","version_name":"5.3.5","version_date":"2017-05-31 16:10:02.000 +0800","version_description":"Enhancements:\n\nSearch Results are now sorted by scheduled departure\nYou can now select \"all flights between origin and dest\" from the Flight Details screen\nThe Flight Details screen has been completely redesigned to display more information\nMore details about the flight\nTimes associated with the flight\nThe Activity Log for the flight\nThe Track Log for the flight\nThe Flight Details screen now shows the airline name and both IATA and ICAO airline callsigns\nButton Icons have been updated\nThe Flight Summary page has been redesigned to make important information more prominent\nThe Share button has been moved to the header on the Flight Summary page\nThe Airport page has been tweaked to make important information more prominent\nThe Flight Summary page now color-codes times if the flight is delayed or canceled\nThe in-app databases for airlines, airports, and logos have been updated\nYou can now set a future notification from the Search Results screen by clicking the \"Select the date of your upcoming flight\" button at the bottom of the screen\nThe My FlightAware page has been redesigned to reduce the need for scrolling\n\nBug Fixes:\n\nImprove colors for devices with \"reduce transparency\" enabled\nEditing notification details navigation takes you back to correct screen when canceled\nMake changes to update status indicator and text when flight is taxiing or en route\nHandle filtering the flight board more effectively\nReturn you to correct point on map when re-centering after navigating away from your flight on the map\nFix titlebar behavior when Map Layers menu is open\nSearching for future flights will no longer return flights for the next day if you are close to a day boundary when searching"},{"version_id":"822730392","version_name":"5.3.6","version_date":"2017-07-20 15:53:09.000 +0800","version_description":"Enhancements:\n\nThe Flight Boards for an airport can now be grouped by origin/destination city\nFlight Board options are now modified from the Flight Board screen\nGate information is now shown on airport Flight Boards\nThe ATC ident (if available) is now included on the Flight Details page\nThe Nearby Flights screen has been restyled to provide more information\n\nBug Fixes:\n\nFixed a text-wrapping issue for terminal/gate info on the flight details page\nFixed a bug where a flight would show Arrived status instead of Taxiing in some cases\nFixed a bug with international date formats and alerts\nFixed a bug with refreshing after having selected \"Where's my plane?\""},{"version_id":"823360534","version_name":"5.3.7","version_date":"2017-08-31 19:53:29.000 +0800","version_description":"- We do a better job of showing transatlantic and transpacific flights\n- You can now delete individual activity entries from you list of recent searches, flights, airports, and alerts.\n- We fixed it so that the correct weather shows up for historical flights\n- We changed our search algorithm to bring back more relevant airlines as you type\n- We now show the marketing carrier's logo for regional carriers on the search results screen to reduce confusion\n- We fixed a problem where the app may crash in rare situations"},{"version_id":"823528252","version_name":"5.3.8","version_date":"2017-09-04 16:16:51.000 +0800","version_description":"Fixed a problem where the app may crash, in some cases, while trying to upgrade"},{"version_id":"823908637","version_name":"5.3.9","version_date":"2017-10-18 13:40:01.000 +0800","version_description":"- We fixed a lot of bugs caused by iOS11.\n- We fixed a problem with showing the dots for the origin and destination airport on the flight summary screen if the airport is small.\n- We fixed a problem with some tail searches when you clicked the 'Search' button on the pop-up keyboard.\n- We fixed a problem where some section headers wouldn't fallback to a default language if the user changed their language.\n- We now show a data block on the map next to the plane when a single flight is tracked."},{"version_id":"824103274","version_name":"5.3.10","version_date":"2017-10-24 14:08:51.000 +0800","version_description":"Fixed a crash on iOS 9 that occurred during a route search."},{"version_id":"824247722","version_name":"5.4.0","version_date":"2017-11-02 17:48:51.000 +0800","version_description":"Fixed multiple user interface bugs for devices running iOS 11. \nSupport discontinued for iOS 9."},{"version_id":"824303691","version_name":"5.4.41","version_date":"2018-01-30 22:36:10.000 +0800","version_description":"We fixed a problem where the app would fail if the default language on the phone wasn't supported and it couldn't fall back to another supported language"},{"version_id":"824303691","version_name":"5.4.1","version_date":"2017-11-07 16:45:24.000 +0800","version_description":"Fixed a problem with the app sometimes crashing in the flight detail view."},{"version_id":"824408183","version_name":"5.4.2","version_date":"2017-12-08 19:42:08.000 +0800","version_description":"- Fixed a problem where the app may not ask for the ability to send push notifications in some circumstances.\n- Fixed a problem where the date for a notification would be defaulted to the following day in some cases."},{"version_id":"825278875","version_name":"5.4.3","version_date":"2018-01-09 16:05:30.000 +0800","version_description":"- We added a walkthrough, when launching for the first time, showing users how to use the most popular features of the app.\n- We added the ability for users to filter their route search results by airline and by plane status."},{"version_id":"825615769","version_name":"5.4.4","version_date":"2018-01-15 16:36:55.000 +0800","version_description":"Fixed an issue where the walkthrough buttons didn't display the correct text when the default language wasn't supported in the app\nUpdated the in-app airports list to include new and updated entries"},{"version_id":"825710986","version_name":"5.4.41","version_date":"2018-01-30 22:36:10.000 +0800","version_description":"We fixed a problem where the app would fail if the default language on the phone wasn't supported and it couldn't fall back to another supported language"},{"version_id":"826886962","version_name":"5.5.0","version_date":"2018-05-07 17:22:19.000 +0800","version_description":"- We fixed an issue where extra characters may show up in the alert set-up process if a non-English language is the default.\n- We updated icons throughout the app to make them easier to understand.\n- We changed the ad-remove in-app purchase from a one-time buy to a subscription.\n- We still honor the existing one-time purchasers ad-remove and do not show ads for them."},{"version_id":"827415993","version_name":"5.6.0","version_date":"2018-06-05 18:48:10.000 +0800","version_description":"- We reworked the flight alert creation process to be more user friendly.\n- We added the ability to be notified a configurable number of minutes before the plane arrives at its destination.\n- We fixed some button color issues when in the light theme mode."},{"version_id":"827433471","version_name":"5.6.1","version_date":"2018-06-07 14:33:50.000 +0800","version_description":"- We fixed a problem with localization strings that were breaking alerts in some cases.\n\n- We reworked the flight alert creation process to be more user friendly.\n- We added the ability to be notified a configurable number of minutes before the plane arrives at its destination.\n- We fixed some button color issues when in the light theme mode."},{"version_id":"827479895","version_name":"5.6.2","version_date":"2018-07-10 22:33:21.000 +0800","version_description":"- We fixed some UI issues to remove redundant display data\n- We changed the data block on an adhoc flight to display a nearby location instead of lat/lon\n- We fixed some more colors that were incorrect for light mode\n- We fixed a \"Missing key\" error on app launch\n- We restored the aircraft registration link\n- We restored the operator on the flight details view\n- We restored the time zone abreviations on the route search results\n- We now correctly display only the available notification channels for alerts\n- We now directly open the app to a flight when tapping on a notification"},{"version_id":"828060271","version_name":"5.6.3","version_date":"2018-08-02 18:28:38.000 +0800","version_description":"- Display the app release notes after an app update (Also available via gear menu)\n- Fix text layout issues on iPhone X\n- Fix issues zooming to your location when on slow network\n- Fix errors setting alerts for codeshare flights\n- Fix incorrect flight times on flight boards\n- Fix error when creating an alert via \"Don't see your flight\"\n- Remove support for iOS 10"},{"version_id":"828180596","version_name":"5.6.4","version_date":"2018-08-21 23:42:13.000 +0800","version_description":"- Display correct gates on flight boards\n- Searching for future flight now always uses correct date\n- Done button now works when creating alert immediately after logging in\n- Flight Boards now show flights for IATA code airports\n- No longer expands landing view when changing map layers\n- Fixed overlap of long airport name in route search results\n- Fixed disapparance of aircraft when zooming in nearby flights map\n- Added ability for EU users to change their ad consent choice"},{"version_id":"828639912","version_name":"5.6.5","version_date":"2018-09-21 00:09:19.000 +0800","version_description":"- Added button to \"view flight\" for GA aircraft when viewing Alert\n- Airport maps now refresh even when zoomed in very close\n- Can now delete recent history when not logged in\n- Fixed spelling errors in Store\n- Fixed overlapping text formatting on airport board flight listings\n- Navigation bar no longer hidden after viewing a notification when app is open\n- Restored auto refresh for flight boards"},{"version_id":"828763870","version_name":"5.7.3","version_date":"2019-12-09 23:24:25.000 +0800","version_description":"- We reconnected the \"Where is my plane\" button\n- We fixed a bug that would cause a crash when checking for a new version\n- We fixed some formatting issues on the Airports Delays screen on iOS 13\n- We fixed a bug that wasn't updating for dark mode/light mode on the network connection screen\n- We fixed a bug where the app wouldn't refresh upon login\n- We updated when we ask for permission to send push notifications when opening the app"},{"version_id":"828763870","version_name":"5.6.6","version_date":"2018-10-18 00:28:27.000 +0800","version_description":"- We fixed a problem where we weren't showing the filed speed on the flight details page in some cases.\n- We fixed a problem with the flight duration if the flight was delayed.\n- We fixed a problem with some items throughout the app not responding to a theme change.\n- We updated the settings menu to make it easier to access the items within.\n- We fixed a problem that would not search the entire, entered search string if you tapped the search button quickly.\n- We fixed a problem where the track for a flight was disconnected from its plane in some instances.\n- We fixed a problem where the nearby map would bounce back and forth between the user's current location and the selected airport when going from airport to airport.\n- We fixed a problem with the display of departing and arriving aircraft for a selected airport when navigating through multiple flights.\n- We added a plane icon to the alert row on the landing page for GA aircraft so that users can view the best flight available by tapping on it.\n- We fixed a problem where the nearby map would lose its focus when returning from the delays screen."},{"version_id":"829078983","version_name":"5.6.7","version_date":"2018-11-29 03:22:40.000 +0800","version_description":"* We added the ability to manage a number of settings in the app that were previously only available for management on the web, including Airport Code Format, Flight Times Format, Position-only Flights, Flight Units, and Aviator Mode.\n* We now let the user know if they are using an old version of the app.\n* We fixed a bug where additional characters were showing on the weather page when the default language was Traditional Chinese."},{"version_id":"829699032","version_name":"5.6.8","version_date":"2019-01-09 06:04:52.000 +0800","version_description":"- We fixed a problem with tracking tail numbers with hyphens when using omnisearch and the blue search button.\n- We fixed a problem where the flights on the flight boards may appear out of order depending on the timezone of the flight, phone, and other flights.\n- We fixed a problem where the version checker would nag if you were on a beta version.\n- We improved the load time of the settings menu.\n- We updated the walkthrough to reflect changes to the way that alerts are created.\n- We now smooth flight tracks to better approximate the flight path.\n- We updated omnisearch to show better search results when searching for an ICAO airport code.\n- We updated the error messaging to be more clear when trying to create an alert without first having verified the user account.\n- We fixed a bug where scheduled times could show instead of estimated times when long delays were involved.\n- We updated omnisearch to show better search results when searching for an IATA airport code."},{"version_id":"829896834","version_name":"5.6.9","version_date":"2019-01-11 00:23:02.000 +0800","version_description":"- We fixed a problem with tracking tail numbers with hyphens when using omnisearch and the blue search button.\n- We fixed a problem where the flights on the flight boards may appear out of order depending on the timezone of the flight, phone, and other flights.\n- We fixed a problem where the version checker would nag if you were on a beta version.\n- We improved the load time of the settings menu.\n- We updated the walkthrough to reflect changes to the way that alerts are created.\n- We updated omnisearch to show better search results when searching for an ICAO airport code.\n- We updated the error messaging to be more clear when trying to create an alert without first having verified the user account.\n- We fixed a bug where scheduled times could show instead of estimated times when long delays were involved.\n- We updated omnisearch to show better search results when searching for an IATA airport code."},{"version_id":"830065831","version_name":"5.6.10","version_date":"2019-01-29 04:31:47.000 +0800","version_description":"This is a hot fix version for version 5.6.8/9\n- We updated the app onboarding sequence to ensure nearby flights are loaded on map at startup.\n- We fixed a problem with reading account settings when your selected time zone was UTC/GMT/Zulu on FlightAware.com\n- We reenabled smoothing of flight tracklines in single flight views.\n- We updated the MyFlightAware sync process which was crashing for some users at startup.\n- We improved matching of search text to results table results when using the Search button.\n  \nIn version 5.6.8 the following was new:\n- We fixed a problem with tracking tail numbers with hyphens when using omnisearch and the blue search button.\n- We fixed a problem where the flights on the flight boards may appear out of order depending on the timezone of the flight, phone, and other flights.\n- We fixed a problem where the version checker would nag if you were on a beta version.\n- We improved the load time of the settings menu.\n- We updated the walkthrough to reflect changes to the way that alerts are created.\n- We updated omnisearch to show better search results when searching for an airport code.\n- We updated the error messaging to be more clear when trying to create an alert without first having verified the user account.\n- We fixed a bug where scheduled times could show instead of estimated times when long delays were involved.\n- We fixed a bug where the alert indicator would show for flights in the future when an alert had only been configured for a single day."},{"version_id":"830203398","version_name":"5.6.11","version_date":"2019-02-19 01:19:17.000 +0800","version_description":"This is a hot fix version for version 5.6.10\n- We fixed a problem where users upgrading from an older version could experience a black screen with no planes.\n- We fixed a problem where creating an alert from the MyFlightAware section of the app could take longer than expected when the user has a large number of saved aircraft.\nIn version 5.6.8-5.6.10 the following was new:\n- We updated the MyFlightAware sync process which was crashing for some users at startup.\n- We improved matching of search text to results table results when using the Search button.\n- We updated the app onboarding sequence to ensure nearby flights are loaded on map at startup.\n- We fixed a problem with reading account settings when your selected time zone was UTC/GMT/Zulu on FlightAware.com\n- We reenabled smoothing of flight tracklines in single flight views.\n- We fixed a problem with tracking tail numbers with hyphens when using omnisearch and the blue search button.\n- We fixed a problem where the flights on the flight boards may appear out of order depending on the timezone of the flight, phone, and other flights.\n- We fixed a problem where the version checker would nag if you were on a beta version.\n- We improved the load time of the settings menu.\n- We updated the walkthrough to reflect changes to the way that alerts are created.\n- We updated omnisearch to show better search results when searching for an airport code.\n- We updated the error messaging to be more clear when trying to create an alert without first having verified the user account.\n- We fixed a bug where scheduled times could show instead of estimated times when long delays were involved.\n- We fixed a bug where the alert indicator would show for flights in the future when an alert had only been configured for a single day."},{"version_id":"830473554","version_name":"5.6.12","version_date":"2019-03-14 02:18:57.000 +0800","version_description":"-We added a number row to the keyboard so it's easier to search for flight numbers.\n-We now inform you of no internet connection since the app relies on it.\n-We fixed a few bugs around recent searches and flights on airport maps."},{"version_id":"830936719","version_name":"5.6.13","version_date":"2019-04-25 20:45:48.000 +0800","version_description":"-We updated Route Search results to be easier to differentiate.\n-We fixed some bugs related to panning and zooming on the nearby map.\n-We updated the collapsible information block on the Flight and Airport Summary screens.\n-We fixed a bug where we were showing a registration details link even if we didn't have any."},{"version_id":"831306483","version_name":"5.6.14","version_date":"2019-05-30 23:39:58.000 +0800","version_description":"We added the ability to copy a link to a flight and to open a flight in safari when tapping the share button.\nWe fixed a bug where searching could return unexpected results if you were on a slow connection.\nWe fixed a bug where the app wouldn't switch to an airport that didn't have any current traffic.\nWe updated the way we display information about ad hoc flights throughout the app."},{"version_id":"832354891","version_name":"5.6.15","version_date":"2019-08-19 23:41:27.000 +0800","version_description":"- We fixed a problem where the share link functionality contained two copies of the link.\n- We updated the search screen to handle returning search results better for fast typers.\n- We updated the nearby screen to do a better job when sorting by airline.\n- We updated the flight details screen to show more actuals for en route flights."},{"version_id":"832861879","version_name":"5.6.16","version_date":"2019-09-30 22:27:51.000 +0800","version_description":"- We fixed a problem where the share link functionality contained two copies of the link.\n- We updated the search screen to handle returning search results better for fast typers.\n- We updated the nearby screen to do a better job when sorting by airline.\n- We updated the flight details screen to show more actuals for en route flights."},{"version_id":"833015949","version_name":"5.7.0","version_date":"2019-10-23 03:39:43.000 +0800","version_description":"- We updated the app to support Dark Mode for iOS 13\n- We updated all modal presentations for iOS 13\n- We resolved a problem where you couldn't create or edit an alert to send to a friend's email"},{"version_id":"833304029","version_name":"5.7.1","version_date":"2019-12-04 23:27:16.000 +0800","version_description":"- We fixed some formatting issues on the Airports Delays screen on iOS 13\n- We fixed a bug that wasn't updating for dark mode/light mode on the network connection screen\n- We fixed a bug where the app wouldn't refresh upon login\n- We updated when we ask for permission to send push notifications when opening the app"},{"version_id":"833872459","version_name":"5.7.2","version_date":"2019-12-06 22:28:59.000 +0800","version_description":"- We fixed a bug that would cause a crash when checking for a new version\n- We fixed some formatting issues on the Airports Delays screen on iOS 13\n- We fixed a bug that wasn't updating for dark mode/light mode on the network connection screen\n- We fixed a bug where the app wouldn't refresh upon login\n- We updated when we ask for permission to send push notifications when opening the app"},{"version_id":"833908445","version_name":"5.7.3","version_date":"2019-12-09 23:24:25.000 +0800","version_description":"- We reconnected the \"Where is my plane\" button\n- We fixed a bug that would cause a crash when checking for a new version\n- We fixed some formatting issues on the Airports Delays screen on iOS 13\n- We fixed a bug that wasn't updating for dark mode/light mode on the network connection screen\n- We fixed a bug where the app wouldn't refresh upon login\n- We updated when we ask for permission to send push notifications when opening the app"},{"version_id":"833969771","version_name":"5.7.4","version_date":"2020-02-12 23:19:05.000 +0800","version_description":"- Are you a FlightAware Global customer? Lucky you! This version has additional functionality and insights for FlightAware Global customers including surface statuses for your aircraft, Taxi Out time selections, destination FBO selections, and estimated and predicted OOOI times. Check it out!\n- We also updated the layout of the Times section on the Flight Information screen.\n- We added the airport code to the title of the Airports screen."},{"version_id":"834861273","version_name":"5.7.5","version_date":"2020-03-09 22:25:07.000 +0800","version_description":"-FlightAware Global customers will notice an added title in the Flight Plan Filed push notifications and new animations after editing flight details\n-We’ve removed ads in the mobile app for customers who have ad-free privileges on our website\n-Long FBO names will now wrap to a second line\n-Other bug fixes and improvements"},{"version_id":"835181501","version_name":"5.7.6","version_date":"2020-04-21 22:26:48.000 +0800","version_description":"- Now more activity on FlightAware. We just enabled displaying all tracked flights (instead of just the ones that share flight plans). Track unscheduled flights all over the world!\n- FBO Toolbox subscribers will notice more features for flights at their airports, including blocked flight information for select flights, predictive ETAs for inbound flights to your airports, surface statuses, and FBO information for aircraft at your airports.\n- We added a filter on the Airport Flights screen for users to filter to only display certain flights \n- General Aviation flights will now display the tail number and ident on the Flight Summary screen"},{"version_id":"835843987","version_name":"5.7.7","version_date":"2020-05-26 23:14:18.000 +0800","version_description":"- We’ve improved how diverted flights are identified and displayed\n- We identify origin or destination airport delays when viewing a single flight.\n- Airline flights will now display both codeshare and operator callsigns when viewing a single flight.\n- We’ve improved how the green and blue flight track lines appear in light mode."},{"version_id":"836275356","version_name":"5.7.8","version_date":"2020-06-30 23:14:35.000 +0800","version_description":"We’ve further included more features for FlightAware Global and FBO Toolbox customers including airport weather conditions, flight rules, runway information, and FBO information \nWe resolved an issue where we displayed incorrect international airport weather information"},{"version_id":"836951940","version_name":"5.7.9","version_date":"2020-08-03 22:56:43.000 +0800","version_description":"- GA pilots, we recently expanded airport detection for VFR flights in the USA. FlightAware now tracks your VFR departures from and arrivals to airports that only have an FAA LID code.\n- If you happen to background the app while searching for a flight, the search results screen will automatically update when you come back.\n- We updated our error messages to be a bit more friendly so you no longer see those nasty, indecipherable errors.\n- Many other minor bug fixes and UI improvements."},{"version_id":"837639096","version_name":"5.8.0","version_date":"2020-09-09 00:53:31.000 +0800","version_description":"You can now easily create a FlightAware account using Sign in with Apple. A FlightAware account allows you to set up alerts for your flights, save your favorite aircraft and airports for easy access, and remembers your recent flight searches."},{"version_id":"838131092","version_name":"5.8.1","version_date":"2020-11-04 23:28:40.000 +0800","version_description":"- Flight Replay is here! You are now able to replay an en route or arrived flight’s path at three different speeds.\n- Based on user feedback, we’ve added the option to turn off flight track lines in the map overlays.\n- We’ve also added timestamps on runway information for FlightAware Global customers."},{"version_id":"838522927","version_name":"5.8.2","version_date":"2020-11-24 22:45:08.000 +0800","version_description":"- You’re now able to switch the sort order of flights on the search results screens, as well as the activity log.\n- We've made improvements to the flight replay feature, including how we automatically zoom on a flight.\n- Aircraft types are now displayed on the route search results screen.\n- We added icons on the Alerts tab in My FlightAware."},{"version_id":"845384686","version_name":"6.3.0","version_date":"","version_description":""}]