[{"version_id":"23352666","version_name":"2.04","version_date":"","version_description":""},{"version_id":"310212661","version_name":"3.1","version_date":"","version_description":""},{"version_id":"611602656","version_name":"3.3","version_date":"","version_description":""},{"version_id":"811389777","version_name":"3.6","version_date":"","version_description":""},{"version_id":"811987381","version_name":"3.9","version_date":"","version_description":""},{"version_id":"812325113","version_name":"4.0.1","version_date":"","version_description":""},{"version_id":"812504013","version_name":"4.0.4","version_date":"","version_description":""},{"version_id":"812848146","version_name":"4.0.5","version_date":"","version_description":""},{"version_id":"815226711","version_name":"4.1.3","version_date":"","version_description":""},{"version_id":"815422535","version_name":"4.1.4","version_date":"","version_description":""},{"version_id":"816769224","version_name":"4.1.7","version_date":"","version_description":""},{"version_id":"817000911","version_name":"4.1.8","version_date":"","version_description":""},{"version_id":"817156439","version_name":"5.0","version_date":"2016-04-27 05:46:33.000 +0800","version_description":"Turkcell Hesabım uygulamasını kullandığınız için teşekkür ederiz. Bu versiyonda aşağıdaki özellikler eklendi:<br>·         Hesap ekle özelliğiyle Superonline hesabı görüntüleme<br>·         Superonline kullanım takibi<br>·         Superonline fatura görüntüleme ve ödeme<br>·         Turkcell hesaplarını tek bir yerden yönetme<br>·         Diğer operatör kullanıcıları için e-posta ile kayıt olma"},{"version_id":"817690433","version_name":"5.0.1","version_date":"2016-06-09 07:47:27.000 +0800","version_description":"Küçük iyileştirmeler yapıldı."},{"version_id":"817731365","version_name":"5.0.2","version_date":"2016-06-13 05:12:32.000 +0800","version_description":"Turkcell canlı hizmet ekranı yenilenerek performans artışı sağlandı."},{"version_id":"818978831","version_name":"5.2","version_date":"2016-11-02 05:16:30.000 +0800","version_description":"Hesabım uygulamasını kullandığınız için teşekkür ederiz. <br>Yeni sürümümüzde;<br>•       Canlı Yardım hizmetimizin kapsamı genişliyor,<br>•       Superonline müşterilerimiz artık sahip oldukları tüm servisleri görüntüleyebilirler,<br>•       AKK aşımına bağlı olarak hızı azalan Superonline fiber müşterilerimiz “Joker AKK” paket satın alabilirler. Böylece AKK’ya takılmadan önceki hızda kullanım yapabilirler."},{"version_id":"819543911","version_name":"5.3","version_date":"2016-11-28 15:13:20.000 +0800","version_description":"Turkcell Hesabım ile sürpriz hediyeler sizi bekliyor. Çok yakında!"},{"version_id":"819880235","version_name":"5.5","version_date":"2017-02-10 08:13:57.000 +0800","version_description":"Superonline kullanıcıları için üst pakete geçme özelliği eklendi ve küçük iyileştirmeler yapıldı."},{"version_id":"819965572","version_name":"5.6","version_date":"","version_description":""},{"version_id":"820808567","version_name":"5.9.1","version_date":"","version_description":""},{"version_id":"820953790","version_name":"6.0","version_date":"2017-02-16 08:20:09.000 +0800","version_description":"Yine yeniden sürprizlerle sizinleyiz!"},{"version_id":"821224247","version_name":"7.0","version_date":"2017-03-20 08:25:21.000 +0800","version_description":"İşte yeni Turkcell Hesabım! Yepyeni yüzü ve özellikleriyle sizlerle buluşuyor.<br> <br>Sizin için neler yaptık?<br> <br>·         Size özel teklifler<br>·         Uygun pakete kolayca geçiş<br>·         Sarı Kutu hediye önerisi<br>·         En popüler Turkcell uygulamalarına tek adımda erişim<br>·         Daha kolay kalan kullanım ve fatura deneyimi<br>·         Kredi kartı tarama özelliği<br>·         Faturanız ile ilgili canlı hizmet desteği<br>·         İngilizce dil seçeneği  <br>·         Turkcell ve Superonline hesaplarını birlikte yönetebilme<br>·         Bize ilettiğiniz taleplerin takibi<br>·         Bildirimlere erişim<br> <br>Ve keşfedeceğiniz birçok yeni özellik için hemen Turkcell Hesabım’ı kullanmaya başlayın!"},{"version_id":"821630553","version_name":"7.1","version_date":"2017-04-07 08:05:08.000 +0800","version_description":"Görme engelli kullanıcılarımız için ekran okuyucu programlarla uyumluluğu arttırıldı ve küçük iyileştirmeler yapıldı."},{"version_id":"821785154","version_name":"7.2","version_date":"2017-04-20 13:48:53.000 +0800","version_description":"4.5G hızında yeni bir kampanya, yeni bir sürpriz!"},{"version_id":"822344503","version_name":"7.3","version_date":"2017-05-30 11:29:09.000 +0800","version_description":"Sizleri dinliyor ve Hesabım’ı ihtiyaçlarınıza en uygun hale getirmek için düzenli olarak güncelliyoruz. Son sürümü yükleyerek tüm yeni özelliklere erişebilirsiniz. Hesabım’ı kullandığınız için teşekkür ederiz!"},{"version_id":"823171836","version_name":"7.4","version_date":"2017-08-07 11:15:30.000 +0800","version_description":"Superonline kullanıcıları için yeni özellikler eklendi ve Faturalarım alanında küçük iyileştirmeler yapıldı."},{"version_id":"823746879","version_name":"7.5","version_date":"2017-09-24 18:55:22.000 +0800","version_description":"Yeni markamız Lifecell'i kullanan müşterilerimize özel yepyeni bir Hesabım deneyimi oluşturuldu.<br>Küçük iyileştirmeler yapıldı."},{"version_id":"824138752","version_name":"7.6","version_date":"2017-10-26 08:32:23.000 +0800","version_description":"Turkcell’den aldığınız ve Turkcell’e gönderdiğiniz tüm SMS’lere Mesajlarım alanından ulaşabilirsiniz.<br>Kalan kullanımlarınızı ve faturalarınızı artık profil alanından takip edebilirsiniz."},{"version_id":"825060626","version_name":"7.9","version_date":"2018-02-02 17:31:46.000 +0800","version_description":"Hesabım, Turkcell'de uzaktan kumandanız.. Yeni sürümde sizin için hangi özellikleri ekledik?<br>- TL yüklerken güncel TL miktarınızı da aynı ekranda görebilirsiniz.<br>- Kalan Kullanımlarım'da yıllık abonelikli kampanya önerilerimiz sizi bekliyor.<br>- Tüm yurtdışı kullanım ayarlarınızı Bana Özel&gt;Yurtdışı alanından kolayca yapabilirsiniz.<br>Hesabım'ı kullandığınız için teşekkürler!"},{"version_id":"825365065","version_name":"8.0","version_date":"2018-03-05 09:24:50.000 +0800","version_description":"Hesabım yepyeni logosuyla sizlerle!<br> <br>Yeni sürümümüzde;<br><br>- Yüklediğin Kadar Kazan Kampanyası ile kazandığınız TL’leri artık Kalan Kullanımlarım alanından takip edebileceksiniz.<br>- Fatura kesim tarihinizde fatura dönem bilginizi ve faturalanan yaklaşık tutarı görebileceksiniz.<br>- Hesabım’a kazandırdığımız yenilikleri uygulamayı açtığınızda ilk ekranda öğreneceksiniz.<br>- Hızlı Giriş özelliği ile Hesabım'a artık şifre girmeden erişebileceksiniz.<br> <br>Hesabım’ı kullanmaya devam edin!"},{"version_id":"825856811","version_name":"8.1","version_date":"2018-03-14 05:33:50.000 +0800","version_description":"Bu sürümde daha iyi bir deneyim yaşamanız için uygulamanın çeşitli yerlerinde küçük iyileştirmeler yaptık."},{"version_id":"826132442","version_name":"8.3","version_date":"2018-05-09 07:12:45.000 +0800","version_description":"Hesabım’ı sizin için kolaylaştırmaya ve geliştirmeye devam ediyoruz.<br>Artık kazandığınız paketleri hesabım’a yeniden girmenize gerek kalmadan Kalan Kullanımlarım kartında hemen görebilirsiniz.<br>Yeni eklenen mobil ödeme kartında, hattınızı Mobil Ödeme’ye açabilir, ödeme limitinizi belirleyebilirsiniz."},{"version_id":"826287376","version_name":"8.4","version_date":"2018-06-06 20:31:22.000 +0800","version_description":"Hesabım’ı ihtiyaçlarınıza göre sürekli geliştiyoruz. Bu versiyonda,<br>·         Paketlerinizi, kampanyalarınızı ve servislerinizi daha kolay ve hızlı görüntüleyebilmeniz için 3 kartı “Ürünlerim” kartında birleştirdik ve tek tıkla tüm bilgilere erişmenizi sağladık.<br>·         Faturalarım kartına, taksitlendirdiğiniz faturalarınızın taksit bilgilerini ekledik.<br>·         Yardım alanına; arama ya da bağlantınızda sorun yaşarsanız sorunu tespit etmenizi ve çözmenizi sağlayan “otomatik kontrol” özelliğini ekledik."},{"version_id":"826388859","version_name":"8.5","version_date":"2018-07-19 18:02:28.000 +0800","version_description":"Hayatınızı kolaylaştırmak için Hesabım’ı sürekli geliştiriyoruz.<br>•Lifecell paketlerini kullanıyorsanız “Ürünlerim” kartına  seçebileceğiniz uygulamaları ekledik. İncelemenizi tavsiye ederiz. Seçtiğiniz uygulama paketlerinin  kalan bilgisini “Kalan Kullanımlarım - Seçtiğiniz Uygulamalar” kategorisinde bulabilirsiniz.<br>•Daha önce oluşturduğunuz Sanal Paycell kartınızın bilgilerini de artık Hesabım’da görebilir, güncelleyebilir, yeni bir kredi kartı bağlayabilir ve Paycell kartınıza kredi yükleyebilirsiniz.<br>•Hesabım’ı kullanmanız için Turkcell'li olmanıza gerek yok. Bir kez kayıt olmanız yeterli, kayıttan sonra girişinizi otomatik olarak sağlıyoruz.<br>•Bu arada yazı fontumuzu değiştirdik. Beğeneceğinizi düşünüyoruz.<br>•Bir de artık bildirimlerimizde Turkcell melodileri duyabilirsiniz. Şaşırmayın."},{"version_id":"827075709","version_name":"8.7","version_date":"2018-10-24 20:44:38.000 +0800","version_description":"Şimdi Hesabım’da Samsung kazanma zamanı! Hesabım’a girin, kampanya katılım formunu doldurun, 10 Samsung Note9, 15 Samsung S9 Plus, 30 Samsung Gear3’ten birini kazanma şansı yakalayın! Her gün katılın, şansınızı artırın."},{"version_id":"827443056","version_name":"8.8","version_date":"","version_description":""},{"version_id":"827923966","version_name":"8.9","version_date":"","version_description":""},{"version_id":"828681985","version_name":"11.0","version_date":"2019-10-30 13:15:07.000 +0800","version_description":"You can chat with AI based Turkcell Assistant from anywhere in the Digital Operator. Your assistant is looking forward to help you at the bottom of the screen."},{"version_id":"828681985","version_name":"11.2","version_date":"2019-12-09 06:32:24.000 +0800","version_description":"In this version, we made various technical infrastructure improvements."},{"version_id":"828681985","version_name":"9.0","version_date":"","version_description":""},{"version_id":"828681985","version_name":"10.8","version_date":"2019-08-08 11:45:05.000 +0800","version_description":"We are working to improve your experience with Digital Operator. In this update, we started to offer you special benefits at Shake and Win. We also renewed the usage information area on broadband section."},{"version_id":"828681985","version_name":"10.1","version_date":"2019-02-11 06:31:21.000 +0800","version_description":"Our developments continue with your feedbacks. We have removed the opening and Shake &amp; Win melodies on your request. Thank you for your precious recommendations."},{"version_id":"828681985","version_name":"9.1","version_date":"","version_description":""},{"version_id":"828937026","version_name":"9.1","version_date":"","version_description":""},{"version_id":"829827707","version_name":"10.0","version_date":"2019-01-28 06:15:21.000 +0800","version_description":"You liked Hesabım a lot and made us very happy by using it millions of times in 2018. We thank you!<br>Now with its brand new look, new features and new name Turkcell Hesabım is transforming into Digital Operator. With the Digital Operator, wherever you are, your Turkcell is there!<br> <br>·        In the Digital Operator, you can do transactions under 3 main sections: Digital My Account, Digital Shop and Digital Support.<br>·        In the Digital My Account, you can view your Remaining Usage, My Bills, My Products and Quick Settings.<br>·        In the Digital Store, you can easily take a look at the devices, applications and packages special for you and buy them.<br>·        From Digital Support, you can send your requests to us in any way you want. If you have a connection problem, you can share your location and send us your complaint.<br>·        For requests that require documents, you can create your request by taking photos of the documents and follow the status of all your requests from My Notifications.<br>·        Add and manage your Superonline account and other Turkcell lines.<br>·        You can perform many transactions even if you are not a Turkcell subscriber."},{"version_id":"830131991","version_name":"10.1","version_date":"2019-02-11 06:31:21.000 +0800","version_description":"Our developments continue with your feedbacks. We have removed the opening and Shake &amp; Win melodies on your request. Thank you for your precious recommendations."},{"version_id":"830422907","version_name":"10.2","version_date":"2019-02-28 06:06:38.000 +0800","version_description":"We've made minor improvements in some areas of the application for a better experience."},{"version_id":"830906380","version_name":"10.3","version_date":"2019-04-18 17:30:41.000 +0800","version_description":"You can turn on and off the Digital Operator's jingle and Shake and Win sounds from “Profile” section in the App whenever you want. We continue to work for you."},{"version_id":"831188268","version_name":"10.4","version_date":"2019-05-06 13:23:02.000 +0800","version_description":"We are working to provide you a better experience.<br>•From now on, you can see all your remaining usages at one screen when you click \"My Remaining Usage\".<br>•New gifts to share with your loved ones are added to legend campaign Shake and Win.<br>•We hope you will love our new Emocan character."},{"version_id":"831227911","version_name":"10.5","version_date":"2019-05-09 13:01:01.000 +0800","version_description":"We are working to provide you a better experience.<br>•From now on, you can see all your remaining usages at one screen when you click \"My Remaining Usage\".<br>•New gifts to share with your loved ones are added to legend campaign Shake and Win.<br>•We hope you will love our new Emocan character."},{"version_id":"831402852","version_name":"10.6","version_date":"2019-05-29 06:15:54.000 +0800","version_description":"We continue to add new features to Digital Operator. You can now perform much more automatic controls for your line with one touch in Call and Connection Control section under Support."},{"version_id":"831778375","version_name":"10.7","version_date":"2019-07-02 13:33:30.000 +0800","version_description":"We continue to improve Digital Operator in order to ease your life! With this update, we have made minor improvements in various areas."},{"version_id":"832212778","version_name":"10.8","version_date":"2019-08-08 11:45:05.000 +0800","version_description":"We are working to improve your experience with Digital Operator. In this update, we started to offer you special benefits at Shake and Win. We also renewed the usage information area on broadband section."},{"version_id":"832953525","version_name":"10.9","version_date":"2019-09-30 16:30:18.000 +0800","version_description":"We continue to listen to you, we have removed the splash video. You will now be able to see the name of your package on the  My Remaining Usage card. Soon you will be able to follow all your Turkcell gifts together and manage your gifts from the new screen to be added. Get ready for surprising games!"},{"version_id":"833353952","version_name":"11.0","version_date":"2019-10-30 13:15:07.000 +0800","version_description":"You can chat with AI based Turkcell Assistant from anywhere in the Digital Operator. Your assistant is looking forward to help you at the bottom of the screen."},{"version_id":"833622443","version_name":"11.1","version_date":"2019-11-17 19:06:24.000 +0800","version_description":"A smile is enough to make nature beautiful! You will support saplings donation with our “Spread The Green ”campaign. All you have to do is to login Digital Operator this week and show your beautiful smile."},{"version_id":"833919658","version_name":"11.2","version_date":"2019-12-09 06:32:24.000 +0800","version_description":"In this version, we made various technical infrastructure improvements."},{"version_id":"834366408","version_name":"11.3","version_date":"2020-01-24 10:28:13.000 +0800","version_description":"We regularly update the App to make it more user-friendly for you. You can install the latest version to access our new features.\n<br>•Keep shaking and winning! You can choose from 2 gift options from your favourite Shake and Win.\n<br>•Come to Turkcell shops now! 500 MB is waiting in the Gift Pool for our individual customers who visit Turkcell shops.\n<br>•Gift Pool will be available to our Corporate customers.\n<br>•We continue to simplify our new line acquisition processes for you.\n<br>•Do you think there is a speed problem with your fiber internet? Now the Application automatically diagnoses for fiber internet speed problems. If the problem continues, you can send us your request.\n<br>We have completed 10 years with you! Our innovations will continue.\n<br>We'd like to hear from you. What do you think about us? We are waiting your comments."},{"version_id":"834496937","version_name":"11.4","version_date":"2020-04-04 06:31:40.000 +0800","version_description":"We are constantly making improvements to provide you a better experience.<br>We also offer many new features in this version:<br>- Digital Store has been renewed! We added product categories to the Digital Store so that you can access the products you want more easily and faster. We also made some design improvements in Dijital Store.<br>- We made improvements to the login feature in line with your requests and made a strengthened \"remember me\" function.<br>- With our new “AI supported” process, you will soon be able to make application for new line and number porting from your home. If you have Digital Operator application, you have your Turkcell at home!"},{"version_id":"835720584","version_name":"11.5","version_date":"2020-04-28 17:04:01.000 +0800","version_description":"We are continuously updating the App to make it better for you.<br>In this version, we have resolved some issues on your favorite Shake&amp;Win in order to provide you with a better experience.<br>During Ramadan; you can use your gift your own or share it to your loved ones. Moreover, the gifts you share reach your loved ones by doubling.<br>Be ready for new surprises!"},{"version_id":"835905287","version_name":"11.6","version_date":"2020-05-12 19:36:08.000 +0800","version_description":"Innovations continue!\n<br>In this period when you are at home, we continue our improvements for a more enjoyable Digital Operator experience.\n<br>•You will now be able to list the eligible packages for the number you enter during top-up and getting package. Moreover, you can now access special packages for you from “Prepaid Packages” section.\n<br>•Individual Superonline customers will now be able to see their commitment period via the Digital Operator.\n<br>We will continue to improve the Application by listening to you. Your comments are valuable to us."},{"version_id":"836666501","version_name":"11.7","version_date":"2020-07-02 14:09:40.000 +0800","version_description":"Thank you for staying with us and at home. Digital Operator continues to improve with your feedback and comments.\n<br>We hope you enjoy the new features that come with our new version.\n<br>•\tNo more struggling with invoice detail! We improved the experience with little touches, and now you will be able to access the information in your billing details more easily.\n<br>•\tYou can now easily pay for your shopping from contracted companies by giving mobile payment confirmation from Digital Operator and reflecting on your Turkcell bill.\n<br>•\tHere comes the Gift Pool badge. You will now be able to realize that you have new GB and gifts without entering the Gift Pool.\n<br>•\tWe have made various improvements regarding Turkcell Assistant. Soon it will be much more enjoyable to use The Assistant."},{"version_id":"837365782","version_name":"11.8","version_date":"2020-08-17 10:53:19.000 +0800","version_description":"Vacation is over! We are working hard to improve your experience.<br> <br>·        Residential Superonline customers will now be able to renew their commitments through the application.<br>·        You will be able to do your transactions faster by safely registering your credit card through our application."},{"version_id":"837541071","version_name":"11.9","version_date":"2020-08-29 08:46:56.000 +0800","version_description":"We are constantly making changes and improvements so that you can do all your Turkcell related transactions without leaving home. Keep your \"App Updates\" on to make sure you don't miss anything.<br>- Innovations never end in Shake&amp;Win! Get ready for the Shake&amp;Win surprises!<br>- You will be able to re-activate your previously submitted request easily and conclude the process through the \"Request\" section."},{"version_id":"838317089","version_name":"12.0","version_date":"2020-10-22 15:28:02.000 +0800","version_description":"In this version, we have made improvements for you to meet your needs from digital.<br> <br>• We have added the \"Tool Set\", where you can easily access transactions when you press the Digital Operator icon on your phone screen.<br>• You can send us your questions and requests related to online shopping and line application through the \"New Request\" step and you can track your requests’ status from “Requests” section.<br>• We tried to improve your experience with design touches.<br> <br>You can continue to discover our new features by updating the App.<br>Be prepared for surprises and innovations!"},{"version_id":"839538503","version_name":"13.0","version_date":"","version_description":""},{"version_id":"839614164","version_name":"13.1","version_date":"2020-12-12 18:11:26.000 +0800","version_description":"We've made improvements in this update.<br>The reference point of technology, Turkey's first electronic marketplace Turkcell Passage is now valid on Digital Operator! With the new welcome page that will appear when you open Digital Operator, you will be able to easily switch to Turkcell related transactions and to the technological shopping world Pasaj. Improvements are on the way.<br>Our postpaid customers who want to take over a line due to death, will be able to apply easily from the App by entering the required information, adding their id photos and approving the contracts from the \"New Request\" option on the Support screen."},{"version_id":"840504310","version_name":"14.0","version_date":"2021-03-03 18:14:22.000 +0800","version_description":"We are here with our first update of 2021!<br> <br>Digital Operator is here with its new design and more user friendly features!<br> <br>Now on Digital Operator:<br>·        You can easily make all your Turkcell transactions in the comfort of your home, and easily find what you are looking for with its renewed menu structure.<br>·        In Turkey's first electronic marketplace Turkcell Pasaj, you can benefit from the advantages of quick delivery, safe and flexible payment.<br>·        On the renewed Packages screen, you can view the special packages for you and perform all your transactions regarding the packages<br>·        You can discover Turkcell's variety of digital services, download and buy whichever you like<br>·        Moreover, Digital Operator is always here whenever you need help about Turkcell<br> <br>We have more surprises for you, stay tuned!"},{"version_id":"840849163","version_name":"14.1","version_date":"2021-03-12 05:16:58.000 +0800","version_description":"Thank you very much for your nice comments on our latest update.<br>However, we also had users who had problems logging in. We are sorry for these too <br>We solved some of the problems, we continue to work on the others.<br>With this update, we're resolving closure issue when signing in or creating account.<br> <br>More is on the way! Turn on your automatic updates so you don't fall behind.<br>We are waiting for your guiding comments."},{"version_id":"841235796","version_name":"14.2","version_date":"2021-04-08 10:59:17.000 +0800","version_description":"We made performance improvements and bug fixes to make your Digital Operator experience more fun and robust."},{"version_id":"842144950","version_name":"14.3.0","version_date":"2021-05-20 06:29:05.000 +0800","version_description":"With this update, we have improved the Support page for you! We have also made performance enhancements and bug fixes to make your Digital Operator experience better. We will keep improving our app in line with your valuable feedbacks :)"},{"version_id":"842596356","version_name":"14.3.1","version_date":"2021-06-10 08:09:02.000 +0800","version_description":"We made performance improvements and bug fixes to make your Digital Operator experience more fun and robust."}]