[{"version_id":"811769052","version_name":"3.1.8","version_date":"2015-04-08 23:02:44.000 +0800","version_description":"- Fixed display of folders with &gt; character in an item name<br>- Fixed status bar hides on rotation to landscape<br>- Fixed playlist songs view goes under the navigation bar<br>- Fixed more tab navigation bar is translucent while all other bars aren't<br>- Fixed placement of save/delete buttons in equalizer view<br>- Fixed equalizer view doesn't correctly pick first preset after deleting custom one<br>- Removed unnecessary check on bookmark name when saving, any number of bookmarks can now have the same name"},{"version_id":"821941076","version_name":"3.1.10","version_date":"2017-04-28 17:04:31.000 +0800","version_description":"Long time no see! Hello again everyone, if you haven't been following the iSub Facebook page, the iSub 4 rewrite has been moving along nicely. However, some users reported battery drain issues with iSub 3 on iOS 10.3, so this update addresses that. There haven't been any bug fix releases in a while because the old project no longer built using the latest Xcode developer tools. Due to the severity of this battery issue, I spent a week getting the project whipped into shape and can now submit fixes again.<br><br>This update includes:<br>- Fix for high CPU usage and fast battery drain on devices running iOS 10.3<br>- Fix for pull to refresh in small folders<br>- Fixed text gets cut off in EQ screen<br>- Re-enabled lyrics and cache status screens in the player<br>- Removed non-functional Twitter support"},{"version_id":"821960013","version_name":"3.1.11","version_date":"2017-05-01 17:55:49.000 +0800","version_description":"Long time no see! Hello again everyone, if you haven't been following the iSub Facebook page, the iSub 4 rewrite has been moving along nicely. However, some users reported battery drain issues with iSub 3 on iOS 10.3, so this update addresses that. There haven't been any bug fix releases in a while because the old project no longer built using the latest Xcode developer tools. Due to the severity of this battery issue, I spent a week getting the project whipped into shape and can now submit fixes again.<br><br>This update includes:<br>- Fixed crash when switching between Wifi/Cell connection<br>- Fixed tap and hold table cell to cache/queue songs<br>- Fixed network indicator never stops after song loads<br>- Fixed version label at the top of the settings page doesn't show version number<br><br>The previous update from Friday April 28th included:<br>- Fix for high CPU usage and fast battery drain on devices running iOS 10.3<br>- Fix for pull to refresh in small folders<br>- Fixed text gets cut off in EQ screen<br>- Re-enabled lyrics and cache status screens in the player<br>- Removed non-functional Twitter support"},{"version_id":"824288654","version_name":"3.1.12","version_date":"2017-11-06 18:46:32.000 +0800","version_description":"- Fixed the broken user interface on devices running iOS 8 or 9<br>- Improved background logic, now it won't bother you to return to the app until there are 30 seconds left instead of doing it almost right away"}]