[{"version_id":"812581394","version_name":"2.7","version_date":"2015-06-24 15:00:22.000 +0800","version_description":"Enhancements<br><br>● Support for sending tweets with Twitter video<br>● Support for viewing recent photos and videos from user profiles<br>● Support for displaying inline Twitter quoted tweets<br>● Support for quoting tweets (additional action available from Retweet button)<br>● Compose view now uses dark keyboard style for dark themes<br><br>You may need to clear your Tweetlogix cache after updating to this version in order to view inline quotes for existing cached tweets. Also note that the default video upload service has changed to Twitter.<br><br>Bug Fixes<br><br>● Fixed problem closing image viewer with swipe-down gesture<br>● Fixed problem navigating to some tweet links<br>● Fixed problem which may cause image viewer to incorrectly open when expanding timeline gaps<br>● Fixed problem opening URLs in VoiceOver mode from iOS 8 sharing sheet"},{"version_id":"813063494","version_name":"2.7.1","version_date":"2015-08-11 20:42:44.000 +0800","version_description":"● Fixed problem displaying expanded long tweets in individual tweet view<br>● Fixed possible crash when changing sound effects in Tweetlogix settings<br>● Other minor bug fixes"},{"version_id":"815192358","version_name":"2.8.1","version_date":"2015-12-10 20:49:00.000 +0800","version_description":"New Features<br>● Support for iPad Pro<br>● External Safari web browser option for iOS  9 (see Settings &gt; Display &gt; Web Browser)<br><br>Bug Fixes<br>● Fixed problem displaying some inline images<br>● Fixed long tap action for user titles on iPhone 6s<br>● Fixed compose view to allow posting empty tweets with image attachments<br>● Fixed problem restoring scroll position if device is rotated while viewing an image<br>● Fixed translate action for some device language and region settings<br>● Fixed keyboard background color when composing tweets on iPad<br>● Fixed problem opening Twitter Periscope app from web view<br>● Fixed problem navigating to web links containing @ symbol<br>● Fixed problem computing remaining characters in compose view<br>● Fixed problem causing unnecessary background battery usage when Wi-Fi Streaming Scroll-to-Top option is enabled"},{"version_id":"817159451","version_name":"2.9","version_date":"2016-04-27 14:08:22.000 +0800","version_description":"New 3D Touch support for iPhone 6s and 6s Plus<br>● Application shortcuts for composing tweets, timeline, mentions, and messages<br>● Peek and Pop into web links, images, and hashtags<br>● Peek and Pop into user profiles<br>● Peek and Pop into individual tweets and quoted tweets<br><br>Other Changes<br>● Changed Twitter Favorites to Likes<br>● Added VoiceOver support for expanding timeline gaps<br><br>Thanks to everyone who helped beta test this release. Tweetlogix never prompts for reviews within the app, but we would greatly appreciate if you would take the time to rate or review Tweetlogix in the App Store."},{"version_id":"817619103","version_name":"2.9.1","version_date":"2016-06-06 15:22:57.000 +0800","version_description":"● Fixed problem dismissing image viewer with swipe gesture<br>● Fixed problem computing remaining characters for tweets containing multiple images<br>● Fixed problem opening compose view with application URL<br><br>Thanks to everyone who reported these issues. Tweetlogix never prompts for reviews within the app, but we would greatly appreciate if you would take the time to rate or review Tweetlogix in the App Store."},{"version_id":"819156648","version_name":"2.10","version_date":"2016-10-06 14:32:13.000 +0800","version_description":"• Support for displaying Twitter extended length Tweets<br>• Twitter images and videos no longer count toward Twitter's 140-character limit when composing tweets<br>• Support for sending tweets with Twitter video up to 140 seconds<br><br>Note that you may wish to clear your Tweetlogix cache after updating to this version in order to view the full text for existing extended length tweets.<br><br>Tweetlogix never prompts for reviews within the app, but we would greatly appreciate if you would take the time to rate or review Tweetlogix in the App Store."},{"version_id":"820479488","version_name":"2.11","version_date":"2017-01-12 17:21:24.000 +0800","version_description":"New Features<br>• Improved detailed tweet view with automatic quote search (pull down to view replies or quotes of the tweet)<br>• Improved profile view with new action to search for quotes of the user<br>• Added Find Quotes swipe menu action to search for quotes of any tweet  (tap the find button in swipe menu)<br><br>Bug Fixes<br>• Fixed possible crash when tapping Music in compose view<br>• Fixed problem displaying some tweets containing emoji characters<br><br>Tweetlogix never prompts for reviews within the app, but we would greatly appreciate if you would take the time to rate or review Tweetlogix in the App Store."},{"version_id":"823874957","version_name":"2.12.1","version_date":"2017-10-02 18:32:10.000 +0800","version_description":"This is a small bug fix update to address a few issues with iOS 11. Thanks to everyone who reported these problems.<br><br>Bug Fixes for iOS 11<br>• Fixed problem changing tabs after selecting a list/search from timeline title bar<br>• Fixed problem saving images to photo library<br>• Fixed search bar colors for dark themes<br><br>Let us know if you have other feedback or suggestions. If you could take the time to rate or review Tweetlogix in the App Store, we would greatly appreciate it."},{"version_id":"824229438","version_name":"2.13","version_date":"2017-11-02 20:01:04.000 +0800","version_description":"This update introduces support for iPhone X, along with support for sending direct messages with an attached image or video. Hope you enjoy the update!<br><br>New Features<br>• Support for iPhone X<br>• Support for sending direct messages with an attached image or video<br><br>Bug Fixes<br>• Fixed problem refreshing drafts on iPad<br>• Fixed problem hiding status bar when viewing images full screen<br>• Fixed search bar layout problem in iOS 11<br><br>Please let us know if you have other feedback or suggestions. If you could take the time to rate or review Tweetlogix in the App Store, we would greatly appreciate it."},{"version_id":"824440390","version_name":"2.13.2","version_date":"2017-11-17 15:16:54.000 +0800","version_description":"This is a small bug fix update, including a fix for a problem causing direct messages to be incorrectly marked unread. Thanks to everyone who reported these issues.<br><br>Bug Fixes<br>• Fixed problem causing direct messages to be reloaded and marked unread when restarting app<br>• Fixed problem displaying full screen images from Recent Media<br>• Fixed Recent Media image layout for iPhone X<br>• Fixed theme designer layout for iPhone X<br><br>Note that you may need to clear your Tweetlogix cache after updating to this version in order to play videos from existing direct messages.<br><br>Let us know if you have other feedback or suggestions. If you could take the time to rate or review Tweetlogix in the App Store, we would greatly appreciate it."},{"version_id":"826191165","version_name":"2.13.3","version_date":"2018-03-06 15:57:00.000 +0800","version_description":"• Fixed layout problem in profile headers<br>• Fixed detailed tweet view bottom margin for iOS 11<br>• Fixed problem restoring scroll position for iOS 11<br>• Fixed possible crash when navigating to links containing international characters<br>• Added larger font size options<br><br>Thanks to everyone who reported these issues. If you could take the time to rate or review Tweetlogix in the App Store, we would greatly appreciate it."},{"version_id":"827251077","version_name":"2.14","version_date":"2018-05-24 14:37:41.000 +0800","version_description":"• Support for viewing web-based Twitter video<br>• Added long-tap actions for Twitter cashtag (finance symbol) links<br>• Fixed possible problem sharing links to tweets<br><br>Thanks to everyone for your feedback and suggestions. If you could take the time to rate or review Tweetlogix in the App Store, we would greatly appreciate it."},{"version_id":"827360892","version_name":"2.14.1","version_date":"2018-06-01 13:43:49.000 +0800","version_description":"• Fixed problem causing \"Could not authenticate\" error in iOS 10"},{"version_id":"828125422","version_name":"2.15","version_date":"2018-08-07 19:22:34.000 +0800","version_description":"• Support for Twitter's new Direct Message API<br><br>• Auto Refresh now supports refreshing as often as every two minutes (see Settings &gt; Refresh &gt; Auto Refresh)<br><br>• Fixed problem recovering from network connection failures"},{"version_id":"828321350","version_name":"2.15.1","version_date":"2018-08-23 14:13:19.000 +0800","version_description":"Twitter has announced that they will be permanently shutting down their streaming APIs on August 23rd, 2018. Sadly, this means that Tweetlogix will no longer be able to support Wi-Fi Streaming Refresh. You will still be able to use pull-down and auto refresh, but real-time streaming is unfortunately no longer possible.<br><br>For more details about Twitter's recent API changes, see our blog at onloft.com/blog.<br><br>• Removed support for Wi-Fi Streaming Refresh<br>• Removed links to Favstar (Favstar has recently shutdown its service)"},{"version_id":"828599483","version_name":"2.16","version_date":"2018-09-17 19:41:26.000 +0800","version_description":"• Support for iOS 12<br>• Support for newest iPhone devices"},{"version_id":"828812960","version_name":"2.16.1","version_date":"2018-10-04 13:38:50.000 +0800","version_description":"• Fixed possible tab bar layout problem with iOS 12<br>• Fixed intermittent network connection error with iOS 12"},{"version_id":"829298606","version_name":"2.17","version_date":"2018-11-15 19:35:13.000 +0800","version_description":"• Enhanced Muted User filters to support optionally muting tweets mentioning the muted user<br>• Support for muting retweets in user mentions (see Filters &gt; Muted Retweets)<br>• Support for disabling retweeter avatars (see Settings &gt; Display &gt; Avatars)<br>• Support for newest iPad Pro models<br>• Fixed problem displaying profile images in Muted Users view"},{"version_id":"829468547","version_name":"2.17.1","version_date":"2018-11-30 20:14:39.000 +0800","version_description":"• Improved Mute User action in profile view to support optionally muting tweets mentioning the muted user<br>• Fixed problem adding animated GIFs in compose view"},{"version_id":"831111070","version_name":"2.17.2","version_date":"2019-05-03 13:25:14.000 +0800","version_description":"• Fixed problem displaying some multi-part threads<br>• Fixed search bar keyboard color for dark themes<br>• Fixed incorrect search results insets at bottom of app<br>• Fixed compose view layout problem after device rotation<br>• Fixed possible crash in detailed tweet view<br>• Other minor bug fixes and improvements"},{"version_id":"831937489","version_name":"2.17.3","version_date":"2019-07-09 21:36:40.000 +0800","version_description":"• Fixed account ordering when selecting accounts in the Compose view<br><br>• Fixed missing tweet text when viewing images from Recent Media<br><br>• Removed support for Tweet Marker synchronization. Tweet Marker has recently shutdown their service. For more information, see https://tweetmarker.net"},{"version_id":"832862659","version_name":"2.18","version_date":"2019-09-24 19:09:46.000 +0800","version_description":"• Support for iOS 13<br>• New Light/Dark system theme option for iOS 13<br>• New Dark theme<br><br>Tap Themes in Tweetlogix to see these new options.<br><br>Thanks to everyone for your feedback and suggestions. If you could take the time to rate or review Tweetlogix in the App Store, we would greatly appreciate it."},{"version_id":"834580613","version_name":"2.18.1","version_date":"2020-02-05 02:02:10.000 +0800","version_description":"• Fixed possible scroll position problem after canceling search<br>• Fixed problem invoking pull-down refresh in timeline selection view<br>• Fixed incorrect background colors when navigating back to detailed tweet view<br>• Fixed possible crash in detailed tweet view<br>• Fixed possible crash when searching recent hashtags<br>• Changed sharing of tweets to always share link to tweet (rather than first link within tweet)<br>• Other minor bug fixes and improvements"},{"version_id":"835736016","version_name":"2.19","version_date":"2020-04-30 14:02:44.000 +0800","version_description":"• Support for choosing an account when retweeting (long tap retweet button to invoke Retweet From)<br>• Fixed looping of animated GIFs<br>• Fixed background color for quoted tweets with dark theme<br>• Fixed theme designer layout on iPad<br>• Other minor bug fixes and improvements"},{"version_id":"838334520","version_name":"2.20","version_date":"2020-10-23 18:57:20.000 +0800","version_description":"• Support for newest device models<br>• Added context menus and previews when long tapping images, videos, and web links<br>• Updated icons within app for better consistency with iOS 13 and iOS 14<br>• Fixed header color problem after closing web browser on iPad<br>• Other minor bug fixes and improvements"},{"version_id":"838485624","version_name":"2.20.1","version_date":"2020-11-03 00:28:30.000 +0800","version_description":"• Fixed problem restoring Mentions scroll position after launching app<br>• Fixed problem invoking Retweet From when long tapping retweet button<br>• Fixed toolbar layout problem with some device models<br>• Added context menu and preview when long tapping date-time link in detailed tweet view<br>• Added Scroll to Top action when double tapping Timeline or Mentions tabs<br>• Other minor bug fixes and improvements<br><br>Thanks to everyone who reported these issues and sent us suggestions. If you could take the time to rate or review Tweetlogix in the App Store, we would greatly appreciate it."},{"version_id":"839212643","version_name":"2.20.2","version_date":"2020-11-17 16:06:41.000 +0800","version_description":"• Fixed problem viewing profile images from detailed tweet view<br>• Added context menu and preview when long tapping user or hashtag links<br>• Added improved Scroll to Unread actions when double tapping Timeline or Mentions tabs<br>• Other minor bug fixes and improvements"}]