[{"version_id":"160902658","version_name":"2.0","version_date":"2013-11-26 00:00:00.000 +0800","version_description":"Procreate 2 is finally here, completely redesigned for iOS 7 and 64-bit optimised for the new iPad Air and iPad mini with Retina Display. <br/><br/>Along with the beautiful new iOS 7 redesign Procreate 2 now includes powerful new GPU accelerated filters and adjustments:<br/>- Gaussian Blur<br/>- Sharpen<br/>- Noise<br/>- Hue, saturation & brightness<br/>- Color Balance (Highlights, Midtones, Shadows)<br/>- Curves (Gamma, Red, Green, Blue)<br/><br/>• New streamlined gallery<br/>- Rapid document load<br/>- New group design<br/>- Share a group <br/>- Quickly action any thumbnail<br/><br/>• Redesigned icon<br/>• Orientation memory<br/>• Includes latest SDKs for all styluses<br/>• Bug fixes and many stability improvements <br/>• Improved performance "},{"version_id":"3506163","version_name":"1.0","version_date":"2011-03-16 00:00:00.000 +0800","version_description":"None"},{"version_id":"635502643","version_name":"2.1","version_date":"2014-07-23 00:00:00.000 +0800","version_description":"我们不断受用户启发，旨在为您带来最出色的产品。为此，我们精心为您准备了一些礼物。就当成今天是您的生日啦。<br/><br/>- ColorDrop！只需拖动所选的颜色，将其放在要填充的地方。真是太简单了。这可不是您爷爷的颜料桶。<br/><br/>- 阈值调整！使用 ColorDrop 时继续按住，您可以滑动手指调整填充阈值，实现无缝颜色填充。<br/><br/>- 参考图层！这说明我们是如此在乎漫画家们。现在您无须影响油墨即可实现完美的填充。使用两根手指轻扫油墨图层，将其激活为参考图层。选择另一个图层，ColorDrop 可以根据参考图层填充所选图层。<br/><br/>- 色轮！使用新色环，拥有更多液体颜色选择。合并并分开手指可以扩大中心，并选择最佳底纹。<br/><br/>- 给出您的数字！Procreate 现在提供数字颜色输入功能，因此您可以准确获得所需的颜色。<br/><br/>- 更好样本！只需轻点一下即可将颜色存储为样本。若要删除样本，只需选择并将其丢掉。<br/><br/>- 样本调色板！创建自定义样本调色板，然后可以存储、命名以及排序。最重要的是，您可以轻松导出调色板与其他用户共享，以及从其他艺术家那里导入调色板。<br/><br/>- 多语言！Procreate 现在被翻译成 14 种语言，包括德语、日语、法语、意大利语、西班牙语、简体中文、繁体中文、韩语、葡萄牙语、俄语、土耳其语和阿拉伯语。<br/><br/>- 其他诸多功能！Procreate 2.1 还包括许多细微修复和性能提升，虽然您可能没注意到，但是我们保证它们非常有用。下面是其中部分亮点：<br/><br/>- 更新了所有手写笔 SDK<br/>- 全新支持 53’s Pencil<br/>- 新重新着色过滤器<br/>- 从照片创建新画布<br/>- 重新设计了画笔源界面<br/>- 修饰了进度滑块界面<br/>- 颜色提示框活动时，激活吸管<br/>- 改进了图层手势，方便更好地滚动<br/>- 绘图可以立即解除提示框<br/>- 选择的画笔和图层现在突出显示 Procreate 蓝色<br/>- 改进了选择和转换流程<br/>- 重建了导入和导出系统，界面简单<br/>- 改进了图库中作品命名<br/>- 彻底重建了提示框系统，提高了可靠性<br/><br/>- 家庭作业！确保从 iBooks Store 和 Procreate 帮助菜单下免费下载最新版本的 Procreate 手册。<br/><br/>为了让我们能够为您推出更棒的产品，人们需要知道我们的产品非常好用。如果您喜欢这些礼物，请在 App Store 上留下简短的评论并告诉我们。在制作更棒的产品的过程中，我们会抽时间阅读您的评论。"},{"version_id":"6744173","version_name":"1.6","version_date":"2012-04-11 00:00:00.000 +0800","version_description":"NEW:\n\n★ Completely rebuilt gallery \n• Thumbnail grid layout: Landscape & portrait \n• Drag & drop organisation for artwork thumbnails \n• Drag & drop artwork thumbnails to create stacks (groups) \n• Export to twitter\n\n★ New brush management \n• New ‘General’ tab in advanced brush settings\n • Option to display brush preview as a stamp\n• Duplicate any Pro Tool\n• Paged brush sets for uncluttered organisation\n• Link to Procreate Artery in far left Page of brush sets\n• Create, delete and rename custom brush sets (groups) \n• Rename, delete and duplicate custom brushes \n• Drag & drop brushes AND brush sets (even between sets) \n• Access the Pro Library to use shape and grain files from Pro Tools \n\n★ Pro Tools\n48 carefully crafted new brushes, organised into the following sets: \n • Sketching tools \n• Inking tools \n• Painting tools \n• Airbrushing tools \n• Texture tools; and\n• Abstract tools  \n\n★ Procreate Artery\nBuy additional Pro Tools Sets from the store. You can preview each brush before you buy, just like a real art supply shop!\n• Elemental brush set\n• Touch-Ups brush set\n• Retro brush set\n• Charcoal brush set\n• Spray Paint brush set\n• Luminance brush set\n\n★ New actions available in painting mode\n • Take and insert a photo directly from camera\n • Export canvas to email (PNG or JPEG)\n • Export canvas to iTunes (PSD, JPEG, PNG) \n• Export canvas to photos (JPEG) \n• Export to Twitter \n\n★ General brush features \n• Realistic stroke taper\n • Grain & shape orient to canvas and device \n\n★  Layers\n• Background colour select UI \n• Show real canvas transparency \n\n★ Gestures\n• 3 finger swipe – Undo and redo\n• 3 finger Z-motion – Instant clear layer\n• 4 finger tap – reset canvas rotation\n\n★ Behind the curtain \n• Zoom & rotate canvas (Pinch and rotate)\n • ARC memory management\n • Jot Touch support\n• 48-bit colour painting\n• Multi-threaded key areas\n• Reworked export process\n\n-------------------------\n\nFIXED/CHANGED: \n\n★ Interface refinements\n • Improved contrast app wide \n• Increased menu transparency \n• Much improved Si popovers\n• Re-designed actions popover \n\n★ General\n• New iPad® support\n• Improved accuracy of precision sliders app wide\n• iOS 5 improvements and optimisations\n• 64-bit colour computations allow for ridiculously low opacity with no loss of colour quality\n• Huge performance boost to make use of the incredible GPU in the new iPad®\n• General performance tweaks for first and second generation iPad®\n• Refined app icon (including retina)\n• Improved stability of transform mode\n \n★ Gallery\n• Updated ‘Create a new canvas’ UI (SD/HD selection)\n• Improved 'Export’ dialogue interface\n• Export multiple artworks to Photos, email or iTunes (instead of one at a time)\n• Select multiple artworks to delete, share or duplicate (instead of one at a time)\n\n★ Brushes\n• Maximum size increased (e.g spacing > 12%, size up to 400%)  \n• Updated help options in advanced brush settings\n• Instant Drag & drop organisation\n• Refined advanced options UI\n• Improved slider readouts\n• Added min & max limits\n• Improved slider min/max/zero point snap areas\n• Better workflow for custom brush creation UI\n• Improved tool ‘memory’ (i.e. remember every tool's size and opacity setting. Even between paint, smudge and erase)\n• Improved visibility of brush thumbnails\n• Double tap (or single tap if already selected) to edit a brush\n• Brushes from 1.5 moved into folder called 'Old Brushes'"},{"version_id":"790832673","version_name":"2.2","version_date":"2014-12-17 00:00:00.000 +0800","version_description":"在过去六个月里，我们一直待在研发室里，针对 iPad 不断进行改进。结果，我们进一步优化了 Procreate，从而充分利用 iPad Air 2 的强大功能，整合了 iOS 8 的灵活性，以及实现了长期以来我们一直专注的功能 - 手掌支撑。<br/><br/>手掌支撑类似于防止手掌误触，但是功能更强。它一直处于开启状态，您可以使用普通的电容式触控笔，甚至自己的手指。您最终可以将手掌放在 iPad 屏幕表面上使用手势，无需担心在画布上画出不想要的内容。手掌支撑完全透明，不会影响性能或您的流程。<br/><br/>iCloud Drive、AirDrop 和 AirPrint 现在可以通过全新的 iOS 8 共享在 Procreate 中访问。您现在可以从向和从  iCloud Drive 以及其他任何提供 iOS 8 扩展插件的存储服务导出和导入。<br/><br/>iPad Air 2 可以完美运行 Procreate，iPad Air 2 用户将会看到所有画布尺寸的图层上限增加了。<br/><br/>另外，我们还进行了其他一些改进。其中包括：<br/><br/>- 重建了 Procreate 的一些关键部分，从而改进了稳定性和内存使用情况<br/>- 更新了所有手写笔 SDK<br/>- 添加了吸管作为手写笔按钮选项<br/>- 向图层选项按钮添加了“向下合并”<br/>- 改进了“调色板库”界面<br/>- 改进了“画笔设置”界面<br/>-  Procreate 内界面稍微进行了调整<br/>- 修复了错误"},{"version_id":"811960247","version_name":"2.3","version_date":"2015-04-24 00:00:00.000 +0800","version_description":"• 全新白色界面<br/>现在，在全新白色界面喜爱，您可以在户外绘图和绘画。在 Procreate 2.3 中，您只需点一下开关，整个界面就会过渡到美丽的全新白色界面，该界面专为在光线好的场景中使用而设计。<br/><br/>• 改进的 UI 项目<br/>我们为您重新设计和改进了界面的每一处细节。<br/><br/>• 稳定性提升和错误修复<br/>我们花了大量时间修复了许多错误，并且让应用程序响应更快、更稳定。下面是我们修复的部分错误：<br/><br/>- 修复了从另一个弹窗打开颜色弹窗影响保存颜色更改的问题<br/>- 修复了取色器停用后启动应用程序时仍然可用的问题<br/>- 修复了清除图层错误<br/>- 修复了 ColorDrop 阈值问题<br/>- 修复了 PSD 文件导出崩溃<br/>- 修复了 .procreate 文件导出崩溃<br/>- 修复了变换模式引起的剪切对象崩溃<br/>- 修复了任何菜单打开时粘贴引起的崩溃<br/>- 修复了数字键盘触摸问题<br/>- 修复了使用颜色选取器时的各种问题<br/>- 修复了选择蒙板错误<br/>- 修复了数字颜色选取器手势<br/>- 修复了使用 Palm Support 时图层有时清除的问题<br/>- 修复了重启后图层不透明度重置的问题<br/>- 修复了曲线控制点出现在曲线区域外的问题<br/>- 修复了首次使用时 HSB 和颜色平衡滑块跳动的问题<br/>- 修复了曲线滤镜在屏幕上时固定连续分配混乱的问题<br/>- 修复了固定主要颜色弹窗手势的问题 <br/>- 修复了启动时图层按钮无法使用的问题<br/><br/>亲自体验 大师级画板 后，如果您能在 App Store 上给我们评分，我们会感激不尽。您的 App Store 评分对我们来说非常重要，它能帮助我们做得更好。"},{"version_id":"813358822","version_name":"2.3.1","version_date":"2015-09-25 00:00:00.000 +0800","version_description":"iOS 9 is here! Our boss told us to release a bug fix update, but after extensive experiments with flies, beetles, a lot of adhesive tape and one very angry wasp, we decided that wasn’t going to work for us. So while Dave’s swellings went down, we fixed all these problems with Procreate instead.<br/><br/><br/>- Swiping between the colour picker and the palette library made Procreate so confused it would stop working. Using small words and big pictures we’ve taught it the difference, and now it copes much better.<br/>- Sometimes activating Reference Layer would look like it worked, but it really didn’t. This was very funny but not very useful.<br/>- Under iOS 9, selecting a Wacom device crashed the app. We locked Procreate and Wacom styli in a room and didn’t let them out until they decided to get along.<br/>- Multiply blend mode and some Adjustments were very broken. They’re better now.<br/>- Swatch palettes didn’t want to go where you put them, now they do what they’re told.<br/>- Exporting a PSD file by email will now actually work.<br/>- We fixed an issue where copying a selection while in Transform mode would copy the entire layer instead. <br/>- We also thought it would be great if the video recording setting actually enabled you to turn video recording on or off. Radical, we know.<br/>- Changing your background colour used to also change your selected colour. While this was inclusive and heartwarming, it wasn’t overly practical.<br/>- Using the eyedropper from a stylus button reset your previous colour. Now for the eight of you that use this feature, it will work properly.<br/>- The Adonit SDK really liked putting things in the top left corner of the screen. With great effort, we’ve coaxed it back to the actual canvas.<br/>- Support for the Hex3 Jaja has been removed, and there was much rejoicing.<br/><br/>If you haven’t seen yet, we’ve just made a big announcement - Procreate 3 is coming. This free update for existing users will be our biggest release yet, and it’ll be out by the end of 2015. For more information, check out http://procreate.si"},{"version_id":"813515629","version_name":"2.3.1","version_date":"2015-09-25 00:00:00.000 +0800","version_description":"iOS 9 is here! Our boss told us to release a bug fix update, but after extensive experiments with flies, beetles, a lot of adhesive tape and one very angry wasp, we decided that wasn’t going to work for us. So while Dave’s swellings went down, we fixed all these problems with Procreate instead.<br/><br/><br/>- Swiping between the colour picker and the palette library made Procreate so confused it would stop working. Using small words and big pictures we’ve taught it the difference, and now it copes much better.<br/>- Sometimes activating Reference Layer would look like it worked, but it really didn’t. This was very funny but not very useful.<br/>- Under iOS 9, selecting a Wacom device crashed the app. We locked Procreate and Wacom styli in a room and didn’t let them out until they decided to get along.<br/>- Multiply blend mode and some Adjustments were very broken. They’re better now.<br/>- Swatch palettes didn’t want to go where you put them, now they do what they’re told.<br/>- Exporting a PSD file by email will now actually work.<br/>- We fixed an issue where copying a selection while in Transform mode would copy the entire layer instead. <br/>- We also thought it would be great if the video recording setting actually enabled you to turn video recording on or off. Radical, we know.<br/>- Changing your background colour used to also change your selected colour. While this was inclusive and heartwarming, it wasn’t overly practical.<br/>- Using the eyedropper from a stylus button reset your previous colour. Now for the eight of you that use this feature, it will work properly.<br/>- The Adonit SDK really liked putting things in the top left corner of the screen. With great effort, we’ve coaxed it back to the actual canvas.<br/>- Support for the Hex3 Jaja has been removed, and there was much rejoicing.<br/><br/>If you haven’t seen yet, we’ve just made a big announcement - Procreate 3 is coming. This free update for existing users will be our biggest release yet, and it’ll be out by the end of 2015. For more information, check out http://procreate.si"},{"version_id":"815407180","version_name":"3.0.3","version_date":"2015-12-18 00:00:00.000 +0800","version_description":"This holiday season, one app must finish what it started.<br/><br/>- New improvements for Apple Pencil which make the start of a stroke extremely responsive.<br/>- Fixed Tilt values that were too large for some brushes, although all tilt sizes are beautiful.<br/>- Fixed occasional blobs at the beginning of Apple Pencil strokes. <br/>- There is now a Softness setting for each brush. Additional softening gives better results on glazed brushes. <br/>- There are significant improvements to stroke taper. Now we want to stroke a tapir. Have you seen those things? So cute.<br/>- 6B Compressed and Wood brushes have correct sidebar defaults.<br/>- If you reset a brush it also resets the brush preview. <br/>- Once you went into a Gallery group in Compact mode you could never, ever leave. The Back button is now more than just a tease.<br/>- We fixed issues with rotations on Eyedropper, pinching/zooming, and Instant Replay.<br/>- Your FiftyThree Pencil, Pogo Connect and Jot Touch 4 stylii are stylin’ once more. <br/>- We have resolved issues sometimes experienced when purchasing Early Access. Probably.<br/>- Renaming a layer no longer sometimes makes the layer interface vanish. Yeah, nah.<br/>- We've added some improvements for non-French speaking Italians<br/><br/>If you’re enjoying Procreate don’t forget to leave a review on the App Store, and to share your art with #procreate!"},{"version_id":"816636236","version_name":"3.0.4","version_date":"2016-03-22 00:00:00.000 +0800","version_description":"• Selecting brushes and layers with Apple Pencil was pretty difficult but now you can actually tap them.<br/><br/>• Some changes in Procreate 3 meant that performance would get sluggish when you made really, really long strokes. We found this out from a guy who set up a harmonograph that made continuous brush strokes in Procreate. We made it better.<br/><br/>• No one really needs a pencil with an eraser at both ends, so Pencil by FiftyThree now like… you know… draws.<br/><br/>• We discovered that if you swiped left on a layer and then tapped in the 1-pixel space between the layers menu and the screen edge in just the right way, the app would freeze. We decided this wasn't the kind of easter egg you might like, so now it just closes the swipe menu.<br/><br/>We're cooking up a seriously beefy update, so stay tuned. In the meantime, if you're an app connoisseur please leave a review on the App Store."},{"version_id":"816823206","version_name":"3.0.5","version_date":"2016-04-14 00:00:00.000 +0800","version_description":"• Selecting brushes and layers with Apple Pencil was pretty difficult but now you can actually tap them.<br/><br/>• Some changes in Procreate 3 meant that performance would get sluggish when you made really, really long strokes. We found this out from a guy who set up a harmonograph that made continuous brush strokes in Procreate. We made it better.<br/><br/>• No one really needs a pencil with an eraser at both ends, so Pencil by FiftyThree now like… you know… draws.<br/><br/>• We discovered that if you swiped left on a layer and then tapped in the 1-pixel space between the layers menu and the screen edge in just the right way, the app would freeze. We decided this wasn't the kind of easter egg you might like, so now it just closes the swipe menu.<br/><br/>We're cooking up a seriously beefy update, so stay tuned. In the meantime, if you're an app connoisseur please leave a review on the App Store."},{"version_id":"817125009","version_name":"3.0.6","version_date":"2016-04-25 00:00:00.000 +0800","version_description":"We’d like to thank everyone who participated in Apps for Earth by purchasing the exclusive Earth brush set, hand-made by Kyle T. Webster. By working together with Apple and WWF, you’ve helped make the world a little bit better.<br/><br/>The iconic Procreate spectrum has returned to your springboard once again, and we’ve also increased the limit on custom brush sets. In fact, the limit does not exist. Try and find it. We dare you.<br/><br/>Also Procreate 3.1 is just around the corner. Packed with features you’ve been asking for, we think you’re going to love it. Watch this space."},{"version_id":"818019982","version_name":"3.1.1","version_date":"2016-07-06 00:00:00.000 +0800","version_description":"Procreate 3.1 是我们 2016 年的最大更新。其中的诸多新功能均可加快创作速度。<br/><br/>自动选择<br/>只需轻点一下，即可选择您作品的任意区域。<br/><br/>Streamline<br/>Streamline 画笔设置可以稳固您的描边，从而形成完美的曲线和花体。 <br/><br/>快捷菜单<br/>打开“快捷菜单”，在不中断绘画的情况下立即获取您喜爱的功能。 <br/><br/>自定义画布<br/>通过像素、毫米、厘米或英寸，以及跟踪 DPI 来创建画布。存储、重新排列、编辑和删除您所创建的任何画布。<br/><br/>“修改”按钮<br/>通过“修改”按钮，您可以更加快速、准确地激活吸管。 <br/><br/>PDF 导出<br/>将任一作品导出为 PDF，且可以从三个质量选项中进行选择；或者一次性将多个作品导出到一个 PDF 文件中。<br/><br/>“复制选区”按钮<br/>通过按住“选区”工具栏上的新按钮，立即将选区复制到新的图层。 <br/><br/>自定义倾斜角度<br/>现在，您可以自定义通过 Apple Pencil 调用的倾斜角度。<br/><br/>4K<br/>现在可以为 iPad Air 2 及更高版本录制高达 4K 分辨率的视频。<br/><br/>画布翻转<br/>通过画布翻转功能，可以保持您的缩放程度和位置。<br/><br/>另外，我们还对透视参考线、压力曲线、在当前图层上粘贴的功能进行了改进，并修复了诸多错误。如果您喜欢 Procreate 3.1，请在 App Store 上对其稍加评论，我们将不胜感激。"},{"version_id":"819122071","version_name":"3.1.2","version_date":"2016-10-02 00:00:00.000 +0800","version_description":"Now that iOS 10 has arrived, this is the last update for the iPad 2, iPad mini 1 and iPad 3. We wanted these devices to have the best possible version of Procreate for as long as they're around. With this in mind, there were a few final bugs we had to stomp, and screws that needed tightening.<br/><br/>- Increases in memory usage from recent updates caused instability with large canvas sizes. We've optimised Procreate's usage of memory as much as possible, so crashes at these canvas sizes should now be drastically reduced.<br/><br/>- Now when you hit Restore Purchases, it will actually restore all your purchases, including the Earth Brushes. It's a novel idea, we know.<br/><br/>- As part of a recent update, the Calligraphy Brush gained a drop shadow. Turns out that you can just draw shadows when you want them, so we made this not happen.<br/><br/>- Sometimes, Procreate would decide that your Layer Opacity (and many other adjustments) should be set to 0.0%, and then refuse to let you have any say in the matter. We've now put control of this back in your hands.<br/><br/>- When you were using Recolor, you couldn't actually change your color at all. This was so ridiculous that we're not even going to make a joke about it. It's fixed now.<br/><br/>To those of you using older devices, it's been an amazing journey, and we hope you'll join us again soon. For iOS 10 users, we've got some big plans in store for later this year. Stay tuned."},{"version_id":"819187899","version_name":"3.1.3","version_date":"2016-10-06 00:00:00.000 +0800","version_description":"Like an ex that won't stop calling, we're back for one last release with our older device users. After all, we've had a lot of fun together. Haven't we?<br/><br/>- We just haven’t been communicating like we used to. When using Procreate in a language other than English, certain export options had completely disappeared. It took a lot of 3AM texts, but we got them to come back.<br/><br/>- When actively using Palm Support with some third-party styluses, Procreate would crash to the Gallery. It’s not you, it’s us. We’ve changed.<br/><br/>- When exporting images, there were certain buttons that became a little attached. Like us, they had trouble letting go. We've had a chat, and they're doing much better now.<br/><br/>We promise we’re done. Our next release will target iOS 10.<br/><br/>No, you hang up."},{"version_id":"819202293","version_name":"3.1.4","version_date":"2016-10-07 00:00:00.000 +0800","version_description":"Sorry. We accidentally hit re-dial. Since we've got you though, we had to fix Quickline.<br/><br/>Love you."},{"version_id":"820351048","version_name":"3.2.1","version_date":"2016-12-31 00:00:00.000 +0800","version_description":"This build contains huge fixes for brush behaviour, as well as general fixes and improvements.<br/><br/>- Improvements made to brushes at small sizes<br/>- Fixed an issue with taper<br/>- Improvements to pressure correction at the start of a stroke<br/>- Fixed a crash with Layers menu<br/>- Added a preference slider for Rapid Undo<br/>- Layer thumbnails of copy-pasted images are flipped<br/>- Alpha Lock swipe gesture tolerance improved<br/>- Crash when dragging a cell out of the Gallery Create menu<br/>- Groups containing a hidden layer couldn't be transformed<br/>- Distort makes pixels disappear<br/>- Eyedropper sometimes returns transparency<br/>- Fixed crashes with importing some PSD files"},{"version_id":"821421741","version_name":"3.2.2","version_date":"2017-06-07 00:00:00.000 +0800","version_description":"Welcome to our smallest update ever!<br/><br/>Jam packed with a single feature: this release is fully optimized for the new iPad Pro's ProMotion technology with a refresh rate of 120Hz. Procreate feels blazingly fast and silky smooth.<br/><br/>Because we love you even if you don't have a new iPad Pro, we've also included improvements for Adonit users, and support for the Wacom Bamboo Sketch and new Wacom Bamboo Fineline. <br/><br/>Though this update is little, keep your eyes peeled over the coming weeks. We've got a very special release coming in the Fall, and we'll be telling you all about it very soon."},{"version_id":"822483820","version_name":"3.2.3","version_date":"2017-06-09 00:00:00.000 +0800","version_description":"This update fixes a crash for users running older versions of iOS 10. If you hadn't updated yet: welcome to our smallest update ever!<br/><br/>Jam packed with a single feature: this release is fully optimized for the new iPad Pro's ProMotion technology with a refresh rate of 120Hz. Procreate feels blazingly fast and silky smooth.<br/><br/>Because we love you even if you don't have a new iPad Pro, we've also included improvements for Adonit users, and support for the Wacom Bamboo Sketch and new Wacom Bamboo Fineline. <br/><br/>Though this update is little, keep your eyes peeled over the coming weeks. We've got a very special release coming in the Fall, and we'll be telling you all about it very soon."},{"version_id":"822664853","version_name":"3.2.4","version_date":"2017-06-26 01:16:18.000 +0800","version_description":"If you've got one of the new iPad Pros, this update is for you. This fixes a cancelling issue with the canvas zoom and pan gesture on both new iPad Pro models. \n\nIf you'd like an inside peek of the really exciting things we're working on, you can find us on Instagram, and we'll see you in the Fall for Procreate 4!"},{"version_id":"823773135","version_name":"4.0.2","version_date":"2017-06-26 01:16:18.000 +0800","version_description":"性能和稳定性\nProcreate 现在支持 Siica M，一个专为 iOS 设计的全新绘画引擎。 Procreate 现在完全基于 Metal 构建，速度快了四倍。\n\n全新调漆\n体验全新湿画和烟熏效果。在画布上混合和调漆，实现液体和准确搅拌。\n\n图层蒙板\n通过图层蒙板，您可以选择显示图层的哪些部分，不丢失原始内容的任何部分。\n\n重调的界面\n几乎 Procreate 中的每个像素都经过精心设计，让您的工作流程更快、更简单。\n\n画笔混合模式\n增强了画笔的功能，在一层上即可创建出新的效果。\n\nP3 广色域\n广色域 iPad 现在可以创建和导出全广色域艺术作品。\n\n拖放\n将图像、图层、画笔或调色板拖放到其他营业程序，或者从其他应用程序拖放。\n\n图库\n通过全新重建的 Procreate 图库，您可以轻松管理成千上万个作品。\n\nAirPlay 画布\n将任何显示屏变成艺术作品的实景。激活 AirPlay 画布可以将整个画布映射到另一个屏幕上。\n\n常规改进\n本次更新还包括许多修复和改进，包括与照片互动更好，更多画布信息以及降低了内存使用量。\n\n另外，还有许多细微改进，如果您喜欢  Procreate，请在 App Store 上留下评论。"},{"version_id":"824204431","version_name":"4.0.5","version_date":"2017-10-31 21:53:01.000 +0800","version_description":"Pour some fixes on you.\n\n• You no longer need to live on a prayer when importing massive sized JPGs, odd file formats, and obscure PSDs.\n• We fixed a crash that sometimes happened if you had an appetite for distortion.\n• You can now safely use 'Add to Procreate` after choosing questionable files\n• If you've purchased the Earth brushes set, they're now back in black.\n• We have improved the Calligraphy Set translations for Italian, French, Arabic or Turkish customers.\n• The new Grade slider allows you to soften wet brushes for new effects. Looks so good makes a grown man cry.\n• No longer visually age waiting for the Actions menu to menu.\n• The new Color panel was back-to-front for right-to-left languages.\n• Quicklines with Wet Mix brushes now don't look completely different to the original stroke (no, it won't do that).\n• For first generation iPad Pro customers, you can once again rest your palm without fear lag bringing you to your sha na na na na knees, knees.\n\nIt's the Final Countdown to 11.1 that we're happy to report will fix the freeze, so make sure you update iOS when it's released."},{"version_id":"824267004","version_name":"4.0.7","version_date":"2017-11-03 17:06:41.000 +0800","version_description":"Here's a quick update to restore the correct background and title colors to all your swatch palettes.\n\nIn case you missed it, here's what we changed in the last update:\n\n• You no longer need to live on a prayer when importing massive sized JPGs, odd file formats, and obscure PSDs.\n• We fixed a crash that sometimes happened if you had an appetite for distortion.\n• You can now safely use 'Add to Procreate' after choosing questionable files.\n• If you've purchased the Earth brushes set, they're now back in black.\n• We have improved the Calligraphy Set translations for Italian, French, Arabic or Turkish customers.\n• The new Grade slider allows you to soften wet brushes for new effects. Looks so good makes a grown man cry.\n• No longer visually age waiting for the Actions menu to open.\n• The new Color panel was back-to-front for right-to-left languages.\n• Quicklines with Wet Mix brushes now don't look completely different to the original stroke (no, it won't do that).\n• For first generation iPad Pro customers, you can once again rest your palm without fear of lag bringing you to your sha na na na na knees, knees.\n\nWe're happy to report iOS 11.1 resolves the freezing issue. Huge thanks to all of you that helped diagnose it."},{"version_id":"825369382","version_name":"4.0.8","version_date":"2017-06-26 01:16:18.000 +0800","version_description":"Here are a few more tweaks, just in time for the holidays:\n\n- With the new Shape Filtered switch, brush shapes come in smooth or crunchy.\n- Locked layers are back for PSD import, along with support for all languages in layer names.\n- We've squashed a bug with layer merge, so the bottom won't fall out when you pinch.\n\nAs always we've got huge things in the works for 2018, and the first one is massive but also small: Procreate Pocket 2!"},{"version_id":"826740226","version_name":"4.0.9","version_date":"2018-04-19 21:55:38.000 +0800","version_description":"We're fast approaching some really exciting releases. This is one last stop to pick up the new iPad, and keep your engines running smoothly.\n\n• Sometimes your safety features would fail you and Undo would stop working. It's important to us that you feel safe.\n• Layers sometimes merged without looking, losing layer opacity and layer masks. We've taught them to check their mirrors.\n• Inserted images will no longer cause corrupted or blank exports.\n• If you quit the app while within a document the Gallery thumbnail will still update.\n• Like a child forgotten at sports practice, inserted image layers were occasionally left behind in imported PSDs. We promise it won't happen again. Yes, we can stop for icecream.\n• Galleries jammed with artworks will now load as fast as that really fast car you like, instead of another slow kind of car that you don't like.\n• Big things in the pasteboard won't cause roadblocks in Create Canvas.\n\nWe're working on some hot modifications to Procreate, and can't wait to greatly enhance your ride. We'd love to hear about your journey so far, so please leave a review on the App Store."},{"version_id":"826757205","version_name":"4.0.10","version_date":"2018-04-20 12:26:38.000 +0800","version_description":"We're fast approaching some really exciting releases. This is one last stop to pick up the new iPad, and keep your engines running smoothly.\n\n• Sometimes your safety features would fail you and Undo would stop working. It's important to us that you feel safe.\n• Layers sometimes merged without looking, losing layer opacity and layer masks. We've taught them to check their mirrors. \n• Inserted images will no longer cause corrupted or blank exports. \n• If you quit the app while within a document the Gallery thumbnail will still update. \n• Like a child forgotten at sports practice, inserted image layers were occasionally left behind in imported PSDs. We promise it won't happen again. Yes, we can stop for icecream. \n• Galleries jammed with artworks will now load as fast as that really fast car you like, instead of another slow kind of car that you don't like. \n• Big things in the pasteboard won't cause roadblocks in Create Canvas.\n\nWe're working on some hot modifications to Procreate, and can't wait to greatly enhance your ride. We'd love to hear about your journey so far, so please leave a review on the App Store."},{"version_id":"827814028","version_name":"4.1","version_date":"2018-07-11 03:34:40.000 +0800","version_description":"Procreate 4.1 新增了一些被广泛要求的功能，进一步改进您的专业工作流程。\n\n卷曲变换\n使用新卷曲变换模式卷曲和合拢纹理，为您的插图增加更多深度。\n\n溶解\n利用 Silica-M 引擎的强大功能，旋转、放大、捏合、重构图像的任何部分，获得最新的惊艳效果。\n\n绘画指南\n现在，您可以创建 2D 和等距指南，通过准确的测量控制和绘画辅助的强大功能。\n\n对称\n注意您的描边镜像，跨画布旋转，生成精美设计和构图。您可以使用任何画笔绘画，涂抹和擦除，甚至进行色滴操作。\n\n手势控制\nProcreate 的手势自定义彻底重新设计，让您更轻松地控制所需的功能。\n\n图层选择\n通过手势控制中的新选项，您可以从画布上其内容中选择图层。\n\n30 秒慢镜头\n除了 Procreate 现有的慢动作录像功能外，现在您还可以导出自动缩短的 30 秒版本，非常适合用于社交媒体。\n\n画笔组导入/导出\n共享和导入整个画笔组，作为一个文件。\n\n常规改进\n本次更新还包括许多修复和改进，包括与 QuickLine 更好互动、图层彩色翻转选项以及变换重新采样重大改进。\n\n另外，还有许多细微改进，如果您喜欢  Procreate，请在 App Store 上留下评论。"},{"version_id":"827839929","version_name":"4.1.1","version_date":"2018-07-11 21:56:24.000 +0800","version_description":"Procreate 4.1 新增了一些被广泛要求的功能，进一步改进您的专业工作流程。\n\n卷曲变换\n使用新卷曲变换模式卷曲和合拢纹理，为您的插图增加更多深度。\n\n溶解\n利用 Silica-M 引擎的强大功能，旋转、放大、捏合、重构图像的任何部分，获得最新的惊艳效果。\n\n绘画指南\n现在，您可以创建 2D 和等距指南，通过准确的测量控制和绘画辅助的强大功能。\n\n对称\n注意您的描边镜像，跨画布旋转，生成精美设计和构图。您可以使用任何画笔绘画，涂抹和擦除，甚至进行色滴操作。\n\n手势控制\nProcreate 的手势自定义彻底重新设计，让您更轻松地控制所需的功能。\n\n图层选择\n通过手势控制中的新选项，您可以从画布上其内容中选择图层。\n\n30 秒慢镜头\n除了 Procreate 现有的慢动作录像功能外，现在您还可以导出自动缩短的 30 秒版本，非常适合用于社交媒体。\n\n画笔组导入/导出\n共享和导入整个画笔组，作为一个文件。\n\n常规改进\n本次更新还包括许多修复和改进，包括与 QuickLine 更好互动、图层彩色翻转选项以及变换重新采样重大改进。\n\n另外，还有许多细微改进，如果您喜欢  Procreate，请在 App Store 上留下评论。"},{"version_id":"827984903","version_name":"4.1.2","version_date":"2018-07-25 13:48:20.000 +0800","version_description":"Procreate 4.1 新增了一些被广泛要求的功能，进一步改进您的专业工作流程。\n卷曲变换\n使用新卷曲变换模式卷曲和合拢纹理，为您的插图增加更多深度。\n\n溶解\n利用 Silica-M 引擎的强大功能，旋转、放大、捏合、重构图像的任何部分，获得最新的惊艳效果。\n\n绘画指南\n现在，您可以创建 2D 和等距指南，通过准确的测量控制和绘画辅助的强大功能。\n\n对称\n注意您的描边镜像，跨画布旋转，生成精美设计和构图。您可以使用任何画笔绘画，涂抹和擦除，甚至进行色滴操作。\n\n手势控制\nProcreate 的手势自定义彻底重新设计，让您更轻松地控制所需的功能。\n\n图层选择\n通过手势控制中的新选项，您可以从画布上其内容中选择图层。\n\n30 秒慢镜头\n除了 Procreate 现有的慢动作录像功能外，现在您还可以导出自动缩短的 30 秒版本，非常适合用于社交媒体。\n\n画笔组导入/导出\n共享和导入整个画笔组，作为一个文件。\n\n常规改进\n本次更新还包括许多修复和改进，包括与 QuickLine 更好互动、图层彩色翻转选项以及变换重新采样重大改进。\n\n另外，还有许多细微改进，如果您喜欢 Procreate，请在 App Store 上留下评论。"},{"version_id":"828126141","version_name":"4.1.3","version_date":"2018-08-10 02:14:20.000 +0800","version_description":"Procreate 4.1 新增了一些被广泛要求的功能，进一步改进您的专业工作流程。\n\n卷曲变换\n使用新卷曲变换模式卷曲和合拢纹理，为您的插图增加更多深度。\n\n溶解\n利用 Silica-M 引擎的强大功能，旋转、放大、捏合、重构图像的任何部分，获得最新的惊艳效果。\n\n绘画指南\n现在，您可以创建 2D 和等距指南，通过准确的测量控制和绘画辅助的强大功能。\n\n对称\n注意您的描边镜像，跨画布旋转，生成精美设计和构图。您可以使用任何画笔绘画，涂抹和擦除，甚至进行色滴操作。\n\n手势控制\nProcreate 的手势自定义彻底重新设计，让您更轻松地控制所需的功能。\n\n图层选择\n通过手势控制中的新选项，您可以从画布上其内容中选择图层。\n\n30 秒慢镜头\n除了 Procreate 现有的慢动作录像功能外，现在您还可以导出自动缩短的 30 秒版本，非常适合用于社交媒体。\n\n画笔组导入/导出\n共享和导入整个画笔组，作为一个文件。\n\n常规改进\n本次更新还包括许多修复和改进，包括与 QuickLine 更好互动、图层彩色翻转选项以及变换重新采样重大改进。\n\n另外，还有许多细微改进，如果您喜欢  Procreate，请在 App Store 上留下评论。"},{"version_id":"828545904","version_name":"4.1.4","version_date":"2018-09-13 04:30:41.000 +0800","version_description":"We're just dropping in with some compatibility fixes, but there's a big update coming soon. We're sorry to Crop these release notes short, and we don't wish to Mask our intentions, but before we Taper off, we want you to know that we're sure the features we've Selected for our next major release will be a real Feather in your cap."},{"version_id":"829172672","version_name":"4.2","version_date":"2018-11-07 04:56:49.000 +0800","version_description":"2018 年第二次重大更新包括形状、画布修剪、剪裁蒙板以及其他许多功能和改进，改进您的专业工作流程。\n\n最前沿\n完全兼容最新的 iOS 和所有可用的 iPad 和 Apple 配件。\n\nQuickShape\n创建完美的椭圆、弧形、圆形、矩形、三角形和其他形状，只需画一个形状并按住笔画末尾即可。\n\n修剪和调整大小\n随时从“操作”菜单放大或修剪画布。\n\n剪裁蒙板\n按另一个图层剪裁图层，根据下方图层的内容控制图层的可见性。\n\n图库预览\n从图库全屏预览作品，在图库、选区或堆栈中滑动或轻点画布。\n\n改进描边锥度\n通过全新锥度选项，您可以准确控制锥度量、笔尖形状以及压力输入和触摸输入之间的变化。\n\n选区羽化\n控制选区的软边，低至精确的像素数。\n\n形状选择\n除了手画和自动选择外，您现在可以使用椭圆形或矩形快速选择画布的区域。\n\n全新溶解工具\n通过结晶和边缘两个新画笔提升了溶解效果，您还可以将变形和动量应用到任何溶解画笔上，获得神奇效果。\n\n转换更新\n为每个转换操作选择最佳插值方法，使用新的统一模式和旋转节点，实现精确调整。\n\n常规改进\n本次更新还包括许多修复和改进, 画笔组的复制选项以及能够在画布间拖放图层。\n\n我们还对整个应用进行了细微改进，如果您喜欢 Procreate，请在 App Store 上留下评论。"},{"version_id":"829203199","version_name":"4.2.1","version_date":"2018-11-08 02:33:18.000 +0800","version_description":"2018 年第二次重大更新包括形状、画布修剪、剪裁蒙板以及其他许多功能和改进，改进您的专业工作流程。\n\n最前沿\n完全兼容最新的 iOS 和所有可用的 iPad 和 Apple 配件。\n\nQuickShape\n创建完美的椭圆、弧形、圆形、矩形、三角形和其他形状，只需画一个形状并按住笔画末尾即可。\n\n修剪和调整大小\n随时从“操作”菜单放大或修剪画布。\n\n剪裁蒙板\n按另一个图层剪裁图层，根据下方图层的内容控制图层的可见性。\n\n图库预览\n从图库全屏预览作品，在图库、选区或堆栈中滑动或轻点画布。\n\n改进描边锥度\n通过全新锥度选项，您可以准确控制锥度量、笔尖形状以及压力输入和触摸输入之间的变化。\n\n选区羽化\n控制选区的软边，低至精确的像素数。\n\n形状选择\n除了手画和自动选择外，您现在可以使用椭圆形或矩形快速选择画布的区域。\n\n全新溶解工具\n通过结晶和边缘两个新画笔提升了溶解效果，您还可以将变形和动量应用到任何溶解画笔上，获得神奇效果。\n\n转换更新\n为每个转换操作选择最佳插值方法，使用新的统一模式和旋转节点，实现精确调整。\n\n常规改进\n本次更新还包括许多修复和改进, 画笔组的复制选项以及能够在画布间拖放图层。\n\n我们还对整个应用进行了细微改进，如果您喜欢 Procreate，请在 App Store 上留下评论。"},{"version_id":"829288495","version_name":"4.2.2","version_date":"2018-11-16 06:10:46.000 +0800","version_description":"2018 年第二次重大更新包括形状、画布修剪、剪裁蒙板以及其他许多功能和改进，改进您的专业工作流程。\n\n最前沿\n完全兼容最新的 iOS 和所有可用的 iPad 和 Apple 配件。\n\nQuickShape\n创建完美的椭圆、弧形、圆形、矩形、三角形和其他形状，只需画一个形状并按住笔画末尾即可。\n\n修剪和调整大小\n随时从“操作”菜单放大或修剪画布。\n\n剪裁蒙板\n按另一个图层剪裁图层，根据下方图层的内容控制图层的可见性。\n\n图库预览\n从图库全屏预览作品，在图库、选区或堆栈中滑动或轻点画布。\n\n改进描边锥度\n通过全新锥度选项，您可以准确控制锥度量、笔尖形状以及压力输入和触摸输入之间的变化。\n\n选区羽化\n控制选区的软边，低至精确的像素数。\n\n形状选择\n除了手画和自动选择外，您现在可以使用椭圆形或矩形快速选择画布的区域。\n\n全新溶解工具\n通过结晶和边缘两个新画笔提升了溶解效果，您还可以将变形和动量应用到任何溶解画笔上，获得神奇效果。\n\n转换更新\n为每个转换操作选择最佳插值方法，使用新的统一模式和旋转节点，实现精确调整。\n\n常规改进\n本次更新还包括许多修复和改进, 画笔组的复制选项以及能够在画布间拖放图层。\n\n我们还对整个应用进行了细微改进，如果您喜欢 Procreate，请在 App Store 上留下评论。"},{"version_id":"829473278","version_name":"4.2.3","version_date":"2018-12-05 04:09:06.000 +0800","version_description":"2018 年第二次重大更新包括形状、画布修剪、剪裁蒙板以及其他许多功能和改进，改进您的专业工作流程。\n最前沿\n完全兼容最新的 iOS 和所有可用的 iPad 和 Apple 配件。\n\nQuickShape\n创建完美的椭圆、弧形、圆形、矩形、三角形和其他形状，只需画一个形状并按住笔画末尾即可。\n\n修剪和调整大小\n随时从“操作”菜单放大或修剪画布。\n\n剪裁蒙板\n按另一个图层剪裁图层，根据下方图层的内容控制图层的可见性。\n\n图库预览\n从图库全屏预览作品，在图库、选区或堆栈中滑动或轻点画布。\n\n改进描边锥度\n通过全新锥度选项，您可以准确控制锥度量、笔尖形状以及压力输入和触摸输入之间的变化。\n\n选区羽化\n控制选区的软边，低至精确的像素数。\n\n形状选择\n除了手画和自动选择外，您现在可以使用椭圆形或矩形快速选择画布的区域。\n\n全新溶解工具\n通过结晶和边缘两个新画笔提升了溶解效果，您还可以将变形和动量应用到任何溶解画笔上，获得神奇效果。\n\n转换更新\n为每个转换操作选择最佳插值方法，使用新的统一模式和旋转节点，实现精确调整。\n\n常规改进\n本次更新还包括许多修复和改进, 画笔组的复制选项以及能够在画布间拖放图层。\n\n我们还对整个应用进行了细微改进，如果您喜欢 Procreate，请在 App Store 上留下评论。"},{"version_id":"829683050","version_name":"4.2.4","version_date":"2018-12-19 06:32:51.000 +0800","version_description":"2018 年第二次重大更新包括形状、画布修剪、剪裁蒙板以及其他许多功能和改进，改进您的专业工作流程。\n\n最前沿\n完全兼容最新的 iOS 和所有可用的 iPad 和 Apple 配件。\n\nQuickShape\n创建完美的椭圆、弧形、圆形、矩形、三角形和其他形状，只需画一个形状并按住笔画末尾即可。\n\n修剪和调整大小\n随时从“操作”菜单放大或修剪画布。\n\n剪裁蒙板\n按另一个图层剪裁图层，根据下方图层的内容控制图层的可见性。\n\n图库预览\n从图库全屏预览作品，在图库、选区或堆栈中滑动或轻点画布。\n\n改进描边锥度\n通过全新锥度选项，您可以准确控制锥度量、笔尖形状以及压力输入和触摸输入之间的变化。\n\n选区羽化\n控制选区的软边，低至精确的像素数。\n\n形状选择\n除了手画和自动选择外，您现在可以使用椭圆形或矩形快速选择画布的区域。\n\n全新溶解工具\n通过结晶和边缘两个新画笔提升了溶解效果，您还可以将变形和动量应用到任何溶解画笔上，获得神奇效果。\n\n转换更新\n为每个转换操作选择最佳插值方法，使用新的统一模式和旋转节点，实现精确调整。\n\n常规改进\n本次更新还包括许多修复和改进, 画笔组的复制选项以及能够在画布间拖放图层。\n\n我们还对整个应用进行了细微改进，如果您喜欢 Procreate，请在 App Store 上留下评论。"},{"version_id":"830121335","version_name":"4.2.5","version_date":"2019-01-30 05:29:31.000 +0800","version_description":"Procreate 4.2.5 包含以下问题的修复和改进：\n\n变换\n选区\n插入文件\n撤销\nAdonit 触控笔\n曲线\n透视参考线\n\n在 App Store 中留下评论，告诉我们您对 Procreate 的看法。"},{"version_id":"830943588","version_name":"4.3","version_date":"2019-04-16 08:46:06.000 +0800","version_description":"2019 年首次更新包含用户要求最多的 Procreate 功能：文本！现在，您可以在画布上创建文本，甚至是导入字体。本次更新还提供其他许多功能和改进，从而提升您的创作水平。\n\n文本工具\n添加并编辑类型，轻松、精准地调整间距和对齐\n\n导入字体\n将您喜欢的字体拖放到 Procreate 中。\n\n分享图层\n导出多个图层，生成一个 PDF、一文件夹 PNG 图像或者一个动画 GIF。\n\n查看单个图层\n选中“可见性”复选框，快速查看一个图层的内容。\n\n压力平滑\n全新压力平滑让您更加自信地完成创作。\n\n全新混合模式\n深色、浅色、亮光、线性光、点光、实色混合和划分。\n\n改进\n本次更新还包含一些修复和改进，包括能够关闭撤销/重做手势。\n\n在 App Store 中留下评论，告诉我们您对 Procreate 的看法。"},{"version_id":"831022931","version_name":"4.3.1","version_date":"2019-04-19 01:33:56.000 +0800","version_description":"2019 年首次更新包含用户要求最多的 Procreate 功能：文本！现在，您可以在画布上创建文本，甚至是导入字体。本次更新还提供其他许多功能和改进，从而提升您的创作水平。\n文本工具\n添加并编辑类型，轻松、精准地调整间距和对齐\n\n导入字体\n将您喜欢的字体拖放到 Procreate 中。\n\n分享图层\n导出多个图层，生成一个 PDF、一文件夹 PNG 图像或者一个动画 GIF。\n\n查看单个图层\n选中“可见性”复选框，快速查看一个图层的内容。\n\n压力平滑\n全新压力平滑让您更加自信地完成创作。\n\n全新混合模式\n深色、浅色、亮光、线性光、点光、实色混合和划分。\n\n改进\n本次更新还包含一些修复和改进，包括能够关闭撤销/重做手势。\n\n在 App Store 中留下评论，告诉我们您对 Procreate 的看法。"},{"version_id":"831153294","version_name":"4.3.2","version_date":"2019-05-01 10:21:39.000 +0800","version_description":"This patch includes improvements and refinements for our last big update:\n\n- Rapidly transitioning between modes no longer causes crashes.\n- Layers can now also be shared as Animated MP4 and Animated PNG.\n- Procreate is now fully compatible with the new iPad Air and Mini.\n- We improved autocorrect and suggestion behaviour in Text.\n- Now you can dictate Text straight into Procreate. \n- When you cut a text layer it will now rasterise. \n- We fixed the disappearing Brush cursor.\n- The curves histogram now works on Text layers.\n- When typing with a font that is missing glyphs, font fallback provides the missing glyph from another font, then switches straight back to your original font as you continue to type.\n- Undo/redo gestures have been re-added for Text mode, even when they're switched off globally.\n- Now you can drag and drop TTC font files into Procreate.\n- Eyedropper uses nearest neighbour interpolation for a clearer visual.\n- Duplicating groups when soloing now preserves every individual layer's visibility setting.\n- Transform and QuickShape animations play at the right speed on 60Hz devices.\n- Painting on Clipping Masks no longer displays on empty layers. \n- Thumbnails of PSD exports now preserve canvas flipping.\n\nThank you so much for your support - we're thrilled to hear all your positive comments for the new Procreate Text and Typography. There's so much more to come."},{"version_id":"831176728","version_name":"4.3.3","version_date":"2019-05-07 03:34:25.000 +0800","version_description":"Procreate 4.3.3 includes fixes for Liquify, video import, transform interpolation, and French language.\n\n* Improved Liquify performance for first generation iPad Pros\n* Fixed canvas sizing on portrait video import\n* Transform interpolation methods now update immediately\n* New translation for Tracking in French\n\nThanks for sharing your art with #procreate. We love seeing what you create."},{"version_id":"831559308","version_name":"4.3.4","version_date":"2019-06-13 01:17:54.000 +0800","version_description":"This update contains fixes for locked layer behaviour, GIF insertion, Text rasterization, image resampling, and UK and Australian language localization.\n\n* Text on locked layers no longer rasterizes on ColorDrop, and locked layers behave much better in general\n* 'Insert a file' now allows insertion of GIFs\n* You can add Text to documents created from imported GIFs\n* Merging a layer with Select contents on it no longer causes a crash\n* We've improved UK and Australian English localization\n* Unnecessary resampling on transform flips has been fixed\n* Flipped PSD and Procreate thumbnails now look nicer\n\nWe've also fixed a few general crashes, and updated the Review button so it sends you to the App Store, as it should! Please try it out, and leave us a review."},{"version_id":"831783492","version_name":"4.3.5","version_date":"2019-06-29 06:03:08.000 +0800","version_description":"This update offers fixes to the importing of older documents, translation corrections, and solutions for assorted crashes.\n\n* Previously, scrubbing to clear a Text layer triggered crashes\n* Issues with editing QuickShapes with Simplified Undo disabled\n* Simplified Undo would not visually update Text layers until another action was performed\n* Loading Gallery Preview no longer causes intermittent crashes\n* Importing older Procreate documents from the Gallery occasionally produced blank layers\n\nPlease share your artwork with the hashtag #procreate, and share your thoughts by leaving us a review."},{"version_id":"832010050","version_name":"4.3.6","version_date":"2019-07-16 07:39:16.000 +0800","version_description":"This update offers improvements to the behaviour of Stacks in Procreate Gallery.\n\n* You can now delete files if they are in a Stack.\n* When you duplicate an artwork within a Stack, the new copy now appears inside the Stack, not outside it.\n\nWe hope you love using Procreate as much as we love working on it. If you have thoughts to share, please leave us a review."},{"version_id":"832799894","version_name":"4.3.7","version_date":"2019-09-24 17:06:55.000 +0800","version_description":"You know how you heard there was going to be a big Procreate update? Well, this isn't it! \n\nInstead this little update will keep you fully compatible with iOS 13 until our major 2019 update arrives. While you wait for Procreate 5, please consider leaving us a review on the App Store."},{"version_id":"832943177","version_name":"4.3.8","version_date":"2019-09-28 01:45:21.000 +0800","version_description":"We love fixing problems for our loyal customers who've been with us since Procreate 2. Especially those of you who ended up with the old Pocket brush set causing a crash.  \n\nAlso the interface is no longer difficult to tap when in compact mode. \n\nNow we're heading back to beefing and polishing up Procreate 5. If you have some time please consider leaving us a review on the App Store!"},{"version_id":"833185714","version_name":"4.3.9","version_date":"2019-10-24 17:47:26.000 +0800","version_description":"This update includes small improvements to keep you going until Procreate 5 is complete. \n\n* Actions and Adjustment headings have been localized for everyone.\n* Share Untitled palettes once more.\n* Canvas Information has been tidied up.\n* You can now always edit your text style from the tap menu.\n* Text Baseline is once again operational.\n* Improved Gallery loading.\n\nWe're working hard on Procreate 5 - and your reviews keep us going!"},{"version_id":"833825779","version_name":"5.0","version_date":"2019-12-09 08:34:56.000 +0800","version_description":"这是您一直期待的更新。欢迎使用 Procreate® 5。Procreate® 5 是一款创意行业一直寻求的解决方案，其中包括了数百项令人激动的新特性和多项质量方面的改进，更多精彩，期待您来体验。\n\n• 动画辅助 \n全新的动画辅助功能是 Procreate® 5 中的开创性功能。这是一款使用简单，而且功能强大的动画工具。动画辅助的基本功能包括洋葱皮和即时回放，可以帮助您创作丰富的直观动画、循环 GIF 和活泼的动画。\n\n• 画笔工具箱\n重新设计和开发的画笔工具箱让您可以充分利用 Procreate® 的画笔系统。上百种设置赋予您充分的灵活性，让您可以自定义 Procreate® 画笔。从头设计自己的画笔，从未如此简单：内置的图形加速结构生成器，可以帮助您在几秒钟内制作出自己需要的画笔。得益于 Valkyrie 的强大处理能力，您可以将自己喜爱的 Adobe® Photoshop® 画笔导入到 Procreate® 中，而且用他们绘画的速度也远超从前。\n\n• Valkyrie，下一代绘图引擎\nProcreate 一直引领性能标杆。全新 Valkyrie 引擎更进一步，提供了更精密的全新着色程序，并且在支持的设备上可以以 120fps 的速度运行。无论是绘图还是绘画，Valkyrie 手到擒来。Valkyrie 基于 Apple 的 Metal 架构，其设计可以充分发挥 iPad 的极限性能。  • 整合画笔\n取两个独立的画笔，并将二者整合，即可获得一个完全不同的画笔和风格。这看似简单，但是却可以给创作者带来很大的影响。\n\n• 颜色动态\n借助与 Apple Pencil 压感和倾斜技术的深度集成，即时传输色相、饱和度、亮度。添加第二颜色，进行深度颜色控制。\n\n• 迷你颜色面板 拖动颜色面板，创建在绘图过程中仍然保持活跃的小面板，加速工作流。轻松移动迷你颜色面板，放在不妨碍使用，又便于使用的位置。 \n\n• 颜色历史 \n最新的 10 步颜色历史，始终将最常用的颜色放在最方便使用的位置。\n\n• 颜色文件\n全新 CMYK 和 RGB ICC 文件支持导入，并可以基于作品轻松创作打印内容。通过特定 CMYK 或 RGB 文件的透镜查看作品，顺畅地从电子版转换成打印版。\n\n• 颜色调和\n从补偿、分离补偿、模拟、三元和四元文件中选择，滑动指尖即可提供快速简单的颜色调和效果。得益于新的直观界面，选取调和颜色如此简单，让您尽情享受驾驭色彩的快乐。\n\n• 克隆调整\n这是一款不一样的克隆工具，可以将画布的一部分轻松冲压或描绘到另一个画布上。您可以使用任意画笔风格，即可在克隆区域应用画笔的外观，或将克隆区域锁定，根据自己的选择用多色画笔进行描绘。\n\n• 新的绘画和艺术画笔套装\n我们提供了 190 多种默认画笔，涵盖 18 种风格，可以满足艺术家们的所有需求。这些画笔经过自定义，可以充分发挥 Procreate 5 的全新画笔引擎的性能，可以在描边和设计图案时提升敏锐度和控制力。\n\n• 重新定义的界面\nProcreate® 5 的界面对当前用户而言并不陌生，大家可以轻松找到工具的具体位置以及如何操作。但是全新的界面经过了优化，进行了超过 100 项改进。Procreate® 5 可以让艺术家轻松创作，扫除一切障碍。  更多改进：\n\n•改进了内存处理方式\n•改善了涂抹采样表现 \n•新画笔作者卡\n•重新设计的创意画布系统\n•重新设计的画布信息\n•重新设计的手势控制面板\n•重新设计的专业图库\n•重新设计的选择界面\n•重新设计的转换界面\n•重新设计的调节\n•重新设计的动画导出对话\n•优化了 GIF 导出 \n•新的 GIF混色选项\n•为画笔创建了重置点\n•新画笔渲染模式\n•新的增益混合模式\n•新的 Apple Pencil 控制选项\n\n感谢大家的支持。我们真心希望大家喜欢 Procreate 5，也欢迎大家在 App Store 中添加评论。"},{"version_id":"834018710","version_name":"5.0.1","version_date":"2019-12-21 05:22:45.000 +0800","version_description":"这是您一直期待的更新。欢迎使用 Procreate® 5。Procreate® 5 是一款创意行业一直寻求的解决方案，其中包括了数百项令人激动的新特性和多项质量方面的改进，更多精彩，期待您来体验。\n\n• 动画辅助 \n全新的动画辅助功能是 Procreate® 5 中的开创性功能。这是一款使用简单，而且功能强大的动画工具。动画辅助的基本功能包括洋葱皮和即时回放，可以帮助您创作丰富的直观动画、循环 GIF 和活泼的动画。\n\n• 画笔工具箱\n重新设计和开发的画笔工具箱让您可以充分利用 Procreate® 的画笔系统。上百种设置赋予您充分的灵活性，让您可以自定义 Procreate® 画笔。从头设计自己的画笔，从未如此简单：内置的图形加速结构生成器，可以帮助您在几秒钟内制作出自己需要的画笔。得益于 Valkyrie 的强大处理能力，您可以将自己喜爱的 Adobe® Photoshop® 画笔导入到 Procreate® 中，而且用他们绘画的速度也远超从前。\n\n• Valkyrie，下一代绘图引擎\nProcreate 一直引领性能标杆。全新 Valkyrie 引擎更进一步，提供了更精密的全新着色程序，并且在支持的设备上可以以 120fps 的速度运行。无论是绘图还是绘画，Valkyrie 手到擒来。Valkyrie 基于 Apple 的 Metal 架构，其设计可以充分发挥 iPad 的极限性能。  • 整合画笔\n取两个独立的画笔，并将二者整合，即可获得一个完全不同的画笔和风格。这看似简单，但是却可以给创作者带来很大的影响。\n\n• 颜色动态\n借助与 Apple Pencil 压感和倾斜技术的深度集成，即时传输色相、饱和度、亮度。添加第二颜色，进行深度颜色控制。\n\n• 迷你颜色面板 拖动颜色面板，创建在绘图过程中仍然保持活跃的小面板，加速工作流。轻松移动迷你颜色面板，放在不妨碍使用，又便于使用的位置。 \n\n• 颜色历史 \n最新的 10 步颜色历史，始终将最常用的颜色放在最方便使用的位置。\n\n• 颜色文件\n全新 CMYK 和 RGB ICC 文件支持导入，并可以基于作品轻松创作打印内容。通过特定 CMYK 或 RGB 文件的透镜查看作品，顺畅地从电子版转换成打印版。\n\n• 颜色调和\n从补偿、分离补偿、模拟、三元和四元文件中选择，滑动指尖即可提供快速简单的颜色调和效果。得益于新的直观界面，选取调和颜色如此简单，让您尽情享受驾驭色彩的快乐。\n\n• 克隆调整\n这是一款不一样的克隆工具，可以将画布的一部分轻松冲压或描绘到另一个画布上。您可以使用任意画笔风格，即可在克隆区域应用画笔的外观，或将克隆区域锁定，根据自己的选择用多色画笔进行描绘。\n\n• 新的绘画和艺术画笔套装\n我们提供了 190 多种默认画笔，涵盖 18 种风格，可以满足艺术家们的所有需求。这些画笔经过自定义，可以充分发挥 Procreate 5 的全新画笔引擎的性能，可以在描边和设计图案时提升敏锐度和控制力。\n\n• 重新定义的界面\nProcreate® 5 的界面对当前用户而言并不陌生，大家可以轻松找到工具的具体位置以及如何操作。但是全新的界面经过了优化，进行了超过 100 项改进。Procreate® 5 可以让艺术家轻松创作，扫除一切障碍。  更多改进：\n\n•改进了内存处理方式\n•改善了涂抹采样表现 \n•新画笔作者卡\n•重新设计的创意画布系统\n•重新设计的画布信息\n•重新设计的手势控制面板\n•重新设计的专业图库\n•重新设计的选择界面\n•重新设计的转换界面\n•重新设计的调节\n•重新设计的动画导出对话\n•优化了 GIF 导出 \n•新的 GIF混色选项\n•为画笔创建了重置点\n•新画笔渲染模式\n•新的增益混合模式\n•新的 Apple Pencil 控制选项\n\n感谢大家的支持。我们真心希望大家喜欢 Procreate 5，也欢迎大家在 App Store 中添加评论。"},{"version_id":"834671539","version_name":"5.0.2","version_date":"2020-02-14 08:50:33.000 +0800","version_description":"This update contains fixes for smudge, color accuracy, and translations.\n\n* Smudge at low speed no longer produces green artefacts\n* Improved colour accuracy and precision\n* Orange Peel brush source crash fix\n* Smudge was not sampling correctly for QuickShapes while using symmetry \n* Improved translations \n* Removal of Color Companion flying animation\n* Fixed hiding a frame jumping back to first frame\n\nDon’t forget to let us know what you think by leaving a review on the AppStore."},{"version_id":"835321455","version_name":"5.0.3","version_date":"2020-03-31 03:53:45.000 +0800","version_description":"Here are some fixes and improvements as part of your #ProcreateCarePack\n\n* Improvements to glazed brushes \"banding\" when painting with very low pressure \n* Time-lapse exports can be encoded in HEVC or MP4 on supported devices\n* Adonit styluses will work with Drawing Assist and after you picked a color\n* Apple Pencil tilt angles can now be modified throughout Brush Studio\n* Improved ABR import\n* DPI now exports with all image types\n* CMYK PSDs export correctly with groups\n* Chinese languages will now link to Chinese language handbook, support page, and Learn to Procreate videos \n* Specific special characters will no longer corrupt your artwork\n\nStay safe and grab all your other treats from http://procreate.art/carepack"},{"version_id":"835448676","version_name":"5.0.4","version_date":"2020-04-08 19:33:16.000 +0800","version_description":"We hope you're safe and finding peace in your art. To help you along on that road, here are some new fixes and improvements winging their way to you as part of the #ProcreateCarePack.\n\n* Fixed: the black background Clone Tool kept leaving behind cloned objects when using a glazed brush\n* Smoothed: artefacts and corrupted colors on glazed brushes and glazed smudge\n* Removed: crashes on import of PSDs with text layers\n\nAnd if you haven't already, treat yourself to the freebies and art challenges from http://procreate.art/carepack."},{"version_id":"835830896","version_name":"5.0.5","version_date":"2020-05-12 18:07:50.000 +0800","version_description":"Some more fixes and improvements to keep you powered up and feeling great. \n\n• You now have a charming new option to export HEVC animations. \n• Export delightful animations with transparent backgrounds using HEVC encoding. \n• If you have the majestic new 2020 iPad Pro, you can now create even more layers.\n• Drag and drop no longer allows you to crash and burn past your layer limits.\n• Animated GIF, PNG, and MP4 now import way better and make you feel good.\n\nKeep an eye out on our instagram channel. We're giving away artist-created coloring pages, skill-boosting live streams, and entries for the 2020 Art Prize open May 20!"},{"version_id":"836100210","version_name":"5.0.6","version_date":"2020-05-27 00:35:57.000 +0800","version_description":"Today you have some more goodies and document recovery improvements:\n\n• You can once again rearrange layers when you have reached your device layer limit\n• Painting with solo visibility on a Clipping Mask will no longer cause visual junk\n• Animated HEVC now only appears for devices that support this magnificent codec\n• Importing a PSD file will no longer duplicate text layers\n• If Procreate finds damaged artworks in your Gallery, it will magic them into a neat stack for you \n• Artworks that cannot be recovered successfully can now be exported and your Gallery will keep operating smoothly\n\nThis year's Art Prize theme is illusion and entries are now open. We can't wait to see yours! http://procreate.art/prize"},{"version_id":"836246918","version_name":"5.0.7","version_date":"2020-06-08 18:02:15.000 +0800","version_description":"We have a few important fixes for you today. Broken thumbnails no longer crash your Gallery and video import once again works. Thanks for your patience and especially to the artists that helped us figure out the crash issue."},{"version_id":"837104623","version_name":"5.0.8","version_date":"2020-07-31 06:39:37.000 +0800","version_description":"This update contains a fix for lag when returning to the Gallery and failure to load in some cases. \n\nA new button in the About section has appeared so that the artwork recovery will only begin when you request it. If Procreate finds any damaged artworks, they will be placed in a Recovered Artwork Stack for you. \n\nNow that you have a fully functioning Gallery, you're all set for what comes next…"},{"version_id":"837389517","version_name":"5.1","version_date":"2020-09-22 05:00:33.000 +0800","version_description":"Procreate 5X 中整合了我们重新构想的精密功能，也是创作工具领域的又一大进步。\n\n• Pencil 滤镜\n利用 Apple Pencil 作为画笔处理图像特效。首次使用时，您可以使用任意画笔在准确的位置进行调整和添加特效。涂抹您的滤镜，就像您从未见过一样创作纹理特效。您甚至可以实时擦除或调整效果。\n\n• 渐变映射\n将渐变映射到您的绘画作品或其他图像是用户呼声最大的功能之一。浏览渐变色库，或从头开始创作您自己的渐变调色板。\n\n• 全新滤镜\n使用全新故障艺术、色像差、泛光、半色调和杂色滤镜创作精彩特效，结合全新 Pencil 滤镜可以获得更棒的效果。\n\n• 浮动参考助手\n现在您可以参考图像，在创作或查看画布的同时从其他视角导览。浮动式参考助手窗口让您可以在任意模式中选取颜色。\n\n• FacePaint面容彩绘\n在脸上直接实时绘画！使用完整版 Procreate，您可以在面部添加动画和慢镜头。\n\n• 调色板捕获 & 色卡快填\n用相机或照片库中的照片捕捉您身边的多彩多姿。将色卡直接拖放到您的画布上，为您的作品填充颜色。现在您还可以导入 Adobe® ACO 和 ASE 调色板。\n\n• 变换工具\n为了提高精准度专门对变换工具重新构建，全新变换工具带来了强大的新功能。 利用对齐功能根据画布和其他图层准确调整对象。使用边界框调整功能，从任意方向缩放和伸缩。使用数字输入以 100% 精度进行变换。\n\n• 选区填色\n自动为您的选区涂色，提高工作效率。即时使用任意选区工具添加或移除和更改颜色。 \n\n• 私人图层\n为所有草图、说明和参考图像插入为在缩时视频中不见踪影的私人图层。\n\n• Scribble随手写 整合 \nScribble随手写 让您以全新的方式在作品中添加文本，甚至无需放下您的 Apple Pencil。为图层命名、更改设置、选区颜色，但是最棒的部分在于，您不需要停止绘画。\n\n• 速选菜单配置集\n为特定的创意流程（例如素描、上色或处理）定制速选菜单配置集。\n\n• 模糊画笔\n在画笔工作室中使用新模糊设置轻松混合颜色。在气笔修饰画笔组中查找混合画笔。\n\nProcreate® 5X 还包括：\n•\t重新设计拷贝并粘贴菜单\n•\t裁剪并调整大小对齐功能\n•\t文本数字输入\n•\t新文本助手\n•\tiPadOS 14 快捷启动小组件\n•\t支持 Alpha 通道的 HEVC 慢镜头\n•\t颜色配置文件改进\n•\t画笔工作室性能提升\n•\t动画呈现变换工具\n•\t新的文本选区外观\n\n我们希望 Procreate 5X 可以带给您更多乐趣。用 #ProcreateFaces 标记您的 FacePaint 自拍照和视频。我们已经迫不及待想见到您的精彩作品了！"},{"version_id":"837931842","version_name":"5.1.1","version_date":"2020-09-26 02:50:50.000 +0800","version_description":"Procreate 5X 中整合了我们重新构想的精密功能，也是创作工具领域的又一大进步。\n\n此更新包括对 iPad 第 8 代支持以及额外修复导出低阿尔法的 PSD 文件、在脸上回放缩时、在文本上变换、用湿混画笔套用 Pencil 滤镜和图层蒙版、用截屏捕获调色板等更多补丁修正。\n\n• Pencil 滤镜\n利用 Apple Pencil 作为画笔处理图像特效。首次使用时，您可以使用任意画笔在准确的位置进行调整和添加特效。涂抹您的滤镜，就像您从未见过一样创作纹理特效。您甚至可以实时擦除或调整效果。\n\n• 渐变映射\n将渐变映射到您的绘画作品或其他图像是用户呼声最大的功能之一。浏览渐变色库，或从头开始创作您自己的渐变调色板。\n\n• 全新滤镜\n使用全新故障艺术、色像差、泛光、半色调和杂色滤镜创作精彩特效，结合全新 Pencil 滤镜可以获得更棒的效果。\n\n• 浮动参考助手\n现在您可以参考图像，在创作或查看画布的同时从其他视角导览。浮动式参考助手窗口让您可以在任意模式中选取颜色。\n\n• FacePaint面容彩绘\n在脸上直接实时绘画！使用完整版 Procreate，您可以在面部添加动画和慢镜头。\n\n• 调色板捕获 & 色卡快填\n用相机或照片库中的照片捕捉您身边的多彩多姿。将色卡直接拖放到您的画布上，为您的作品填充颜色。现在您还可以导入 Adobe® ACO 和 ASE 调色板。\n\n• 变换工具\n为了提高精准度专门对变换工具重新构建，全新变换工具带来了强大的新功能。 利用对齐功能根据画布和其他图层准确调整对象。使用边界框调整功能，从任意方向缩放和伸缩。使用数字输入以 100% 精度进行变换。\n\n• 选区填色\n自动为您的选区涂色，提高工作效率。即时使用任意选区工具添加或移除和更改颜色。 \n\n• 私人图层\n为所有草图、说明和参考图像插入为在缩时视频中不见踪影的私人图层。\n\n• Scribble随手写 整合 \nScribble随手写 让您以全新的方式在作品中添加文本，甚至无需放下您的 Apple Pencil。为图层命名、更改设置、选区颜色，但是最棒的部分在于，您不需要停止绘画。\n\n• 速选菜单配置集\n为特定的创意流程（例如素描、上色或处理）定制速选菜单配置集。\n\n• 模糊画笔\n在画笔工作室中使用新模糊设置轻松混合颜色。在气笔修饰画笔组中查找混合画笔。\n\nProcreate® 5X 还包括：\n•\t重新设计拷贝并粘贴菜单\n•\t裁剪并调整大小对齐功能\n•\t文本数字输入\n•\t新文本助手\n•\tiPadOS 14 快捷启动小组件\n•\t支持 Alpha 通道的 HEVC 慢镜头\n•\t颜色配置文件改进\n•\t画笔工作室性能提升\n•\t动画呈现变换工具\n•\t新的文本选区外观\n\n我们希望 Procreate 5X 可以带给您更多乐趣。用 #ProcreateFaces 标记您的 FacePaint 自拍照和视频。我们已经迫不及待想见到您的精彩作品了！"},{"version_id":"838036201","version_name":"5.1.2","version_date":"2020-10-23 00:03:35.000 +0800","version_description":"This update includes some important fixes for Time-lapse and stability.\n\n- Fixes for Time-lapse colors, color profiles on non-HEVC compatible devices, and export compatibility \n- Recolor has been added to QuickMenu while we work on a  new home\n- Reduced lag when painting with a Reference Image\n- Holding the Transform button will pinch zoom the layer contents\n- PDF export for CMYK color profiles\n- Unable to enter Background color values with the keyboard\n- Improvements to Pencil filters and layer mask painting\n- Improvements for Arabic user interfaces\n\nThanks for your feedback on Recolor. We're listening and we love that you care."},{"version_id":"838406875","version_name":"5.1.3","version_date":"2020-11-04 00:49:53.000 +0800","version_description":"This update includes fixes for crashing on launch and iPad Air 4 compatibility.\n\n- Gallery scrolling outside of screen size on Air 4\n- Selection Color Fill will no longer use the reference layer's opacity and hidden state\n- Time-lapse stability fixes\n\nMore 5X polishes coming soon!"},{"version_id":"839215034","version_name":"5.1.4","version_date":"2020-11-18 01:35:26.000 +0800","version_description":"Just popping in with some fixes for painting with the maximum number of layers. Also some polishes including:\n\n- One-shot animation preview displays correctly\n- JPEG can have non-standard RGB profiles embedded\n\nDon't forget to share what you love making with #Procreate."},{"version_id":"839747745","version_name":"5.1.5","version_date":"2020-12-22 08:07:06.000 +0800","version_description":"New features:\n- You can now change color profiles after you have created your Canvas. \n- You can now add Layer and Pencil Filters to QuickMenu. \n- New and improved Recolor. Begin by ColorDropping and then tap Continue Filling with Recolor in the Notification bar and away you go! \n\nBug fixes:\n- Full Keyboard Access won't cause Toolbars to become unresponsive. \n- Hold Duration works again!\n- GIFs no longer change background dimensions when exported. \n- FacePaint recordings won't silently fail, and you can even record without audio now. \n- You can now dismiss your Gradient Map menu without causing the app to freeze. \n- QuickMenu won't be invoked by Apple Pencil when set to Touch only. \n- Fix for Selection Color Fill locking up after undo. \n- You can now SwatchDrop from the Floating Color Companion without rearranging your swatches. \n- Performance improvements for Transform on large canvases. \n- Transform Fit to Screen behaviour with Magnetics toggled on is fixed. \n- Air 2 Selection improvements."},{"version_id":"841224462","version_name":"5.1.6","version_date":"2021-04-29 05:16:34.000 +0800","version_description":"给大家带来个通知，我们注意到最近新安装的 Procreate 没有自带正确的默认笔刷。\n你有看到我们先前发布的 Procreate 5.2 预告吗？抢先预览即将推出的版本：https://procre.at/xin-wei-du"},{"version_id":"842106652","version_name":"5.1.7","version_date":"2021-05-12 08:44:03.000 +0800","version_description":"This update fixes some brush sets that could not be opened, and after updating with that issue, a crash opening artworks. \n\n你有看到我们先前发布的 Procreate 5.2 预告吗？抢先预览即将推出的版本：https://procre.at/xin-wei-du"},{"version_id":"842342074","version_name":"5.1.8","version_date":"2021-05-28 08:59:32.000 +0800","version_description":"本次更新带来性能改进，也给新 M1 iPad Pro 机型更多图层。"},{"version_id":"845335715","version_name":"5.2.2","version_date":"2021-11-18 09:24:01.000 +0800","version_description":"本更新让你能在使用页面辅助時增添加背景，不妨试试为你的速写本增添分行和纸张纹理。你也能轻点 3D 材质找到填充图层、清除等实用操作。为你带来的修复还有：\n- 在满是作品的图库中快速滑动时，作品缩图不会再显示损坏。\n- 你的最爱画笔不再覆盖速选菜单按钮。\n- 使用\"图层选择\"时不会显示隐藏图层。\n- 现在你能在渐变映射里轻松套用编辑。\n- \"动态画笔缩放\"关闭状态下用手指画画，笔划起始时不会出现奇怪的形状。\n- 移除进度条后，撤销和重做步骤变得更隐秘一点了。\n- 合并文本图层时不再崩溃。\n- 给 2018 12.9寸 6GB 内存的 iPad Pro 和 2018 11寸 6GB 内存的 iPad Pro 更多可用图层数。\n- 选色吸管现在会依颜色配置文件正确显示画布。\n- \"图层选择\"不会再显示那些讨人厌的组了。\n- 修复在剪辑蒙版下弯曲变形图层时出现的小故障。"},{"version_id":"9823074","version_name":"1.6.3","version_date":"2012-08-11 00:00:00.000 +0800","version_description":"• Dropbox support"}]