[{"version_id":"11772873","version_name":"1.1.1","version_date":"","version_description":""},{"version_id":"12038116","version_name":"1.2","version_date":"","version_description":""},{"version_id":"198552632","version_name":"1.9.1","version_date":"","version_description":""},{"version_id":"734963299","version_name":"3.5","version_date":"","version_description":""},{"version_id":"757162714","version_name":"4.0","version_date":"","version_description":""},{"version_id":"811496473","version_name":"4.1","version_date":"","version_description":""},{"version_id":"812826093","version_name":"4.2","version_date":"2015-07-11 19:45:27.000 +0800","version_description":"- Fixed the bug which caused audio to drop &amp; video to freeze when notification came on the iPhone,<br>- Included Shutter speed in manual controls,<br>- Improved Manual controls UI,<br>- Added support for Moondog labs Anamorphic lens,<br>- Added support for Image flip in the settings,<br>- Bug fixes for Bluetooth microphone<br>- Now there is a setting to enable/disable Bluetooth microphone (in case you wish to ignore bluetooth microphone for audio input),<br>- Other bug fixes, stability &amp; performance improvements.<br><br>If you like MoviePro, do not forget to give a 5 star rating on the AppStore. Good ratings definitely help us in serving you better with nice updates. For any issues, contact us at support@seeitwithus.com"},{"version_id":"813524016","version_name":"4.3","version_date":"2015-10-14 02:29:38.000 +0800","version_description":"- iOS 9 compatibility<br>- 4K resolution support for iPhone 6s/iPhone 6s plus<br><br>If you like MoviePro, please do not forget to leave a 5 star rating in the AppStore. Good ratings definitely help us to roll out nice updates and serve you better."},{"version_id":"813814893","version_name":"4.4","version_date":"2015-10-27 01:43:30.000 +0800","version_description":"- Bug fixes for crashes when opening Projects,<br><br>- New 400% video quality available on iPhone 6 &amp; later devices running iOS 9 or later. Now you can record 1080p video at over 120 MB/s and save to camera roll using 400% setting. On iPhone 6s/6s+, you can get upto 200 MB/s bitrate with 4K video preset by choosing 400% video quality setting. But please note that 4K video at such a high bitrate may not be compatible with Camera roll, so you would need to save such videos to computer using iTunes File Sharing.<br><br>- Video stabilization for 4K video on iPhone 6s/6s plus. By setting video stabilization to 'Standard', iPhone 6s plus users can enable Optical image stabilization for video recording. Do not use Cinematic Stabilization for 4K preset on 6s plus, else OIS will not work.<br><br>- Other bug fixes and performance improvements on iOS 9 or later.<br><br>Please Note : 4K video is only supported on iPhone 6s/6s plus.<br><br>If you like MoviePro, please do not forget to leave a 5 star rating in the AppStore. Good ratings definitely help us to roll out nice updates and serve you better. If you have any issues with the update, please send us an email at support@seeitwithus.com instead of leaving a bad rating."},{"version_id":"815168064","version_name":"5.0","version_date":"2015-12-14 23:46:51.000 +0800","version_description":"NOTE: We have removed Spy mode recording &amp; enabled shutter sound during photo capture due to certain compulsions. We will disable shutter sound in camera in next version when recording video. Thank you for listening to our compulsions. For any concerns write to us at support@seeitwithus.com. But other than that here are new exciting features in the app.<br><br>- Directly record video in Camera Roll without delays in copying files. Enable \"Save To Camera Roll\" to ON in the settings to perform this action. We saw several users going through the hassles of manually copying the videos to camera roll &amp; eventually got frustrated. Sometimes they did not have enough space to copy video to camera roll. Requires iOS 9.0 or later,<br><br>- Additional option \"Move Video to Camera Roll\" in savings option in app library. If you save recordings in App Library, you will find this feature handy to move one or many videos to camera roll in one go without delays in copying files and without any duplication. Requires iOS 9 or later,<br><br>- Fixes for Focus, Exposure, WB settings : Your manual Focus, Exposure, WB settings are not reset if you go and come back from other screens in the app. The reticle behavior is also consistent if you choose manual settings. Also the \"Lock\" button was a cause of confusion and has been renamed to AF-L, AE-L, AWB-L to denote the correct meaning. Refer to user instructions in the app for details.<br><br>- Bug fix for Dropbox upload issue on iPad,<br>- Bug fixes for video stabilization on iPhone 6s &amp; iPhone 6s plus (Auto stabilization now works on both correctly for any resolution),<br>- Bug fixes for colors and noisy videos on iPhone 6s/6s plus,<br>- Other bug fixes for iPhone 6s/6s plus,<br>- General Bug fixes and other enhancements,<br>- Improved documentation in info screens. We will keep on adding more and more info in documentation in upcoming updates.<br><br>If you like MoviePro, please do not forget to leave 5 star rating in the AppStore. Good reviews really help us to sustain app development and keep updates coming. If you have any issues with the app, contact us at support@seeitwithus.com rather than leaving a bad rating.<br><br>PS : 4K resolution is only available on iPhone 6s/6s+."},{"version_id":"815453561","version_name":"5.1","version_date":"2015-12-19 15:29:28.000 +0800","version_description":"- Shutter sound is now disabled when recording video.<br><br>If you like MoviePro, please do consider leaving a 5 star rating and a good review. Good ratings help us to sustain development efforts and bring in awesome updates. If you have any queries, contact us at support@seeitwithus.com."},{"version_id":"815970848","version_name":"5.2","version_date":"2016-01-16 16:36:20.000 +0800","version_description":"- Bug fixes,<br>- Included link to detailed demo video of the app on YouTube in info pages. Thanks to Epic Tutorials for making the excellent tutorial detailing all the features of the app and how to use them.<br><br>If you like MoviePro, please do not forget leaving a 5 star rating on the AppStore. Good reviews really help us to keep working on nice updates. If you have any questions, do write to us at support@seeitwithus.com."},{"version_id":"820376994","version_name":"6.1","version_date":"2017-01-04 16:19:30.000 +0800","version_description":"- Various Bug fixes,<br>  - Fixed Zoom on iPad and iPhone 6,<br>  - Fix for Audio not ready error in some conditions(such as after pressing sleep &amp; wake button, etc.),<br>  - Fixes for AV sync with some external microphones,<br><br>- New setting for disabling/enabling Audio monitoring. If you use connectors such as Lightening to USB or HDMI, please disable Audio Monitoring in settings to avoid garbled noise,<br><br>- A new Symmetry guides option comprising two lines is now available for composing symmetrical shots,<br><br>If you like MoviePro, please submit a 5 star rating/review in the AppStore. Ratings get reset with each version of the App update and if you have already rated it for the previous version, please spare 2 min to rate it again."},{"version_id":"821056201","version_name":"6.3","version_date":"2017-02-27 16:39:11.000 +0800","version_description":"- MoviePro Remote compatibility. Companion app 'MoviePro Remote' can be used on another iOS device to trigger recordings and control all the functions &amp; parameters with live video preview. <br><br>- Bug fix for iPad 4 zoom &amp; crash with front camera,<br><br>- Fixes for frame rate not changing despite setting it to 24 or 25,<br><br>- Resolutions &amp; Frame rates combination : We found several users confused with the combined settings, example setting 60 fps with 4K resolution and noticing that the app records at 1080p instead. The settings now advice the best supported resolution for frame rate and vice versa so there can be no confusion,<br><br>- iPhone 7 plus lens + Manual controls : We have seen several people complaining that manual controls do not work with iPhone 7 plus. That is not correct, manual controls are not supported for zoom lens only, the Telephoto &amp; Wide angle lens do support manual controls. A warning has been added for the same when using zoom lens.<br>-  Many other bug fixes and enhancements (example, SlowMo slider not responding on iPad, etc.)<br><br>If you like MoviePro, don't forget to give a 5 star rating in the AppStore. We are listening to your feedback and continually improving the app."},{"version_id":"821146767","version_name":"6.3.1","version_date":"2017-03-07 02:46:50.000 +0800","version_description":"- Bug fix for crash while rendering in mini editor,<br>- Select preset to launch from home screen via force touch (3D touch). Presets in 3D touch menu are available after app has been launched atleast once,<br>- Bug fixes for Remote (delay in preview, 240 fps preset not working, etc.),<br>- Bug fixes for iPad UI,<br>- Other bug fixes"},{"version_id":"821245355","version_name":"6.3.2","version_date":"2017-03-09 01:44:24.000 +0800","version_description":"- Bug fixes"},{"version_id":"821275276","version_name":"6.4","version_date":"2017-03-19 05:28:27.000 +0800","version_description":"* Multicam support with remote: some subtle changes have been done so as to connect multiple MoviePro cameras with remote without stopping recording on any device. Try it with latest version of Remote and let us know your feedback,<br>* Zoom slider bug fix, now it is smooth and better,<br>* Focus hunting fix for 720p preset,<br>* Other bug fixes"},{"version_id":"821422862","version_name":"6.4.1","version_date":"2017-04-16 19:29:10.000 +0800","version_description":"- Bug fixes (iPad 4th generation zoom button fixes, and other minor bug fixes)<br><br>* For any issues, contact us at support@seeitwithus.com or @movieproapp on Twitter. If you like MoviePro, please do leave a 5 star rating in the AppStore. Good ratings motivate us to keep rolling out new updates and improve the app."},{"version_id":"822455281","version_name":"6.5","version_date":"2017-06-07 20:23:04.000 +0800","version_description":"- YouTube upload bug fixes,<br>- Other minor bug fixes<br><br>If you like MoviePro, please do not forget to leave a 5 star rating in the AppStore. For any concerns, write to us at support@seeitwithus.com or follow us on Twitter at @movieproapp ."},{"version_id":"823715366","version_name":"6.6","version_date":"2017-09-20 03:05:14.000 +0800","version_description":"- Bug fix for stuck Audio meters on iOS 11,<br>- On iOS 11, presets now contain support for choosing HEVC or H264 code type in Video Encoding settings. For each preset, you can choose codec type for video recording.<br>- If you want to convert HEVC videos to H.264, simply tap the mini editor (with screw driver icon in App library) and export. All exports in mini editor are using H.264 encoder.<br><br>If you like MoviePro, please rate us 5 stars in the AppStore to support us. For any issues, contact us at support@seeitwithus.com or follow us on Twitter @movieproapp ."},{"version_id":"823934851","version_name":"6.6.1","version_date":"2017-10-09 16:03:54.000 +0800","version_description":"- Bug fix for crash when setting Shutter Speed on iPhone 8/8 plus devices,<br>- Bug fix for crash when taking photo on iOS 11,<br>- Other bug fixes for iOS 11<br><br>The remote app has also been updated to version 1.2 correspondingly. Make sure you are using most recent versions of both apps. If you like MoviePro, please submit a 5 star rating in the AppStore. Good ratings motivate us to continuously improve the app and let the updates rolling. If you have any concerns, please write to us at support@seeitwithus.com or follow us on Twitter @movieproapp."},{"version_id":"824401414","version_name":"6.6.2","version_date":"2017-11-14 19:52:43.000 +0800","version_description":"- Bug fixes for iPhone X &amp; iPhone 8/8 plus devices<br><br>PS: For people having issues with 4K preset@30 fps with video stabilization on iPhone X/8/8plus devices, please set fps to 60 OR set Reduced Feature Mode to ON (which works in lean mode like native camera app) as workarounds. This is unfortunately a bug in iOS 11 which Apple engineers are working on and we hope this will be behind us pretty soon."},{"version_id":"824918186","version_name":"6.6.5","version_date":"2017-11-27 20:12:47.000 +0800","version_description":"- Bug fixes for iPhone X/8/8+. Specifically, it fixes 4K@60 fps recording with video stabilization turned ON. <br><br>If you like MoviePro, please consider leaving a 5 star rating in the AppStore. Good ratings help us keep improving the app and keep rolling updates for free. For any concerns, write to us at support@seeitwithus.com or on Twitter @movieproapp ."},{"version_id":"825183197","version_name":"6.6.6","version_date":"2017-12-04 19:04:02.000 +0800","version_description":"- More bug fixes for iOS 11"},{"version_id":"825351448","version_name":"6.6.7","version_date":"2017-12-18 04:12:17.000 +0800","version_description":"- Bug fix for video stabilization on iPhoneX/8/8+ at 4K resolution."},{"version_id":"826528403","version_name":"6.6.8","version_date":"2018-04-03 04:46:08.000 +0800","version_description":"- Bug fix for inverted videos when using front camera and high fps,<br>- Bug fix for crash when capturing photo with 96 fps preset **,<br>- Stability fixes on iPhone X/8/8plus when using 4K preset **,<br>- Bug fixes for crash on startup on iPhone X/8/8 plus under certain conditions,<br>- Various other bug fixes.<br><br>** If you are using iOS 11, it is strongly recommended to upgrade to iOS 11.3 or later to let MoviePro function smoothly along with stability. If you notice any issues with MoviePro, please immediately notify us at support@seeitwithus.com."},{"version_id":"829158583","version_name":"6.6.9","version_date":"2018-11-02 20:56:29.000 +0800","version_description":"- Bug fixes for iOS 12.1"},{"version_id":"832337840","version_name":"1.0","version_date":"","version_description":""},{"version_id":"832796970","version_name":"1.0","version_date":"","version_description":""},{"version_id":"832871636","version_name":"2.0","version_date":"","version_description":""},{"version_id":"832958477","version_name":"2.0","version_date":"","version_description":""},{"version_id":"833076796","version_name":"2.0","version_date":"","version_description":""},{"version_id":"833198468","version_name":"1.5","version_date":"","version_description":""},{"version_id":"833220211","version_name":"1.1","version_date":"","version_description":""},{"version_id":"833331539","version_name":"1.5","version_date":"","version_description":""},{"version_id":"833419757","version_name":"1.0","version_date":"","version_description":""},{"version_id":"833444573","version_name":"1.5","version_date":"","version_description":""},{"version_id":"833546524","version_name":"1.0","version_date":"","version_description":""},{"version_id":"834016809","version_name":"2.0","version_date":"","version_description":""},{"version_id":"836913509","version_name":"1.4","version_date":"","version_description":""},{"version_id":"837221547","version_name":"2.0","version_date":"","version_description":""},{"version_id":"837288177","version_name":"1.0","version_date":"","version_description":""},{"version_id":"837314284","version_name":"1.0","version_date":"","version_description":""},{"version_id":"837351639","version_name":"1.6","version_date":"","version_description":""},{"version_id":"837916440","version_name":"1.0","version_date":"","version_description":""},{"version_id":"837928730","version_name":"1.0","version_date":"","version_description":""},{"version_id":"837945734","version_name":"1.0","version_date":"","version_description":""},{"version_id":"838061107","version_name":"1.0","version_date":"","version_description":""},{"version_id":"838097022","version_name":"1.0","version_date":"","version_description":""},{"version_id":"839452272","version_name":"1.1","version_date":"","version_description":""},{"version_id":"839541710","version_name":"1.1","version_date":"","version_description":""},{"version_id":"9607642","version_name":"1.0","version_date":"","version_description":""}]