[{"version_id":"15188431","version_name":"1.0","version_date":"","version_description":""},{"version_id":"15832963","version_name":"1.0.1","version_date":"","version_description":""},{"version_id":"15985748","version_name":"1.0.2","version_date":"","version_description":""},{"version_id":"612192676","version_name":"1.2.0","version_date":"2014-07-10 03:26:29.000 +0800","version_description":"[巨量内容更新，两大新世界来袭]\n\n疯狂戴夫带领植物小伙伴们开启全新旅程，穿越到了神奇的中国功夫世界和神秘遥远的未来世界。\n多达60个主线关卡和6种支线玩法震撼登场！\n12种全新植物等你收集，僵尸BOSS等你来战！\n\n[植物装扮]\n向日葵戴上墨镜，高坚果系上领结，弹簧豆还穿上了短裙！不仅是造型变化，喂食能量豆后的大招也将焕然一新！\n\n[植物进阶]\n魔高一尺，道高一丈！为了抗衡升级进化后的可怕僵尸，现在植物小伙伴们也获得了进阶的能力！\n只要收集一些植物碎片和金币，就能大大强化植物的攻击力和生存力，还可以获得全新的酷炫技能！\n\n[每日副本]\n三种难度，三种副本每天任你挑战，可赢取大量植物碎片和装扮碎片！\n邪恶入侵：击退僵尸博士的入侵，守卫植物家园的净土。\n巨人危机：成群结队的巨人僵尸，考验火力的时候到了。\n暴走雪人：抵御僵尸大军的同时，记得别让雪人逃走了。\n\n[潘妮宝物]\n瞧瞧潘妮给大家带来了什么，赶快打开后盖箱看看金光闪闪的花盆里有什么宝贝！\n\n[黄瓜炸弹]\n最新研究成果：黄瓜改良品种成为了戴夫家园的最后一道超级防线，当你措不及防，命悬一线的时刻，记得使用黄瓜炸弹！"},{"version_id":"701832651","version_name":"1.2.3","version_date":"2014-09-25 06:34:59.000 +0800","version_description":"[新植物胡萝卜导弹车登场]\n胡萝卜导弹车拥有强大的远程火力，喂食能量豆还能制造会爆炸的巨型胡萝卜阻挡僵僵的前进！\n从10月1日起：只要连续在游戏中签到2天就可以立即免费拥有它！\n连续签到14天，送专属装扮！\n连续签到27天，保送到2阶！\n\n[更多植物技能研制完毕]\n疯狂戴夫日以继夜的不断努力终于有了收获！现在几乎所有的植物都拥有了进阶技能，对付僵僵更轻松！\n\n[高清视觉体验]\n完美支持大屏设备Retina高清分辨率，让视觉体验更上一层楼！\n\n[国庆好礼活动]\n活动时间：10月1日-10月12日\n\n活动一：潘妮宝物每日返钻\n活动期间内，每日首次开启潘妮宝物将获得一半钻石返还。\n\n活动二：植物进阶一步到位\n为了回馈玩家，版本更新后，您可以从商城直接获得植物进阶和装扮的机会，并且您之前所收集到的任何碎片都不会浪费，会抵扣掉需要消耗的钻石哦。\n进阶等级越高，打折力度越大！这么好的事情千万要把握机会哦！"},{"version_id":"750572801","version_name":"1.3.0","version_date":"2014-11-12 02:49:01.000 +0800","version_description":"[新世界黑暗时代]\n这回戴夫时空穿梭来到了黑暗时代，植物军团的老朋友蘑菇家族将再次发力抗击僵僵入侵！\n蘑菇家族可谓人才济济，除了招牌蘑菇大小喷菇，还有会成长的阳光菇、令僵尸为己作战的魅惑菇和能吸走铁器的磁力菇！\n僵尸军团阵容毫不逊色，小丑能够反弹各种子弹、国王能够召唤强力骑士，还有千万小心会变羊的巫师！\n更可怕的是，僵尸们还学会了借助各种药剂来强化自身的能力！\n\n[中国版独有内容]\n经典迷雾玩法重现，路灯花能够驱散迷雾，还有发现潜藏的盗贼僵尸！\n大法师僵尸擅长让植物陷入沉睡，没关系咖啡豆能够及时唤醒它们！\n烈焰菇和寒冰菇可是植物军团阵中的强力法师，随着体型成长，法术也会越来越强大！\n橡木弓手箭无虚发，百步穿杨；骑兵僵尸单骑闯关，无可阻挡！\n\n[签到植物蒲公英]\n11月签到植物蒲公英萌动来袭！空投炸弹，远程打击，穿上专属装扮后还能地毯式轰炸僵僵！\n坚持每日签到不仅可以获得蒲公英，还能获得专属装扮和进阶机会。\n\n[新植物限时热卖]\n活动时间：11月13日-11月30日\n活动期间内，您可以从商城直接购买到黑暗时代新植物寒冰菇和花生射手的大礼包！进阶+装扮一步到位，并且您之前所收集到的任何碎片都不会浪费，会抵扣掉需要消耗的钻石。\n\n[界面整合更清爽]\n大地图上的用户界面已经焕然一新，整洁美观，使用方便！"},{"version_id":"810953882","version_name":"1.3.3","version_date":"2014-12-22 06:30:59.000 +0800","version_description":"[黑暗时代巨龙现身]\n僵尸博士骑乘机械魔龙现身，植物军团面临龙息的考验。带上你最强的阵容，前去阻止博士邪恶的计划吧！\n\n[新玩法百步穿僵]\n特色小游戏玩法百步穿僵，面对重出不穷的僵尸，展现你的眼力和反应，利用爆头秒杀它们！\n\n[签到植物大力花菜]\n12月签到植物大力花菜重磅登场！力大无穷，擅长摔跤，穿上专属装扮后还能把僵僵当保龄球扔！坚持每日签到不仅可以获得大力花菜，还能获得圣诞节限定专属装扮和进阶机会。\n\n[新植物限时热卖]\n活动时间：12月18日-1月4日\n活动期间内，您可以从商城直接购买烈焰菇、椰子加农炮、火龙草的限时打折礼包！进阶+装扮一步到位，并且您之前所收集到的任何碎片都不会浪费，会抵扣掉需要消耗的钻石。\n\n[版本瘦身流畅体验]\n通过技术哥哥的不断努力，无论是游戏包的下载大小，还是占用手机空间都小了很多! 游戏体验更爽更流畅！"},{"version_id":"811601054","version_name":"1.4.0","version_date":"2015-02-06 04:04:17.000 +0800","version_description":"[全新世界巨浪沙滩]\n这回戴夫时空穿梭来到了碧海金沙的阳光暖岛，植物军团将乘风破浪迎战泳装僵尸！\n\n莲叶为陆生植物提供水上作战的能力\n缠绕水草和鳄梨能够直接种植在水中\n香蕉火箭炮提供了远程定点打击火力\n导向蓟擅长追踪并摧毁最靠近的目标\n保龄泡泡的弹射伤害有效应对大场面\n大嘴花最爱吃僵尸一口一个毫不含糊\n\n[中国版本独有内容]\n莲小蓬水陆两栖，发射鱼雷有效对抗难缠的渔夫僵尸\n强酸柠檬自带酸性腐蚀，面对肉盾贝壳僵尸游刃有余\n支线小游戏贪食鳄梨惊艳登场，重现经典贪食蛇玩法\n植物四阶觉醒隆重开启，花盆保驾护航尽享尊贵属性\n\n[签到植物惊喜连连]\n2月签到送机枪石榴，3月签到送大嘴花！\n坚持每日签到还能获得专属装扮和进阶机会\n\n[欢庆春节红包拿来]\n活动时间：版本上线起至3月31日\n通过每日登陆、挑战财神和猜灯谜即可赢取大量红包\n开红包领取中国春节限定植物竹员外，带僵升天带僵飞\n无尽模式震撼开启，参与即赢钻，奖章还能兑换新植物\n三阶植物每日送每日换，充值30立即领取钻石一颗不少"},{"version_id":"812285380","version_name":"1.5.0","version_date":"2015-05-28 01:58:31.000 +0800","version_description":"[全新世界冰河世界]\n这回戴夫时空穿梭来到了冰天雪地的世界，植物军团将冒着严寒面对更强大的敌人！\n\n极地的寒风带来了新的困扰：\n寒风冻结植物，严重影响植物们的作战\n浮冰上下翻动，僵尸们的行动更加灵活\n机械猛犸操纵寒气，僵尸博士更加难缠\n\n全新的冰河植物加入了植物军团：\n热土豆瞬间融化冰层，火焰豌豆甜椒投手抵挡寒风侵袭，\n飓风甘蓝吹退僵尸，眩晕洋葱控制超群，甜菜护卫擅长击飞\n\n[中国版本独有内容]\n中国版特有新植物登场：\n旋风橡果回旋攻击，对付海象僵尸有奇效\n大王花攻击后排，穴居人僵尸无处躲藏\n\n特色内容玩法任你畅玩：\n三种全新小游戏登场，欢乐支线让你放松心情\n植物试用开放，闯关之路更加轻松\n玉米卷地图全新改版，星系展现更加直观\n\n签到植物惊喜连连：\n6月签到送幽灵辣椒，7月签到送旋转芜菁\n坚持签到即可获得二阶植物与丰厚钻石奖励！\n\n[冰河世界上线双重礼包]\n新世界礼包：版本上线起至6月19日\n商城折扣价出售冰河世界最新植物以及明星植物礼包，不要错过！\n\n端午节礼包：6月20日至6月30日\n全新植物板栗小队、限量植物竹员外与各类老牌强势植物限时出售！"},{"version_id":"812557953","version_name":"1.5.1","version_date":"2015-06-18 02:43:55.000 +0800","version_description":"[欢乐端午开心答题]\n时间：6月18日至7月5日\n春节期间广受玩家好评的答题活动再开！全新的题库全新的奖励，考验玩家们聪明才智的时候到了。坚持答题即可获得幸运粽子！粽子中可以找到丰富的奖励哦。再告诉你一个小秘密：必要的时候可以求助小豌豌哦！\n\n[消耗有礼奖励丰厚]\n活动时间：7月1日至7月15日\n每周消耗有好礼，活动期间消耗钻石达到一定数量的玩家，还可以额外获得一份奖励！让你的钻石变得更有价值！\n\n[充值即送强力植物]\n活动时间：7月1日至7月7日\n活动期间每日单笔充值30元即可获得三阶强力植物！机会难得不容错过！"},{"version_id":"813014210","version_name":"1.6.0","version_date":"2015-08-20 01:50:02.000 +0800","version_description":"【天空之城鏖战云端】\n僵尸博士在冰河世界落败后再度来袭，乘坐机械战鹰并带领空军僵尸部队横扫了戴夫家园，植物军团措不及防，损失惨重。疯狂戴夫当然不能善罢甘休，他和潘妮的最新研究成果——居然将自己的家园改造成了一艘飞行母舰！伴随着轰鸣的巨大涡轮……威猛的舰载大炮……和及时加入的飞行植物，“戴夫号”拔地而起，不畏电闪雷鸣，向着僵尸博士的空中势力，全速进发！\n\n【植物僵尸酷炫萌拽】\n为空战而生！飞碟瓜、芦笋战机、电离红掌、蚕豆突击队、灯笼草、旋转菠萝、旋涡枇杷，7种天空之城专属植物整装待发，供你调遣！闪电枪僵尸、飞弹僵尸、战斗机僵尸、双舱飞机僵尸、仲裁者-X型，多达11种天空之城专属僵尸严阵以待，追随僵王！\n\n【迷你游戏满满诚意】\n壮植凌云——派遣植物小队，翱翔天际冲破层层的僵尸防线！\n一炮当关——控制舰载主炮，尽你所能击落最多的飞行僵尸！\n\n【上线活动丰富精彩】\n自版本上线日起至9月16日，每周开放一款天空之城专属植物礼包，商城超低价出售！9月17日至9月30日期间，累计消耗一定钻石，也可以领取天空之城专属植物和装扮哦！"},{"version_id":"813339734","version_name":"1.6.1","version_date":"2015-09-28 10:08:38.000 +0800","version_description":"[八重好礼 喜迎国庆]\n\n活动时间：10月1日~10月7日\n\n活动一：穿梭时空 再战僵王\n活动内容：每日可挑战一位随机僵王，挑战成功即可获得植物装扮碎片奖励。\n\n活动二：无尽关卡 等你来战\n活动内容：自由选择阵容，挑战无尽关卡，赢取出战阵容中的植物碎片，助您快速进阶喜爱植物。\n\n活动三：植物碎片 掉落翻倍\n活动内容：植物碎片双倍掉落，植物进阶事半功倍！\n活动范围：主线植物碎片关卡、邪恶入侵、巨人危机关卡\n\n活动四：装扮碎片 掉落翻倍\n活动内容：植物装扮碎片双倍掉落，装扮收集再也不愁！\n活动范围：暴走雪人关卡\n\n活动五：成就奖励 每日必做\n活动内容：每日完成指定成就目标即可领取植物碎片、装扮碎片、挂件碎片、金币等丰厚奖励，多劳多得！\n\n活动六：3阶植物 充值就送\n活动内容：每日单笔充值30元即送3阶植物！\n\n活动七：累计消耗 花钻享礼\n活动内容：消耗钻石累计达一定数量即可领取丰厚奖励，更有机会获得国庆特别植物“捣蛋萝卜”的专属装扮。\n\n活动八：精英植物 国庆限定\n活动内容：参与抽奖赢取精选强力植物，更有机会获得国庆特别植物“捣蛋萝卜”。"},{"version_id":"813769459","version_name":"1.6.2","version_date":"2015-10-28 09:46:46.000 +0800","version_description":"《植物大战僵尸2》中文版已经两周岁啦！植物和僵尸们已经盛装打扮，成群结队出席周年庆典。生日派对现场已经热火朝天，一场好戏即将上演！ \n两周年庆典时间：10月29日~11月15日\n \n[周年感恩回馈]\n生日派对狂欢怎么能少了一路陪伴支持《植物大战僵尸２》的你们！如果您是老玩家，曾经玩过这款游戏，只要在版本更新后就能立即免费领取一份感恩回馈大礼，包括高阶植物组合和大量金币，帮助您轻松追赶游戏进度，加入戴夫的时空之旅穿越时代，从古至今乃至未来，体验游戏带给您的丰富乐趣！即便您是全新玩家，我们同样给您准备了一份植物和金币的起航礼包，伴您轻松上手！\n \n[周年分享好礼]\n生日派对让更多的亲朋好友一起加入才好玩！只要您在游戏中轻轻一点，就能将这个好消息分享到微信朋友圈让更多的好友看到！分享即额外再送虚拟奖励，参与微信的H5页面互动，更有机会赢取周年庆限量纪念周边实物奖品！\n \n[周年特别植物]\n生日派对怎么能少了动感音乐？！这不戴夫请来了著名歌手歌唱向日葵前来助兴，作为两周年庆典的特别植物，歌唱向日葵拥有时尚的外形以及酷炫的出场效果，还能感染身边的植物小伙伴共同起舞，强化战斗力！\n \n[周年活动盛宴]\n生日派对活动精彩纷呈，赶快进入游戏，查看两周年活动中心吧！"},{"version_id":"815883200","version_name":"1.7.0","version_date":"2016-01-21 10:34:57.000 +0800","version_description":"[失落之城 遗迹探险]\n戴夫为了神奇的玉米卷来到了传说中的失落之城！在这块被诅咒的大地上，各路宝藏猎人都无一幸免地成为了僵尸。\n太阳伞僵尸免疫抛射，向导僵尸会开启暗道。\n飞行员僵尸从天而降，考古僵尸远距离攻击。\n魔高一尺，道高一丈，植物军团也有了新的小伙伴！\n金蟾菇能吞僵尸产阳光，大丽菊擅长群体缓速。\n菠萝蜜可以封装暗道，红针花具备三种形态。\n\n[花园大战 一触即发]\n全新PvP功能已经开启。 现在来玩PvP，每次获胜将得到10钻奖励，一天最多获得50钻！\n更有精彩PvP每日成就活动供您挑战，稀有植物碎片等你来领！\n\n[六重好礼 喜迎新春]\n2月1日-2月15日点爆竹即可抽取春节限定植物，玩元宝大作战赢红包\n2月7日-2月22日免费猜灯谜赢红包\n2月1日-2月11日充值即能砸金蛋抽好奖\n2月12日-2月22日充值即有大返利\n2月1日-2月22日充值就有免费大礼包\n\n[植物集结 探险寻宝]\n现在不用每天去各关卡手动刷植物碎片了，直接派遣植物小队替你完成吧。\n\n[签到植物 惊喜连连]\n2月签到送棉小雪，3月签到送龙舌兰\n坚持签到即可获得二阶植物与丰厚钻石奖励！"},{"version_id":"816338295","version_name":"1.7.1","version_date":"2016-02-16 13:53:20.000 +0800","version_description":"本次更新修复了如下问题：\n\n1. 火系植物被僵尸吃掉后闪退\n2. 植物布阵点击榴莲闪退\n3. 游戏性能优化\n4. 增加岩浆番石榴和龙舌兰的音效"},{"version_id":"816686335","version_name":"1.7.2","version_date":"2016-03-31 09:52:31.000 +0800","version_description":"[Apple Watch玩法来啦]\n拥有Apple Watch的玩家可以下载手表版《植物大战僵尸2》啦，快去看看吧！\n\n\n[十倍钻石返还]\n超值福利，点击十倍返还按钮，充值1元即可获得105钻石，机不可失哟！"},{"version_id":"817034017","version_name":"1.7.3","version_date":"2016-04-25 15:57:41.000 +0800","version_description":"修复以下问题：\n\n1. 重新开启了账号转移功能\n2. 优化了版本性能和稳定性\n3. 修复了棉小雪和蒲公英随机闪退 \n4. 修复了关卡结束后随机闪退\n5. 修复了查看制作人员名单闪退"},{"version_id":"817305592","version_name":"1.7.4","version_date":"2016-05-20 18:35:03.000 +0800","version_description":"[欢乐儿童节]\n5月22日-6月3日，参加儿童节活动即可获得全新植物天使星星果，快去挑战吧！\n\n[对战新玩法]\n邪恶戴夫入侵啦，每周二、四、六它会出现在花园街区里接受挑战，打败他来获取海量资源吧！\n\n[实验室开放]\n对战实验室隆重开放，快去升级基地，扩大军备吧，还有五种全新僵尸等你解锁哟！"},{"version_id":"817583017","version_name":"1.8.0","version_date":"2016-07-06 11:47:58.000 +0800","version_description":"[十大世界 任意解锁]\n完成埃及世界，即可解锁九大世界中的任意一个！\n新世界解锁条件更轻松，只要收集一定数量的星星就可继续解锁任意一个新世界！\n\n[关卡重置 全新体验]\n所有关卡精心重置，更快的游戏节奏和更强的策略性带你体验时空之旅的无限魅力！\n\n[困难难度 丰厚奖励]\n九大进阶世界全新困难难度，通关即可获得神秘宝箱！\n\n[收集星星 兑换植物]\n全新星星兑换系统，收集星星即可兑换大量奖励，高阶植物免费换！\n\n[终极BOSS 挑战极限]\n通关世界的所有关卡，即能解锁BOSS关卡，超级BOSS宝箱等你赢取！\n\n[畅玩新版 活动多多]\n自动收集阳光！自动收集能量豆！每日免费黄炸弹！还有免费钻石可以领取！\n全新畅玩月卡上线，所有玩家都可免费享用2天！\n\n全新潘妮小店开业，金币也能获得给力植物，记得每天光顾！\n\n[界面调整 系统优化]\n世界地图和界面焕然一新，更多惊喜等你发现！\n植物色彩分级系统上线，白、绿、蓝、紫、金区分植物的强度更清晰。\n黄瓜炸弹二次确认，再也不用担心钻石误扣了！\n挑战、植物探险、金豆兑换等系统正在加紧调试中，此版本暂不开放，您的金豆数据不会受到影响。"},{"version_id":"818376027","version_name":"1.8.2","version_date":"2016-08-11 10:31:37.000 +0800","version_description":"[冰火挑战 盛夏狂欢]        \n每天参加冰火挑战挑战僵尸博士，得全新植物火柴花拳手和火焰花女王！\n“火柴花拳手”是一个打着打着就爆燃变身的拳击手，也会被其他植物点燃，火越大伤害越高，当他着火的时候还能点燃豌豆哟！\n“火焰花女王”远看是一个抛射火球的植物，可一旦僵尸靠近，她就会变成倾倒烈焰的复仇天神！\n\n[三周年庆 充值大礼]\n即日起到8月22日，充值钻石赠送加量！\n充值300钻： 原送30颗现在送60颗\n充值680钻： 原送100颗现在送200颗\n充值1280钻：原送250颗现在送500颗\n充值3280钻：原送828颗现在送1288颗\n充值6480钻：原送1988颗现在送2588颗\n\n即日起到8月22日，累计充值送橙色植物！\n累计充值满168元，送“一阶机枪豌豆”\n累计充值满298元，送“二阶机枪豌豆”\n累计充值满398元，送“三阶机枪豌豆”\n\n“机枪豌豆”是豌豆家族的最强战士，攻速快大招赞，一代经典重装回归，手快有，手慢无哟！\n\n[每日挑战 如约回归]\n期待已久的每日挑战终于回来了！\n您可以在主界面上找到挑战的入口，每天都可以从两个关卡中获得植物碎片和装扮碎片，周末还会开放所有关卡，一天合成一颗植物不是梦！\n激活月卡的小伙伴每天每关都可以多一次挑战机会哟！"},{"version_id":"818705891","version_name":"1.9.0","version_date":"2016-09-20 10:17:53.000 +0800","version_description":"[摇滚年代 全新到来]\n这一次，戴夫带着小豌豌来到了1980年代，一群引领时代潮流的僵尸正在举办一个大大大派对，他们来了！\n\n[火爆节奏 引燃全场]\n从没想过音乐对僵尸的影响如此之大，当音乐吵起来，节奏带起来，气氛燃起来的时候，僵尸们会加速前进，一些僵尸还会有出人意料的表现哦！\n\n[自带音箱 贝斯僵尸]\n死亡重金属摇滚的典范，黑暗与噪音的代言人，贝斯僵尸横空出世！他和他的两个巨型音箱将是每个植物宝宝的噩梦！\n\n[音波反击 喇叭花]\n喇叭花是少数能跟上潮流的植物之一，上场数量越多威力越大，据说喇叭花和贝斯僵尸的宿命音波对决持续了三天三夜，场面之惨烈以至于植物和僵尸们都不太敢提及。\n\n[周年庆典 挑战升级]\n即日起到10月30日，每天参加「周年挑战」挑战僵尸博士，夺取强势回归的仙人掌！雷雨交加的战场最适合电系植物的发挥，具有十万伏特属性的植物大显神威的时候到了！决定就是你了，仙人掌！\n重装回归的仙人掌可以发射穿透性的尖刺，对多个敌人造成伤害，敌人靠近的时候他会藏起来像地刺一样杀伤敌人。\n\n[植物探险回归啦]\n继每日挑战后又一神级收集碎片功能重磅回归，还等什么？快去配置队伍探险吧！\n\n[玩家对战全新升级]\n玩家对战实在火爆，近期新增的强大植物也纷纷加入战团，老植物都用腻了？快去调整阵容吧！\n\n[累充送猫 喵不可言]\n即日起到10月31日，一代萌神活动限定「猫尾草」 充值就送！猫尾草是极为少见的全屏攻击植物，种一棵守全屏，再也不怕僵尸偷袭了！据可靠消息：猫尾草拥有史无前例的隐藏技能哦！\n\n[首充大礼 奖励多多]\n首次充值任意金额就能获得价值68元大礼包，累充还有更多奖励哟！\n\n[消费钻石抽限量玩偶]\n从现在开始到10月31日，每消费100钻石就能获得一次抽取三周年限量抱枕的机会哟！数量有限，先到先得，手快有手慢无哟！\n\n[潘妮小店打折啦]\n小店全面翻新，您现在可以买到稀有植物装扮碎片啦！植物碎片全线降价，限时七折，机不可失哟！\n\n[潘妮宝物全新改版]\n现在您可以用更低廉的价格在潘妮宝物里抽奖了，同时也有性价比更高的奖池供你选择，免费也能抽大奖哦！"},{"version_id":"819511564","version_name":"1.9.1","version_date":"2016-11-16 17:33:08.000 +0800","version_description":"[冬日盛筵 暖心上演]\n11月17日到12月11日，每天参加「冬日挑战」挑战激情僵博组，夺取全新辅助植物缩小紫罗兰！ \n挑战全新的激情僵博组合，激情无限的紫色植物再适合不过了！\n\n-缩小紫罗兰-\n缩小紫罗兰可以缩小一个区域内的僵尸，让他们受到更多伤害并降低他们咬植物的伤害。缩小紫罗兰还是小鬼、海鸥僵尸和冲浪板的杀手。\n猴哥的最后一击！12月15日到1月11日，每天参加「冬日挑战」挑战激情僵博组，夺取今年的吉祥物猕猴桃！ \n\n-铁棒无敌猕猴桃-\n猕猴桃可以变出金箍棒攻击最近的僵尸，并对范围内的所有僵尸造成持续伤害。\n\n[限时宝物]\n新的一期限时宝物开放啦！\n\n-酷冷至尊冰龙草-\n大家可能对火龙草的近程高伤害记忆犹新，他的兄弟冰龙草除了高伤害之外，还能冰冻减速哦！\n11月17日到12月7日，主打明星冰龙草等着你！\n\n-清场神器爆裂葡萄-\n爆裂葡萄清楚地记得妈妈说咱们是藤本植物，可他一直不明白为什么大家总喜欢叫自己小黄瓜。\n12月8日到12月21日，强力爆裂葡萄等着你！\n\n-心想事成天使星-\n天使星星果很受欢迎，不是因为他可以妆点圣诞树，也不是因为他可以拿来许新年愿望，更不是因为他放大招的时候堪比弹幕护体，而是因为人们内心都深藏着对粉色的热爱。\n12月22日到1月8日，节日专属天使星星果闪亮登场！\n\n[充值有礼] \n累计充值达到指定额度即可获得橙色植物！\n11月17日到12月21日，活动限定「冰龙草」！\n12月22日到1月8日，节日限定「天使星星果」！\n\n[星星兑换奖励更新] \n星星兑换奖励更新啦！现在可以在左下角的星星兑换中快速领取二阶植物啦！\n获得4颗星就可以领取二阶豌豆射手\n获得5颗星就可以领取二阶向日葵\n获得8颗星就可以领取二阶坚果"},{"version_id":"819992572","version_name":"2.0.0","version_date":"2017-01-12 10:37:41.000 +0800","version_description":"[恐龙横行 步步危机]\n这一次戴夫一行来到了一亿多年前的侏罗纪，不，也许是一万年前的原始社会，还可能是现代某个与世隔绝的岛屿……\n这不重要，反正，这里有很多恐龙！还有很多原始僵尸！ \n\n[戴夫！前来拜访！]\n迅猛龙、剑龙、翼手龙、甲龙、霸王龙、雷龙，这些恐龙会在你和僵尸的战斗中乱入（实际上是你和僵尸乱入了他们的领地）。\n潘妮分析认为，这里的恐龙虽然会无意识地帮助僵尸，但并没有主动攻击植物的念头，找到和他们相处的方式也许能让恐龙成为我们的帮手。\n史前生存法则第一条：不要乱动恐龙蛋！\n\n[史前盟友热情加入]\n很多现代植物都能找到他们的原始远亲，原始向日葵可以生产大号阳光，原始豌豆射手吐出的子弹可以击退普通僵尸，土豆地雷、坚果、大王花都有他们的原始远亲，还有神秘的香水蘑菇、龙吼草和荆棘草，据说他们可以和恐龙进行一些特殊的互动。\n\n[强势插入的更新提示] \n1、挂件栏位数量增加到120个，大家可以存放更多挂件了~\n2、所有植物装扮都可以在潘妮小店买到了，快去看看吧！\n3、看到这里的都是铁粉！送你一枚礼包码：hysfwldrea\n（点击左上角头像，填完个人信息后就可以看到礼包兑换按钮了，输入兑换码即可获得神秘奖励哦！）\n\n[无尽挑战 重装上线]\n组合你的植物阵容，加入无尽挑战吧！\n无尽挑战定期开启，每期都有不同的主题，通过尽可能多的关卡赢取奖励和更高排行，在商店里兑换稀有奖励吧！\n小贴士：无尽挑战过程中每种植物可用数量有限，请尽可能多地收集植物，扩充你的后备力量吧！\n\n[五阶来了] \n现在已经有一部分植物可以进行五阶升阶啦！五阶植物除了基础属性提升之外，还会拥有一个全新的特殊技能！\n包括豌豆射手、卷心菜投手、机枪豌豆、火焰花女王、玉米加农炮、蔗师父和恐龙危机的绝大部分新植物都可以升五阶了，快去试试吧！\n升五阶需要特殊的“培养液”，只能在“无尽挑战”的商店里兑换到哦！\n\n[植物家族 全面强化] \n同一植物家族里的5颗植物，共享最多两条家族属性加成，每天都有免费刷新属性的次数哦，不要浪费~\n你可以在主界面右下角的“植物”按钮里找到“植物家族”，快去看看吧！\n\n[转基因 变废为宝] \n无用的植物碎片太多？来这里合成更高级的碎片吧，说不定会有意想不到的收获哟！"},{"version_id":"821141782","version_name":"2.0.1","version_date":"2017-03-14 10:58:01.000 +0800","version_description":"[春日活动 快乐植树]\n阳光明媚的春天是适合植树的好日子！\n我们在全新的春日活动里，为您带来快乐植树活动~从现在到4月30日，只要动动手，为大树浇水就可以获得植物碎片哦！\n\n[强力新植物来袭]\n1.世界核苹苹果迫击炮\n苹果不止一次改变了世界，这一次，它将化身威力巨大的抛射植物，改变植物大战僵尸的世界。（可升五阶！）\n2.电磁连线电流醋栗\n两棵同行或者同列的电流醋栗就能拉出一条电磁线，经过的僵尸将持续受到伤害，多种一些组成华丽丽的电网吧！（可升五阶！）\n3.移形换位逃脱树根\n逃脱树根可以和其他任意植物互换位置，还能在僵尸接近的时候变成爆炸植物，考验手速和微操的时刻到了！（可升五阶！）\n4.点尸成菇金缕梅女巫\n具有秒杀级强度的植物不多，能秒杀还是自动攻击的植物更少，能秒杀还能把死亡的僵尸变成喷菇的只有金缕梅女巫了，化敌为友，攻守逆转，想不想要？（可升五阶！）\n\n[一大波五阶植物来袭]\n大嘴花、坚果、充能柚子、龙吼草、玫瑰剑客、番石榴已经可以升级到五阶啦，快去试试他们的新能力吧！\n\n[限时礼包全面更新啦]\n现在可以在限时礼包里直接买到5阶升阶用培养液，5阶苹果迫击炮和电流醋栗碎片礼包了！\n史上力度最大的钻石折扣礼包上线！比直接充值最多优惠500%，每人每包限购一次，机不可失时不再来哦！\n\n[春节红包活动继续]\n新年红包是不是还没收过瘾？我们决定延长活动日期到4月30日，在此期间你仍可以开红包，并且在新春商人那里兑换奖励，我们也会不定期在公告中给大家发红包，千万不要错过哟！"},{"version_id":"821930978","version_name":"2.1.0","version_date":"2017-06-03 15:50:32.000 +0800","version_description":"1．6月签到植物：机枪石榴\n2．新的5阶植物：保龄球茎\n3．儿童节活动开启，连续7天登录送保龄泡泡\n4．充值有礼更新\n5．限时宝箱更新"},{"version_id":"822731882","version_name":"2.1.1","version_date":"2017-07-04 09:54:11.000 +0800","version_description":"[巨浪海滩 清凉来袭] \n7月7到7月21日，炎炎夏日，巨浪海滩活动中，数个多种难度的关卡等你来挑战！\n还有涨潮的特殊玩法，海量的变态难度的僵尸，挑战你的极限！\n植物们，进击吧！\n累积7天通关还可获得关卡奖励！\n\n[热血白瓜 隆重登场]\n头顶发髻身穿兜裆布的白瓜相扑手是一个热血青年，他每天刻苦提升自己相扑实力，因为它有一个梦想，自己相扑实力可以“称霸世界”！\n\n[又有新的五阶植物上线啦]\n-香蕉火箭炮：香蕉火箭炮可有概率产生定时香蕉导弹，对目标产生暴击！ \n-猕猴桃：拥有美猴王拔毛吹气变幻小猕猴桃的超级能力，小猕猴桃拿着金箍棒骑着筋斗云直奔目标！\n\n[超值特惠 清凉消暑]\n2017年7月6日-7月14日，享夏日特定折扣价，力度之大，超乎你想象!连续购买3次，还可固定获得3阶香蕉火箭炮。\n\n[充值有礼 拥有最新植物]\n2017.7.6- 2017.7.26 ，活动限定白瓜相扑手\n2017.7.27- 2017.8.17，活动限定香蕉火箭炮"},{"version_id":"823083489","version_name":"2.2.0","version_date":"2017-08-24 10:23:58.000 +0800","version_description":"[摩登世界 全新关卡]\n摩登世界全新的场景开放，27个全新的关卡，戴夫和潘妮带着植物们回到现在，在熟悉的庭院草坪上，击败来自其他时空的僵尸。\n \n[新僵尸军团袭来，花园里硝烟弥漫]\n9种全新的僵尸组成了新的僵尸军团，外加从其他时空穿越而来的僵尸，这次的敌人空前强大！更注重植物战士之间的排兵布阵、相互配合，用你的智慧击败他们吧！\n一代中经典的矿工僵尸又出现在了摩登世界！对付他，还是可以沿用老战法哦！\n \n[暗影家族 战无不克]\n一大波新植物正在靠近，7个全新的植物来到摩登世界，和你并肩作战。\n暗樱草、夜影龙葵、月光花、幽暮投手、暗影菇组成了新的暗影家族，拥有暗影形态下的超强能力。\n超能花菜魅惑敌人、铃儿草投手可以在僵尸身上留下印记，再多的僵尸也不怕！\n \n[随机BOSS 时空穿梭]\n1.摩登世界的3个BOSS关卡使用随机模式，进入后随机出现之前星系的BOSS。\n每次进入BOSS关卡，面对不一样的敌人，配合新植物，获得不一样的战斗体验！\n2.全新的“三消”玩法，通过滑动让多个相同的植物处在一条直线上便会消除，消除3个相同的植物可以获得阳光！消除4个相同的植物可以施放大招！\n3.时空穿梭活动开放，每个活动关卡均有3种不同的难度，每个难度下都有丰富的奖励，累计7天参加，通关后可获得新植物“夜影龙葵”！\n \n[5阶植物又添新成员]\n新植物幽暮投手、超能花菜可以升5阶哦！\n幽暮投手的“究极缠绕”，有概率发出特殊子弹，击中敌人后会在一定范围内产生种子，对触碰到种子的僵尸形成藤曼束缚其行动。\n超能花菜施展“终极魅惑”，可以魅惑超高阶僵尸，并且立即恢复休眠时间。\n \n[潘妮小店更新了，快去看看吧！]\n潘妮小店又又又更新了，新植物碎片也上架啦！快来入手你心仪已久的那个吧！\n \n[限时宝物]\n新的一期限时宝物开放了！\n \n[充值有礼]\n累计充值达到指定额度即可获得强力植物\n8月25日-9月13日，活动限定「幽暮投手」\n9月14日-10月2日，活动限定「超能花菜」"},{"version_id":"823768713","version_name":"2.2.1","version_date":"2017-09-28 08:06:53.000 +0800","version_description":"[全新植物 华丽登场]\n炙热山葵，闪亮登场！施放大招时会旋转火鞭，攻击自身周围一定范围内的僵尸。\n攻防兼备的爆炸坚果被啃食完后，会产生威力巨大的爆炸，大招会增加防御力并且保护壳也会额外产生一次爆炸！ \n\n[周年大庆 专属碎片]\n参与国庆各类活动（幸运欢乐转、每日领福利、极限竞速赛）可以获得“四周年专属碎片”。\n使用碎片可以兑换相应的植物、植物碎片、装扮、装扮碎片、挂件、挂件碎片哦！\n          \n[每日福利 幸运转盘]\n活动期间，用户每天登录即可获得相应奖励，第7天会获得紫色挂件。\n幸运欢乐转活动，用户每次抽奖可以获得植物、碎片，抽奖还会累加幸运值，一旦幸运值达到MAX，必定获得特殊植物哦！\n\n[BOSS竞速 挑战极限]\nBOSS挑战竞速大比拼，看看你到底有多快！\n活动期间，每天都可进行BOSS挑战。击败BOSS就可获得大量“四周年专属碎片”，兑换超级大礼！终极奖励会是玩家们心目中的超炫植物！\n\n[限时活动 惊喜不断]\n新的一期限时宝物开放了！\n多个活动更新！\n累计充值达到指定额度即可获得强力植物！"},{"version_id":"824228281","version_name":"2.2.2","version_date":"2017-11-17 10:54:49.000 +0800","version_description":"[全新植物，震撼来袭] \n咦咦咦？难道新伙伴的原型是颗小草吗？错！其实他是一种外形与胡萝卜很相似的植物，但是防风草颜色为白色。一对大蟹钳，不但可以对近距离的僵尸疯狂攻击，在极少血的情况下蟹钳还会土中爬出去追击僵尸！\n防风草“横行霸道”，一钳当关，万僵莫敌！\n \n[戴夫俱乐部 打折也疯狂]\n小伙伴们期待已久的戴夫俱乐部，终于开放啦！\n 戴夫迷们速速进入，植物套装超值购、幸运奖励，尽在戴夫俱乐部！\n          \n[转基因大扩容 潘妮出新品]\n千呼万唤始出来，潘妮小店和转基因商店再不更新小伙伴们都要抓狂暴走了吧~~~\n转基因商店将加入电流醋栗、逃脱树根、金梅女巫等植物碎片，还没收集到手的小伙伴建议马上更新，通过转基因商店来获得啦！\n潘妮小店里则加入了爆炸坚果这位小伙伴，性格热辣的它一言不合就要爆炸了，有兴趣的小伙伴赶紧进入潘妮小店寻找它吧！\n \n[日常更新来一波 每月优惠不停息]\n签到更新走一波~ 十一月签到内容已经上线！\n限时宝物、充值有礼停不下来，主打植物就有全新植物-防风草，尝鲜内容不容错过！更有备受小伙伴们喜爱的前十植物之一：天使星星果，还没来得及跟上潮流体验天使星星果的攻击效果的小伙伴可不要错过哦！"},{"version_id":"825204854","version_name":"2.2.3","version_date":"2017-12-20 15:56:29.000 +0800","version_description":"[全新植物 震撼上线]\n美女与野兽，冷静与疯狂，两大全新植物震撼上线！\n此次新版本给小伙伴们带来了冰系攻击植物选手-槲寄冰仙子，另外加入的一名攻防兼备植物选手-野兽猕猴桃。这个冬天给您带来美女与野兽的战斗盛宴哦！\n槲寄冰仙子的战斗力可是杠杠的，与香蕉火箭炮相比那可是不输上下的呢。通过时间蓄力，点击植物后，选中攻击区域，槲寄冰仙子就可以发射冰锥轰炸该区域，对敌方僵尸造成高额伤害。\n美女与野兽组合当然少不了野兽猕猴桃战将啦，野兽猕猴桃最大的特点就是受到了伤害就会异常愤怒继而激发体型变大，受到的伤害越高体型变更大，变大后的猕猴桃对周围僵尸造成重创。"},{"version_id":"825589821","version_name":"2.2.4","version_date":"2018-01-31 13:16:42.000 +0800","version_description":"[全新植物 燃爆新春] \n电能豌豆射手，让这个春节“电力十足”！电能豌豆发射充能的豌豆子弹，直击每一个僵尸，还会向三个最接近的僵尸发射3个超大电能豌豆，造成巨大的伤害！\n热辣嗨枣，劲爆出场，假期也要“燥”起来！充满力量的枣儿可以吸引不同行的僵尸到植物所在行，更为神奇的是，枣儿死后会产生火焰对一格范围内僵尸造成伤害！\n寒冰醋栗驾到，注意减速！这颗看上去很冷的栗子，真的可以让僵尸们“雪上加霜”哦！\n \n[节日好礼 免费体验]                        \n小僵僵们最爱的点爆竹活动开启啦！爆竹里面藏着什么惊喜呢？小伙伴们快点嗨玩起来吧！\n红包来了，千万不要手软！小僵僵们可以购买红包，就会获得各类植物、碎片、钻石、金币等奖励哦！\n更令人兴奋的是，春节期间参与各类活动，可以获得“春节专属碎片”。偷偷告诉你们，碎片可以兑换丰富奖励哦！ \n此外，小僵僵们每天可以领取一定数量的橙色植物体验卡！每张体验卡有时效限制，且是最高阶状态。赶紧去获得吧！\n         \n[最强大脑 给您助力]\n猜灯谜！元宝大作战！\n小脑瓜转起来，活动期间，小僵僵们每天可以猜5个灯谜，根据猜对的数量，可以获得不同的奖励。如果答题率达到设定的标准，还会获得特殊奖励哦！\n在元宝大作战关卡中，使用指定的植物以及“神偷僵尸”掉落的植物来迎战敌人，守护关卡内的元宝。做好您的排兵布阵吧！\n         \n[竹员外 五阶开放] \n炫酷的竹员外在爆炸后，有概率掉落旋转的烟花，掉落的烟花会旋转一段时间，对周围敌人造成伤害，旋转结束后再次爆炸，同时再次造成伤害。错过这次，再等一年！\n \n[趣味竞速大升级] \n新的“趣味竞赛”活动开启啦！这次将会有各种经典的迷你游戏玩法组合，一次开启，玩转小游戏！通关奖励拿不停！ 精彩游戏过大年，植物僵尸陪伴您!"},{"version_id":"825867042","version_name":"2.2.7","version_date":"2018-03-28 14:33:40.000 +0800","version_description":"【可爱呆萌 郁金香号手】\n全新植物震撼来袭—郁金香号手！\n郁金香号手是攻防兼备的多面手，身体颜色随战斗状态而改变，攻击时呈红色，治愈时呈黄色。 \n别看它平时含羞腼腆，一旦家园遭到入侵，对付僵尸毫不手软。郁金香号手使用音符攻击较远处的僵尸，而当僵尸靠近时，它会从攻击状态切换成治愈状态，治疗其他植物，构筑坚强防线！\n\n【春暖花开 优惠到底】\n春暖花开的季节，植物装扮特卖会开启！超低折扣拥有植物碎片+装扮碎片,还赠送超多金币与钻石！活动植物多变，给您多种选择，遇到心动的就赶紧行动吧！\n \n【首次充值 送豪礼】\n首充礼包，诚意满满！从现在开始，只要首次充值2元，就能获得至尊新手礼包！植物！植物碎片！钻石！金币！ \n好机遇难得一见!\n \n【日常更新 优惠不停】\n四月签到内容全面更新，限时宝物、充值有礼停不下来，小伙伴可不要错过哦！"},{"version_id":"825867042","version_name":"2.2.5","version_date":"2018-02-03 09:07:43.000 +0800","version_description":"修复了部分闪退问题。"},{"version_id":"826242568","version_name":"2.2.7","version_date":"2018-03-28 14:33:40.000 +0800","version_description":"【可爱呆萌 郁金香号手】\n全新植物震撼来袭—郁金香号手！\n郁金香号手是攻防兼备的多面手，身体颜色随战斗状态而改变，攻击时呈红色，治愈时呈黄色。 \n别看它平时含羞腼腆，一旦家园遭到入侵，对付僵尸毫不手软。郁金香号手使用音符攻击较远处的僵尸，而当僵尸靠近时，它会从攻击状态切换成治愈状态，治疗其他植物，构筑坚强防线！\n\n【春暖花开 优惠到底】\n春暖花开的季节，植物装扮特卖会开启！超低折扣拥有植物碎片+装扮碎片,还赠送超多金币与钻石！活动植物多变，给您多种选择，遇到心动的就赶紧行动吧！\n \n【首次充值 送豪礼】\n首充礼包，诚意满满！从现在开始，只要首次充值2元，就能获得至尊新手礼包！植物！植物碎片！钻石！金币！ \n好机遇难得一见!\n \n【日常更新 优惠不停】\n四月签到内容全面更新，限时宝物、充值有礼停不下来，小伙伴可不要错过哦！"},{"version_id":"826700047","version_name":"2.2.8","version_date":"2018-05-11 09:47:48.000 +0800","version_description":"[茄子忍者 重磅来袭] \n身穿忍者服，头顶手里剑，锐利的眼神，这就是我们新加入的小伙伴——茄子忍者。茄子忍者的手里剑，可来回对僵尸造成伤害，直到目标倒下！升阶后，不仅会有概率释放带有爆破符的手里剑，5阶茄子忍者还会释放龙卷风手里剑，将目标僵尸卷出场外！   \n茄子忍者们，快使用手里剑！\n\n[感恩有你 折扣继续]\n感恩有你，一路相随。深受小僵僵们喜爱的感恩礼包，又继续开放啦！超低折扣即可抢购钻石、金币等等，还有超多的赠送哦！\n\n[六一盛典 惊喜不断]\n六一儿童节通关盛典活动开启！活动为大家准备了7个全新的传送带关卡，金币、钻石、植物碎片、挂件碎片、装扮碎片、植物等等都藏身于关卡宝箱中，运用你的聪明才智，打败僵尸大军，就能获得梦寐以求的宝箱奖励哟！\n\n[端午佳节 剥粽子吧]\n端午节即将到来，关于粽子口味的争辩，甜咸党各执一词，那么《植物大战僵尸2》是咸党还是甜党呢？在小僵僵们的端午剥粽子活动中，只要1元就可以打开一个粽子，植物、植物碎片、金币、钻石等你拿！\n一次性打开10个粽子更划算，必得完整植物！快来一起来剥粽子吧！\n\n[日常更新 优惠不停]\n最新签到内容已经上线！限时宝物、充值有礼停不下来，小伙伴们可不要错过哦！"},{"version_id":"827495305","version_name":"2.2.9","version_date":"2018-06-14 13:37:18.000 +0800","version_description":"[植僵世界杯 隆重开场]\n植物大战僵尸2将首次加入足球元素游戏活动，让足球迷们过过世界杯的瘾，也让更多小伙伴们体验足球的魅力！在足球活动中，僵尸阵容与植物阵容将会展开激烈的搏杀，看看哪一方能突破对方的底线吧！一场时间结束后进球一方多的获胜，如平局则算植物方挑战失败哦！\n小僵僵们赶紧去驰骋绿茵场吧！\n\n[日常更新 优惠不停]\n限时宝物、充值有礼停不下来，小伙伴可不要错过哦！"},{"version_id":"828016705","version_name":"2.3.0","version_date":"2018-07-31 10:44:59.000 +0800","version_description":"[蒸汽时代 保卫环境]\n植物大战僵尸2又开新地图啦！！！从神秘的东方功夫跨越太平洋来到欧洲，从21世纪摩登时代穿梭到第一次工业革命时期的英国。城市中的下水道，每隔一段时间会有工业蒸汽喷出，形成有毒烟雾，并随时向周围扩散！烟雾不仅会遮挡住僵尸的身影，还会对种在烟雾里的植物造成持续性伤害！保卫环境，抵御僵尸来袭，你们准备好了吗？\n\n[全新植物 C位出道]\n新增7种全新植物！黄金蓓蕾、平顶菇、莲藕射手、西番莲工程师、芦藜药师、吹风荚兰，尤其是蒸汽时代C位出道的伤害力极高的植物选手-桑葚爆破手！\n桑葚爆破手来自抛投家族，与卷心菜投手本是同根生。在生活上他是一个军事迷，而且酷爱收集各种军事材料，有一天他把自己打扮成炮手的形象，在街上吓到不少植物~于是桑葚爆破手就这么横空出道啦！\n桑葚爆破手遇到僵尸时就会变身杀伤力武器，投射桑葚炸弹让僵尸灰飞烟灭。大招攻击还会投放7个手雷桑葚，对7个随机僵尸目标进行伤害！进化到5阶的桑葚爆破手将拥有更强的杀伤力！\n小僵僵们是不是已经迫不及待想要使用他了呢？此外，新世界的主力植物，都可全部5阶进化哦！\n \n[打地鼠玩法 僵尸无处躲]\n蒸汽时代地图里不仅有传统的对战模式关卡，还延续了各个世界的小游戏关卡，推出打地鼠小游戏关卡！\n打地鼠游戏规则是，当僵尸和植物接二连三地从地洞中冒出来时，小伙伴们记得要擦亮眼睛！敲中了僵尸会得到积分，如果不小心敲到植物则会扣积分哦！简单模式中花费金币即可解锁道具“翻倍锤子”，用翻倍锤子敲中的僵尸可以获得积分翻倍哦！\n\n[全新植物 尽情试用]\n新版本里还推出了限时植物体验卡活动！累计登陆天数就可以领取新蒸汽时代稀有植物，获得限时游戏体验功能。芦黎药师、桑葚爆破手、吹风荚兰，更多新植物上线，先试用再购买。这个暑期，限时体验卡让你免费抢先体验最新植物！植物试用够不够打动你的心弦？\n\n[暑期返利 酷爽一夏]\n每天累计充值一定金额，即可获得赠送的植物碎片及植物装扮碎片。每天的奖励植物都不同哦！还有稀有橙色植物碎片会随机出现。\n限时体验不过瘾，充值返利来补档，就是要你酷爽一夏哦！\n\n[日常更新 优惠不停]\n最新签到内容已经上线！限时宝物、充值有礼停不下来，小伙伴可不要错过哦！"},{"version_id":"828674327","version_name":"2.3.1","version_date":"2018-09-25 10:05:10.000 +0800","version_description":"[双枪石榴 火力全开]\n外形酷酷、武功高强、勇猛无敌、植物中著名的双枪小将——双枪石榴全新登场！\n双枪石榴利用积累多年的探险经验，一出场就拥有了强大的武力值，更是以精准的双枪跟踪弹闻名僵尸世界。想要在各个boss关卡里狂虐僵王吗？那就赶紧使用带了牛仔帽子的双枪石榴选手吧！\n双枪石榴，令僵尸们闻风丧胆！\n\n[植物芭蕉 舞动奇迹]\n优雅的热带植物——芭蕉舞蹈家小姐姐闪亮登场，她拥有强劲的火力输出，让你的战斗力倍增！\n刚从舞蹈学院学成归来的芭蕉舞蹈家，外表优雅，舞姿优美，却可以面不改色地掀起飓风将僵尸卷出场外。\n芭蕉舞蹈家的优点在于一击必中并且伤害极高，只是需要一小段休眠时间来恢复体力，毕竟掀起飓风可不是什么轻松的活计。\n当芭蕉舞蹈家的扇形扇叶挥舞起来时，僵尸们可都要小心啦！\n \n[国庆狂欢 奖励不停]\n幸运欢乐转！在活动期间，任意系统消耗100钻石，就会获得抽奖机会一次，还在等什么！\n每日登陆奖！活动期间7天登陆就能领取奖励，简直是国庆期间的超级大福利！累计7天还可以获得特殊植物！\n充值免费送！活动期间，每天首充 30元就能获得植物碎片、装扮、金币、钻石、挂件等多种奖励！\n盛大国庆狂欢节，超值福利派不停，快来加入吧！\n\n[周年竞速 专属植物]\n竞速活动哪家强？快来植物大战僵尸2 5周年！\n在周年竞速活动中，只要通关周年竞速赛,就可获得“周年水晶”！周年水晶可以去抽纪念币碎片哦！ 一定数量的纪念币可以兑换植物、金币和钻石！\n集齐5种“五周年纪念币”可以召唤最新植物-“芭蕉舞蹈家”！\n小僵僵们，赶紧行动吧！\n\n[日常更新 优惠不停]\n最新签到内容已经上线！\n限时宝物、充值有礼停不下来，小伙伴可不要错过哦！"},{"version_id":"828742685","version_name":"2.3.2","version_date":"2018-09-28 11:56:43.000 +0800","version_description":"[植物芭蕉 舞动奇迹]\n优雅的热带植物——芭蕉舞蹈家小姐姐闪亮登场，她拥有强劲的火力输出，让你的战斗力倍增！刚从舞蹈学院学成归来的芭蕉舞蹈家，外表优雅，舞姿优美，却可以面不改色地掀起飓风将僵尸卷出场外。芭蕉舞蹈家的优点在于一击必中并且伤害极高，只是需要一小段休眠时间来恢复体力，毕竟掀起飓风可不是什么轻松的活计。当芭蕉舞蹈家的扇叶挥舞起来时，僵尸们可都要小心啦！\n \n[国庆狂欢 奖励不停]\n幸运欢乐转！活动期间，每消耗100钻石，就可获得一次抽奖机会，还在等什么！\n每日登陆奖！活动期间，每天登陆游戏就能领取奖励，累计7天登陆还可以获得特殊植物！\n充值免费送！活动期间，每天首充 30元就能获得植物碎片、装扮、金币、钻石、挂件等多种奖励！\n\n[周年竞速 专属植物]\n竞速活动哪家强？快来《植物大战僵尸2》五周年！\n在周年竞速活动中，只要通关周年竞速赛，就可获得“周年水晶”！使用周年水晶可以抽纪念币碎片哦！ 一定数量的纪念币可以兑换植物、金币和钻石！\n集齐5种“五周年纪念币”可以召唤最新植物“芭蕉舞蹈家”！\n\n[超Z联赛 正式开启]\n大家期待已久的超Z联赛终于来了，在这个全新的对抗玩法中，你需要在限定的时间消灭更多的僵尸来获得分数，并且与其他玩家进行比拼。\n多级联赛？有！排行榜？有！丰厚的奖励？有！兑换商店？也有！\n在体验全新玩法的同时，更有大量的奖励拿到手软，还在等什么，快成为新的超Z选手吧！\n\n[日常更新 优惠不停]\n最新签到内容已经上线！\n限时宝物、充值有礼停不下来，小伙伴可不要错过哦！"},{"version_id":"828989190","version_name":"2.3.3","version_date":"2018-11-21 11:29:35.000 +0800","version_description":"[泡泡水仙 强势来袭]\n水仙花总是很烦恼被误认为熏人的大蒜，这一次加入植僵大战特意带上了她的泡泡机，\n可以将那些烦人的僵尸带走。泡泡攻击不仅浪漫梦幻，战斗力也随着升阶一直up up，成串的小泡泡可把敌军当韭菜一样收割，能量豆大招还会吹出超级大泡泡呢。\n“植物大军永不服输！只是一直吹泡泡腮帮子好酸啊。”\n\n[幸运转盘 在线夺宝]\n世上锦鲤千千万，说不定下一个就是你呢，幸运大转盘，快来试一试运气吧~\n买水晶，去抽奖，奖池是史无前例的丰厚，涵盖了一切你所需有的碎片与道具。只要6元，就有机会获得超值奖励哦~\n光有抽奖还不够，幸运夺宝来凑一凑。抽一次奖后幸运值+1，幸运值满时即可获得夺宝奖杯，夺宝奖杯可以去商店直接换取三阶橙色植物!三阶橙色植物！三阶橙色植物！\n\n[全新玩法 积分兑换]\n全新益智小游戏-植物成长挑战强势登场，与众不同的玩法，考验你的逻辑与思维，是走一步看一步还是未雨绸缪，千万不要太早把空格填满哟~\n前所未有的丰厚奖励更是令人心动不已，挑战结束后开启转盘，金币、钻石、植物碎片唾手可得；持续挑战所累积积分还可直接兑换各种品质的完整植物，数款植物等着你来！\n\n[全新月卡 优享特权]\n多种全新月卡正式开抢，让游戏体验酷炫到底，战斗挑战更加快人一步，满足各类玩家的多重刚需！\n酷炫达人卡：满足资深颜控玩家的爱美之心，购买即可让个人头像、无尽挑战头像及超z联赛头像拥有VIP特效加持，头像也要美美哒~\n超值精英卡：送钻石、送黄瓜、送阳光，还增加了三大挑战次数，自动收集阳光和能量豆，非常“有内涵”的一张卡，作为资深玩家的你一定需要它~\n超级特权卡：集诸多功能和优惠的全能卡，一卡在手万事不愁，既有颜值更有实力，你不心动吗？！"},{"version_id":"829613471","version_name":"2.3.4","version_date":"2018-12-19 10:45:50.000 +0800","version_description":"[双枪松果 纵横天下]\n让我们欢迎头戴牛仔帽，左右手各一把枪，热情无畏的双枪小将-双枪松果闪亮登场！在植物家族里一展风采！\n桀骜不羁的双枪松果常年闯荡在广袤的西部土地上，练就了一身不凡身手和百发百中神枪手，拥有了强大的武力值，更是以精准的双枪跟踪弹闻名植僵世界。\n想要在各个boss关卡里狂虐僵王吗？那就赶紧使用戴着牛仔帽的双枪松果选手吧！让僵尸们闻风丧胆！\n\n[柠檬猫尾 五阶进化]\n重磅消息！！！ 两大力量强盛的橙色植物5阶强势登场！\n强酸柠檬，外表可爱呆萌，一旦上了战场便化身为杀伤力极强的攻击大佬。\n从天洒下的酸液能腐蚀机械，暴雨梨花针更是不容小觑，5阶还有超高伤害的柠檬片攻击，一击必中，稳如松。\n猫尾草说我很美，我也很强悍，收藏、战斗两不误！\n电击针刺不过瘾，看看能量豆大招电击能量柱，不行？那就使出最后的杀手锏，一颗芦苇箭，千军万马都不惧。5阶技能表示有我紫色芦苇箭在，前路无阻！\n\n[双旦福利 年末狂欢]\n年末最后一波狂欢福利，登录礼、大转盘、大返利三大巨头再次聚集此次双旦活动，盛典时刻，不容错过哦~\n每天进入登录礼界面就有好礼相送，手指点一点，金币、钻石、装扮碎片就到手，累计七天还有蓝色植物火龙果相送哟~\n双旦大转盘，奖池丰厚，橙色植物猫尾草静候你的到来哟，从此脱非入欧不是梦。50钻单抽一次，400钻连抽十次，当幸运值满一百时下一次抽奖直接赠送二阶猫尾草！\n充值大返利，活动期间游戏内消费达到一定金额即可获赠相应植物碎片，赠送植物碎片每天更换，赶紧买买买起来，机不可失哟。\n\n[冰球对战 不可错过]\n北国冰封万里雪飘，又到了南方人迫不及待看雪的时候啦~\n植物大战僵尸2将首次加入冰球元素游戏活动，南方的小僵僵们快看过来，娱乐版冰球大作战：一起在冰地上与僵尸来一场激烈的对抗赛吧！\n冰球大作战中，僵尸阵容与植物阵容展开激烈的搏杀，一场时间结束后进球一方多的获胜，看看哪一方更能突破对方的底线吧！ \n冰球大作战不仅可以看到寒冰下炫彩夺目的植僵世界，还可以让更多小伙伴们体验冰球的魅力哦！\n活动入口就在双旦狂欢哦，小僵僵们赶紧来一场力量型的冰球PK吧！\n\n[日常更新 优惠不停]\n最新签到内容已经上线！\n限时宝物、充值有礼停不下来，小伙伴可不要错过哦！"},{"version_id":"829954982","version_name":"2.3.5","version_date":"2019-01-28 13:09:04.000 +0800","version_description":"[慈菇冬青 攻防兼备]\n美味的慈菇进入僵尸世界变得火爆易怒，一言不合就是炸。警爆慈菇不仅可以当枪匹马会僵尸，两个慈菇处于同一纵行时，将建立起一道警爆线，一旦僵尸跨入雷池便会被炸得粉身碎骨！\n冬青锯齿状的叶子为它储存了丰厚的血量，扎根脚下任僵尸啃食也能阻挡好一阵子，更别说它还能箭刺僵尸；叶子后头藏着便是小冬青果实，它能实时跟踪将僵尸击退，可谓攻防兼备！\n慈菇冬青获得指路------限时转盘，小僵僵们冲鸭！\n\n[经典植物 五阶进化]\n冷酷冰西瓜 冰西瓜投手贯彻着冷酷到底思想，五阶进化却透露着不知名的萌萌哒，小勺子上装着3片西瓜，对同一直线上的目标进行抛射伤害并减速哦。\n满身是刺仙人掌，五阶强化更无敌！五阶仙人掌不仅继承着电击针刺大杀器，还长出了小仙人球，遇到僵尸会造成伤害和定身效果。\n经典植物，再次进阶，你的营养液还够吗~\n\n[冬日盛筵 激情上演]\n2月1日起到2月15日，每天参加「冬日雪原」挑战激情冰封时代，累计完成七天即可夺取全新爆炸植物蓝色竹员外！\n每日选择不同难度关卡挑战成功后还可开3次宝箱，各种植物碎片手到擒来，每日挑战不限次数哦~ 此外，趣味竞赛活动还加入了各种新奇的玩法哦！\n小伙伴赶快加入吧！\n\n[辞旧迎新 好礼不停]\n爆竹声中一岁除，春风送礼入植僵~\n新春好礼，每天都有不同的玩法与您乐享佳节！小手点一点，红包开不停！\n点燃爆竹拿碎片，满十次就有天使星哦~ 更有小猪存钱罐，投资少回报大，购买即可享受超值赠送！ \n春节期间，每日单笔充值满30元就有完整植物和装扮相送哦，记得来看看有没有你喜欢的吧！\n\n[特权体验 限时开放]\n2月5日至2月12日期间，可进入到月卡界面激活超级特权卡免费体验3天，3天内享受全面月卡特权，两倍签到奖励、关卡内加速、免费2次黄瓜，关键时刻月卡救急！\n新春登录礼内签到还要送你橙色植物体验卡！每张体验卡有3天时效限制，对战僵尸阶数越高，体验卡植物阶数越高。\n此等好事，小僵僵们赶紧去获得吧！"},{"version_id":"830405485","version_name":"2.3.6","version_date":"2019-03-08 16:19:52.000 +0800","version_description":"[夜之骑士 暗影豌豆]\n暗影家族新秀：暗影豌豆横空出世，它不仅擅长远程输出，而且近战能力毫不逊色，能将僵尸拖入地底消灭。它在配合月光花进入暗影状态后，攻击力倍增的同时还能使僵尸中毒减速。\n\n[五阶阵容 再添猛将]\n憨厚的白瓜总是义无反顾顶在战线最前方来阻挡僵尸的步伐。五阶进化后，将附近僵尸震离地面的能力成为它的又一项制敌法宝！\n老牌强力植物寒冰菇一直是后排火力输出的代表之一。五阶进化后，它将如虎添翼，新招寒冰螺旋可摧枯拉朽般击溃僵尸阵线，造成成吨伤害并附带可观的减速效果。\n\n[春暖花开 快乐植树]\n一年一度的植树活动现已推出！动动手为大树浇浇水就可以轻松收获成熟果实哟！金币、钻石、高级植物碎片拿到手软！完成每日任务还可以获得额外浇水机会哦！\n\n[热门植物 拼团优惠]\n《植物大战僵尸2》首推团购季活动，超多热门植物等你来团！\n万人拼团购，价格最实惠！在活动期间抢购同种植物的玩家越多，拼团结束后您获得的折扣返还也越大！来不及解释了，快进活动页来看一看吧！"},{"version_id":"830597989","version_name":"2.3.7","version_date":"2019-03-14 12:44:27.000 +0800","version_description":"修复了无尽模式钻石跳关的弹窗错误。"},{"version_id":"831037826","version_name":"2.3.8","version_date":"2019-04-23 14:34:48.000 +0800","version_description":"[全新植物 闪亮登场]\n植物家族空降全新植物-食人花豌豆，食人花与豌豆射手完美结合，继承了两种植物的攻击技能！\n食人花豌豆可以吞食僵尸并吐出去攻击前方，堪称植物中的噬元兽！随着阶数提升，吞食效率更是大幅提高，是连续作战的一把好手。\n\n[强悍植物 再次进阶]\n三大散射植物同时进阶，快来看看吧！\n5阶蚕豆突击队-小蚕豆们攻击时有概率将普通攻击变成发射聚能激光，对僵尸伤害升级！\n橡木弓手升级5阶后发射的寒冰箭矢，不仅威力加倍，还能将僵尸冰冻，为植物阵营争取更多的时间！ \n5阶天使星更是星光熠熠！它发射的星光子弹拥有更高的攻击力，可以攻击子弹飞行路径上的所有僵尸。\n\n[无尽模式 破罐大师]\n破罐大师隆重登场，趣味规则遇上经典模式+无尽模式，任性畅玩！\n打破罐子，释放出僵尸或者植物，请抓紧时间将植物种在空闲位置来抵抗僵尸的进攻哦！考验眼力和谋略的通关小游戏等着你！\n\n[标记喜欢 定制专属]\n号外号外！植物大战僵尸2首推便捷小功能-植物收藏夹。轻轻一点，将经常使用或心头好植物标上你的“喜欢”印记，再也不用在茫茫植海中瞪大眼睛搜寻植物了！\n\n[快乐小长假 五一好活动]\n活动期间累计消耗钻石兑换蚕豆突击队碎片，蚕豆突击队更是这期新五阶植物，快来试试吧~\n团购活动再次开团，还没参加过的小伙伴快来哟，一大波橙色植物正在团购中等待您！\n挑战僵博，满足你的好胜之心，更有丰富奖励见证你的神操作！"},{"version_id":"831105534","version_name":"2.3.9","version_date":"2019-04-27 03:09:03.000 +0800","version_description":"修复了一些已知错误。"},{"version_id":"831235770","version_name":"2.3.92","version_date":"2019-05-25 10:09:27.000 +0800","version_description":"[造雪植物 冰力十足]\n全新紫色植物水晶兰造雪机，它制造出的寒冷冰风，会将僵尸变成萌萌雪人，阻挡僵尸前进的步伐。大招时，更会随机在全场范围落下大量暴风雪！\n\n[五阶突破 实力暴增]\n植物界魔术精湛、才貌双全的魔术菇，升五阶啦！它的扑克牌攻击，可释放4个扑克牌，给僵尸带来巨大伤害！强势大招，打无尽模式必备，你值得拥有！\n继冰西瓜投手后，西瓜投手也升五阶啦！西瓜投手小勺子上装着萌萌的西瓜片，对同一直线上的僵尸形成巨大的抛射伤害。在炎炎的夏日，来尝尝西瓜的滋味吧！\n\n[旅行原木 全新开放]\n旅行原木全新开放，各类任务等您开启！\n选择困难星人，快去开启您的旅行原木，每天接收任务并去完成它吧！\n更令人兴奋的是，还有特定条件的任务推出。快去获取丰厚奖励吧！\n\n[六一活动 全面开启]\n六一快乐果,幸运来光顾，三大儿童节活动全面开启！\n砸罐子玩法的六一庆典关卡，只要累计7天完成节日关卡，即可获得六一节专属植物-猫尾草！关卡中，还会出现六一儿童节特有的系列僵尸，给您带来完全不同的战斗体验！\n特殊关卡挑战、六一幸运转、六一大回馈，各种活动，总有一款适合您！\n走过路过不要错过啦！来这里像孩子一样享受快乐时光吧！\n\n[星星兑换 扩容上线]\n玩家朋友们千呼万唤的星星兑换全面扩充啦！\n只要在游戏中打通关卡获得星星，就可以兑换丰厚的奖励。星星越多，奖励越多，快来数一数你有多少星星哦！"},{"version_id":"831689770","version_name":"2.3.93","version_date":"2019-07-03 11:48:56.000 +0800","version_description":"[超强攻击 谁与争锋]\r\n继苹果迫击炮后，又一大面积杀伤武器-豌豆迫击炮震撼登场！\r\n果实炮弹不仅具有超高伤害，还可以同时抛射多颗，瞬间秒杀前方僵尸群！\r\n更有伤害更高，数量更多的装扮大招等你来探索哦！ \r\n\r\n[经典老将 焕发五阶]\r\n菜问出拳快狠准，是植僵世界初代植物中的经典选手。 \r\n此次火爆五阶横空出世，拳头攻击变大变强，还能跳起来将僵尸一拳揍晕！\r\n电击蓝莓，小小的身体大大的能量，释放闪电乌云笼罩僵尸，对十字格内目标造成致命伤害。五阶性价比之王，不容错过！\r\n\r\n[全体集合 畅快运动]\r\n放暑假啦但是锻炼不可少哦~小僵僵们快来参加暑期运动会吧！\r\n这里有一场场酣畅淋漓的足球赛！僵尸阵容与植物阵容展开激烈搏杀，看看哪一方能率先突破对方的底线！还不赶紧加入这紧张战局，体验足球的魅力！\r\n\r\n[拼团实惠 团购返场]\r\n团购活动又双叒叕开始啦~暑期大力优惠再度来袭！ \r\n当天拼团开始后，使用原价钻石购买植物，越多玩家在活动时间内购买同种植物，拼团结束后获得折扣越大，返还钻石越多！\r\n（温馨提示：活动期间，当天参加的团购活动，团购返钻时间为次日9点以后哦。）\r\n\r\n[热辣暑期 尽情欢享]\r\n暑假那么长~无聊那么大~ 那就让植僵世界暑期活动陪伴你热闹一夏吧！\r\n旅行原木新增高级植物活动，快来尽情体验植物的战斗技能，还有秘密宝箱等你来开启！\r\n告诉你一个小秘密，戴夫藏在植僵世界里的宝藏开放啦~任务多类，花样领奖，你一定要来寻宝哦！\r\n小猪存钱罐！投资少回报大，购买即可享受超值赠送。\r\n幸运大转盘！活动期间，任意系统消耗100钻石，就会获得抽奖机会一次，还在等什么！\r"},{"version_id":"832155169","version_name":"2.3.95","version_date":"2019-08-08 16:44:40.000 +0800","version_description":"[雷霆万钧 千夫莫挡]\r\n雷龙草踏着闪电登场啦！\r\n普通攻击会释放雷电球，触及僵尸后散发电弧对周围僵尸造成伤害。\r\n大招是引导一个巨型雷电球降至僵尸区域，造成大范围伤害并附带麻痹僵尸的效果。\r\n除此之外，更有装扮大招等着你来探索，一起雷霆万钧，震慑全场！\r\n\r\n[橙色植物 满级出发]\r\n食人花豌豆：橙色吃货植物再次进阶，5阶技能堪称低配版大招，吃僵攻击随机爆发！\r\n三重射手：扫射武器子弹华丽升级，4种功能型子弹组合发射，加量又加血，你值得拥有！ \r\n\r\n[破罐大师 冲冲冲鸭]\r\n盲猜规则遇上经典模式+无尽模式，惊险又刺激！\r\n随机打破罐子，释放出僵尸或者植物，请抓紧时间将植物种在空闲位置来抵抗僵尸的进攻哦。考验眼力和谋略的破罐小游戏现已开启，还有植物碎片可领取，快来接受挑战吧！\r\n\r\n[趣味小游戏 通关兑植物]\r\n趣味迷你游戏活动加入了各种新奇玩法，共有七关挑战哦！\r\n每关都有独特的世界玩法和战斗场景，通关后更有大量迷你币奖励，可进入迷你商店中兑换各类稀有植物碎片！\r\n又好玩又刺激的趣味竞速活动，小伙伴赶快加入吧！\r"},{"version_id":"832855467","version_name":"2.4.0","version_date":"2019-09-25 11:31:22.000 +0800","version_description":"[穿越时空 复兴时代]  \r\n久等了小僵僵们，时空穿梭之门已经开启，快跟上步伐来到文艺复兴时期的佛罗伦萨小镇吧！等你来重振复兴时代的辉煌！\r\n小镇上昼夜更替，雕像僵尸和原石在白日里阻挡了植物的进攻。夜晚到来后他们便开始复活，场上的僵尸数量骤增，这就很考验小僵僵们的排兵布阵功力哦！\r\n更令人兴奋的是，复兴时代还入侵了调香师僵尸！调香师主业为僵尸调香，副业毒害植物。当调香师出现后，小僵僵们需要尽早将调香师僵尸的香水瓶扼杀在摇篮中。\r\n时空穿梭之旅即将启程，以上注意事项你记住了吗？\r\n\r\n[超强橙色 Carry全场]\r\n复兴时代出现了新型僵尸，当然要有强劲植物来助攻征服世界啦~\r\n超强橙色植物-熊果臼炮，来了~来了~它来了！熊果臼炮空有一颗想做核武器的心，可发出的炮弹总是滑膛。不过滑膛的炮弹却能对一行内的每个僵尸都能造成伤害，熊果臼炮的职业生涯打开了新大门！滑膛炮弹技能get！\r\n强力医护人员-芦荟，还在苦恼如何对付毒害植物的调香师僵尸吗？不要慌，芦荟种一种，为植物来解毒吧。\r\n皮糙肉厚-冬瓜守卫，超高血量，优质肉盾，惹恼了冬瓜守卫，它会起跳震杀僵尸。\r\n\r\n[三大主题 挑战复兴]\r\n世界关卡不过瘾？来来来，看一看复兴挑战吧！\r\n三大植物主题-熊果臼炮、冬瓜、芦荟，免费体验新植物；\r\n三大难度-简单、困难、传奇，不断挑战自我巅峰！\r\n更有丰厚奖励商店，兑换挑战成功的奖励雕像，获得各种植物碎片，熊果、冬瓜、芦荟通通收入囊中！\r\n冲鸭，强力橙色植物在向你招手！\r\n\r\n[好运不停 闪耀金秋]\r\n在这美好的秋日里，让我们闪耀起来吧！\r\n进入活动“1元礼炮”，开礼炮得植物、金币、钻石！\r\n12元获得15个礼炮，记得要试试十连开哦，必得完整植物，还有各种数量植物碎片，欧气十足的你，千万不能错过此次开礼炮活动哟！\r"},{"version_id":"832977050","version_name":"2.4.1","version_date":"2019-10-01 16:47:26.000 +0800","version_description":"修复已知问题。"},{"version_id":"833261817","version_name":"2.4.2","version_date":"2019-11-05 11:52:12.000 +0800","version_description":"[十万伏特 全网最强]\r\n强劲橙色电力植物-电力绿茶\r\n电力绿茶虽然看着弱不禁风，但可不要小看它哦，小小身体大大电力!普通闪电不得劲？试试能量豆吧，全场僵尸都将难逃一劫！\r\n\r\n[矮个黄梨 克敌制胜]\r\n矮小精悍的小黄梨，虽然停止了攻击，但可以让吃了它的僵尸们变成小鬼僵尸！不仅如此，被击败后的小鬼僵尸还会释放出毒气让身后的僵尸中毒麻痹哦~\r\n\r\n[五阶家族 灵魂选手]\r\n威风凛凛雷龙草：“我变强了，变得更强了！”五阶雷龙草将使出雷龙幻影绝招，令僵尸们闻风丧胆！\r\n炸弹天才蒲公英：“论释放炸弹，谁都比不上我！”蒲公英擅长炸弹攻击，五阶的它会放出更大的青色炸弹，对僵尸造成更高伤害，大概率一击致命！\r\n\r\n[超多装扮 百变形象]\r\n大事件大事件，多装扮系统真的来啦~\r\n一个装扮已集齐，再来试试第二个装扮吧。全新形象，加成属性，新装扮让你的植物焕发新机，攻势更强。还可任意穿戴脱下哦~\r\n新装扮从哪里get呢，悄悄告诉你，快去看看团购、戴夫的宝藏以及充值大返利吧，会有意想不到的收获哟~\r\n\r\n[购物季 买买买]\r\n最新省钱套餐马上出发，现有各种精品活动开放哦~\r\n双十一，团购活动再次开团，还没参加过的小伙伴快来哟，一大波橙色植物还有最新植物新装扮都在团购中等待你的pick啊！\r\n充值大返利，每天单笔充值 30元即可获得奖励，植物碎片，新装扮碎片，即买即送哟~\r\n消耗兑换，活动期间累计消耗钻石兑换水仙花、电击蓝莓和槲寄冰仙子40碎片，超值兑换千万不要忘了呀！\r"},{"version_id":"833684549","version_name":"2.4.3","version_date":"2019-11-22 09:31:29.000 +0800","version_description":"修复已知问题。"},{"version_id":"833864689","version_name":"2.4.4","version_date":"2019-12-13 15:20:24.000 +0800","version_description":"[复兴世界 全新关卡]\r\n说好的给你全世界，我们不是开玩笑~\r\n复兴世界完整战线全面开放，14关-24关倾情放送，小僵僵们快来刷关勇争通关小能手吧！\r\n有机遇就会有危险，新敌人-芭蕾舞僵尸与飞行器僵尸现已加入复兴僵尸大军，快来迎接挑战吧！\r\n\r\n[石榴+橄榄 决战复兴]\r\n最珠光宝气的植物—宝石商石榴带着整袋的红宝石来到了复兴时代！它以宝石作为子弹，抗击僵尸，随着植物阶数的提升，弹射技能也被开启，可同时伤害多名僵尸！\r\n强力辅助植物-油橄榄，作为克制芭蕾舞僵尸的绝佳植物，千万记得带着油橄榄上场哦！\r\n\r\n[僵尸迷阵 眼力大考验] \r\n爱的魔力转圈圈，复兴世界小游戏开始啦~\r\n第16天-僵尸迷阵，在充满魔力转转转的雕像群里，藏着真正的僵尸，想要准确识别出雕像背后的僵尸，绝对是一次眼力大考验，小僵僵们可要睁大眼睛不要被迷惑了呀~\r\n\r\n[冬日暖阳 冰球大作战]\r\n天气这么冷，小僵僵们决定出门运动运动~\r\n冰球场上八支植物精英队伍等待选择！小僵僵们可选定心仪的队伍，成功踢赢七场比赛即可获得各样奖励与奖牌，累计的奖牌可进入奖牌商店兑换各样植物碎片哦。\r\n小提示：一旦在对战中退出比赛，之前的战绩视为作废，所以小僵僵们要持之以恒呀！\r\n\r\n[复兴挑战 再次开放]\r\n随着复兴世界的全面开放，这次复兴挑战加入了新植物宝石商石榴与油橄榄。免费试玩新植物，三种难度任意选择，更有丰厚奖励！\r\n\r\n[更多装扮 尽情佩戴]\r\n更多植物新装扮上线啦~确定不来看看吗~\r\n土豆地雷、星星果、甜菜护卫、红针花，传统老将也要佩戴新装，增添强力属性；\r\n野兽猕猴桃、铃儿草投手、幽暮投手，植物家族新生代再戴新装扮，还有更多植物加入新装扮队伍哦，快去看看吧！\r"},{"version_id":"834047294","version_name":"2.4.5","version_date":"2019-12-18 10:45:09.000 +0800","version_description":"修复已知问题。"},{"version_id":"834193464","version_name":"2.4.6","version_date":"2020-01-13 14:51:18.000 +0800","version_description":"[双橙植物 燃爆新春] \r\n又甜又酷，爆炸草莓嗨翻全场！\r\n爆炸草莓的宣言是“我爱敌人就和爱炸弹一样，因为他们都快要爆炸啦！”点击草莓就可发射炸弹，能量豆大招会给全屏僵尸带来重击！草莓阶数越高，秒杀全场越easy！\r\n英姿飒爽，白鹭花战机准备起飞！\r\n注意注意，这里是白鹭花战机！近程可进行机枪扫射，远程还能装载导弹攻击！白鹭花战机，使命必达！随着阶数的提升，白鹭花战机还可进行飞行联机哦！\r\n\r\n[一代神器 升阶上场]\r\n“It's party time!”音乐大师五阶喇叭花闪亮登场，它的“节奏音浪”可发出超强音波攻击，一往无前！\r\n攻防兼备，守护骑士再次升阶！五阶冬青骑士抛出的小冬青体型增大、荆棘变长、血量增厚，组成铜墙壁垒！更重要的是，它的攻击力也将随之增加，精准打击敌人！\r\n\r\n[春节限定 超萌新装扮]\r\n爆竹声声辞旧岁,限定装扮迎新春。菜问、龙舌兰、卷心菜投手、原始豌豆射手喜提第一批新春限定装扮，快来累计签到获得新春装扮吧~\r\n还有更多常规新装扮同时上线哦~\r\n\r\n[经典大富翁 共庆新禧]\r\n参与文艺大剧院，体验经典大富翁玩法！幸运转转转，消耗电力豆来获得前进步数，前进过程中，还会有宝箱代币掉落！获得的代币还可在商店里兑换植物、装扮碎片哦~\r\n大富翁的世界，等你来探索！\r\n\r\n[节日巨献 福袋来袭]\r\n新春福袋来袭，玩的就是一个刺激！\r\n从四排橙色植物中选定四颗心仪植物，再从两排紫色植物中选中两颗！-变！变！变！必得一颗橙色植物和一颗紫色植物！\r\nOh，my god！还在犹豫什么，福袋买买买起来！\r\n\r\n[新春有礼 活动不停]\r\n全年时限最长，内容最多的活动合集来了~春节在家有些无聊 ，打开“恭贺新禧”，总有一款活动打动你哦！\r\n开红包燃爆竹，奖池丰厚几率大，不试试你都不知道自己有多幸运！\r\n新的一年里也要努力攒钱呀，购买子鼠存钱罐，畅享6.6倍钻石返利！\r\n每日登陆进入累计签到，获取新春限定新装扮，千万不要忘了哟~\r"},{"version_id":"834342307","version_name":"2.4.7","version_date":"2020-01-15 10:31:44.000 +0800","version_description":"修复已知问题。"},{"version_id":"834836386","version_name":"2.4.8","version_date":"2020-02-27 14:59:29.000 +0800","version_description":"[用毒高手 毒液豌豆]\n毒液豌豆也有青葱时代，直到毒液侵蚀了它的根部，让它失去控制变得疯狂且充满毒液\n毒液豌豆能够发射带毒豌豆，使僵尸中毒掉血且变得动作迟缓。它的大招更加强劲，扔出巨大毒球向前滚动，不仅对途径僵尸造成大量伤害，而且会留下一条毒道，对触碰到的僵尸造成持续中毒！\n如此给力的“用毒高手”毒液豌豆，你值得拥有！\n\n[双紫五阶 助力植僵]\n火力全开-烈焰菇：五阶烈焰菇的岩浆火焰球从天而降击败僵尸，并在地上留下岩浆可对途径僵尸造成伤害，配合家族天赋使用更佳哦！\n追光留影-暗影豌豆：种上一颗月光花，暗影状态下的五阶暗影豌豆有几率将前方僵尸吸入黑洞中！关于黑洞吸入僵尸还有更多小窍门，快到游戏中瞅瞅吧~\n\n[今日最佳 转基因更新]\n多余的装扮碎片有着落啦~打开转基因，进行装扮碎片融合，就可以获得未拥有或未集满的装扮碎片哦，一定要记得去看看哟！\n\n[快乐植树 邀你来玩]\n冬去春来，快乐植树再次与你相遇！\n只要动动手，为大树浇浇水就可以摘获成熟果实哟！金币、各类植物碎片随机爆出，橙色植物火焰花碎片、电能豌豆碎片等你来拿！\n完成每日任务还可以获得额外浇水机会哦，勤劳的小僵僵们快来玩呀~\n\n[更多挑战 春日活动]\n想要更多战斗快感，挑战僵博、初春挑战正在开放中！\n初春挑战加入了新植物毒液豌豆作为战斗主题，免费试玩新植物，三种难度任意选择，更有丰厚奖励！\n挑战僵博，各大boss出战满足你的好胜心，更有丰富奖励见证你的神操作！"},{"version_id":"835085361","version_name":"2.4.81","version_date":"2020-03-14 13:01:19.000 +0800","version_description":"修复已知问题。"},{"version_id":"835434473","version_name":"2.4.83","version_date":"2020-04-15 14:29:43.000 +0800","version_description":"[羽团高手 低血秒杀]\n每遇到一棵新植物，杜英都会问他们：\"生命在于运动，要和我对打羽毛球吗？\" \n杜英不仅长的像羽毛球，更是擅长以羽毛球为武器攻击僵尸哦~对于低血僵尸可以直接秒杀，还可以发射出旋风羽毛球，这将给僵尸带来巨大伤害。\n快来拥有属于你的“植僵羽毛球一哥”与僵尸对战吧！\n\n[魔音椰子 超能来袭]\n暴力摇滚-魔音甜菜：五阶甜菜犹如植僵DJ,闪耀在舞台中央，带上耳机的它放出超强烈音波造成僵尸的持续掉血，还可以震掉僵尸防具哦~\n能力觉醒-椰子加农炮：种下一颗椰子，你将获得超多椰肉，椰肉的来源？这可能有些一言难尽了，具体您还是问下被椰弹击中的小僵僵吧~\n\n[快速定位 植物筛选]\n植物太多？总为找不到植物头秃？最新版本解决了你这个苦恼，在植物进阶与植物装饰里，通过标签寻找心仪植物所在~\n\n[穿越时空 许下心愿]\n时空秘宝，潘妮穿越各大时空终于来到了植僵世界，小僵僵们许下心愿植物，消耗钻石打开秘宝就能实现心愿啦~ 橙色植物，装扮碎片，还有挂件尽在秘宝中！限时免费开放活动，快来体验吧！\n\n[全新五一 惊喜多多]\n欢乐砸罐子，完成任务即可获得砸罐锤，砸开金蛋随机获得奖励，快来测测你的手气吧！\n破罐大师，幸运转盘，消耗兑换再次上线，未尽兴的小僵僵们快来玩吧~\n\n[植物新衣 换上装扮]\n孢子菇、椰子加农炮、火龙草、大蒜、钢地刺\n想知道植物与他的新装扮会撞出怎样的火花嘛？快来看看吧！"},{"version_id":"835629150","version_name":"2.4.84","version_date":"2020-05-22 14:17:45.000 +0800","version_description":"[极速飞镖  万箭齐发]\r\n谨慎的危险感知者 -飞镖洋蓟隆重登场！\r\n与生俱来的感知能力，让飞镖洋蓟随时保持战斗形态，面对僵尸无时无刻都在发射飞镖！更会优先攻击场上危险僵尸，高效，敏锐成为飞镖洋蓟的代名词！\r\n小僵僵们，快带上它一起征战植僵世界吧！\r\n\r\n[五阶进化 潜力激发]\r\n紫色怒火 - 火龙果：五阶究极进化后，火龙果爆发了更强烈的愤怒，紫色怒火大幅增加攻击伤害，请不要低估它的厉害哦！\r\n巨力裹挟 - 甜菜护卫：五阶甜菜护卫已激发巨力天赋，成为更忠诚的一线守护者，击飞僵尸并给范围内僵尸完成晕眩！\r\n\r\n[欢庆六一 奖励不停]\r\n千僵过尽，童心未泯，努力战斗的你也要有个快乐六一哦～\r\n此次儿童节为大家准备了童趣十足的活动套餐哦：六一签到、儿童节糖果罐、六一挑战、儿童节奖池，四大活动将全面开放！\r\n小僵僵们快来瞧瞧，一起共享快乐时光吧～\r\n\r\n[玩家回归 专属福利]\r\n戴夫表示很怀念曾经一起并肩作战的时光呢，特为长期未登陆的小僵僵们准备了各类回归大礼！更有诚意满满的专属活动！\r\n期望因种种原因而离开游戏的小僵僵们可以抽空回来看看戴夫哦～\r"},{"version_id":"836091829","version_name":"2.4.84","version_date":"2020-05-22 14:17:45.000 +0800","version_description":"[极速飞镖  万箭齐发]\r\n谨慎的危险感知者 -飞镖洋蓟隆重登场！\r\n与生俱来的感知能力，让飞镖洋蓟随时保持战斗形态，面对僵尸无时无刻都在发射飞镖！更会优先攻击场上危险僵尸，高效，敏锐成为飞镖洋蓟的代名词！\r\n小僵僵们，快带上它一起征战植僵世界吧！\r\n\r\n[五阶进化 潜力激发]\r\n紫色怒火 - 火龙果：五阶究极进化后，火龙果爆发了更强烈的愤怒，紫色怒火大幅增加攻击伤害，请不要低估它的厉害哦！\r\n巨力裹挟 - 甜菜护卫：五阶甜菜护卫已激发巨力天赋，成为更忠诚的一线守护者，击飞僵尸并给范围内僵尸完成晕眩！\r\n\r\n[欢庆六一 奖励不停]\r\n千僵过尽，童心未泯，努力战斗的你也要有个快乐六一哦～\r\n此次儿童节为大家准备了童趣十足的活动套餐哦：六一签到、儿童节糖果罐、六一挑战、儿童节奖池，四大活动将全面开放！\r\n小僵僵们快来瞧瞧，一起共享快乐时光吧～\r\n\r\n[玩家回归 专属福利]\r\n戴夫表示很怀念曾经一起并肩作战的时光呢，特为长期未登陆的小僵僵们准备了各类回归大礼！更有诚意满满的专属活动！\r\n期望因种种原因而离开游戏的小僵僵们可以抽空回来看看戴夫哦～\r"},{"version_id":"836108575","version_name":"2.4.85","version_date":"2020-06-10 15:53:24.000 +0800","version_description":"修复已知问题。"},{"version_id":"836609981","version_name":"2.5.0","version_date":"2020-07-14 15:08:58.000 +0800","version_description":"[时空混战 持续追击]\r\n警报，警报！接收到救援信号，快随潘妮一起，拯救戴夫！\r\n全新玩法潘妮的追击正式开启，每周都有不一样的关卡开启，在时空乱流中迎接各个世界的僵尸吧！培养增益以应对变幻的策略主题和难度，挑战并击败博士的机甲，将获得丰厚的奖励！\r\n你不是一个人在战斗！在这个全新的对抗玩法中，你需要尽可能在各个关卡中获得尽可能高的分数，加入小组赛的角逐。\r\n罗马僵尸入侵！十余种全新僵尸已经加入游戏，等你来挑战！\r\n \r\n[荸荠秋葵 双橙出击]\r\n外表蠢萌的荸荠兄弟俩实力不容忽视，他们是资深的冰壶健将，能攻能守。大招合体后更加势不可挡，感受下重量级选手的威力吧！\r\n尖刺秋葵的击剑水平一流，快速出剑造成毒伤和减速。大招更能释放多个穿透子弹，助你快速解决僵尸！\r\n \r\n[五阶进化 再添大将]\r\n愤怒中队-板栗小队，小板栗们具有了更高的攻击性，人多力量大！\r\n爆炸拳-火柴花拳手，火柴花的出拳有几率触发爆炸，对一整格的僵尸造成群体伤害！\r\n \r\n[超级挂件 强化培养]\r\n你没听错，超级挂件来了！\r\n八种超级挂件已经加入游戏，一个挂件携带多个属性，好看、好强又好玩！\r\n挂件强化系统上线，使用时空粉尘和时空水晶强化背包中的超级挂件吧！\r\n \r\n[丰富活动 惊喜不断]\r\n这个暑假，除了惊险刺激的追击大赛，更有超多的暑期活动陪伴！\r\n体验新模式的不同内容，解锁各个档位的奖励，你的追击旅途需要助推吗？快试试潘妮追击指南吧！\r\n暑期神秘商店开张啦！想要稀有植物？缺点紫金币？进阶书不够？这里都有！\r\n更有存钱罐、破罐大师，欢乐砸罐子等丰富内容带来全新惊喜！\r"},{"version_id":"836892975","version_name":"2.5.1","version_date":"2020-07-21 10:54:19.000 +0800","version_description":"修复了潘妮的追击指南贴图异常问题。\n修复了植物进阶页面闪退问题。\n修复了部分设备无法绑定存档问题。"},{"version_id":"837233211","version_name":"2.5.2","version_date":"2020-08-25 16:27:15.000 +0800","version_description":"[终极番茄 秘密武器]\r\n终极番茄拥有光之粒子的神秘加持，练就了一双激光电眼，聚能后可以发射高伤害的射线，对抗僵尸。叠加种植后番茄的形态升级，将会拥有超高的攻防能力，五阶后充盈的能量更能溅射到附近的僵尸。注意！随着场上番茄的增多，消耗的阳光将会越来越高。\r\n \r\n[五阶进化 无限潜力]\r\n暗影爆破-暗樱草，暗樱草将僵尸拖入黑洞后，会在原地释放爆炸，造成范围伤害！\r\n热辣余温-热辣海枣，热辣海枣爆燃后会在地面上留下火屑，短时间内造成持续灼烧！ \r\n\r\n[植物装扮 新衣来袭]\r\n复活萝卜、火爆辣椒、能量花、飓风甘蓝、三叶草已经开启首款植物装扮，同时也对这五款植物开放了挂件佩戴能力，快去试试吧！\r\n \r\n[神秘水晶 兑换好礼]\r\n戴夫在时空旅行中发现了神秘水晶，可以兑换获得丰富的奖励！\r\n通过各个世界的关卡、进行植物探险都能获得神秘水晶，也可以在神秘水晶商店直接购买。大量实用植物已经上架水晶商店，积攒水晶，获取你心仪的植物伙伴吧！\r\n\r\n[首充焕新 超值回馈]\r\n首充礼包功能调整，参与首充活动可以获得极品植物三选一奖励，持续参与更能获得超值回馈！\r"},{"version_id":"837695274","version_name":"2.5.3","version_date":"2020-09-22 10:11:45.000 +0800","version_description":"[音乐鼓舞 铜钱草鼓手]\n灯光！奏乐！鼓声！舞台的幕布已经拉开，七周年庆典专属植物铜钱草鼓手登场啦！铜钱草鼓手可以击鼓发出音波，美妙的乐音不仅会对附近的植物造成激励效果，带来攻击力和攻速的全方面加持，还能吸引僵尸驻足，造成减速效果。如果周围有音乐植物的伙伴们，它们的合奏将会更加精彩，敬请期待他的精彩表现吧！ \n \n[周年寻宝 赢取宝藏]\n戴夫在失落之城发现了一处神秘遗迹，快去跟随他一起寻宝吧！ 花费一些钻石即可砸开罐子找到里面的宝物，达成三点一线就能获得路线尽头的额外奖励，如果清空了场上所有的罐子，将会解锁丰厚的终极奖励，快去试试吧！\n\n[极限竞速 挑战僵博]\n僵尸博士回来了！僵博竞速赛再启，在三轮挑战中前往不同的时空，击败博士的机甲将会掉落周年水晶，可在限时转盘中抽取海量奖励，七周年庆典专属植物铜钱草鼓手也在其中哦！\n \n[福袋扭蛋 好礼不断]\n周年福袋开启！打开福袋，从四排橙色植物中选定四颗心仪植物，再从两排紫色植物中选中两颗，必得一颗橙色植物和一颗紫色植物！\n周年扭蛋限时售卖，在扭蛋中发现你心仪的植物吧！\n\n[潘妮秘宝 寻找惊喜]\n潘妮秘宝重磅回归！秘宝提供了丰富的心愿植物供大家选择，花费钻石或秘宝券进行抽奖，有机会获得心愿植物和3万钻石大奖，看看你的手气如何吧？秘宝券可在周年寻宝、首充奖励等多个活动中获得哦~\n\n[潘妮追击 新赛季开赛]\n潘妮的追击持续进行中，经历了“罗马入侵”赛季的酣战，大家获得了丰厚的奖赏。第二赛季“失落之城”紧跟其后，全新的关卡和大量僵尸来袭，速速跟随潘妮一起和僵尸们大战三百回合吧！人气植物尖刺秋葵在第二赛季保留，在传奇段位等待着你将其收入麾下！"},{"version_id":"838241103","version_name":"2.5.4","version_date":"2020-10-27 16:42:06.000 +0800","version_description":"[黑夜掌控者 暗影荚兰]\n第一届植物设计大赛圆满落幕，首个来自玩家创意的植物登场啦！暗影荚兰和月光花是天生的好搭档，通过累计攻击给叶片充能，吹出强大的暗影雾气，使僵尸受到易伤效果，承受更多的伤害。准备好让这位新伙伴一展身手了吗？\n \n[全新五阶 加入战斗]\n水晶兰-冰冻残留，雪人融化后，僵尸还将会减速一段时间！\n野兽猕猴桃-兽王怒吼，当野兽猕猴桃变为最大体型时，有概率击退中小体型僵尸！\n\n[心愿团购 购物狂欢]\n团购活动新玩法来袭，想要哪个植物，你来决定！在团购活动开启前将会举办限时投票活动，角逐大家都最期待的心仪植物，让它出现在双十一团购的主会场中。参与投票更能获得折扣券、潘妮的秘宝抽奖券、植物碎片等稀有奖品哦~\n\n[月卡焕新 限时特惠]\n潘妮时空车进行了大改造，带来了更多超棒的月卡新特权！免费改名机会、彩色游戏名、免费神秘水晶、免费电池……超多新特权等你来体验！\n双十一月卡特惠限时开启，不仅可以免费领取一天超级月卡，更能以超优惠的价格获取月卡时长，心动不如行动，感受超级月卡的大满足吧！\n\n[植物新装 挂件扩容]\n火龙草、全息坚果、玉米投手、回旋镖射手、旋转芜菁迎来了新的装扮，好看又好用！\n挂件仓库不够用？戴夫已经将挂件数量上限调整为200，新挂件囤起来！"},{"version_id":"839291390","version_name":"2.5.6","version_date":"2020-12-10 15:49:28.000 +0800","version_description":"植物僵尸新玩法\n[武林高手 凤梨链刃]\n凤梨链刃身手不凡，手持着一副威力强大的链刃，甩手一挥便能横扫一片。在僵尸接近时，凤梨链刃会展开自己的武器，对前方的敌人造成多段伤害，对方的体型越大，受到的伤害也将越高，多次连击后更能发动链刃直刺，将僵尸抬起下砸，震慑力十足！准备好迎接这位武林高手了吗？\n \n[植物僵尸 经典回归]\n回忆感满满的植物僵尸模式回！来！了！机枪豌豆僵尸、寒冰豌豆僵尸、火爆辣椒僵尸和爆炸坚果僵尸现已加入潘妮的追击豪华时空套餐，不仅有来自一代的老面孔，也有全新的角色带来截然不同的挑战。同时，复兴时代、蒸汽时代和功夫世界的僵尸们也已经在追击乱流中严阵以待，在整整两周的全新关卡中会一会他们！\n\n[元旦寻宝 开启好礼]\n千呼万唤始出来，寻宝活动限时回归，这个元旦很有料！搜寻宝藏，砸开罐子找到里面的宝物，达成三点一线就能获得路线尽头的额外奖励，清空了场上所有的罐子更能解锁丰厚的终极奖励！准备好在失落的遗迹中试一试自己的好运气了吗？\n\n[全新五阶 加入战斗]\n寒冰醋栗-极寒冻气，掌握冰雪的魔法，冰冻格子将会具备严冬的威力，造成更高的伤害！\n缩小紫罗兰-跳出式惊吓，来自恐怖片的惯用手段对僵尸们一样适用，僵尸们会被紫罗兰的恶作剧吓晕，并延长僵直的时间！\n还有五款植物的的新衣已上线，快去装扮中找到它们！\n\n[无尽礼包 隆重焕新]\n无尽闯关大礼包震撼上线，参与每周四开赛的无尽模式，迎接僵尸们的“洗礼”吧！多款实用植物现已上架无尽礼包，只要成功通关指定层数，即可获得超值的折扣价格。强力的新伙伴将助你无惧僵尸来袭，向着无尽榜首冲刺！"},{"version_id":"839699427","version_name":"2.5.7","version_date":"","version_description":""},{"version_id":"840106296","version_name":"2.6.0","version_date":"2021-01-25 11:48:37.000 +0800","version_description":"[平安时代 重磅开启]\n潘妮时空车再度启程，全新和风地图平安时代与大家正式见面啦！\n    此次时空车降落到了平安时代，一股大风携带着僵尸大军赶来了。有戴着月代头假发的武士僵尸、有手捧烟花筒的花火僵尸、有来无影去无踪的忍者小鬼僵尸、还有手握鲔鱼寿司的寿司师傅僵尸……他们在将军巨人僵尸的指挥下，迈着诡异的步伐，漫步走向戴夫的据点，势在夺脑！\n情况紧急！在潘妮的建议下，戴夫利用起了神社中的赛钱箱，将其改造成为强力的增幅武器，联合起植物勇士们，与僵尸们开展起新一轮的战斗！准备好在新世界中一展身手了吗？\n \n[植物出击 拯救时空]\n厨师杓兰热爱烹饪，而今他的臭味汤汁可以让僵尸们绕道而行，避而远之；潜行开口箭的是个忍界高手，喜欢从地下突然出现展开偷袭；千金藤的飞盾和格挡不容小觑，碎裂的盾片可以散射到附近的敌人；石斛防风网根须强大，能够阻挡强风的摧残，为阵容带来更强的防御；滴水冰莲不能容忍一丁点火苗，巧妙破解花火僵尸的诡计。\n新植物们各个神通广大，快去和他们一起联手打败僵尸吧！\n\n[除夕时节 舞狮来袭]\n年关将至，鞭炮声声。舞狮僵尸携带着丰厚的奖励来到了游戏中！舞狮来袭活动开启，参与任务即可获得爆竹，投向舞狮僵尸获得稀有植物碎片、神秘水晶等奖励，成功击败舞狮僵尸更有机会获得全新植物厨师杓兰，快和戴夫一起打倒舞狮，喜迎辛丑年的到来吧！\n\n[新春新装 喜迎新年]\n\t豌豆射手、大嘴花、猕猴桃、菜问穿上了春节新装扮，不仅喜气洋洋，而且非常能打！\n在浓厚的新春气息中，海量春节活动已经开启，新春福袋、小猪存钱罐、文艺大剧院、新春签到、僵博挑战……植物和僵尸们将会陪伴大家一起闹新年，祝大家春节快乐！"},{"version_id":"840329092","version_name":"2.6.1","version_date":"2021-02-11 12:14:59.000 +0800","version_description":"新增订阅月卡以及修复部分Bug"},{"version_id":"840805711","version_name":"2.6.2","version_date":"","version_description":""},{"version_id":"840918098","version_name":"2.6.3","version_date":"","version_description":""},{"version_id":"841674081","version_name":"2.6.4","version_date":"2021-04-25 14:44:18.000 +0800","version_description":"庆五一\n[定时“米”弹 黏弹糯米]\n黏弹糯米热衷于米饭料理，受戴夫之邀保卫平安时代。黏弹糯米会向僵尸脚下发射饭团，黏滞住僵尸的脚步。在一定时间后，定时“米”弹将会爆炸，对附近的敌人造成伤害，有概率诱发连锁爆炸，威力更强。饭团叠加的层数越多，爆炸的范围和伤害也将越高。黏弹糯米不仅可以兼顾三行，还可防备后方来患，准备好让僵尸们接受糯米团子的爆炸攻势吧！\n\n[回旋花扇 刺眼花艺伎]\n刺眼花艺伎来自“富脑山”下，以其漂亮的扇子舞闻名平安时代。刺眼花飞出的花扇以极快的速度命中僵尸后，扇子会旋转着以一道弧线从上行或下行的飞回到植物处，攻击沿途的所有目标。大招更能甩出熊熊燃烧的大花扇，向僵尸们展现她的怒火，尚未看清刺眼花的身姿，就已纷纷应声倒地。美丽与危机并存的刺眼花艺伎，将会带给大家什么样的新体验呢？ \n\n[新关开启 僵尸来袭]\n在经历了将军巨人僵尸的恶战之后，平安时代的后半段已经浮现在了戴夫眼前，两款全新僵尸来势汹汹。阴阳师僵尸可以施展法术召唤神风，对植物们的排兵布阵造成不小的麻烦；蓑衣僵尸手捧瓦钵前行，这身行头既能助其免疫抛射子弹，也能让他可以在不经意间偷走能量豆。平安时代的武士们已经在平安时代13-24关严阵以待，快去挫败僵尸们的计划！\n\n[躲避陷阱 僵太郎历险记]\n僵太郎立誓成为平安时代最出色的忍者，一起来帮助他历练吧！平安时代小游戏玩法上线，大家需要操纵忍者小鬼僵尸，躲避场上的旋风和障碍，成功到达左侧的终点，成功通过平安时代忍术资格考试。注意回避茄子忍者的飞镖，护送僵太郎安全通过哦！\n\n[喜迎五一 好礼不断]\n劳动节即将来临，寒冰豌豆、冰冻生菜、高坚果、黄金叶、脉冲黄桃迎来了新装扮，不仅好看，能力也不容小觑。多重五一节日活动也接踵而至，破罐大师体验解谜乐趣，开启扭蛋抽取稀有植物，团购活动再次开团惊喜连连，更有每日签到、幸运转盘丰富你的小长假。这个五一假期，植物大战僵尸陪你一起度过，参与活动可以获得丰厚的奖励哦。"},{"version_id":"841967320","version_name":"2.6.5","version_date":"2021-04-28 09:45:47.000 +0800","version_description":"修复iphone12系列设备适配问题\n修复偶现闪退问题"},{"version_id":"842358694","version_name":"2.6.6","version_date":"2021-05-26 14:28:45.000 +0800","version_description":"[强力导弹 地星发射井]\n全新植物地星发射井上线，潜藏在地脉之上的秘密武器登场！地星可以向僵尸发射核弹，对范围内的僵尸造成伤害并生成辐射区域。僵尸会吸收辐射并受到一定时间的变异，短暂变身为辐射僵尸，拥有更低的血量，为植物们的反击提供可乘之机。大招更能发射多枚小型核弹，对场上僵尸造成打击，片“僵“不留！随着种植数量的增多，地星发射井的阳光消耗也会增加哦~\n\n[埃及焕新 困难开启]\n潘妮对时空探测器进行了升级，发现了古埃及的更多秘密。神秘埃及困难模式正式开启，通关可以获得更多额外的星星。同时，神秘埃及的新手引导已经焕然一新，除了关卡调整，通关奖励也已大幅提升，时空之旅的第一站必须精彩，欢迎大家体验！\n\n[七日任务 获取奖励]\n戴夫发现了一本神奇的日志，完成任务可以获取丰厚的奖品。全新新手七日任务来袭，在活动期间完成指定的每日任务，即可获得奖励。累计任务进度更能解锁档位奖励，强力植物槲寄冰仙子、潘妮秘宝单抽券、植物进阶书等奖励等你拿，一起来体验吧！ \n\n[新装上线 寻找童趣]\n六一即将到来，又有一群植物小伙伴迎来了充满童趣的新装扮，板栗小队扮起了兔子、蚕豆突击队玩起了风车、激光豆佩上了竹蜻蜓、捣蛋萝卜和三线射手戴上了风格迥异的卡通装饰、噬碑藤则尝试了异域风格的大帽子。新装扮不仅酷炫，能力也不容小觑，和植物们一起迎接儿童节的到来吧！\n\n[喜迎六一 好礼不断]\n草坪已经被饼干和糖果妆点，吸引了一批可爱的小僵尸们。潘妮的追击迎来六一主题周，棒棒糖僵尸、泡泡枪僵尸、玩具车僵尸、气球僵尸等新面孔将会限时造访，可别小看他们哦。众多儿童节活动上线，挑战僵尸博士赢得奖励，开启六一糖罐收获稀有植物，更有每日签到、幸运转盘等活动接踵而至，准备好了吗？"},{"version_id":"842498070","version_name":"2.6.7","version_date":"2021-06-04 11:04:10.000 +0800","version_description":"1.修复了新植物地星发射部分音效缺失问题\n2.修复了偶现的挂件兑换闪退问题\n3.修复了部分活动icon重叠问题"},{"version_id":"842904246","version_name":"2.7.0","version_date":"2021-07-13 11:24:30.000 +0800","version_description":"[黄油大战 奶油生菜]\n全新植物奶油生菜上线，这个呆萌的新植物能力可不容小觑。生菜会攻击来袭的敌人，有概率甩出一团黄油，造成伤害并粘滞僵尸。随着奶油生菜等级的提升，可以增加黄油的释放概率和控制时间。大招更能左右拍打，抛投大量黄油，拖住场上僵尸们的脚步！\n\n[释放迷雾 眩晕雏菊]\n眩晕雏菊来到了草坪战场，这束可爱的小花会释放可以穿透的眩晕气体！随着攻击次数的累积，雏菊将会开出更多的花朵，增强攻击的伤害，延长眩晕的时间。随着眩晕雏菊等级的提升，成长速度也将变快。雏菊大招将会释放一大团迷雾，大范围眩晕前方的僵尸们。\n\n[神器降临 扭转战局]\n潘妮在时空隧道的深处发现了一些强力的神器，神风神器、闪电神器、投罐神器、治愈神器已经上线，为大家的战场带来了更多的可能性。神器具备主动技能和被动增益，随着神器等级的增加，他们也将会拥有更加有用的技能和属性提升，为植物们带来增益效果。更多神器即将在未来和大家见面，为战场带来强有力的支持，敬请期待哟！ \n\n[心愿召唤 许愿好礼]\n全新“心愿召唤”活动上线，许下愿望，在当期奖池中选择想要的植物，打开潘妮的神秘宝匣子，抽取心仪的新植物吧！通过完成每日任务和获取礼包可以都获得代抽券，累计许愿达到一定次数，获取丰厚的奖励。培养新植物到达指定阶段，还有珍贵的植物碎片和代抽券可以领取哦~\n\n[新装上线 夏日狂欢]\n众多暑期活动即将开始，暑期欢乐购开启购物狂欢、暑期寻宝带你探寻珍贵宝藏、神秘商店限时开启、破罐大师体验探索乐趣。更有幸运转盘、每日签到、折扣礼包等丰厚的福利活动接踵而至，好礼不断。五款植物即将迎来新装扮，好看又好玩。这个夏天，一起在《植物大战僵尸2》狂欢吧！"},{"version_id":"843542337","version_name":"2.7.2","version_date":"2021-08-12 12:17:16.000 +0800","version_description":"[庆典开启 生日狂欢]\n时光荏苒，植物大战僵尸2已经走过了八年！在大家的陪伴下，戴夫穿梭各个奇妙有趣的时空，带领植物们和僵尸斗智斗勇，在旅途中勇往直前。草坪上，精心准备的狂欢派对已经准备就绪，植物和僵尸们都已整装待发，为大家带来一场盛大的八周年庆典。大量周年庆活动即将开启，超丰厚的周年福利来袭，好礼不断，一起为《植物大战僵尸2》庆生吧。时空之旅，一路有你！\n\n[气泡翻腾 庆典汽水椰]\n庆典汽水椰热衷于参加各种有趣的派对，这次的八周年庆典自然少不了他的身影。别看汽水椰胖乎乎的，当他受到僵尸的“打扰”时，体内的汽水将会持续翻腾充气，准备来一场气泡大喷发，击退前方的大量僵尸。随着汽水椰等级的提升，庆典上的汽水攻势将会更加热烈。大招更能喷射出大量的气泡水，为草坪带来一场翻滚的气泡盛宴！\n\n[空投气球 爆炸桔梗]\n庆典上怎么能没有多彩的气球，气氛组选手爆炸桔梗已经安排得妥妥当当！桔梗可以吹出气球并布置在场上的任意位置，这些气球可不仅仅是装饰，更会突然爆裂，对想要近距离“观摩”的僵尸们造成重创。随着爆炸桔梗等级的提升，气球的生成速度将会更快，还有可能变幻出不一样的花样哦~桔梗的大招同样精彩，就等大家在庆典会场上亲自揭晓答案啦~\n\n[双植进化 五阶上线]\n两款植物迎来了五阶能力的开放，准备在庆典的舞台上一展身手。\n芦荟医师-寒冰水滴，对冰雪的运用更加炉火纯青，芦荟医师会丢出1滴蕴含冰晶的水滴，额外提供攻击力的提升，在水雾持续期间，水雾中的僵尸会受到冰减速效果。\n粘液桉果-剧毒泡泡，桉果师从毒影菇学成归来，吹出的泡泡糖含有剧毒，泡泡爆开后将会放出一团烟雾，对后方的僵尸们造成眩晕，为植物们的反击争取更多的时间。 \n\n[新装登场 酷炫好用]\n八周年的狂欢必须满满的仪式感，植物们也已经穿上新衣，等待着派对的到来。向日葵、天使星星果、猫尾草、暗影豌豆、尖刺秋葵的全新装扮上线，精灵古怪的装饰会为僵尸们带来什么样的“大惊喜”呢？更有两款全新超级挂件登场，在挂件页面中找到它们吧！ \n除此之外，神秘水晶商店即将上架植物装扮专栏，准备好兑换心仪的装扮了吗？"},{"version_id":"843639026","version_name":"2.7.3","version_date":"","version_description":""},{"version_id":"843913240","version_name":"2.7.4","version_date":"","version_description":""},{"version_id":"844311157","version_name":"2.7.5","version_date":"","version_description":""},{"version_id":"845156314","version_name":"2.7.6","version_date":"","version_description":""},{"version_id":"845558173","version_name":"2.7.7","version_date":"","version_description":""},{"version_id":"845871998","version_name":"2.7.8","version_date":"","version_description":""},{"version_id":"846614302","version_name":"2.8.0","version_date":"","version_description":""},{"version_id":"846814087","version_name":"2.8.1","version_date":"","version_description":""},{"version_id":"847579974","version_name":"2.8.2","version_date":"","version_description":""},{"version_id":"847603349","version_name":"2.8.4","version_date":"","version_description":""},{"version_id":"848610003","version_name":"2.8.5","version_date":"","version_description":""},{"version_id":"85513979","version_name":"1.0.3","version_date":"2013-11-15 03:07:55.000 +0800","version_description":"1、优化了对iOS7的支持； \n2、增加了钻石恢复系统, 再也不用担心钻石丢失的问题了；"}]