[{"version_id":"819203927","version_name":"1.7.4","version_date":"2016-10-08 16:09:24.000 +0800","version_description":"A few minor updates and bug fixes to make PrintHand an even better."},{"version_id":"819976746","version_name":"1.7.5","version_date":"2016-12-19 06:26:16.000 +0800","version_description":"- Updated drivers<br>- Added more printers<br>- Fixed issues"},{"version_id":"821145192","version_name":"1.7.6","version_date":"2017-03-10 21:02:07.000 +0800","version_description":"By popular request, we’ve improved the SMB printing in our app. This means that printing from our mobile app on printers shared via Windows computers works much better now! Moreover, we've added a bunch of new printer drivers. Check it out!"},{"version_id":"821525561","version_name":"1.7.7","version_date":"2017-03-30 19:41:16.000 +0800","version_description":"Good news: we had a closer look at SMB (Windows printer sharing), and it is now more reliable and works much better! So please, check it out and let us know if there are any issues.<br><br>Thank you for using this app!"},{"version_id":"821804698","version_name":"1.7.8","version_date":"2017-04-18 22:49:18.000 +0800","version_description":"What's done in this update:<br>• Updated Facebook SDKs;<br>• New Authorization for Google Services;<br>• Minor bug fixes."},{"version_id":"822113117","version_name":"1.8","version_date":"2017-05-15 21:03:39.000 +0800","version_description":"Printing from iOS devices becomes slick with Action button!<br><br>Say goodbye to copy/paste, saving files to your device and locating them in our printing app. From now on iOS users can share content from the majority of the apps to PrintHand.<br>How? Just use Action button in your browser, viewer or editor. As easy as that! It is supported by PrintHand starting from today. Try it out!"},{"version_id":"822533990","version_name":"1.8.1","version_date":"2017-06-14 21:21:10.000 +0800","version_description":"Recently we’ve faced an issue with Google Cloud Print authorization, which could prevent our users from accessing their cloud printers. <br>Today we are delighted to tell that we have rewritten the code responsible for Google Cloud Print feature from scratch to make this service available again. <br><br>In addition we’ve updated the Facebook SDK. This won’t affect your user experience, but it is still worth mentioning :)"},{"version_id":"823993063","version_name":"1.8.2","version_date":"2017-10-15 22:49:08.000 +0800","version_description":"A few minor updates and bug fixes"},{"version_id":"824402823","version_name":"1.8.3","version_date":"2017-11-14 23:22:56.000 +0800","version_description":"In this update we had updated the application for iPhone X."}]