[{"version_id":"393072824","version_name":"2.0.2","version_date":"","version_description":""},{"version_id":"590533067","version_name":"2.0.3","version_date":"","version_description":""},{"version_id":"812726273","version_name":"2.2.1","version_date":"2015-07-06 12:21:03.000 +0800","version_description":"Since I first wrote Pedometer++ it has been one of my six year old son's favorite apps.  He loves checking to see if I have hit my daily step goal and then watching the green confetti that rains down.  After much consideration, he has decided that if you double your goal the confetti should be blue.  So now it is. :)<br><br>Also, I have added the ability to disable automatic distance estimation.  If you prefer to use a fixed stride length you can now do so.  Enjoy!<br><br>As always if you have a minute to write a review for the app I'd really appreciate it.  They really do help other people find and get the app.  Thank you.<br><br>—Dave"},{"version_id":"815163691","version_name":"2.3.1","version_date":"2015-12-10 02:32:40.000 +0800","version_description":"Thanks for all the kind words around the launch of 2.3, I'm so glad to hear how warmly it was received.  This update includes a few little fixes for issues that slipped through my testing:<br> - The Great Confetti Shortage of 2015 has been resolved.  There was a bug that could have prevented confetti from falling when you hit your goal under certain circumstances.  The bug has been fixed and the amount of confetti going forward has been increased by 5% to compensate for lost delight.<br> - Plus, lots of little stability improvements and fixes.<br>Thanks for all your continued support of Pedometer++.  If you have a minute to leave a review in the App Store I'd really appreciate it.  They really help in getting the app in front of more and more people.  Thanks!<br><br>—Dave"},{"version_id":"816834517","version_name":"2.3.2","version_date":"2016-03-29 14:23:17.000 +0800","version_description":"This update is all about cleaning out all the little nagging bugs that I have found over the last few months. Nothing too major but overall you should find the app much more responsive and reliable.  The fixes included:<br><br> - Speed of refreshing your step counts (with new activity indicator)<br> - Fix issues with Apple Watch complications not showing icons correctly<br> - Fix issues where the step badge wouldn't update correctly.<br><br>Thank you for your continued support of Pedometer++, you rock."},{"version_id":"817286703","version_name":"2.3.3","version_date":"2016-05-09 15:11:19.000 +0800","version_description":"A few little goodies in this update. <br>- Better complications for the Apple Watch (especially the Modular watch face)<br>- Avoid a situation where the confetti wouldn't be shown after reaching your goal<br>- Minor fixes and improvements<br><br>If you have a minute to leave a review for Pedometer++ in the App Store I'd really appreciate it.  It really helps.  <br><br>Thanks, <br>   Dave"},{"version_id":"818796824","version_name":"2.4","version_date":"2016-09-13 17:52:27.000 +0800","version_description":"This update brings support for iOS 10 and watch OS 3, plus a handful of other minor improvements <br>- Added support for the new wheelchair mode on the Apple Watch.  Will switch from steps to pushes as the goal metric. <br>- Improved the operation of the Apple Watch walking workout<br>- Improved the complication refresh interval and accuracy on Apple Watch <br>- Added the ability to share your step count and goal progress in iMessage"},{"version_id":"818978117","version_name":"2.4.1","version_date":"2016-10-05 13:49:47.000 +0800","version_description":"Thank you for all the great feedback about our iOS 10 and watchOS 3 updates.  This is a bug fix update that clears up a few little bugs that slipped through including:<br> - Fixes to Portuguese and German Localizations<br> - Fix resizing bug in iMessage app<br> - Substantial improvements to the stability of the Apple Watch walking mode.<br><br>Keep the feedback coming it really helps me improve the app.  If you have a minute to leave a review in the App Store for Pedometer++ I'd really appreciate it.  Thanks!"},{"version_id":"820445628","version_name":"2.5","version_date":"2017-01-12 20:47:36.000 +0800","version_description":"To start the year off right this update introduces Goal Streak Tracking to help keep you motivated to hit your goal each day.  How long of a streak of days can you get?<br><br> This includes a mechanism for allowing you to have a single rest day each week where you won't break your streak just for resting up. You can turn this off in settings if you want every day to count towards your streak. <br><br>Additionally, I also fixed a bunch of bugs with accessibility and the Apple Watch complication display.  <br><br>Happy New Year!"},{"version_id":"820597263","version_name":"2.5.1","version_date":"2017-01-19 21:56:17.000 +0800","version_description":"Whoops, a few little bugs slipped through in the last update (which added Goal Streak Tracking). <br> - Fix a bug where scrolling the view to the left would keep bouncing back.<br> - Fix a bug where settings were hard to change on smaller iPhones<br> - Fix a bug where the weekly summaries would change while you scrolled.<br><br>Thanks for all the feedback in helping me track these down."},{"version_id":"822116986","version_name":"2.5.2","version_date":"2017-05-22 18:21:03.000 +0800","version_description":"This update is geared around trying to tidy up a lot of loose ends and fixing lingering bugs.  It includes:<br>- Fix a bug that caused old data to change (note: you may see a one time adjustment the first time you run the new update)<br>- Fix a bug that prevented the graph from re-centering onto the current week<br>- Update the icon to be a cleaner and clearer<br>- Add a warning when switching to Wheelchair Mode but your Apple Watch isn't in wheelchair mode<br>- Add the ability (in the Settings area) to switch the app's icon to one more appropriate for Wheelchair Mode when active. <br><br>If you see anything else please let me know, I'm working on a pretty big update next and want everything to be nice and stable before that rolls out.<br><br>—Dave"},{"version_id":"822714596","version_name":"2.5.3","version_date":"2017-07-06 13:27:42.000 +0800","version_description":"This update unfortunately needed to remove the step-count icon badge feature. As an alternative I recommend adding Pedometer++ to your today widget list (swipe left-most on your home screen), or hard press on its icon on an iPhone 6s or 7 to see your current step counts.<br><br>This update also includes a fix for an issue with resetting the alternative wheelchair icon, a Russian localization correction, and better display of missing days in the app. <br><br>Thank you for your understanding."},{"version_id":"823329383","version_name":"3.0.0","version_date":"2017-08-29 12:31:41.000 +0800","version_description":"I'm delighted to announce version 3.0 of Pedometer++.  I've been working on Pedometer++ for the last four years I've worked to constantly improve and enhance the app, to make it more and more motivating, and to keep it up to date with the latest capabilities of our devices.  This update brings with it two major features and a truckload of little improvements and tweaks.<br> - ACHIEVEMENTS! You now earn badges for the steps you take and the floors you climb.  These are available via the top right button from the main screen. My hope is that these will provide you with another source of encouragement and motivation to stay active.<br> - Enhanced widget.  The widget you can access from the lock or home screen now includes a detailed graph of your current day's activity to show you your progress more clearly. <br><br>  Additionally, I've done lots of work behind the scenes fixing little bugs or smoothing over past issues. I hope you enjoy this update.  <br><br>    —Dave"},{"version_id":"823499968","version_name":"3.0.1","version_date":"2017-08-31 23:54:41.000 +0800","version_description":"[In v3.0.1, I fix a layout bug for smaller devices, a Portuguese translation, address an issue with wheelchair mode badges, the streak date being incorrect and a VoiceOver problem.]<br><br>I'm delighted to announce version 3.0 of Pedometer++.  I've been working on Pedometer++ for the last four years I've worked to constantly improve and enhance the app, to make it more and more motivating, and to keep it up to date with the latest capabilities of our devices.  This update brings with it two major features and a truckload of little improvements and tweaks.<br> - ACHIEVEMENTS! You now earn badges for the steps you take and the floors you climb.  These are available via the top right button from the main screen. My hope is that these will provide you with another source of encouragement and motivation to stay active.<br> - Enhanced widget.  The widget you can access from the lock or home screen now includes a detailed graph of your current day's activity to show you your progress more clearly. <br><br>  Additionally, I've done lots of work behind the scenes fixing little bugs or smoothing over past issues. I hope you enjoy this update.  <br><br>    —Dave"},{"version_id":"823595660","version_name":"3.1","version_date":"2017-09-22 14:11:13.000 +0800","version_description":"This update is all about taking advantage of the new abilities recently added to iOS and watchOS.  These include:<br>- The ability to sync and measure floors using a Series 3 Apple Watch (ensure that \"Merge Apple Watch Data\" is turned on)<br>- Support for the new iPhone screen layouts<br>- Re-add the summary steps/distance display to the bottom of the Settings area by popular demand<br><br>- Plus, lots of little bug fixes and tweaks:<br> -- Localization fixes for German, Russian and Spanish<br> -- Resolve a situation where the app could get stuck in Wheelchair Mode accidentally<br><br>Thanks for your continued support for Pedometer++. If you come across anything on a new device or OS that I've missed please let me know so that I can get is fixed ASAP.  Thank you!<br><br>—Dave"},{"version_id":"824261746","version_name":"3.2","version_date":"2017-11-03 12:37:29.000 +0800","version_description":"This update includes:<br> - Distance based badges!  Earn badges based on how far you've walked with Pedometer++<br> - Added a badge for 15 Million steps. Much to my surprise many of you have already reached your 10 Million step badge, so I wanted to add something else for you to walk towards.<br> - Fixed perfect month badge calculations"},{"version_id":"824320803","version_name":"3.2.1","version_date":"2017-11-08 16:14:43.000 +0800","version_description":"This update includes:<br> - The ability to start either an outdoor or indoor (treadmill) walk in the Apple Watch app<br> - A fix for a rare bug that resulted in missing day counts<br> - A lot of clean up and minor fixes to issues introduced by the last update."},{"version_id":"825225903","version_name":"3.2.2","version_date":"2017-12-06 20:35:53.000 +0800","version_description":"Just a few fixes in this one.  <br> › Fix an issue that could case the app to freeze on launch when it hadn't been opened in a while.<br> › Faster loading of Apple Watch step data"},{"version_id":"825401895","version_name":"3.2.3","version_date":"2017-12-20 19:43:35.000 +0800","version_description":"Speeeeed!  This update is all about making scrolling faster, especially when you have lots of history with Pedometer++ (thank you for sticking with it!).  You should see greatly increased performance when moving around within the app.  <br><br>(Also fixed an issue where Apple Watch steps would get start syncing correctly after you do a backup/restore)"},{"version_id":"825858847","version_name":"3.2.4","version_date":"2018-02-02 18:53:46.000 +0800","version_description":"This update includes a few features that I've been hoping to add to Pedometer++ for a while but never quite got around to it.  <br> - You can now transfer your step history to another iPhone.  Simply email the export file (Export.steps) to the new iPhone and then open it.  Your steps will be merged into the new iPhone's database.  The merge process will keep any steps you have taken on your new phone.<br>- You can now tap the workout screen in the Apple Watch app to toggle between seeing your total daily steps or only the steps you've taken in the current workout/walk.<br><br>Also fixed:<br>- Occasional streak marker alignment bug<br>- An issue with the rest day switch in settings."},{"version_id":"825884477","version_name":"3.2.5","version_date":"2018-02-05 20:19:05.000 +0800","version_description":"Whoops!  The last update included a little bug where the \"Importing Data\" dialogue could get stuck on your screen.  This fixes that.  Sorry about that. <br><br>More positively the last update included:<br> - You can now transfer your step history to another iPhone.  Simply email the export file (Export.steps) to the new iPhone and then open it.  Your steps will be merged into the new iPhone's database.  The merge process will keep any steps you have taken on your new phone.<br>- You can now tap the workout screen in the Apple Watch app to toggle between seeing your total daily steps or only the steps you've taken in the current workout/walk.<br><br>Also fixed:<br>- Occasional streak marker alignment bug<br>- An issue with the rest day switch in settings."},{"version_id":"825898988","version_name":"3.2.6","version_date":"2018-02-06 18:44:12.000 +0800","version_description":"A little bug fix for a rare situation where pressing the export button can cause a crash in the app. <br><br>Recently added:<br> - You can now transfer your step history to another iPhone.  Simply email the export file (Export.steps) to the new iPhone and then open it.  Your steps will be merged into the new iPhone's database.  The merge process will keep any steps you have taken on your new phone.<br>- You can now tap the workout screen in the Apple Watch app to toggle between seeing your total daily steps or only the steps you've taken in the current workout/walk."},{"version_id":"827726028","version_name":"3.2.7","version_date":"2018-07-02 10:40:58.000 +0800","version_description":"Quick little bug fix update that includes:<br>- Fixes for Chinese Localization<br>- Now hides the floors badge when on a device that doesn't support floor counting"},{"version_id":"827896441","version_name":"3.2.8","version_date":"2018-07-17 10:04:17.000 +0800","version_description":"This update is all about clearing up any lingering bugs or issues before some exciting improvements I'm working on for this fall.<br> - Fix the display of the Awards section of Achievements on older phones<br> - Fix the alignment of the goal bar on the main graph screen<br> - Prevent the streak bars from being hidden for long streaks on newer devices<br> - VoiceOver and accessibility fixes for error states"},{"version_id":"828586247","version_name":"3.3","version_date":"2018-09-17 10:37:13.000 +0800","version_description":"I'm very excited to announce this update.  It is primarily focused on dramatic improvements to Pedometer++’s Apple Watch app.  The old Apple Watch app served its purpose but lacked flexibility and capability.  Now I can take advantage of the significant improvements found in modern Apple Watches to dramatically improve what's possible.  The new Apple Watch app:<br> - Provides a beautiful, customizable workout metric display<br> - Includes a colorful, glanceable heart rate history graph<br> - Adopts robust support for the new Hiking mode including a real-time elevation profile<br> - Lets you record a GPS track of your workout and even display it on a map right from your wrist<br> - Incorporates media controls right in the app so you can control your music or podcast without leaving the app<br> - Adopts all the new complication types <br> - Let’s you completely customize your workout display to tailor the metrics shown to your needs.<br><br>Additionally, this update adds support for additional screen sizes.<br><br>I hope you enjoy this update as much as I have enjoyed making and testing it out.<br><br>  —Dave"},{"version_id":"828651895","version_name":"3.3.1","version_date":"2018-09-19 22:49:40.000 +0800","version_description":"This is a quick bug fix update to address a few issues that cropped up in version 3.3.<br> - Improve the accuracy of complication refresh<br> - VoiceOver fixes in Watch app<br> - Prevent a situation that would prevent workouts from starting when the 'Start' button was pressed<br> - Indicate when a workout is being saved in the background<br> - Fix the display of calories (previously was showing kJ when it should show Calories)<br><br>Version 3.3 included a massive update to the Apple Watch app including:<br>- Provides a beautiful, customizable workout metric display<br>- Includes a colorful, glanceable heart rate history graph<br>- Adopts robust support for the new Hiking mode including a real-time elevation profile<br>- Lets you record a GPS track of your workout and even display it on a map right from your wrist<br>- Incorporates media controls right in the app so you can control your music or podcast without leaving the app<br>- Adopts all the new complication types <br>- Let’s you completely customize your workout display to tailor the metrics shown to your needs."},{"version_id":"828686001","version_name":"3.3.2","version_date":"2018-09-23 11:07:26.000 +0800","version_description":"This update adds a new Achievement for most floors climbed in a day as well as adds a iMessage sticker pack with all the top achievements.  <br><br>Additionally I found and fixed an issue that could cause the app to crash when starting a workout under certain circumstances."},{"version_id":"829609554","version_name":"3.4","version_date":"2018-12-13 15:01:26.000 +0800","version_description":"This update includes a ton of improvements and changes:<br> - Address an issue where the app could sometimes under-count your steps <br> - Adds indicator for when a day is being considered a 'Rest Day' for your streaks<br> - Extend the end of streaks by one day when you have 'earned' a rest day <br> - Much faster updates and data loading<br> - Fix an issue where the floors count shown didn't match other sources<br> - Fix an issue where data would be merged from Apple Watch even when setting was disabled<br> - Improvements to the Infograph Modular Apple Watch complication<br> - Lots of small tweaks and clean ups<br><br>This update is a bit overdue but got held up due to the complexity involved with fixing the under-counting bug.  I'm very glad to get it finally sorted out so I can continue moving forward with the long list of great improvements I have for the app.  I'm sorry it took so long!<br><br>  —Dave"},{"version_id":"829660582","version_name":"3.4.1","version_date":"2018-12-16 22:32:24.000 +0800","version_description":"A quick bug fix update to address a situation where certain Apple Watch users could see their steps decrease.  I'm so sorry for this bug, if you were affected please reach out via the support link in Settings and I can get your steps restored.<br><br>Previously in 3.4:<br><br>This update includes a ton of improvements and changes:<br>- Address an issue where the app could sometimes under-count your steps <br>- Adds an indicator for when a day is being considered a 'Rest Day' for your streaks<br>- Extend the end of streaks by one day when you have 'earned' a rest day <br>- Much faster updates and data loading<br>- Fix an issue where the floors count shown didn't match other sources<br>- Fix an issue where data would be merged from Apple Watch even when setting was disabled<br>- Improvements to the Infograph Modular Apple Watch complication<br>- Lots of small tweaks and clean ups"},{"version_id":"829696113","version_name":"3.4.2","version_date":"2018-12-18 17:28:48.000 +0800","version_description":"Another quick bug fix update to address a situation where steps would get double counted and would grow massively.  I'm very sorry for these data issues.  I take very seriously keeping the step counting logic as rock solid as possible but unfortunately had to make a few changes recently.  I think I'm getting very close to ironing out all the issues if you see anything a miss please let me know.   I'll work tirelessly to get them all sorted. <br><br>  —Dave<br><br>Previously in 3.4:<br><br>This update includes a ton of improvements and changes:<br>- Address an issue where the app could sometimes under-count your steps <br>- Adds an indicator for when a day is being considered a 'Rest Day' for your streaks<br>- Extend the end of streaks by one day when you have 'earned' a rest day <br>- Much faster updates and data loading<br>- Fix an issue where the floors count shown didn't match other sources<br>- Fix an issue where data would be merged from Apple Watch even when setting was disabled<br>- Improvements to the Infograph Modular Apple Watch complication<br>- Lots of small tweaks and clean ups"},{"version_id":"829783465","version_name":"3.4.3","version_date":"2018-12-28 21:38:35.000 +0800","version_description":"To kick off 2019 with some added motivation, I'm introducing new Monthly Challenge badges.  Each month I'm going to add a unique badge you can earn based on your activity.  The first badge of 2019 has the objective of reaching your daily step goal 19 times in January.  I hope these additional challenges will help you to find that little bit of extra motivation to get up and moving. <br><br>Happy New Year!<br><br>  —Dave"},{"version_id":"830035151","version_name":"3.4.4","version_date":"2019-01-25 18:16:41.000 +0800","version_description":"Little update improving the badge system:<br> - Added the February Challenge: Get a 10 day Streak in February to earn it this badge<br> - Fix a situation where exactly meeting the goal for certain badges didn't earn them<br> - Fix a situation where the wrong badge count was displayed"},{"version_id":"830395539","version_name":"3.4.5","version_date":"2019-02-28 11:37:36.000 +0800","version_description":"I have a major update that is nearly finished that includes a ton of very exciting changes.  It isn't quite ready yet so in the meantime here is a quick update that adds the March Challenge:<br><br>- March's goal is distance based where the distance goal is based on you reaching 75% of your daily step goal for the whole month.  <br><br>Thanks for all the great feedback about the monthly challenges, I'm so glad to hear they are a fun new motivator.  I can't wait to show you all the cool updates that are coming soon!<br>  —Dave"},{"version_id":"830774108","version_name":"3.4.6","version_date":"2019-03-29 22:22:15.000 +0800","version_description":"This update includes the April Monthly Challenge.  In January the goal as 19 days of meeting your goal, for April I wanted to push that a little bit further.  The goal for April is to reach your goal 21 days.  Best of luck and get walking!"},{"version_id":"831126133","version_name":"3.4.7","version_date":"2019-04-29 21:01:54.000 +0800","version_description":"This update includes the May challenge badge.  This is the last of these small updates before a big update I have planned for mid-May.  I can't wait to show it to you."},{"version_id":"831389452","version_name":"4.0","version_date":"2019-05-28 17:40:36.000 +0800","version_description":"Introducing Pedometer++ version 4.0!  This update is all about letting you personalize Pedometer++ to your tastes.<br>• Support for Fixed Timezones.  You can set the app to your home timezone and it will always display your step counts in that location.  So when you travel your streaks and achievements don't get mixed up.  <br>• I've added a few new color themes for the app:<br>  • A Dark Mode for situations where you'd prefer a less bright display<br>  • A new color palette option that is designed with colorblind users in mind.  My typical red-orange-green theming is less than ideal for users with color differentiation limitations so I worked with some accessibility experts to come up with a theme that should provide more contrast for all users.  <br>• You can now set alternative icons for the app, to make it fit in with your home screen aesthetic.<br>• I re-worked how your daily step goal is changed within the app. Previously your goal would apply to your entire history and changing it would update it for every day in the app.  This made it really awkward to increase your goal over time, as you'd loose your old achievements and streaks.  Now changing your goal doesn't affect your past data, only the current day and moving forward.  So starting at a lower goal and then slowly increasing over time works much better.<br>• The monthly challenges are now pre-loaded into the app so they'll appear on the first day of each month, without needing an app update.<br>• I also refreshed the design of the Apple Watch app making it fit in better with the overall system apps.<br><br>I hope this update makes Pedometer++ feel even more personal to you and in turn gives you that little extra boost to get out there walking. <br><br>—Dave"},{"version_id":"831504757","version_name":"4.0.1","version_date":"2019-05-31 15:24:07.000 +0800","version_description":"Quick bug fix update addressing:<br> - An issue with the display of wheelchair based graphs<br> - An issue with changing the system timezone<br> - An issue with confetti colors"},{"version_id":"831696864","version_name":"4.0.2","version_date":"2019-06-18 11:44:04.000 +0800","version_description":"Just a quick bug fix update to address an issue where certain step counts were getting wildly over counted."},{"version_id":"832336032","version_name":"4.1","version_date":"2019-08-12 16:48:01.000 +0800","version_description":"This update is a large collection of bug fixes that should address the lingering issues in the app.  My goal is to clear the decks and get the app in a really solid state before I dive into my next major update.  It includes:<br>- Fix bug with iMessage app loading<br>- Fix the way timezones are handled in the Today Widget<br>- Fix a bug that caused the count shown in the today widget to be higher than the correct value shown in the app<br>- Include goal history in the export files.  Unfortunately, previous exports did not include this data.<br>- Fix an issue where step counts could reduce after their initial load<br>- Mark the fixed timezone on the graphs to clarify their offset<br>- Fix an issue where the watch app wouldn't update to reflect new goals<br>- Fix an issue when new monthly goals you earn aren't indicated with sparkling <br><br>Thanks!"},{"version_id":"832441840","version_name":"4.1.1","version_date":"2019-08-20 22:00:59.000 +0800","version_description":"- Fix the way the timezone chooser works to make it less likely to accidentally select an incorrect timezone<br>- Fix a bug that was preventing high step count hours from being counted correctly"},{"version_id":"832631892","version_name":"4.1.2","version_date":"2019-09-04 19:29:07.000 +0800","version_description":"Quick bug fix update to prevent a situation where step counting could get temporarily stuck and stop counting."},{"version_id":"832798026","version_name":"4.2.1","version_date":"2019-09-17 18:47:35.000 +0800","version_description":"This update includes a lots of updates for compatibility and a bunch of great new features:<br>- Apple Watch app can now run independently without needing the iPhone app to be installed<br>- Add support for systemwide Dark Mode, by default Pedometer++ will mirror your iPhone's setting.  This can be changed in Settings.<br>- Better background refresh<br>- Dramatically faster initial launch time<br>- Fix September badge<br>- Fix timezone chooser on smaller phones<br>- Fix bug with distances shown in badge screen"},{"version_id":"832814005","version_name":"4.2.2","version_date":"2019-09-18 16:27:34.000 +0800","version_description":"This update is just a minor update to the previous version that clarifies some of the help text within the app.<br><br>Previously:<br><br>This 4.2.1 included a lots of updates for compatibility and a bunch of great new features:<br>- Apple Watch app can now run independently without needing the iPhone app to be installed<br>- Add support for systemwide Dark Mode, by default Pedometer++ will mirror your iPhone's setting.  This can be changed in Settings.<br>- Better background refresh<br>- Dramatically faster initial launch time<br>- Fix September badge<br>- Fix timezone chooser on smaller phones<br>- Fix bug with distances shown in badge screen"},{"version_id":"832847215","version_name":"4.2.3","version_date":"2019-09-21 17:35:24.000 +0800","version_description":"This update fixes two bugs:<br> - The first was a layout issue for certain Apple Watch devices<br> - The second was an issue where the day bars could be incorrectly labeled after switching timezones.<br><br>Previously:<br><br>This 4.2 included a lots of updates for compatibility and a bunch of great new features:<br> - Clarifies some of the help text within the app.<br> - Apple Watch app can now run independently without needing the iPhone app to be installed<br> - Add support for systemwide Dark Mode, by default Pedometer++ will mirror your iPhone's setting.  This can be changed in Settings.<br> - Better background refresh<br> - Dramatically faster initial launch time<br> - Fix September badge<br> - Fix timezone chooser on smaller phones<br> - Fix bug with distances shown in badge screen"},{"version_id":"833500487","version_name":"4.2.4","version_date":"2019-11-07 17:36:35.000 +0800","version_description":"This update includes improvements to the Apple Watch app.  It makes the complication refresh more reliably and fixes a bug where the floors counter could be omitted on smaller devices."},{"version_id":"833874241","version_name":"4.3.1","version_date":"2019-12-06 11:29:05.000 +0800","version_description":"This update is all about badges!<br> - Updated to include all the new monthly badges for 2020<br> - My popular demand adds a 365 Streak Badge<br> - Includes two new daily floors badges."},{"version_id":"835117663","version_name":"4.3.2","version_date":"2020-03-17 19:53:07.000 +0800","version_description":"- Fix to the way your March Challenge badge distance was being calculated.  It might change one last time with this update, but then be stable from here on out.  I know how much reaching these badges means, so I really am very sorry for the confusion and bug.<br>- A tweak to how complications are being refreshed on the Apple Watch to hopefully give more reliable updates."},{"version_id":"835186689","version_name":"4.3.3","version_date":"2020-03-25 23:47:29.000 +0800","version_description":"Minor fixes again to the Distance based badges."},{"version_id":"836499173","version_name":"4.4","version_date":"2020-06-30 13:49:48.000 +0800","version_description":"This update is focused primarily around improving the refresh of your steps when shown on an Apple Watch.  You should see a dramatic increase in update frequency and accuracy with this update.   I also changed the layout of the monthly achievements so that the current year is more prominent."},{"version_id":"836705205","version_name":"4.4.1","version_date":"2020-07-04 19:36:56.000 +0800","version_description":"Battery life improvements."},{"version_id":"837803628","version_name":"4.5","version_date":"2020-09-16 20:20:08.000 +0800","version_description":"This update introduces support for home screen widgets.  You can display your daily steps as either a progress gauge or if you prefer the detailed numbers."},{"version_id":"837822951","version_name":"4.5.1","version_date":"2020-09-18 13:30:39.000 +0800","version_description":"This is a quick bug fix update that addresses an issue that would prevent the home screen widget from correctly matching the main app. <br><br>New in v4.5<br><br>This update introduces support for home screen widgets.  You can display your daily steps as either a progress gauge or if you prefer the detailed numbers."},{"version_id":"837861964","version_name":"4.5.2","version_date":"2020-09-19 21:27:29.000 +0800","version_description":"Fixes a bug where the widget's goal value doesn't match the main app."},{"version_id":"838145709","version_name":"4.5.3","version_date":"2020-10-22 09:18:20.000 +0800","version_description":"Fixes for Apple Watch issues."},{"version_id":"839782007","version_name":"4.6","version_date":"2020-12-28 13:42:50.000 +0800","version_description":"Adds the 2021 challenges, start the year off right by reaching your goal 21 times.  You got this!"},{"version_id":"840058568","version_name":"4.6.1","version_date":"2021-01-21 10:42:26.000 +0800","version_description":"This update includes a bunch of fixes:<br>- Adds new 15M &amp; 20M lifetime step badges<br>- Adds new 180 and 730 day streak badges<br>- Adds new 15,000 mi badge<br>- Adds a new light and dark widgets<br>- Fix widgets not correctly showing the overridden timezone<br>- Fixes a situation that could cause very updates in certain circumstances"},{"version_id":"840369667","version_name":"4.6.2","version_date":"2021-02-08 09:40:15.000 +0800","version_description":"- Fix localization display for widgets<br>- Add a start date for your Lifetime Steps badge<br>- Fixes for Health authorization prompts"},{"version_id":"840494146","version_name":"4.6.3","version_date":"2021-04-05 11:11:54.000 +0800","version_description":"Bugfix for a situation that could lead to repeated Health authorization prompts being shown."},{"version_id":"841813341","version_name":"4.7","version_date":"2021-04-29 10:12:51.000 +0800","version_description":"This update dramatically improves the complications provided by the Apple Watch app.  You can now choose from a wide variety of options ranging from data packed to clean &amp; minimal.  Additionally, you can now install the Pedometer++ complications into multiple slots on a single watch face."}]