[{"version_id":"817535379","version_name":"2.0","version_date":"2016-06-21 09:30:41.000 +0800","version_description":"● Now connects to the online version of the game.<br>● Contains all three games: First Steps, Fun With Words and Champion Reader.<br>● Hours of game play in one app."},{"version_id":"818294019","version_name":"2.1.0","version_date":"2016-08-24 08:40:24.000 +0800","version_description":"Fixed a number of small bugs and issues."},{"version_id":"819063463","version_name":"3.0.0","version_date":"2016-10-26 17:07:41.000 +0800","version_description":"Smartphone compatible<br>Better compatibility with school IT systems<br>Minor bug fixes"},{"version_id":"821039232","version_name":"3.0.3","version_date":"2017-03-13 08:20:25.000 +0800","version_description":"- New! You can change your monster's appearance by tapping on it in the monster shop!<br>- Added an 'exit' button to log out of game (within the monster shop)<br>- Small bug fixes<br>- Any aspect ratios<br>- Improved full screen behaviour<br>- Improved memory use"},{"version_id":"821319843","version_name":"3.0.4","version_date":"2017-04-01 08:15:13.000 +0800","version_description":"Various bug fixes."},{"version_id":"821640602","version_name":"3.1","version_date":"2017-06-28 15:37:42.000 +0800","version_description":"NEW!<br>* Practice Mode including our brand new 10 Minute Adventure and Single Minigames<br>* 10 Minute Adventure: Choose letter sounds to practice in a fun and interactive new adventure mode<br>* Single Minigames: Choose a ‘letter sound matching’ or ‘blending and segmenting’ game with your chosen GPCs (Grapheme Phoneme Correspondences)<br>* Music volume controls in Settings to enable users to choose the balance between music and speech<br><br>IMPROVEMENTS AND FIXES<br>* Switched the first game from sheep to ducks to avoid confusion with “s” letter sound and “sh-eep”<br>* Polished the interface – clearer images, texts and buttons to enhance the overall appearance<br>* New in-game music in some mini-games to add more variety and aid in the clarity of phonemes<br>* More intuitive controls for the UFO and submarine mini-games<br>* Added Progress Maps between levels in Fun With Words and between galaxies in Champion Reader<br>* Fixed a word sequence in Champion Reader<br>* Minor bug fixes including in monster shop and on maps<br>* Reduced memory load in Champion Reader"},{"version_id":"827700959","version_name":"3.2","version_date":"2018-07-02 07:07:53.000 +0800","version_description":"2 brand new minigames added! Play Space Goblins and Beach Party - excellent for blending and segmenting. Available in Practice mode.<br><br>The Island Kings have been brought to life with a wealth of new animations and expressions. <br><br>Multiple players can now login simultaneously (in the login-mode).<br><br>Music volume has been lowered and phoneme files changed so that letter sounds are easier to hear.<br><br>Small bug fixes, gameplay and usability improvements."},{"version_id":"828331649","version_name":"3.3","version_date":"2019-02-21 09:44:48.000 +0800","version_description":"Thanks to your wonderful feedback and reviews, we’ve made some exciting additions to the app. We read and respond to every review, so please keep them coming.<br><br>FUN NEW THINGS: <br><br>Dress your monster up as a princess, a superhero, a unicorn or a dinosaur!<br><br>Win snazzy new certificates for every game your monster completes.<br><br>You can now play practice mode with logged in monsters and we’ve also improved the interface to make it easier to jump into the game.<br><br>The popular running mini-game has been updated so it’s smoother to play.  <br><br>There are more exciting prizes in the first game and the stars you collect are now carried across all three games.<br><br>Many small bugs have been fixed, including a multi-logout error, a keyboard bug when entering star codes and a proxy-related issue. We’ve also improved our error reporting in case of future ‘monsters in the system’. <br><br>Let us know what you think and please leave a review. We love to hear your success stories and want to know what else you’d like us to add to the game."},{"version_id":"830414724","version_name":"3.4","version_date":"2019-04-26 08:40:57.000 +0800","version_description":"Thanks to your feedback and reviews, we’ve made some additions to the app. We read and respond to every review so please keep them coming.<br><br>New things in this version:<br><br>The new certificates have been brought to life with animation.<br><br>The letter sounds have been made more audible. <br><br>Typos in the third game’s books have been corrected.<br><br>Bugs have been fixed, including one that was causing some users to experience ‘freezing’ at the end of minigames.<br><br>Let us know what you think and please leave a review. We love to hear your success stories and want to know what else you’d like us to add to the game."},{"version_id":"831318160","version_name":"3.5","version_date":"2019-06-11 14:13:30.000 +0800","version_description":"We've made improvements for you. Keep your reviews coming!<br><br>• Collectable stars can now be transferred between games. Save them up or spend them in the shop! <br>• Words are now easier to hear! We know that there can be a whole load of background noise in the home or classroom whilst playing, so we've made the words louder and clearer. <br>• Help messages have been made a bit clearer and, well... more helpful<br><br>We love to read your success stories and we want to know what you’d like added to the game, so please leave a review. As a charity with a mission to improve children's literacy, we want to make this game as great as it can possibly be."},{"version_id":"832173980","version_name":"3.6","version_date":"2019-09-12 08:39:30.000 +0800","version_description":"We've made some improvements based on your feedback. Please keep your reviews coming. We read every one! <br><br>• A glistening trophy icon will magically appear on your dashboard when you've achieved a new certificate!  <br>• The way the game exits when the app is closed has been improved. It's now easier to continue where you left off if you've only exited the app for a few moments. <br>• Small bugs have been blasted away!<br><br>We love to read your success stories and we want to know what you’d like added to the game, so please leave a review. We are a charity with a mission to improve children's literacy, so we want to make this game as great as it can possibly be."},{"version_id":"833215785","version_name":"3.7","version_date":"2019-11-06 17:18:08.000 +0800","version_description":"• As voted by you, a blue tentacled monster has made it's way into the game. You can find these monster body parts when you make a monster or customise your monster during gameplay.<br>• A thunder of dragons has flown in to our third game. These fire-breathers are spread across many planets, so watch out!<br>• A beautiful little animation has been added to the start screen, bringing warmth to the welcome.<br>• The buttons on the title screen are now bigger, making it easier to read them on small devices. <br>• The way the game exits when the app is closed has been improved. We've increased the time before the game goes back to the main menu, so you can continue where you left off if you've only exited the app for a few moments.<br>• Small bugs have been blasted away!<br><br>We love to read your success stories and we want to know what you’d like added to the game. We are a charity with a mission to improve children's literacy, so we want to make this game as great as it can possibly be. Please leave a review, we read every one!"},{"version_id":"833766544","version_name":"3.8","version_date":"2019-12-09 09:49:27.000 +0800","version_description":"• A magical Christmas theme has been added! Get a special Santa costume prize in your monster's inventory.<br><br>• As voted by you, a new monster called Spike, is now available! Find Spike's monster parts when you make a monster or customise your monster.<br><br>• A help button has been added to the home screen to explain a few features.<br><br>• We've made the in-game shop appear more regularly so players can spend their hard-earned stars. Don't worry, there are still absolutely no in-app purchases (it's just for fun)!<br><br>• Small bugs have been blasted away!<br><br>We love to read your success stories and we want to know what you'd like added to the game. We're a charity on a mission to improve children's literacy, so we want to make this game as great as it can possibly be.<br><br>Please leave a review, we read every one!"},{"version_id":"833986414","version_name":"3.8.1","version_date":"2019-12-20 17:28:19.000 +0800","version_description":"• A magical Christmas theme has been added! Get a special Santa costume prize in your monster's inventory.<br><br>• As voted by you, a new monster called Spike, is now available! Find Spike's monster parts when you make a monster or customise your monster.<br><br>• A help button has been added to the home screen to explain a few features.<br><br>• We've made the in-game shop appear more regularly so players can spend their hard-earned stars. Don't worry, there are still absolutely no in-app purchases (it's just for fun)!<br><br>• Small bugs have been blasted away!<br><br>We love to read your success stories and we want to know what you'd like added to the game. We're a non-profit on a mission to improve children's literacy, so we want to make this game as great as it can possibly be.<br><br>Please leave a review, we read every one!"},{"version_id":"834238197","version_name":"3.8.2","version_date":"2020-01-07 23:22:53.000 +0800","version_description":"Small improvements to the app. <br>We want to make this game as great as it can possibly be, so please leave a review, we read every one!"},{"version_id":"834511911","version_name":"3.9","version_date":"2020-03-10 17:11:57.000 +0800","version_description":"PLAY THE NEW MINIGAME - Can you free the villager from the naughty duck in our brand new minigame? Head over to Practice mode to play today! <br><br>ENJOY MAKING YOUR MONSTER - Are you having fun making monsters? The interface has been spruced up a little!<br><br>CHECK OUT THE IMPROVEMENTS - Playing on a smaller screen size? We've made GPCs, words and prizes bigger, so that they're easier to see. We've also made a few smaller improvements, fixed a few bugs and added a little music to our main menu.<br><br>We want to make this game as great as it can possibly be, so please leave a review, we read every one!"},{"version_id":"835277634","version_name":"4.0","version_date":"2020-04-22 16:31:47.000 +0800","version_description":"PLAY 2 NEW MINIGAMES! <br><br>• Play the brand new minigame where you rescue villagers. Kids love this minigame so much that we've made it the first minigame your monster runs into .<br>• Head over to 'Practice' mode to race against the duck professor in a jet pack!<br>• We've also made some small bug fixes along the way. <br><br>We want to make this game as great as it can possibly be, so please leave a review, we read every one!"},{"version_id":"835735307","version_name":"4.0.5","version_date":"2020-04-29 18:41:32.000 +0800","version_description":"PLAY 2 NEW MINIGAMES! \n<br>\n<br>• Play the brand new minigame where you rescue villagers. Kids love this minigame so much that we've made it the first minigame your monster runs into.\n<br>• Head over to 'Practice' mode to race against the duck professor in a jet pack!\n<br>• We've also made some bug fixes along the way including a fix for users reporting crashing within Practice mode and 10 Minute Adventure. \n<br>\n<br>We want to make this game as great as it can possibly be, so please leave a review, we read every one!"},{"version_id":"838395389","version_name":"4.1","version_date":"2020-11-03 12:11:15.000 +0800","version_description":"PLAY THE NEW SPACE BLASTER MINIGAME!\n<br>• Play the brand new Space Blaster minigame, where you mine the asteroids for fuel to get home. Play in Practice mode and tell us what you think!\n<br>• We’ve also made some improvements including new launch and background screens, new VO, adding Lava minigame into the second game ‘Fun with words’ and permitting special characters and hyphens for player names.\n<br>We want to make this game as great as it can possibly be, so please leave a review, we read every one!"}]