[{"version_id":"712252682","version_name":"2.0.4","version_date":"","version_description":""},{"version_id":"813546368","version_name":"2.2.3","version_date":"2015-10-05 20:10:33.000 +0800","version_description":"Bug Fixes:<br><br>• Corrects a crash that occurred when loading an existing project from one of the song selection screens.<br>•&nbsp;Thank-you for submitting your crash logs when prompted. You all rock!"},{"version_id":"815285740","version_name":"2.3","version_date":"2015-12-16 05:00:33.000 +0800","version_description":"We have worked very hard over the past few months to bring you new features and much-needed enhancements to your favorite song learning and practice tool!<br><br>The biggest news in this release is Isolation. It completely replaces our old effects, and is powered by Neptune: our powerful new audio isolation engine that helps you isolate or eliminate guitars, bass, vocals, and anything else you're trying to hear more clearly. You'll find it in the spot where the effects used to be, in the In-Song Settings. When enabled, just sweep the panning slider around to find the instrument you're after, and tweak the width and frequency range to narrow in on the sound. See the included help file for more details on using Isolation in Capo.<br><br>Just like Capo on the Mac, Capo touch now also ships with our all-new guitar samples that make auditioning chords much more pleasant than before, and offer a richer overall experience. Gone are the tiny little hard-to-hear samples that didn't even play at the correct octave! (Sorry about that…)<br><br>We also spent a lot of time fixing parts of the interface to make way for multitasking and the brand-new system font that was introduced in iOS 9. This release also natively supports the new iPad Pro so that Capo will appear just as crisp and beautiful as ever, and it responds correctly to splitting the screen so you can load audio files stored in iCloud Drive, or other apps that support \"Open In…\" functionality. <br><br>We also took care to support Dynamic Type in various parts of Capo's UI. So if you like to use a larger text size on your phone (hey—we're all getting older!), you'll really appreciate the work we did on that front.<br><br>And finally, we fixed so many little bugs and crashes all over the place to make Capo better overall. Crashes are much easier to fix thanks to your crash submissions, so we'd like to thank you again for sending those in. Rock on!<br><br>Please note that Capo touch 2.3 requires iOS 9 or later."},{"version_id":"815989473","version_name":"2.3.1","version_date":"2016-01-17 21:41:57.000 +0800","version_description":"This update resolves an issue that led to the UI locking up in certain circumstances. In addition, we resolved a few nasty crashes. Thanks for your submissions and emails—you all rock!<br><br>NOTE: If you have an iPad 2 or iPad mini, install Capo to your device using iTunes on a Mac or PC to get rid of the \"huge numbers\" bug—we have reported the issue to Apple and hope it is resolved soon."},{"version_id":"816276829","version_name":"2.3.2","version_date":"2016-02-03 03:52:50.000 +0800","version_description":"This update carries a rather large fix that's been long overdue—Capo is now _at least_ 90% less wrong about reporting sharps and flats for your keys, and their respective chords! We apologize that it took so long, but we're pretty sure we have this nailed down now.<br><br>In addition, Capo touch should no longer lock up when choosing songs from the Songs list, or the Albums detail view. Capo now also correctly handles a very rare issue where certain audio files resulted in no chord detection results at all."},{"version_id":"818755693","version_name":"2.3.3","version_date":"2016-09-06 15:17:55.000 +0800","version_description":"This update fixes some of our most common crashes, and addresses the following bugs:<br><br>•&nbsp;Corrected the \"large digits\" issue on iPad 2 and iPad mini devices<br>•&nbsp;Songs with backslashes in their title should load properly once again<br>•&nbsp;When selecting a song that Capo cannot load, Capo now displays an error message rather than crashing<br>•&nbsp;Made the settings popover taller on iPad devices, so scrolling is not required to adjust isolation settings<br>•&nbsp;The Heads-Up Display no longer zeroes out after rotating the device<br>•&nbsp;While pressing and holding the timeline to enter the downbeat shifting mode, the timeline now remains blue<br>•&nbsp;The frequency control label now displays the correct text when the isolation effect controls are shown before playback starts<br>•&nbsp;The Capo logo no longer jumps during the onboarding animation<br>•&nbsp;Corrected margins in the chord chooser display<br>•&nbsp;Fixed the alignment of chord selection labels<br>•&nbsp;Corrected the alignment of the time display image"},{"version_id":"818845503","version_name":"2.3.4","version_date":"2016-09-16 17:59:15.000 +0800","version_description":"Bug Fixes:<br><br>•&nbsp;Corrects an issue that could lead to a lock-up when playing documents saved with note entries on the Mac<br>•&nbsp;Improves the timing of the metronome sound playback"},{"version_id":"819665118","version_name":"2.4","version_date":"2016-11-17 13:49:45.000 +0800","version_description":"Enhancements:<br><br>• The Artists, Albums, and Songs lists have been moved to a new \"My Music\" tab where you can browse your music collection.<br><br>• The \"My Music\" tab now includes playlist browsing!<br><br>• Re-added search to the Projects and all the \"My Music\" browsing screens<br><br>• Major changes to the iCloud code will resolve a number of issues ranging from flickering to not displaying anything for too long<br><br>• The \"Now Playing\" alert now respects your preferred system font size<br><br>• We spent some time scrubbing the User Guide in the Settings tab, and included more information about interacting with your music library<br><br>• Keyboard shortcuts for iPad users! There's not a whole lot of commands right now, but enough to make life with a keyboard more fun. As with other apps, hold the command key to see a list of what we currently offer. Send us feedback from the Settings tab to request more!<br><br>Bug Fixes:<br><br>• Songs with \"problematic characters\" in their titles no longer cause Capo to crash<br><br>• Capo now correctly asks for permission to browse your media library if it hasn't already been granted access, and the \"Uh oh!\" screens have been modified to provide more helpful recovery information.<br><br>• If an incoming call is received during playback, Capo no longer forces you to \"reset\" the project by exiting and re-entering it<br><br>• Upon fixing the \"incorrectly sized digits\" for iPad 2 users, we inadvertently shrunk them for Plus-sized iPhone users. Digits should display correctly for everyone, now.<br><br>• When a song is tapped in the music collection browsers, the importing status is now shown so you know something's happening on slower devices.<br><br>• When certain files fail to import, the failure is caught before entering the in-song view rather than leading to a crash.<br><br>• There were a few crashes related to state restoration (when Capo was quit/backgrounded, and then relaunched) that have been resolved<br><br>If you're enjoying Capo, show us some love by leaving a 5-star rating in the App Store! Or, use the support link to let us know how we can make Capo even better for you."},{"version_id":"822021855","version_name":"2.4.1","version_date":"2017-05-08 14:34:11.000 +0800","version_description":"This release fixes a number of our most \"popular\" crashes and bug reports. Thanks for all your feedback and bug submissions!!<br><br>Bug Fixes:<br><br>• A number of crashes that occurred when sending Capo to the background have been resolved.<br>• Fixes a crash when importing certain M4A audio files from other apps<br>• A number of bugs related to searching projects and songs have been fixed<br>• When deleting chords, they now disappear correctly!<br>• Resolved a layout issue that caused the song title to display incorrectly in landscape mode<br>• When entering the in-song view, there are now fewer abrupt layout changes<br>• While scrolling the heads-up display pages, the waveform and timer no longer pause<br>• Corrected an issue that led to incorrect state restoration behavior in the in-song view that could lead to a crash<br>• In the Settings screen, tapping 'Write a Review' now takes you directly to the relevant spot in the App Store app. (How about you help us test that one? *nudge, nudge*)<br><br>Notes from the Developer:<br><br>Sorry it's been so long since the last update! I've been working really hard on some great new features for a future release, and in doing so I've learned a whole lot of new stuff that helped me clean up some code and fix many of the above issues in the process. <br><br>Please keep those feedback emails coming, and help us out by leaving a review in the store! Your feedback helps us shape future releases, and lets us know that we're on the right track."},{"version_id":"822391999","version_name":"2.5","version_date":"2017-07-26 04:00:26.000 +0800","version_description":"This update is huge! Read on to see all the improvements that help make the best music learning app for iOS even better.<br><br>New Features:<br><br>•&nbsp;Integrated iTunes Purchases - Capo doesn’t want to get in the way of your music discovery, so now it displays *all* the songs that are in your iCloud Music Library, even if you added them from the vast Apple Music catalog. When Capo encounters a song you don’t own, you can now buy it quickly on the iTunes Store and have it ready to learn once it’s done downloading. Fast and easy!<br><br>•&nbsp;Open in Music - When the songs you own are stored in the cloud, Capo can now take you directly to the track in the Music app so you can download it to your device and make it available to Capo soon after. This is a *huge* time saver compared to previous releases.<br><br>•&nbsp;Improved Audio Scrubbing - During playback, seeking through the song by swiping the waveform will start Capo’s “Audio Freezer” scrubbing engine. Scrolling slowly will let you focus on specific sounds.<br><br>•&nbsp;Import audio files directly from iCloud, Dropbox, and more  - Capo now uses the system-wide document provider extensions to give you easy access to audio files stored in the cloud. Quickly download shared stems and early mixes from your collaborators and band mates that you can work immediately without leaving the comfort of Capo.<br><br>User-Requested Improvements:<br><br>•&nbsp;Jump to Beginning and End Gestures - Many users have asked for a way to get to the start of the song quickly, and we made it simple to do. Just double-tap the left or right edge of the waveform to jump to the start or end of the song.<br><br>•&nbsp;Toggle snapping while adjusting regions - You can now drag your finger above or below the regions’ resize handles to disable beat snapping for songs that do not follow Capo’s detected beat grid.<br><br>Enhancements:<br><br>•&nbsp;We've added a “What's New” onboarding experience that allows us to share exciting new features with our customers in video form as we continue to add more of them in future updates. You can get back to these videos at any time from Settings.<br><br>•&nbsp;All-new project browsing - We overhauled the project list to provide a faster, and far more useful view of your projects. Projects can now be sorted by modification date (keeping the newest at the top), or title, and of course they can be searched as well.<br><br>•&nbsp;Increment and decrement buttons for speed and pitch - Just tap the + and - buttons on either side of the speed and pitch slider to increment their values by either 1%, or one semitone at a time. A small improvement, but very handy!<br><br>Bug Fixes:<br><br>•&nbsp; Capo no longer deletes markers that were saved in Capo 3 on the Mac<br>•&nbsp; The playhead location is properly restored when re-opening a project<br>•&nbsp; Capo now reports playback position on the Now Playing screen<br>•&nbsp; When closing a project, Capo no longer appears on the Now Playing screen in Control Center<br>•&nbsp; The playhead no longer jumps around when starting playback<br>•&nbsp; The section headers (aka “The alphabet”) in My Music views no longer appear when there are too few items to jump between<br>•&nbsp; Plus-sized phones will no longer display the iPad-sized region titles in landscape<br>•&nbsp; Fixed all of our top crashes. Thanks for all your submissions and feedback!"},{"version_id":"823102771","version_name":"2.5.1","version_date":"2017-08-02 23:13:02.000 +0800","version_description":"Enhancements:<br><br>•&nbsp;Improved the accessibility descriptions for songs while browsing My Music<br>• Exposed the audio scrubbing interface for users that rely on VoiceOver, including the current chord and song location when scrubbing stops and/or playback stops<br><br>Bug Fixes:<br><br>•&nbsp;Fixed a crash that affected users running iOS 9.3 when attempting to create a new project<br>•&nbsp;Corrected the Getting Started UI layout for the 10.5\" iPad Pro"},{"version_id":"823326550","version_name":"2.6","version_date":"2017-09-25 14:53:27.000 +0800","version_description":"New Features (Only on iOS 11): <br><br>•&nbsp;We've integrated the all-new document browser that was introduced in iOS 11. We think our users will really enjoy the level of organization (folders, tags, renaming, etc.) that comes with this change.<br><br>•&nbsp;As with all apps that support the new document browser, Capo touch can load its projects from the Files app, and displays your recently-opened Projects when you press &amp; hold on its app icon.<br><br>Enhancements:<br><br>•&nbsp;When creating a new project, a tabbed view will now be shown with 'My Music' alongside a new 'Import Audio' tab that replaces the selection of file sources that was introduced in version 2.5. This was made necessary by changes to iOS 11, but we think it's quite a nice improvement—and it saves you a tap in many cases!<br><br>Subscriptions:<br><br>•&nbsp;Capo touch now offers a subscription to unlock all its current features as well as exclusive, subscriber-only features that we will be adding in the future.<br><br>•&nbsp;NOTE TO EXISTING CUSTOMERS: If you already paid to download Capo touch, a subscription is completely optional! You will continue to have access to all the features that you paid for, as well as any updates and improvements to them in the future. In case you're asked to subscribe after installing this update, just restore your purchases and everything will return to how it was. Thanks for your support!<br><br>•&nbsp;NOTE TO OUR *SUPER-FANS*: While subscriptions are not _required_, you are still welcome to offer your support by purchasing a discounted upgrade subscription in advance of the subscriber-only features being offered. Think of it as a tip jar with benefits-to-come! :)"},{"version_id":"824068910","version_name":"2.7","version_date":"2017-11-02 20:11:15.000 +0800","version_description":"This release adds the all-new Control Strip, the Transcription Playhead, improved Region looping, and more!<br><br>New Features:<br><br>•&nbsp;The new Control Strip lives inside the Heads-Up Display (HUD) and groups related buttons together into sets. Tapping the Control Strip Selector beside the time display lets you switch sets, and a long press reveals a menu to switch between sets quickly. This new design allows us to keep extending Capo touch with even more features, so we're really excited to finally ship it!<br><br>•&nbsp;We've added the Transcription Playhead that we first introduced in Capo on macOS. The Transcription Playhead allows you to lock the playhead into position so that every time you press Play, the song starts from the same point. This is very handy when you are listening carefully and want to hear a single note, chord, or riff repeatedly while you're trying to identify what note(s) to play.<br><br>•&nbsp;The new Mixer allows you to set the playback volume in Capo touch independently from the metronome and the sound of chords when they're tapped. This feature is helpful when the metronome is difficult to hear over an especially loud song, or if you'd like to play Capo's audio alongside your favorite guitar amp simulation apps.<br><br>•&nbsp;You can now adjust the playback pitch of a song using a separate slider that's dedicated to this purpose. Adjustments can be made between -100 and +100 cents, which is equivalent to a semitone in either direction. We know it took a very long to introduce this feature, but the Control Strip made it possible to do it *properly*!<br><br>New Subscriber-Only Features:<br><br>•&nbsp;None! The new features in this release are available to all our existing customers, so enjoy!<br><br>Enhancements:<br><br>•&nbsp;Region looping is now much easier to use! Similar to the macOS version of Capo, looping a region is now enabled by simply selecting it. The play button will change to indicate that Capo touch will loop the selected region, and tapping it starts your loop immediately!<br><br>•&nbsp;We added controls for Regions and Chords that allow you to move around the song using a left and right arrow to quickly move around the entries stored in your Project. You'll find these in the respective sets of controls in the Control Strip.<br><br>•&nbsp;While working on some future improvements, we spent some quality time with the isolation engine and tweaked our approach a little bit to improve the sound quality of the effect. Let us know what you think!<br><br>Bug Fixes:<br><br>•&nbsp;The \"Open In\" functionality in iOS 10.3 has been restored for all you folks that like to import audio files from other apps (such as Mail, Dropbox, etc.) We apologize for any trouble that we caused with this bug in the last update!<br><br>•&nbsp;We addressed an issue that led to the isolation's power display to appear flipped, causing energy on the right side to appear on the left, and vice versa. This is now resolved, and we regret any error/confusion that was caused.<br><br>•&nbsp;The top crashes were addressed, and we appreciate all your submissions and feedback. Keep it coming so we can keep making the app better with each new update!<br><br>Please leave us a review on the App Store to let us know how you're enjoying Capo touch and the new update. All your positive reviews are helpful to our success on the App Store, and your good vibes help us stay motivated while continue to release more great updates!"},{"version_id":"825616491","version_name":"2.7.1","version_date":"2018-03-08 20:47:24.000 +0800","version_description":"We spent a lot of time reworking the music processing pipeline that powers Capo’s chord, beat, and key detection. This work should improve the overall accuracy of Capo’s results, and it paves the way for some features that we plan to add in the coming months.<br><br>To help celebrate these improvements, we’ve expanded the trial to allow access to the chord detection results and increased the playback timer to 60 seconds!<br><br>Note: If you’re running an older device, you may notice that it now takes longer to process songs when they are first imported—Capo’s doing a *lot* more detailed analysis than before, so this is to be expected. We hope to improve this in future updates, so stay tuned!<br><br>Enhancements: <br><br>•&nbsp;When operating in trial mode, Capo now indicates the remaining playback time and provides a brief explanation of the trial limitations<br><br>Bug Fixes:<br><br>•&nbsp;The “Capo Needs Your Help” window no longer gets stuck after trying to download songs from the cloud<br>•&nbsp;When browsing through your music collection, the search bar should no longer get lost after navigating into one of the Albums, Artists, or Playlist search results<br>•&nbsp;We’ve restored the ability to rename regions—sorry about that!<br>•&nbsp;On iPad devices with keyboards, the play/pause and region shortcut keys have been fixed<br>•&nbsp;With songs that have too-long titles, the back button should no longer be obscured<br>•&nbsp;Audio controls on the lock screen should be working correctly once again<br>•&nbsp;Tapping outside the Control Strip's quick selection menu will now dismiss it<br>•&nbsp;When switching outside of Capo to another app, and then back, the chord sounds are no longer muted<br>•&nbsp;After loading a project that had muted chords set in the Mixer, new projects will no longer have muted chords<br><br>We love hearing from our customers, so please leave a review on the App Store to share your positive experiences with others, or send us a support email if you have any questions for us. We're listening, and appreciate all your bug reports and feedback!"},{"version_id":"826422867","version_name":"2.7.2","version_date":"2018-03-23 22:43:37.000 +0800","version_description":"Bug Fixes:<br><br>•&nbsp;Custom-applied chord shapes that were saved using previous releases should now appear as they were originally saved.<br>• This build also fixes our longest-standing top crasher. Thanks to everyone that submitted their crash reports—keep 'em coming!<br><br>We love hearing from our customers, so please leave a review on the App Store to share your positive experiences with others, or send us a support email if you have any questions for us. We're listening, and appreciate all your bug reports and feedback!"},{"version_id":"827095033","version_name":"2.8","version_date":"2018-06-27 20:04:39.000 +0800","version_description":"*** 新功能 ***<br><br>* 新增 7 种语言支持！ -- 本次更新包含法语、意大利语、德语、西班牙语、日语、简体中文、繁体中文语言界面。 我们希望今后继续增加对更多语言的支持，如果您有其他语言需求，请与我们联系！<br><br>* （简单）钢琴和弦 -- Capo 现在可以用你熟悉的键盘图显示和弦。 和弦中音符的展示方式让你更容易的创作自己的和弦。<br><br>* 改进吉他和弦显示 -- 我们通过加粗字体并调整了吉他指板风格，让 Capo 的和弦更容易阅读。 我们也进行了大量的研发，让和弦显示形式在 iOS 和 macOS 版本的 Capo 上保持一致。<br><br>* 更多和弦视图选项 -- 除了显示类似钢琴风格的和弦图示，Capo 现在也可设置为只显示和弦名称甚至完全隐藏和弦——就像 macOS 版本上的一样！<br><br>*** 改进 ***<br><br>* 左手和弦显示设置现在与其他和弦相关的显示设置一样位于记号显示设置中（也就是 歌曲内视图中屏幕右上角的按钮。）<br><br>*** Bug 修复 ***<br><br>* 在编辑和弦时，空和弦记录不再出现在结果中。<br>* 在检测和添加新和弦时不会再出现空的和弦指法图。<br>* Capo 在尝试加载损坏或不支持的音频文件失败时不会再导致崩溃。<br><br>我们乐于倾听用户的声音，欢迎在 App Store 为我们评价和评分，与他人分享你的体验，或直接向我们发送邮件寻求技术支持和疑难解答。 我们会持续关注用户的意见，感谢大家的报告和反馈！"},{"version_id":"827745731","version_name":"2.8.1","version_date":"2018-07-03 13:40:45.000 +0800","version_description":"*** 新功能 ***<br><br>* 新增 7 种语言支持！ -- 本次更新包含法语、意大利语、德语、西班牙语、日语、简体中文、繁体中文语言界面。 我们希望今后继续增加对更多语言的支持，如果您有其他语言需求，请与我们联系！<br><br>* （简单）钢琴和弦 -- Capo 现在可以用你熟悉的键盘图显示和弦。 和弦中音符的展示方式让你更容易的创作自己的和弦。<br><br>* 改进吉他和弦显示 -- 我们通过加粗字体并调整了吉他指板风格，让 Capo 的和弦更容易阅读。 我们也进行了大量的研发，让和弦显示形式在 iOS 和 macOS 版本的 Capo 上保持一致。<br><br>* 更多和弦视图选项 -- 除了显示类似钢琴风格的和弦图示，Capo 现在也可设置为只显示和弦名称甚至完全隐藏和弦——就像 macOS 版本上的一样！<br><br>*** 改进 ***<br><br>* 左手和弦显示设置现在与其他和弦相关的显示设置一样位于记号显示设置中（也就是 歌曲内视图中屏幕右上角的按钮。）<br><br>*** Bug 修复 ***<br><br>* 在编辑和弦时，空和弦记录不再出现在结果中。<br>* 在检测和添加新和弦时不会再出现空的和弦指法图。<br>* Capo 在尝试加载损坏或不支持的音频文件失败时不会再导致崩溃。<br><br>我们乐于倾听用户的声音，欢迎在 App Store 为我们评价和评分，与他人分享你的体验，或直接向我们发送邮件寻求技术支持和疑难解答。 我们会持续关注用户的意见，感谢大家的报告和反馈！"},{"version_id":"827865680","version_name":"2.8.2","version_date":"2018-07-13 16:57:14.000 +0800","version_description":"*** 新功能 ***<br><br>* 新增 7 种语言支持！ -- 本次更新包含法语、意大利语、德语、西班牙语、日语、简体中文、繁体中文语言界面。 我们希望今后继续增加对更多语言的支持，如果您有其他语言需求，请与我们联系！<br><br>* （简单）钢琴和弦 -- Capo 现在可以用你熟悉的键盘图显示和弦。 和弦中音符的展示方式让你更容易的创作自己的和弦。<br><br>* 改进吉他和弦显示 -- 我们通过加粗字体并调整了吉他指板风格，让 Capo 的和弦更容易阅读。 我们也进行了大量的研发，让和弦显示形式在 iOS 和 macOS 版本的 Capo 上保持一致。<br><br>* 更多和弦视图选项 -- 除了显示类似钢琴风格的和弦图示，Capo 现在也可设置为只显示和弦名称甚至完全隐藏和弦——就像 macOS 版本上的一样！<br><br>*** 改进 ***<br><br>* 左手和弦显示设置现在与其他和弦相关的显示设置一样位于记号显示设置中（也就是 歌曲内视图中屏幕右上角的按钮。）<br><br>*** Bug 修复 ***<br><br>* 在编辑和弦时，空和弦记录不再出现在结果中。<br>* 在检测和添加新和弦时不会再出现空的和弦指法图。<br>* Capo 在尝试加载损坏或不支持的音频文件失败时不会再导致崩溃。<br><br>我们乐于倾听用户的声音，欢迎在 App Store 为我们评价和评分，与他人分享你的体验，或直接向我们发送邮件寻求技术支持和疑难解答。 我们会持续关注用户的意见，感谢大家的报告和反馈！"},{"version_id":"828321207","version_name":"2.10.2","version_date":"2019-10-19 13:44:24.000 +0800","version_description":"此更新还包含许多基于用户反馈和崩溃提交的错误修复和改进。\n<br>\n<br>我们乐于倾听用户的声音，欢迎在 App Store 为我们评价和评分，与他人分享你的体验，或直接向我们发送邮件寻求技术支持和疑难解答。 我们会持续关注用户的意见，感谢大家的报告和反馈！\n<br>\n<br>ENHANCEMENTS\n<br>\n<br>- Attention Platinum subscribers! Activation across all your devices is now automatic, and no longer requires the use of activation codes. Please ensure that iCloud Drive is enabled on all the iOS and macOS devices that you wish to activate, and all devices are updated to the latest version of Capo.\n<br>\n<br>BUG FIXES\n<br>\n<br>- Fixed the most common crashes that were reported by users. Thanks for your submissions and feedback!"},{"version_id":"828321207","version_name":"2.10.1","version_date":"2019-09-27 19:37:46.000 +0800","version_description":"此更新还包含许多基于用户反馈和崩溃提交的错误修复和改进。\n<br>\n<br>我们乐于倾听用户的声音，欢迎在 App Store 为我们评价和评分，与他人分享你的体验，或直接向我们发送邮件寻求技术支持和疑难解答。 我们会持续关注用户的意见，感谢大家的报告和反馈！\n<br>\n<br>BUG FIXES\n<br>\n<br>- Capo no longer crashes for those users that updated to iOS 13, and were unable to browse their music library.\n<br>- When editing certain chords, Capo will no longer crash while trying to present the new Chord Chooser.\n<br>- While snapping is enabled, Capo's haptic feedback no longer triggers excessively when resizing regions or moving markers.\n<br>- On certain models of iPhone, the Chord Chooser no longer disappears briefly after it is presented in the landscape orientation."},{"version_id":"828321207","version_name":"2.8.3","version_date":"2018-08-23 21:49:44.000 +0800","version_description":"This update addresses the most commonly-reported crashes. Thanks for all your submissions and feedback!"},{"version_id":"828715199","version_name":"2.9","version_date":"2018-12-13 08:33:46.000 +0800","version_description":"- 标记！ 我们终于把这个热门功能从 macOS 的 Capo 移植到了 Capo touch 上。 您将在控制条上找到使用相关功能的按键。\n<br>- 全新 Capo Platinum 订阅服务让您同时解锁 macOS 版 Capo 3 全部功能和 Capo touch 的全部 Pro 功能。\n<br>\n<br>此更新还包含许多基于用户反馈和崩溃提交的错误修复和改进。\n<br>\n<br>我们乐于倾听用户的声音，欢迎在 App Store 为我们评价和评分，与他人分享你的体验，或直接向我们发送邮件寻求技术支持和疑难解答。 我们会持续关注用户的意见，感谢大家的报告和反馈！"},{"version_id":"829654385","version_name":"2.9.1","version_date":"2019-01-08 20:29:50.000 +0800","version_description":"此更新包含基于用户反馈和崩溃提交的错误修复和改进。<br><br>我们乐于倾听用户的声音，欢迎在 App Store 为我们评价和评分，与他人分享你的体验，或直接向我们发送邮件寻求技术支持和疑难解答。 我们会持续关注用户的意见，感谢大家的报告和反馈！<br><br>BUG FIXES<br><br>- Fixed an issue that caused Capo to get stuck when the “Create a Project” UI was requested at the same time that a project was being opened.<br>- When browsing the Music library, Capo no longer fails to align the track items when displaying album or artist detail views.<br>- Album header views displayed in the artist detail, or album detail lists are now correctly truncated while browsing the Music library.<br>- Fixed a (rather uncommon) crash that occurred while Capo was saving new documents."},{"version_id":"830050311","version_name":"2.9.2","version_date":"2019-03-01 20:55:10.000 +0800","version_description":"此更新还包含许多基于用户反馈和崩溃提交的错误修复和改进。<br><br>我们乐于倾听用户的声音，欢迎在 App Store 为我们评价和评分，与他人分享你的体验，或直接向我们发送邮件寻求技术支持和疑难解答。 我们会持续关注用户的意见，感谢大家的报告和反馈！<br><br>ENHANCEMENTS<br><br>- Markers can now be dragged along the timeline, with similar snapping behavior to regions.<br>- We spent a lot of time improving the performance of the main timeline UI, and you should notice smoother frame rates while scrolling and zooming.<br>- We also improved the performance of the initial key, beat, and chord detection process that runs when loading new songs into Capo. Many of the individual tasks now run up to 10x faster than previous versions!<br><br>BUG FIXES<br><br>- The waveform on the timeline should no longer flicker or display any other visual artifacts while zooming or scrolling.<br>- Capo no longer displays “floating resize handles” for invisible regions.<br>- When displaying the notation settings popover on iPad, the chords on the timeline will no longer appear to flicker.<br>- When saving documents in Capo touch that are shared between Mac and iOS versions, the document’s window state on the Mac should no longer get overwritten.<br>- Capo no longer crashes when loading extremely short audio files.<br>- In certain (rare) situations, Capo should no longer crash while loading existing projects."},{"version_id":"830510445","version_name":"2.9.3","version_date":"2019-03-26 22:17:48.000 +0800","version_description":"此更新还包含许多基于用户反馈和崩溃提交的错误修复和改进。\n<br>\n<br>我们乐于倾听用户的声音，欢迎在 App Store 为我们评价和评分，与他人分享你的体验，或直接向我们发送邮件寻求技术支持和疑难解答。 我们会持续关注用户的意见，感谢大家的报告和反馈！\n<br>\n<br>ENHANCEMENTS\n<br>\n<br>- When you tap on the time position in the Heads-Up Display to switch between bar/beat and time displays, the timeline now also updates to reflect the current position display mode.\n<br>- When searching for inversions (a.k.a. “slash chords”) such as D/A in the chord chooser, Capo now provides results that include all the inversions available in the chord once you type the “/“ character.\n<br>- The progress meter that is displayed during the song analysis now updates more smoothly as the calculations are happening, and should better reflect the weight of the individual processing steps.\n<br>\n<br>BUG FIXES\n<br>\n<br>- Certain inversions (Dm/C, D/A) are no longer missing important/common shapes in the chord chooser\n<br>- Capo no longer includes shapes in the chord chooser that are missing the specified bass note in their inversions (e.g. D/A no longer includes a straight, open D shape)\n<br>- Chords will no longer flicker when displaying the notation settings UI with a capo applied"},{"version_id":"832064174","version_name":"2.10","version_date":"2019-09-19 12:33:47.000 +0800","version_description":"此更新还包含许多基于用户反馈和崩溃提交的错误修复和改进。\n<br>\n<br>我们乐于倾听用户的声音，欢迎在 App Store 为我们评价和评分，与他人分享你的体验，或直接向我们发送邮件寻求技术支持和疑难解答。 我们会持续关注用户的意见，感谢大家的报告和反馈！\n<br>\n<br>NEW FEATURES\n<br>\n<br>- Dark Mode: On iOS 13, Capo supports the new system-wide Dark appearance!\n<br>\n<br>- New Chord Chooser: After upgrading to iOS 13, you will also be treated to an all-new chord editing experience. We re-designed it to be faster, easier to use, and to reflect your preferred chord display mode.\n<br>\n<br>ENHANCEMENTS\n<br>\n<br>- Recently Played Songs: In addition to browsing by Album, Artist, or Playlist, you can now select songs based on the date they were last played.\n<br>\n<br>BUG FIXES\n<br>\n<br>- Capo should no longer take you to the Music app instead of the iTunes Store when you tap the \"Buy on iTunes\" button while browsing your music library."},{"version_id":"832907948","version_name":"2.10.1","version_date":"2019-09-27 19:37:46.000 +0800","version_description":"此更新还包含许多基于用户反馈和崩溃提交的错误修复和改进。\n<br>\n<br>我们乐于倾听用户的声音，欢迎在 App Store 为我们评价和评分，与他人分享你的体验，或直接向我们发送邮件寻求技术支持和疑难解答。 我们会持续关注用户的意见，感谢大家的报告和反馈！\n<br>\n<br>BUG FIXES\n<br>\n<br>- Capo no longer crashes for those users that updated to iOS 13, and were unable to browse their music library.\n<br>- When editing certain chords, Capo will no longer crash while trying to present the new Chord Chooser.\n<br>- While snapping is enabled, Capo's haptic feedback no longer triggers excessively when resizing regions or moving markers.\n<br>- On certain models of iPhone, the Chord Chooser no longer disappears briefly after it is presented in the landscape orientation."},{"version_id":"833081926","version_name":"2.10.2","version_date":"2019-10-19 13:44:24.000 +0800","version_description":"此更新还包含许多基于用户反馈和崩溃提交的错误修复和改进。\n<br>\n<br>我们乐于倾听用户的声音，欢迎在 App Store 为我们评价和评分，与他人分享你的体验，或直接向我们发送邮件寻求技术支持和疑难解答。 我们会持续关注用户的意见，感谢大家的报告和反馈！\n<br>\n<br>ENHANCEMENTS\n<br>\n<br>- Attention Platinum subscribers! Activation across all your devices is now automatic, and no longer requires the use of activation codes. Please ensure that iCloud Drive is enabled on all the iOS and macOS devices that you wish to activate, and all devices are updated to the latest version of Capo.\n<br>\n<br>BUG FIXES\n<br>\n<br>- Fixed the most common crashes that were reported by users. Thanks for your submissions and feedback!"},{"version_id":"839284624","version_name":"4.0.1","version_date":"2020-11-20 11:47:46.000 +0800","version_description":"此更新包含基于用户反馈和崩溃提交的错误修复和改进。<br><br>BUG FIXES<br><br>* Capo no longer crashes when creating or loading projects on A7-powered devices (iPad Air, iPad mini 2, iPad mini 3, iPhone 5S)<br><br>我们乐于倾听用户的声音，欢迎在 App Store 为我们评价和评分，与他人分享你的体验，或直接向我们发送邮件寻求技术支持和疑难解答。 我们会持续关注用户的意见，感谢大家的报告和反馈！"},{"version_id":"839576978","version_name":"4.0.2","version_date":"2020-12-11 23:52:50.000 +0800","version_description":"此更新包含基于用户反馈和崩溃提交的错误修复和改进。<br><br>BUG FIXES<br><br>* When seeking to the start of the song using the new Go To Location feature in the Structure or Chords song views, the display is now correctly scrolled to the top.<br>* Capo now correctly auto-scrolls to the currently playing bar in the Structure and Chords song views after creating new sections.<br>* In landscape mode on larger iPhones, the controls in the isolation UI are no longer clipped out of view.<br>* Capo will now return results for music library searches that include apostrophes and other punctuation characters.<br>* When editing the location of bars in landscape mode on iPhone, the display is no longer clipped and drawn outside the bounds of the screen.<br>* We addressed some of the crashes that were submitted by users since the last release. Please keep sending us your bug reports!<br><br>我们乐于倾听用户的声音，欢迎在 App Store 为我们评价和评分，与他人分享你的体验，或直接向我们发送邮件寻求技术支持和疑难解答。 我们会持续关注用户的意见，感谢大家的报告和反馈！"},{"version_id":"840444480","version_name":"4.1","version_date":"2021-02-10 22:41:08.000 +0800","version_description":"此更新包含基于用户反馈和崩溃提交的错误修复和改进。<br><br>NEW FEATURES<br><br>* Using Handoff, you can easily continue your work on projects that are stored in iCloud when switching between your Mac, iPhone, and iPad.<br><br>ENHANCEMENTS<br><br>* You can now import from FLAC audio files when creating a new project.<br><br>BUG FIXES<br><br>* Capo no longer allows an existing project to continue playing in the background when a new project is loaded using the Recents list on an iPad.<br>* We addressed some of the crashes that were submitted by users since the last release. Please keep sending us your bug reports!<br><br>我们乐于倾听用户的声音，欢迎在 App Store 为我们评价和评分，与他人分享你的体验，或直接向我们发送邮件寻求技术支持和疑难解答。 我们会持续关注用户的意见，感谢大家的报告和反馈！"},{"version_id":"841046153","version_name":"4.1.1","version_date":"2021-03-24 23:57:19.000 +0800","version_description":"此更新包含基于用户反馈和崩溃提交的错误修复和改进。<br><br>BUG FIXES<br><br>* Capo no longer crashes when activating the song scrubbing feature with certain audio files.<br>* The song scrubber is no longer silent when using audio files that have a 96kHz sample rate.<br><br>我们乐于倾听用户的声音，欢迎在 App Store 为我们评价和评分，与他人分享你的体验，或直接向我们发送邮件寻求技术支持和疑难解答。 我们会持续关注用户的意见，感谢大家的报告和反馈！"}]