[{"version_id":"812629009","version_name":"1.5","version_date":"2015-07-09 18:35:56.000 +0800","version_description":"Version 1.5 adds the much-requested key-press feedback, and fixes an iPad bug. We're now starting work on version 2.0, which will be a major upgrade re-coded from scratch with an auto-complete bar and even quicker access to numbers, symbols, and more. For updates on our progress, join our email list at herokeyboard.com."},{"version_id":"820474089","version_name":"2.0","version_date":"2017-01-19 16:51:34.000 +0800","version_description":"HERO v2.0 is completely re-coded from scratch for better typing action. Basic typing is free! Subscribe for just $0.99/month for more themes and the full emoji, number, and symbol views. New features are:<br>- An auto-complete bar.<br>- Tilt iPhone 6/6+ or iPad to slide the keyboard toward your thumb for easy 1-thumb typing.<br>- Tap the center bolt to enter a SPACE. Hold or 3D-Touch the bolt then drag for quick access to numbers, symbols, emojis, and cursor control. <br>- Smarter emoji categories (for subscribers)<br>- There's no drag-to-type (yet!)<br><br>I hope you like it -- please post your suggestions on the new HERO User Group (linked from the app).<br>Thanks!<br>Corey"},{"version_id":"821628702","version_name":"2.1","version_date":"2017-04-07 20:27:55.000 +0800","version_description":"Version 2.1 has:<br>- A \"SpeedTest\" tab, where you can do 1-minute tests of your typing speed on HERO and QWERTY.<br>- Two new themes: Rose Gold, and Superclean White. (You can always suggest new themes on the HERO Users Facebook Group!)<br>- Better Autosuggest and Autocomplete.<br><br>Thanks for supporting HERO!"},{"version_id":"822314540","version_name":"2.2","version_date":"2017-07-14 17:02:59.000 +0800","version_description":"- All features are now unlocked!<br>- No more subscription model for themes (current subscribers: see support.herokeyboard.com for how to convert your subscription free)<br>- An optional \"Zoomed\" view if you want the keyboard to fill the entire width on iPhone 6, 7, and Plus.<br>- Fixed an iPad Pro bug, and some other ones I won't bore you with."},{"version_id":"826425178","version_name":"2.3","version_date":"2018-04-27 00:17:52.000 +0800","version_description":"- It works on iPhone X!<br>- Added arrow buttons to move the keyboard for 1-thumb typing<br>- Brought back the setting to show only uppercase keys<br>- Fixed an auto-capitalization bug"}]