[{"version_id":"822595154","version_name":"1.2.0","version_date":"","version_description":""},{"version_id":"822633618","version_name":"1.2.1","version_date":"","version_description":""},{"version_id":"822697804","version_name":"1.2.2","version_date":"","version_description":""},{"version_id":"822767568","version_name":"1.2.3","version_date":"","version_description":""},{"version_id":"822826469","version_name":"1.3.3","version_date":"","version_description":""},{"version_id":"822946058","version_name":"1.3.5","version_date":"","version_description":""},{"version_id":"822996585","version_name":"1.4.1","version_date":"","version_description":""},{"version_id":"823200837","version_name":"1.4.2","version_date":"2017-08-08 02:12:40.000 +0800","version_description":"修复了一些影响体验的bug"},{"version_id":"823225543","version_name":"1.4.3","version_date":"2017-08-10 02:40:54.000 +0800","version_description":"修复了一些影响体验的bug"},{"version_id":"823320243","version_name":"1.4.4","version_date":"2017-08-17 18:00:39.000 +0800","version_description":"1.开放新的历史战役地图：襄樊之战-蜀国篇<br>2.开启联盟鼓舞功能：盟主开启后可在短时间内提升全盟成员的出征速度<br>3.添加了队伍自动响应联盟集结的功能，可在队伍界面进行设置<br>4.添加了查看联盟仓库存储、提取记录的功能<br>5.平衡性调整：调整了程昱的装备属性，并且给程昱的技能和专属被动添加了新的效果<br>6.优化了反唇相讥和稳固军心的触发机制<br>7.历史战役内的成就会在未完成时前显示更多的线索<br>8.过关斩将累计全部通关5次以上的玩家在45级后可以快速扫荡前8关<br>9.添加了体力和战利品中经验的最大累积上限：体力大于5000点、战利品累积经验大于1000W时，将无法继续累积<br>10.优化了图鉴显示：活动中出现过的武将将会一直可见<br>11.鲜花榜现在拥有更高的鲜花获取上限<br><br>修复的问题：<br>1.修复了战斗中的反伤类伤害并未受到伤害减免和伤害增加类技能影响的问题<br>2.修复了关羽的攻击回血效果有时在战斗中会临时失效的问题<br>3.修复了在将领转星级降低后，由于未及时更新相关渊源的战力，导致的武将升星反而引起战力降低的问题<br>4.修复了高级官职降级时会导致上一阶战功清零的问题<br>5.修复了每日战功上限未能完全生效的问题，并调整日常获得战功上限的生效机制<br>6.修复了部分服务器出现南郡之战-寸土必争玩法时，过早占领的关隘未能计算占领分的问题<br>7.修复了南郡之战在寸土必争和论持久战等积分玩法时，并列排名显示错误的问题<br>8.修复了某些情况下自己正在探索的宝箱被他人抢夺时，无法看见行军路线的问题<br>9.修复了装备超出上限时的发放方式，超出的装备将会通过邮件发放<br>10.修复了服务器维护后，国战队伍的坐骑速度未能正确加成，需要手动重新装备才可激活的问题<br>11.修复了当邮件积攒过多时，打开邮件无法看到邮件列表的问题<br>12.修复了贼兵乱世活动的称号有可能会提前消失的问题<br>13.修复了批量分解大量装备时，响应过慢有可能卡死的问题"},{"version_id":"823404547","version_name":"1.4.5","version_date":"2017-08-29 04:35:11.000 +0800","version_description":"1，新增橙色武将：姜维。可通过七夕活动兑换或限时酒馆内抽取。<br>2，新增可永久培养幼兽坐骑-小驴。可通过七夕活动兑换或直接用钻石开启。<br>3，开启历史战役襄樊之战-魏篇，现在可以体验魏国版的襄樊之战<br><br>修复的问题：<br>1，修复了过关斩将加速通关后第二天仍可找回的问题<br>2，修复了贼兵乱世在南郡之战开启后排行榜混排的问题<br>3，修复了流浪他乡时未正确删除玩家拥有的地方官问题<br>4，修复了联盟内有时会出现机器人且无法被T掉的问题<br>5，修复了攻城略地中精英怪-郭嘉的阵容不合理问题<br>6，修复了防御宝石描述的显示问题"},{"version_id":"823662097","version_name":"1.5.1","version_date":"2017-09-16 17:01:51.000 +0800","version_description":"功能更新：<br>1、个人空间面板内新增角色改名功能<br>2、为每一个官职添加了对应的战功囤积上限<br>3、在高级官职的扣战功阶段，每次扣除战功都能获得对应的黄金补偿<br>4、大幅降低了过关斩将加速通关功能的黄金消耗<br>5、调整了重伤机制内的时间判断，现在起重伤更为严格<br>6、提升了副本扫荡时将领经验丹的产出<br>7、历史战役商店中添加多种已有将领专属装备所需的晶石<br>8、调整了城池守军的孤注一掷技能，现在伤害量为全军分摊<br><br>问题修复：<br>1、修复了集结的队伍出发时，目标点没有相邻的地块从而导致队伍卡死的问题<br>2、修复了破盾之力在释放技能时可能错误添加给自己的问题<br>3、修复了于禁据守之阵的降低伤害效果错误的使降怒效果也被降低的问题<br>4、修复了趁火打劫和乘风破浪类追加伤害在已经死亡的单位时可能引发的战斗异常问题<br>5、修复了于禁携带专属被动的同时携带如鱼得水、如饮甘霖等回复生命触发的技能在战斗中未能正确显示效果的问题<br>6、修复了某些情况下周卡、月卡奖励邮件未能正确发放的问题<br>7、修复了诸葛亮专属武器属性在部分界面显示错误的问题<br>8、修复了某些情况下退出联盟后还可以看到原联盟消息的问题<br>9、修复了将领转移时由于通信不畅可能会引起消耗增加的问题<br>10、修复了红包打开状态下过期红包不会消失的问题<br>11、修复了空间状态的时间显示错误问题"},{"version_id":"823711098","version_name":"1.5.3","version_date":"2017-09-22 01:29:00.000 +0800","version_description":"主要功能：<br>1、新增了4个武将被动技能<br>攻其不备：攻击若未被格挡，则对当前目标造成固定伤害<br>高歌猛进：攻击若未被格挡，则对敌方全体造成伤害<br>落井下石：攻击若未被格挡，则可令目标在一段时间内受到的治疗效果降低<br>戮力同心：行动时有40%的概率在一段时间提升所有后排将领的攻击力<br><br>新地图—中原战场<br><br>1、在中原战场中通过天下大势可将玩家的等级解锁至100级<br>2、联盟等级解锁至15级，联盟人数上限调整为60人<br>3、新增个人领地生产建筑：弓弩坊、步铠厂、骑配营，分别生产弓弩、刀盾、马匹等军备<br>4、新增兵种：使用军备可将普通士兵变为特色兵种，特色兵种在攻城略地中可直接将攻防能力加成至将领部队中<br>5、新的资源地：中原地图拥有大量的林场、矿场、草场，可使个人领地内的生产建筑拥有更高产出<br>6、新系统-军机营：用于提升全军科技。包括：<br>士兵科技：可升级士兵科技，提升士兵属性，将普通士兵升级为更强力兵种<br>武侯兵法：可使用黄金增强全军属性，并可激活使武将获得战斗增强的阵法<br>7、新的历史战役：已有的所有历史战役分别开放了新的隐藏剧情、新的难度和奖励内容<br>8、新将领：江东小霸王-孙策（可在进军中原的签到活动中获得）<br>怒气技-锋芒之势：对目标造成较高伤害，并且较长时间内自己的速度提高100%<br>专属被动-霸王：攻击时可根据目标现存的生命值，额外造成一定比例的伤害<br>9、新的中央州-冀州之战<br>冀州中出现新的建筑-秘道：可在两点之间跨越地形快速驻扎<br>中央州加入5张全新地图，并且之前南郡中经典地形因为秘道的存在带来新的变化<br>冀州中可获取新道具兵法密卷，在武侯兵法中提升全军将领战斗能力<br>10、资质丹产量全面提升<br>11、进入中原战场前服务器内会开放前置活动，详情关注服务器内公告。"},{"version_id":"823765940","version_name":"1.5.4","version_date":"2017-09-25 13:26:16.000 +0800","version_description":"修复进入中原地图后点击武侯兵法有几率卡死问题<br>优化部分UI在IPAD上适配问题"},{"version_id":"823800113","version_name":"1.5.5","version_date":"2017-09-28 02:11:43.000 +0800","version_description":"主要功能：<br>1，国庆全民活动，登录好礼，积分兑换福利<br>2，中秋送月饼排行活动（特殊坐骑奖励：玉兔）<br>3，拥有资质丹时的特效提示<br>4，在聊天频道显示玩家部分稀有限时称号<br>5，两套装备方案允许玩家选取重复的装备<br>6，联盟仓库支持批量删除模式<br>7，开启主公转职功能<br><br>其他优化：<br>1，个人领地面板将记录重要事件<br>2，聊天频道出现坐标和城池名时会增加一键跳转功能，方便用户直接定位目标地<br>3，聊天频道可输入指定字符后可直接发送坐标，发送成功后，点击坐标可直接跳转目标地<br>4，联盟消息面板出现坐标和城池名时，点击可直接跳转目标地<br>5，攻城略地地图点击任一点时可直接点击坐标分享至任一聊天频道（官频、公共、本州、联盟）"},{"version_id":"823840303","version_name":"1.5.6","version_date":"2017-09-30 01:46:00.000 +0800","version_description":"修复部分已知问题"},{"version_id":"824029733","version_name":"1.5.7","version_date":"2017-10-20 17:42:34.000 +0800","version_description":"新增内容：<br>1、坐骑成就奖励：添加了全新成就奖励，收集坐骑图鉴，获得更高评价或等级的坐骑都会获得更多丰厚奖励；<br>2、坐骑技能：坐骑学会全部可学技能并且整体升级，可为坐骑带来新的属性加成及速度提升；<br>3、新增坐骑幻化功能，可在不改变属性技能的情况下，改变已有坐骑的外形显示；<br>4、貂蝉的闭月羞花的持续时间延长，并且闭月羞花和闭月带来的沉默效果均不能被驱散；<br>5、将领专属装备开放升星功能，通过历史战役商店兑换到新道具-特殊装备升星石，可以百分比提升特殊装备的属性；<br>6、大乔专属防具破击调整为格挡、暴击调整为破击；<br>7、甄姬专属武器格挡调整为暴击；<br>8、赵云专属武器格挡调整为破击；<br>9、司马懿专属武器韧性调整为破击；<br>10、提升了分解幼年坐骑夜时获得的灵兽丹数量；<br>11、优化了天下大势的显示，如果地图内没有某一档的城池将不显示该档奖励；<br>12、玩家进行改名操作后，曾用过的昵称不可被其他玩家再次使用；<br>13、调整了历史战役商店中购买进阶材料的数量，单次购买数量由1个提升为10个<br><br>修复的问题：<br>1、修复了城池-清水、姑臧的名称重复的问题；<br>2、修复了中原战场中的密道错误；<br>3、修复了某些情况下九星连营在有效期内却无法使用的问题；<br>4、修复关羽专属特殊武器技能的特效显示错误；<br>5、修复了个人主城升级条件中对马厩等级需求的描述显示错误。"},{"version_id":"824132603","version_name":"1.5.8","version_date":"2017-10-26 01:05:20.000 +0800","version_description":"1，添加了武将特殊装备自动进阶功能；<br>2，添加了战城南（单人跨服竞技场）入口<br>3，推出新将领-贾诩，通过全新的限时酒馆上架；<br>4，推出新坐骑-孔雀，通过坐骑礼包上架；<br>5，更新了节日活动-九九归一重阳节活动；<br>6，战斗中加入了高级步兵和骑兵技能触发时的提示；<br>7，修复了中原地图绵羊关附近的一个地块错误；<br>8，修复了武将装备在强化160级时蓝田玉消耗数量异常的问题；<br>9，修复了黄忠专属被动在战斗时触发显示文字错误的问题；<br>10，修复了同仇敌忾技能的文字描述错误。"},{"version_id":"824417576","version_name":"1.6.0","version_date":"2017-11-17 03:34:45.000 +0800","version_description":"更新内容：<br>1、战城南跨服战先遣测试正式开放；<br>2、新增神兵系统：参与战城南跨服竞技场可开启专属神兵；<br>3、新增橙色将领-张星彩，可在普通酒馆内抽取；<br>4、马厩等级上限开放至160级；<br>5、超出上限部分的战功将会按照1:5的比例折算为黄金；<br>6、优化了军机营对于兵种克制效果及特种兵升级条件的展示；<br><br>问题修复：<br>1、修复了中原地图中，南皮的城池占领奖励无法领取的问题；<br>2、修复了中原地图中镇远关附近的地块错误问题；<br>3、修复了中原地图部分桥梁丢失的问题；<br>4、修复了部分联盟目标计数某些情况下会丢失的问题；"},{"version_id":"824672361","version_name":"1.6.1","version_date":"2017-11-23 06:50:40.000 +0800","version_description":"1、稀有坐骑-梦魇、九尾开放性格重置功能；<br>2、增加了新坐骑-小可爱，可通过跨服竞技场庆祝活动-兑换；<br>3、新增功能：武将晶石可分解为对应的令牌；<br>4、新增功能：可以将过期的时效道具分解为黄金；<br>5、新增功能：等级达到当前上限后，无法再获得的经验将按一定比例转化为黄金；<br>6、新增功能：批量分解及锁定武将特殊装备；<br>7、优化了武将重置时关于资质丹的相关提示；<br>8、新武将-张角加入限时酒馆"},{"version_id":"825285819","version_name":"1.6.2","version_date":"2017-12-16 04:13:17.000 +0800","version_description":"更新内容：<br>1、新增专属装备图鉴，可查询将领专属装备详情；<br>2、战城南功能优化（见详情）；<br>3、张辽、魏延、曹仁、徐庶、诸葛均、荀彧、陆逊、诸葛瑾将领技能优化；<br>4、战功每日获取上限上调，玩家每天可以获取更多战功；<br>5、神秘商店内每日添加特定将领魂石限量折扣；<br>6、中原战场的密道现在可点击查看目的地；<br>7、新增将领：左慈<br>8、新增坐骑：赤兔<br>9、大幅上调了魔王挑战中BOSS的血量<br><br>战城南功能优化详情：<br>1、修复了某些情况下排位赛中的阵容调整未能生效的问题；<br>2、修复了积分赛战报观看结束后只显示胜利字样的BUG；<br>3、连胜公告将只在本服内可见；<br>4、增强了周日排位赛阶段可助威时的系统提示；<br>5、在战场分组界面点击战报，可直接查看对应战报；<br>6、优化了排位赛阶段的晋级动态提示；<br>7、战城南将根据大区进行匹配。<br><br>修复的问题：<br>1、修复了先锋营宝箱过期后无法分解为黄金的问题；<br>2、修复了张星彩天命书无法分解为天书残页的问题；<br>3、修复了坐骑共鸣效果未能正确显示的问题；<br>4、修复了历史战役店中购买貂蝉的晶石时消耗错误的问题；<br>5、修复了过关斩将中对当前队伍战力显示错误的问题；<br>6、修复了某些情况下个人建筑可以重复建造的问题；<br>7、修复了甄姬斩杀技能错误的问题；<br>8、修复了甄姬和贾诩专属装备技能错误的问题；<br>9、修复了部分有特效的称号在除了国战之外的其他位置未能正确显示的问题。"},{"version_id":"825449108","version_name":"1.6.8","version_date":"2018-01-05 07:12:11.000 +0800","version_description":"更新内容：<br>1、跨服大战场-决战洛阳预更新<br>2、擂台增加新的兑换将领：关兴<br>怒气技-将门虎式：对目标造成大量伤害，并将伤害的一半回复为自己的生命<br>专属被动-父魂：攻击时可使目标在一段时间内的治疗效果降低，且对虚弱敌人造成的伤害提高，目标每损失5%的血量，其受到的伤害提高一定比例<br>3、新增将领-徐晃，可通过限时神将活动获取<br>4、新增被动技能，可以在技能宝箱中获取<br>其利断金：行动时有40%的概率为后排将领增加破击状态，在一段时间内攻击被格挡的概率减少<br>波澜不惊：我方全体受到的怒气减少效果降低<br>5、图鉴收集奖励中增加赤兔<br>6、元旦送福袋活动：通过打怪或购买福袋赠送给关系密切的好友，夺榜后均可获得专属活动奖励：稀有兔子坐骑<br><br>修复的问题：<br>修复了部分服务器南郡和中原之战的复仇状态在叠层后未能正确生效的问题"},{"version_id":"825539018","version_name":"1.6.9","version_date":"2018-01-09 03:01:18.000 +0800","version_description":"修复部分已知问题"},{"version_id":"825703905","version_name":"1.6.10","version_date":"2018-01-23 01:58:03.000 +0800","version_description":"1、坐骑特殊技能重置时返还曾用于成功升级的技能书<br>2、武将专属装备添加一键强化功能<br>3、新增武将在使用内丹自动培养时的快速完成功能<br>4、新增了坐骑快速升级至指定等级的功能<br>5、新增将领：卧龙<br>怒气技-举火燎原：为我方全体恢复一定生命，同时可清除敌方所有增益效果，并在接下来的 一段时间内降低敌方全体的暴击率和攻击力<br>专属被动-看破：敌方全体在受到伤害时，有25%概率令所受伤害提高<br><br>修复问题：<br>1、修复了夏侯惇的技能在搞等级官印效果时反弹伤害过高的问题<br>2、修复了部分将领渊源导致数据异常的问题<br>3、修复了徐晃在魂石商店中无法兑换的问题<br>4、修复了徐晃、关兴晶石道具描述错误的问题"},{"version_id":"825888315","version_name":"1.6.11","version_date":"2018-02-09 00:45:55.000 +0800","version_description":"更新内容：<br>1、第一批将领开启升红功能：吕布、大乔 、吕玲绮、甄姬、关羽、张辽、姜维、马超<br>2、升红条件：可以升红的将领在品质为橙色且具有一定星级<br>3、升红材料：可通过挑战专属副本获取升红石进行升红<br>4、升为红色将领后：原有的将领技能会额外获得新效果，并且同时开启魂印系统 ，进一步提升战力<br>5、主公可在达到一定等级、星级之后直接开启魂印系统<br>6、中心州轮战复仇叠加的最高层数调整为10层（当前已超过10层的buff暂时保留 ）；当复仇叠加层数≥10层时，复仇只作用于下一次中心州轮战；下一次轮战结 束后，复仇将自动被清除。<br>7、增加了在战斗中显示状态叠加层数的功能<br>8、新增了新年活动限定坐骑-年兽，可在春节年兽活动中获取<br>9、新增了情人节狗年限定坐骑，可在2018年2月14日情人节活动期间获取"},{"version_id":"826443642","version_name":"1.6.17","version_date":"2018-03-29 02:44:22.000 +0800","version_description":"3月28日更新内容：<br><br>1、新开放5名武将的升红：夏侯惇、黄月英、貂蝉、贾诩、于禁<br>2、新增坐骑：玄天火凤，可通过皇宫秘藏获取<br>3、魔王挑战：新增挑战木牛流马和年兽<br>4、皇宫宝藏和秘藏添加新道具：吕布、左慈、貂蝉专属异宝装备<br>5、官印等级将提升至65级<br>6、优化了联盟神兽的免疫沉默、眩晕、混乱效果，调整了联盟神兽的血量和攻击力<br>7、预更新第三张地图-司隶之战，符合条件的服务器将陆续开放<br><br>修复的问题：<br>1、修复了某些情况下酒馆图鉴未显示夏侯渊的问题<br>2、修复了黄盖武将类型显示不正确的问题，其正确类型为防御型"},{"version_id":"828066731","version_name":"1.7.16","version_date":"","version_description":""},{"version_id":"828428091","version_name":"1.7.21","version_date":"","version_description":""},{"version_id":"829156233","version_name":"1.8.6","version_date":"","version_description":""},{"version_id":"829742269","version_name":"1.8.11","version_date":"","version_description":""},{"version_id":"830666182","version_name":"1.8.33","version_date":"","version_description":""},{"version_id":"830666182","version_name":"1.8.20","version_date":"","version_description":""},{"version_id":"831868617","version_name":"1.8.33","version_date":"","version_description":""},{"version_id":"835069946","version_name":"2.2.3","version_date":"","version_description":""},{"version_id":"839819642","version_name":"2.4.10","version_date":"2020-12-30 01:45:52.000 +0800","version_description":"四名武将开放觉醒：\t\t<br>\t\t左慈\t<br>\t\t\t命-方士之戏：左慈在场时我方全体免疫混乱和眩晕效果，且敌方每次召唤替身类单位时，都会令敌方全军混乱一小段时间，混乱期间双防降低30%，混乱结束后一小段时间内攻击力降低30%<br>\t\t\t命-化身：敌方全体每次行动后，都有8%的概率混乱一小段时间，我方全体有50%的概率抵御可被驱散的负面状态<br>\t\t魏延\t<br>\t\t\t命-苍狼之噬：双防提高10%，受到伤害后有50%的概率可获得一个护盾，可吸收自身已损生命值15%的伤害<br>\t\t\t命-独狼：普通攻击变为对敌方前排所有目标造成攻击力*25%的无视防御伤害，并将伤害的50%恢复为自身生命<br>\t\t卧龙\t<br>\t\t\t命-举火燎原：举火燎原可额外使敌方全体造成的伤害降低，攻击者每损失5%的生命值，造成的伤害降低2%<br>\t\t\t命-看破：我方全体受到伤害时，有25%概率令伤害降低24%<br>\t\t庞德\t<br>\t\t\t命-抬棺决击：我方全体在击杀目标后都可立刻对敌方全体造成一次110%的伤害，庞德死亡时可立刻对敌方全体造成一次110%的伤害<br>\t\t\t命-白马：庞德100%抵御沉默和混乱状态，攻击时造成的伤害提高10%<br>\t新增了人物未满100级时部分新功能的预告功能\t\t<br>\t战城南积分赛阶段，匹配对手的刷新等待时间缩短为两小时"}]