[{"version_id":"812372365","version_name":"1.1","version_date":"","version_description":""},{"version_id":"819120565","version_name":"2.2","version_date":"","version_description":""},{"version_id":"824356086","version_name":"3.2","version_date":"2017-11-13 17:59:57.000 +0800","version_description":"Get ready for the holidays by telling Manifest which days you’re not planning to work! Manifest will adjust your goals and time projections to ensure the most accuracy. For example, if you’re taking Thanksgiving off, you can update your schedule so that Manifest knows not to treat it as a work day. It’ll adjust your goals accordingly, and will update projected total times as well. (You probably won’t get much work done anyway after all that turkey and pie!) Go to Settings &gt; Schedule to get started. You can also add additional work days.<br><br>This update also includes:<br>- Customize the first day of the week in Settings &gt; Schedule. For example, if you’re in the US but prefer to see Monday as the first day of the week on a calendar, you can customize away!<br>- Manifest now remembers whether calendar view is set to week or month mode between launches<br>- Fixed a bug that could cause time to be recorded incorrectly when manually adding time late in the day<br>- Fixed high CPU usage when viewing a weekend day under some conditions<br>- Fixed incorrect display of work day start and end times in settings<br>- Fixed a bug where project detail didn’t always update after editing project settings- <br><br>Enjoying Manifest? Please consider leaving a review on the App Store. It helps and is very much appreciated!"},{"version_id":"825264018","version_name":"3.3","version_date":"2017-12-11 18:09:35.000 +0800","version_description":"This update provides some great enhancements to reminders! By popular request, you can now get regular reminders while a timer is running. For example, you can now have Manifest remind you every hour so that you don’t forget to stop a timer. You’ll find options in the Reminders section of the Settings screen.<br><br>You can also stop a timer right from a reminder notification! Simply swipe or press firmly on the notification to reveal the Stop Timer button, which will stop your timer without disrupting your work or switching apps. You can even stop timers from the notification on your Apple Watch!<br><br>This update also includes:<br>- Set goals with fractional hours (e.g. 2.5 hours)<br>- Provide more explanation about the rounding increment setting<br>- Tweak behavior when rounding is disabled<br>- Free users can now dismiss the Manifest Pro banner on the timer list screen<br>- Fixed a bug with time projections when you record time on your day off<br>- Fixed a bug that could cause Toggl export to miss some time under certain conditions<br><br>Enjoying Manifest? Please consider leaving a review on the App Store. It helps and is very much appreciated!"},{"version_id":"826173775","version_name":"3.4","version_date":"2018-03-04 00:39:27.000 +0800","version_description":"Two big new features: Recent Notes and a complication for Apple Watch<br><br>- Watch Complication: Quickly launch Manifest from your watch face with the new complication. In many cases the complication can also show your currently running timer and project. It's a super easy way to check on your timer with a quick glance.<br><br>- Recent Notes: You can quickly fill the notes field from a menu of recently-used notes. If you find yourself working on the same task for multiple days in a row, this feature is for you!<br><br>Additionally, this version includes:<br><br>- Tabbed display for project details to reduce clutter<br>- Updated date picker for project charts to more easily select by week or month<br>- A new pie chart in the day overview displays a breakdown of the day's time by project<br>- A new yellow project color"},{"version_id":"826211032","version_name":"3.4.1","version_date":"2018-03-07 16:34:46.000 +0800","version_description":"Minor bug fixes."},{"version_id":"826279637","version_name":"3.4.2","version_date":"2018-03-13 22:30:20.000 +0800","version_description":"Fix for a bug related to Daylight Saving Time transition."},{"version_id":"826825851","version_name":"3.6","version_date":"2018-04-26 16:35:09.000 +0800","version_description":"The theme of this update is: themes! Pro users can pick from the slick new black theme, which looks especially great on iPhone X, or the airy light theme, as well as the original dark theme.<br><br>Fixes:<br>- Fixed a bug when editing negative manual time adjustments. You can now select negative as well as positive values when manually adjusting time.<br>- Fixed a crash that could occur when creating a backup on iPad<br>- Fixed a crash when resizing the app on launch in split view on iPad"},{"version_id":"826880684","version_name":"3.6.1","version_date":"2018-05-01 17:05:50.000 +0800","version_description":"This release has a few bug fixes:<br><br>- Fixed a crash when editing the periodic reminder interval on iPad.<br>- Fixed an intermittent crash when updating the list of projects for the day.<br>- Fixed a bug that allowed negative time intervals in situations where that didn't make sense.<br>- Fixed an bug that could cause incorrect corner rounding on the start/pause button.<br><br>Enjoying Manifest? Please consider leaving a review on the App Store. It makes a big difference and is very much appreciated!"},{"version_id":"827152836","version_name":"3.6.2","version_date":"2018-05-17 04:06:56.000 +0800","version_description":"A few bug fixes in this update while I'm working on some new features:<br><br>- Fixed a bug that could cause sync to fail after manually deleting a time entry from the timeline.<br>- Fixed a bug that caused the app to forget restored purchases, forcing a repeat restore.<br>- Fixed missing goal type in project settings for projects with no goal.<br>- Fixed incorrect badge color in the widget once your goal is reached for the day.<br><br>Enjoying Manifest? Please consider leaving a review on the App Store. It makes a big difference and is very much appreciated!"},{"version_id":"827362423","version_name":"3.6.3","version_date":"2018-05-31 20:34:09.000 +0800","version_description":"This update contains a few more bug fixes, thanks to some very helpful folks who reported issues!<br><br>- Fixed keyboard dismissing at the wrong time while editing an project name.<br>- Fixed alternate app icons on iPad.<br>- Fixed wonky-looking calendar view after rotating the iPad.<br>- Fixed project colors on pie chart.<br><br>Enjoying Manifest? Please consider leaving a review on the App Store. It makes a big difference and is very much appreciated!"},{"version_id":"827914346","version_name":"3.7","version_date":"2018-07-18 16:23:52.000 +0800","version_description":"FEATURES AND UPDATES<br>- Getting data into Manifest is much easier with new import options from Harvest, Freshbooks, and Toggl. If you have existing data on one of these services and want to bring all your data into Manifest, now you can! Just tap Import Data after installing or on the settings screen.<br>- You can now export CSV files containing one line for each timing session, in addition to the existing option to export a summary of each project per day.<br>- Unfortunately, Toggl export has been removed. API limitations made it very difficult to ensure that this feature worked reliably. CSV export remains available as always. Sorry about that.<br><br>FIXES<br>- Improved alignment of bars and labels on time distribution bar chart.<br>- Made sure that time tracked for archived projects doesn’t show up in the calendar view.<br>- Fixed a bug that could cause a sync error after deleting a time session.<br>- Fixed a bug that could make it hard to change goal types on a project with no goal.<br>- Fixed incorrect color of progress badge in the Notification Center widget.<br>- Improved VoiceOver support"},{"version_id":"828846348","version_name":"3.8.1","version_date":"2018-10-08 20:59:27.000 +0800","version_description":"- Improved complications for Infograph faces on Apple Watch Series 4.<br>- Minor performance enhancements."},{"version_id":"829108099","version_name":"3.8.2","version_date":"2018-11-09 00:20:35.000 +0800","version_description":"- Support for new iPad Pros<br>- Display elapsed time by week, month, and all time on the project detail screen<br>- Fixed chart date labels in longer time ranges<br>- Fixed a bug when importing data from Toggl"},{"version_id":"829266604","version_name":"3.8.3","version_date":"2018-11-13 18:25:52.000 +0800","version_description":"- Fixed a nasty bug that could cause Manifest to freeze when viewing project details. Sorry about that!<br>- Fixed projected total time displayed alongside charts."},{"version_id":"829299630","version_name":"3.8.4","version_date":"2018-11-15 21:01:34.000 +0800","version_description":"Improvements:<br>- Smart Goals are now available to all users!<br>- Improved support for Shortcuts<br><br>Fixes:<br>- Fixed a bug that selected the wrong date range when the first weekday is not Sunday<br>- Fixed a bug that caused the incorrect month to be selected in chart view in some circumstances"},{"version_id":"829495800","version_name":"3.8.5","version_date":"2018-12-03 19:28:14.000 +0800","version_description":"- Improved ease of switching between time periods in charts view<br>- Fixed the number of days displayed in charts in week view<br>- Fixed missing line when selecting a date in charts<br>- Fixed updates to total daily times in calendar view"},{"version_id":"829665656","version_name":"3.8.6","version_date":"2018-12-17 16:11:06.000 +0800","version_description":"- Improved performance when viewing lots of data in charts<br>- Improved default date range when switching charts from a longer time period to a shorter one (e.g. month to week)<br>- Improved reliability of complication data on Apple Watch, especially after syncing from other devices<br>- Fixed a bug that caused importing data from Toggl to fail in some cases"},{"version_id":"829810438","version_name":"3.8.7","version_date":"2019-01-04 02:31:34.000 +0800","version_description":"Fixed a bug that could prevent entering time on days in the past."},{"version_id":"830398980","version_name":"3.8.8","version_date":"2019-02-24 20:53:44.000 +0800","version_description":"Fixed a bug that could prevent pausing a timer from your Apple Watch under certain circumstances.<br><br>Coming soon: A daily goal type and improvements to scheduling!"},{"version_id":"830690879","version_name":"3.8.9","version_date":"2019-03-21 19:26:51.000 +0800","version_description":"This is a small update that makes sure email list signups will continue to work properly.<br><br>Coming soon: A daily goal type, improvements to scheduling, and more!"},{"version_id":"831310591","version_name":"4.0","version_date":"2019-05-23 13:44:52.000 +0800","version_description":"Tasks<br>By popular request, Manifest now lets you track time for multiple tasks within a project. Swipe left on a project and tap the task icon to add or change tasks. In the Today tab of the detail view, you'll see a breakdown of time by task for the current date. You can also tap on a task in this view to make it the current task. In the Analysis tab, you'll also see a breakdown of time by task. Tasks can be used across projects, which lets you categorize your time.<br><br>Improved Scheduling<br>In order to help you keep your schedule on track, this update contains big improvements to scheduling. For each day, you'll see your projects broken down into Scheduled and Unscheduled sections. Projects appear in the Scheduled section if the current date is a work day for that project and the project's goal hasn't been reached yet. All other projects appear in the Unscheduled section, which is collapsed by default to keep things tidy. (Just tap on the Unscheduled header to expand it.)<br><br>By default, all projects use the global work days setting that you can configure on the main settings screen. (Tap the gear in the upper left corner of the screen.) In addition, you can set a custom work day schedule for each project on the project's settings screen. For example, if you have a project that you only do on weekends, you could set that project's work days to Saturday and Sunday. It'll appear in the Scheduled section on those days, and in Unscheduled on all other days.<br><br>Finally, a new daily goal type is perfect for projects that have the same time requirements each day. You can select the daily goal type in any project's settings.<br><br>Improved History Tab<br>The History tab can now show your time visually so you can see at a glance what you worked on during the course of a day. Swipe from side to side to view different days, or tap on a block of time to edit it. The list view is also improved, now breaking down time by date and showing the task.<br><br>From either view, you can tap on the + button in the upper right to add time manually, which is perfect if you forgot to start a timer. You can optionally assign a task and notes as well.<br><br>Sync Settings<br>If you have iCloud sync enabled, Manifest will now sync your app settings across devices, providing a consistent experience no matter where you are. There's nothing to set up or configure, and your data continues to be private.<br><br>Improved Watch App Reliability<br>This update improves the speed and reliability between Manifest on your phone and your Apple Watch. Timers should start and stop more quickly than previous versions. I plan a bunch of additional improvements to the Watch app in a future release, but I wanted to be sure and improve the basics now.<br><br>Keyboard shortcuts<br>On the iPad, Manifest now supports some basic keyboard shortcuts for moving between projects and tabs. I plan additional improvements to keyboard shortcuts in the future."},{"version_id":"831436557","version_name":"4.0.1","version_date":"2019-05-25 16:03:17.000 +0800","version_description":"Version 4.0.1<br><br>- Fixed a bug that could cause a crash when manually editing time in history view.<br>- Fixed a scrolling issue when editing projects and time on larger devices.<br><br><br>Version 4.0<br><br>Tasks<br>By popular request, Manifest now lets you track time for multiple tasks within a project. Swipe left on a project and tap the task icon to add or change tasks. In the Today tab of the detail view, you'll see a breakdown of time by task for the current date. You can also tap on a task in this view to make it the current task. In the Analysis tab, you'll also see a breakdown of time by task. Tasks can be used across projects, which lets you categorize your time.<br>Improved Scheduling<br>In order to help you keep your schedule on track, this update contains big improvements to scheduling. For each day, you'll see your projects broken down into Scheduled and Unscheduled sections. Projects appear in the Scheduled section if the current date is a work day for that project and the project's goal hasn't been reached yet. All other projects appear in the Unscheduled section, which is collapsed by default to keep things tidy. (Just tap on the Unscheduled header to expand it.)<br><br>By default, all projects use the global work days setting that you can configure on the main settings screen. (Tap the gear in the upper left corner of the screen.) In addition, you can set a custom work day schedule for each project on the project's settings screen. For example, if you have a project that you only do on weekends, you could set that project's work days to Saturday and Sunday. It'll appear in the Scheduled section on those days, and in Unscheduled on all other days.<br><br>Finally, a new daily goal type is perfect for projects that have the same time requirements each day. You can select the daily goal type in any project's settings.<br><br>Improved History Tab<br>The History tab can now show your time visually so you can see at a glance what you worked on during the course of a day. Swipe from side to side to view different days, or tap on a block of time to edit it. The list view is also improved, now breaking down time by date and showing the task.<br><br>From either view, you can tap on the + button in the upper right to add time manually, which is perfect if you forgot to start a timer. You can optionally assign a task and notes as well.<br><br>Sync Settings<br>If you have iCloud sync enabled, Manifest will now sync your app settings across devices, providing a consistent experience no matter where you are. There's nothing to set up or configure, and your data continues to be private.<br><br>Improved Watch App Reliability<br>This update improves the speed and reliability between Manifest on your phone and your Apple Watch. Timers should start and stop more quickly than previous versions. I plan a bunch of additional improvements to the Watch app in a future release, but I wanted to be sure and improve the basics now.<br><br>Keyboard shortcuts<br>On the iPad, Manifest now supports some basic keyboard shortcuts for moving between projects and tabs. I plan additional improvements to keyboard shortcuts in the future."},{"version_id":"831505471","version_name":"4.1","version_date":"2019-06-04 12:12:52.000 +0800","version_description":"- Improved the Watch app to show your progress, allow you to increment or decrement timers, and switch tasks.<br>- Restored the ability to manually edit a project's time for an entire day. It turns out lots of people used this feature - sorry about that!<br>- Restored the ability to clear dates from a date picker view.<br>- Fixed incorrect button colors when composing a feedback email that made them almost invisible."},{"version_id":"831645903","version_name":"4.1.1","version_date":"2019-06-13 01:18:53.000 +0800","version_description":"- Fixed a potential crash when swiping to delete an entry in history list view."},{"version_id":"831727356","version_name":"4.1.2","version_date":"2019-06-20 19:08:14.000 +0800","version_description":"- Fixed a bug that could prevent the widget from loading in some cases."},{"version_id":"834388060","version_name":"4.6.3","version_date":"2020-01-25 15:44:45.000 +0800","version_description":"Fixed a bug that caused sorting to work incorrectly in some cases."},{"version_id":"835886358","version_name":"4.7.5","version_date":"2020-05-12 17:38:31.000 +0800","version_description":"Added a setting to let you view your data in a time zone other than your current one. This can be useful if you're traveling but still want to see things as they'd appear in your home time zone. Find this setting under Appearance &gt; Time Zone."}]