[{"version_id":"818871678","version_name":"2.0","version_date":"2016-09-28 14:55:12.000 +0800","version_description":"Das neue Blitzer.de PRO ist da."},{"version_id":"823715129","version_name":"2.1","version_date":"2017-09-20 21:53:11.000 +0800","version_description":"Bitte nach Update auf 2.1 in den Einstellungen unter Allgemein die Option \"FCD\" abschalten.<br><br>* Stabiler Hintergrundmodus und zuverlässige Hintergrundaktualisierung<br>* Aktuelle Karten<br>* Neuer Audioausgang USB-Audio für die Nutzung eines USB-Kabels oder Adapters<br>* Möglichkeit Standortzugriff auf „immer“ zu setzen (kein blauer Balken im Hintergrund)<br>* Popups für visuelle Warnungen im Hintergrundmodus<br>* Frühere Ausgabe der akustischen 100m Warnung<br>* Manuelle Umschaltung Tag-/Nachtmodus"},{"version_id":"824153741","version_name":"2.1.1","version_date":"2017-10-27 08:51:57.000 +0800","version_description":"* Fehler behoben: hoher Datenverbrauch, App stürzt direkt nach Start ab, App stürzt während der Fahrt ab<br>* Lautstärkeregelung angepasst<br><br>Sollte in seltenen Fällen die App nach dem Update gar nicht mehr starten, Löschen Sie bitte die App und installieren sie neu. Wir würden uns über ein Update Eurer Rezensionen oder neue Rezensionen sehr freuen."},{"version_id":"824405506","version_name":"2.1.2","version_date":"2017-11-15 09:01:53.000 +0800","version_description":"Tag-/Nachteinstellung bei Startansicht wird wieder berücksichtigt<br>Hinweise für abgelaufene Testphase erscheinen wieder"},{"version_id":"831334645","version_name":"54.2.2","version_date":"","version_description":""},{"version_id":"9820143","version_name":"1.1","version_date":"2012-08-11 08:58:59.000 +0800","version_description":"Dieses Update behebt das Hitzeproblem, das insbesondere im Zusammenhang mit Navigations-Apps auftrat. Die App arbeitet insgesamt weniger rechenintensiv, Akku und CPU werden weniger belastet. Die Karten bewegen sich deutlich flüssiger.<br><br>Neuerungen in der Version 1.1<br>[✔] Blitzererkennung optimiert<br>[✔] Hintergrundmodus läuft stabiler, Warnmeldungen kommen nicht mehr verzögert<br>[✔] Download-Rädchen in der Statuszeile dreht sich nicht mehr permanent<br>[✔] Bug behoben, dass die Anzahl der festen Blitzer im System „0“ beträgt<br>[✔] Bluetooth-Wiedergabekanal-Einstellungen werden gespeichert<br>[✔] Hintergrundmodus leichter aktivierbar<br>[✔] Bei Blitzermeldungen wird die gerundete gefahrene Geschwindigkeit voreingestellt<br>[✔] Lautstärke-Einstellungen optimiert<br>[✔] Wechsel in den Radarmodus, wenn keine Kartendaten mehr vorhanden sind (ausgeschaltete Internetverbindung/Roaming)<br>[✔] Weitere kleine Bugs behoben<br><br>Wir arbeiten weiterhin daran, dass die Geschwindigkeitswerte in der Tachoanzeige genauer angezeigt werden. Bei Problemen wenden Sie sich bitte an info@blitzer.de."}]