[{"version_id":"10336833","version_name":"1.0.0","version_date":"","version_description":""},{"version_id":"652353712","version_name":"2.5.0","version_date":"","version_description":""},{"version_id":"706022695","version_name":"2.6.0","version_date":"","version_description":""},{"version_id":"722283011","version_name":"2.6.2","version_date":"","version_description":""},{"version_id":"810914693","version_name":"3.0.0","version_date":"","version_description":""},{"version_id":"811834066","version_name":"3.2.0","version_date":"","version_description":""},{"version_id":"812765942","version_name":"3.5.2","version_date":"","version_description":""},{"version_id":"813091074","version_name":"3.6.0","version_date":"","version_description":""},{"version_id":"813722448","version_name":"3.7.2","version_date":"","version_description":""},{"version_id":"814484440","version_name":"4.0.1","version_date":"","version_description":""},{"version_id":"814668635","version_name":"4.0.1","version_date":"","version_description":""},{"version_id":"815283377","version_name":"4.0.5","version_date":"","version_description":""},{"version_id":"816361124","version_name":"4.1.5","version_date":"","version_description":""},{"version_id":"816484029","version_name":"4.1.6","version_date":"","version_description":""},{"version_id":"816689923","version_name":"4.1.7","version_date":"","version_description":""},{"version_id":"816833629","version_name":"4.2.0","version_date":"2016-04-04 20:02:50.000 +0800","version_description":"Den Hennessey Venom GT gibt es jetzt in Real Racing 3! Schnall dich an, schnapp dir das Lenkrad und erreiche eine Rekordbeschleunigung von 0 auf 300 Stundenkilometer in weniger als 14 Sekunden! Kannst du den Venom bändigen?<br><br>• Erlebe die schiere Power von drei neuen Wagen!<br>o Hennessey Venom GT<br>o 2015 BMW 3.0 CSL Hommage R<br>o 1975 BMW 3.0 CSL<br>• Stell dich dem brandneuen Spezial-Event \"Spitzenreiter\" und erhalte die Chance, den Hennessey Venom GT zu gewinnen, laut Guinness-Buch das beschleunigungsstärkste Serienfahrzeug der Welt!<br>• Zeige, dass du das Können hast, den klassischen 1975er BMW 3.0 CSL sowie den neuen 2015er BMW 3.0 CSL Hommage R mit nach Hause zu nehmen!<br>• Die Prüfung ist mit der fünften Staffel zurück und bietet tausende neue, zufällige Renn-Challenges sowie neue Chancen R$ und Gold zu gewinnen!"},{"version_id":"817258739","version_name":"4.3.1","version_date":"2016-05-16 19:59:59.000 +0800","version_description":"Real Racing 3 kehrt für ein ruhmreiches drittes Jahr nach Le Mans zurück! Es ist ein Showdown mit 50-jähriger Vorgeschichte, wenn Ford nach Le Mans zurückkommt, um sich die Krone zu sichern, und Ferrari in der GTE-Pro-Klasse herausfordert! <br><br>• Setz dich hinters Steuer von fünf neuen Autos! <br>o Ferrari 488 GTE<br>o Ford GT Le Mans<br>o Corvette C7.R<br>o Porsche 911 RSR (2016)<br>o Jaguar C-X75<br>• Dempsey Proton Racing geht zum ersten Mal in der Le Mans GTE-Pro-Klasse an den Start – gewinne den Porsche 911 RSR (2016) in dieser neuen Limited-Time-Serie<br>• Jaguar feiert sein Real Racing 3-Debüt in Die Prüfung Staffel 6! Stell dich der Herausforderung für deine Chance, den Jaguar C-X75 zu gewinnen – eins der exklusivsten Autos der Welt!<br>• Der letztjährige Le-Mans-Champion ist zurück – Teste dein Können für deine Chance, die Corvette C7.R in einer neuen Limited-Time-Serie zu gewinnen!<br>• Zwei Titanen des Rennsports treten im Spezial-Event Le Mans: Legenden gegeneinander an. Entscheide dich in diesem Duell mit 50-jähriger Vorgeschichte für Ford oder Ferrari! Verpasse nicht deine Chance, den 2016er Ferrari 488 GTE sowie den Ford GT Le Mans zu gewinnen!"},{"version_id":"817568628","version_name":"4.3.2","version_date":"2016-06-01 23:58:41.000 +0800","version_description":"Real Racing 3 kehrt für ein ruhmreiches drittes Jahr nach Le Mans zurück! <br><br>• Setz dich hinters Steuer von fünf neuen Autos! <br>o Ferrari 488 GTE<br>o Ford GT Le Mans<br>o Corvette C7.R<br>o Porsche 911 RSR (2016)<br>o Jaguar C-X75<br>• Dempsey Proton Racing geht zum ersten Mal in der Le Mans GTE-Pro-Klasse an den Start – gewinne den Porsche 911 RSR (2016) in dieser neuen Limited-Time-Serie<br>• Jaguar feiert sein Real Racing 3-Debüt in Die Prüfung Staffel 6! Stell dich der Herausforderung für deine Chance, den Jaguar C-X75 zu gewinnen – eins der exklusivsten Autos der Welt!<br>• Der letztjährige Le-Mans-Champion ist zurück – Teste dein Können für deine Chance, die Corvette C7.R in einer neuen Limited-Time-Serie zu gewinnen!<br>• Stell dich dem Spezial-Event Le Mans: Legenden. Verpasse nicht deine Chance, den 2016er Ferrari 488 GTE sowie den Ford GT Le Mans zu gewinnen!"},{"version_id":"817735104","version_name":"4.4.1","version_date":"2016-06-27 20:00:09.000 +0800","version_description":"Real Racing 3 lädt dich ein, das Steuer von vier der exklusivsten Autos der Welt zu übernehmen! Mit dem Ferrari FXX K bringt Real Racing 3 den Spielern eins der seltensten und begehrtesten Autos des Planeten! Dazu gibt Lotus sein Debüt in Real Racing 3 mit drei der schnellsten Autos auf der Strecke!<br>• Schnall dich an und finde heraus, ob du diesen vier neuen Autos gewachsen bist!<br>o Ferrari FXX K<br>o Lotus Exige S 360 Cup <br>o Lotus Type 125<br>o Lotus 3-Eleven<br>• Ein so kompromissloses und exklusives Auto, dass es nur von zugelassenen Käufern und ausschließlich auf speziellen Strecken gefahren werden darf: Verpasse NICHT deine Chance, dir den Ferrari FXX K zu verdienen!<br>• Eine ganz neue zeitlich begrenzte Serie bietet dir die Chance, den schnittigen Lotus Exige S 360 Cup zu gewinnen!<br>• Spiele nicht nach althergebrachten Regeln: Stelle neue auf. Wenn deine Rivalen aufholen, setze neue Maßstäbe. Bleib niemals stehen. Tauche ein in die Lotus-Philosophie und gewinne den Lotus Type 125!<br>• Außerdem ist Die Prüfung zurück mit einer siebten Staffel! Mach mit bei diesem Rennen um hohe Einsätze und nimm den atemberaubenden Lotus 3-Eleven mit nach Hause!"},{"version_id":"818214435","version_name":"4.5.1","version_date":"2016-08-08 20:03:51.000 +0800","version_description":"Drei atemberaubende Boliden stürmen in die Garage von Real Racing 3, der 1963er Lightweight E-Type, der 1992er XJ220 und der 2017er F-Type SVR. Erlebe mit ihnen die Evolution von Jaguar. Verdiene dir diese Autos in einem mitreißenden dreiteiligen Spezial-Event. Außerdem:<br><br>• Voll aufgerüstete Autos erhalten jetzt besondere Vorteile – fahre doppelt so weit, bis eine Wartung fällig ist, individualisiere kostenlos und fahre, ohne Drive zu verbrauchen!<br>• Kämpfe mit deinen voll aufgerüsteten Kultautos gegen nahezu gleichstarke Gegner um große Belohnungen: Fünf Exklusiv-Serien wurden hinzugefügt – die ersten von vielen<br>• Stell dich der Carrera-Prüfung und gewinne den 2016er Porsche 911 Carrera S in der brandneuen Prüfung Staffel 8, die Millionen möglicher Renn-Challenges bietet<br>• Schließe eine neue zeitlich begrenzte Serie ab, um den fauchenden 2015er Dodge Challenger SRT Hellcat zu gewinnen – das leistungsstärkste Muscle Car des Planeten.<br>• Verdiene dir in der zeitlich begrenzten Serie \"Samsung Championship\" einen Mercedes-Benz SLS GT3 mit Exklusivlackierung"},{"version_id":"818552696","version_name":"4.5.2","version_date":"2016-08-20 01:03:52.000 +0800","version_description":"Drei atemberaubende Boliden stürmen in die Garage von Real Racing 3, der 1963er Lightweight E-Type, der 1992er XJ220 und der 2017er F-Type SVR. Erlebe mit ihnen die Evolution von Jaguar. Verdiene dir diese Autos in einem mitreißenden dreiteiligen Spezial-Event. Außerdem:<br><br>• Voll aufgerüstete Autos erhalten jetzt besondere Vorteile – fahre doppelt so weit, bis eine Wartung fällig ist, individualisiere kostenlos und fahre, ohne Drive zu verbrauchen!<br>• Kämpfe mit deinen voll aufgerüsteten Kultautos gegen nahezu gleichstarke Gegner um große Belohnungen: Fünf Exklusiv-Serien wurden hinzugefügt – die ersten von vielen<br>• Stell dich der Carrera-Prüfung und gewinne den 2016er Porsche 911 Carrera S in der brandneuen Prüfung Staffel 8, die Millionen möglicher Renn-Challenges bietet<br>• Schließe eine neue zeitlich begrenzte Serie ab, um den fauchenden 2015er Dodge Challenger SRT Hellcat zu gewinnen – das leistungsstärkste Muscle Car des Planeten.<br>• Verdiene dir in der zeitlich begrenzten Serie \"Samsung Championship\" einen Mercedes-Benz SLS GT3 mit Exklusivlackierung"},{"version_id":"818909420","version_name":"4.6.2","version_date":"2016-09-21 23:42:54.000 +0800","version_description":"Real Racing 3 ist unterwegs zum Supercheap Auto Bathurst 1000, Australiens erstklassigem Supercar-Event! Starte mit diesem Update durch, das:<br>• den 2016 Ferrari F12tdf, 2016 Ford Falcon FG X und den 2016 Nissan Altima vorstellt<br>• das neue Supercheap Auto Bathurst 1000 Spezial-Supercars-Event mit dem 2016 Ford Falcon FG X präsentiert<br>• den neuen und kraftvollen Ferrari F12tdf entfesselt, der darauf wartet, in der 7-tägigen Tour Auto Speciale die Straßen unsicher zu machen<br>• die Prüfung mit ihrer 9. Staffel und dem beeindruckenden Nissan Altima Supercar aufleben lässt<br>• dir die Chance gibt, in einer zeitlich begrenzten Serie den Koenigsegg Regera oder eine Gold-Belohnung zu gewinnen<br>• drei Exklusiv-Serien für drei fantastische Autos bringt: Rüste den Koenigsegg Regera, den Lamborghini Gallardo und den Ferrari F12tdf voll auf, um sie einzeln freizuschalten"},{"version_id":"819118574","version_name":"4.6.3","version_date":"2016-09-30 17:23:31.000 +0800","version_description":"Real Racing 3 ist unterwegs zum Supercheap Auto Bathurst 1000, Australiens erstklassigem Supercar-Event! Starte mit diesem Update durch, das:<br>• den 2016 Ferrari F12tdf, 2016 Ford Falcon FG X und den 2016 Nissan Altima vorstellt<br>• das neue Supercheap Auto Bathurst 1000 Spezial-Supercars-Event mit dem 2016 Ford Falcon FG X präsentiert<br>• den neuen und kraftvollen Ferrari F12tdf entfesselt, der darauf wartet, in der 7-tägigen Tour Auto Speciale die Straßen unsicher zu machen<br>• die Prüfung mit ihrer 9. Staffel und dem beeindruckenden Nissan Altima Supercar aufleben lässt<br>• dir die Chance gibt, in einer zeitlich begrenzten Serie den Koenigsegg Regera oder eine Gold-Belohnung zu gewinnen<br>• drei Exklusiv-Serien für drei fantastische Autos bringt: Rüste den Koenigsegg Regera, den Lamborghini Gallardo und den Ferrari F12tdf voll auf, um sie einzeln freizuschalten"},{"version_id":"819418814","version_name":"4.7.2","version_date":"2016-11-01 19:01:30.000 +0800","version_description":"Drei neue McLarens rasen in die Garage von Real Racing 3 – der MP4-X, der 675LT und der 570GT! Verdiene dir jeden davon in den vielen Events dieses aufregenden Updates.<br><br>• Treibe die Zukunft des Rennsports mit einem brandneuen 8-tägigen Spezial-Event, in dem das revolutionäre Konzeptfahrzeug McLaren MP4-X vorgestellt wird, voran!<br>• Die Prüfung kehrt mit ihrer 10. Staffel zurück und präsentiert den schnittigen neuen McLaren 570GT!<br>• Drei neue zeitlich begrenzte Serien, in denen der Ferrari LaFerrari, der Ferrari 599 GTO und der McLaren 675LT ihren Auftritt haben – Verdiene dir diese drei Autos sowie einen Haufen Gold!<br>• Rüste den McLaren P1 GTR, den McLaren MP4-X und den von der Community ausgewählten Audi R8 LMS Ultra komplett auf, um jede neue Exklusiv-Serie freizuschalten!<br><br>Vielen Dank fürs Spielen und \"\"keep racing\"\"!"},{"version_id":"819765712","version_name":"4.7.3","version_date":"2016-11-18 00:01:34.000 +0800","version_description":"Drei neue McLarens rasen in die Garage von Real Racing 3 – der MP4-X, der 675LT und der 570GT! Verdiene dir jeden davon in den vielen Events dieses aufregenden Updates.<br><br>• Treibe die Zukunft des Rennsports mit einem brandneuen 8-tägigen Spezial-Event, in dem das revolutionäre Konzeptfahrzeug McLaren MP4-X vorgestellt wird, voran!<br>• Die Prüfung kehrt mit ihrer 10. Staffel zurück und präsentiert den schnittigen neuen McLaren 570GT!<br>• Drei neue zeitlich begrenzte Serien, in denen der Ferrari LaFerrari, der Ferrari 599 GTO und der McLaren 675LT ihren Auftritt haben – Verdiene dir diese drei Autos sowie einen Haufen Gold!<br>• Rüste den McLaren P1 GTR, den McLaren MP4-X und den von der Community ausgewählten Audi R8 LMS Ultra komplett auf, um jede neue Exklusiv-Serie freizuschalten!<br><br>Vielen Dank fürs Spielen und \"keep racing\"!"},{"version_id":"819878776","version_name":"5.0.0","version_date":"2016-12-12 19:01:11.000 +0800","version_description":"Real Racing 3 erlebt die nächste Evolutionsstufe mit der Einführung der Formel E. Starte auf den Straßen von Hong Kong mit einem brandneuen Stadtkurs, der speziell für den ePrix entworfen wurde.<br>• Die Formel E feiert ihr Debüt in Real Racing mit dem Spezial-Event \"Hochspannung\", in dem du dir den Renault e.dams Formula E SRT_01E verdienen kannst<br>• Beherrsche den ambitionierten, ultramodernen Mercedes-AMG GT3 in einem neuen Spezial-Event – \"Erfolg serienmäßig\"<br>• Die Prüfung kehrt mit ihrer 11. Staffel zurück und präsentiert ein kraftvolles neues Formel-E-Fahrzeug – den NextEV TCR Formula E SRT_01E<br>• Rüste den Porsche 918 RSR Concept und den Mercedes-AMG GT3 voll auf, um die neuen Exklusiv-Serien freizuschalten!<br>• Außerdem: Zwei zeitlich begrenzte Serien mit dem ABT Schaeffler Formula E SRT_01E und der Chevrolet Corvette C7.R"},{"version_id":"820516229","version_name":"5.0.5","version_date":"2017-01-23 18:59:37.000 +0800","version_description":"Zwei neue Hot Hatches gehen in Real Racing 3 auf die Strecke! Der stärkste Kompaktwagen der Welt, der Mercedes-AMG A 45, und der vielseitige Renault Megane R.S. 275 Trophy-R kommen mit einer zeitlich begrenzten Serie. Das hier gibt es oben drauf:<br><br>• Fahre den Lamborghini Huracán LP 610-4 und den Ford Shelby GT350R, diesmal als R3-Spec-Versionen mit verbesserten Werten und exklusiven Lackierungen<br><br>• Gewinne den schnittigen Porsche 911 RSR als Belohnung für die Dempsey LTS Challenge<br><br>• Rüste den Aston Martin V12 Vantage S komplett auf, um die neue exklusive Serie freizuschalten, und verdiene dir mehr Geld und Ruhm"},{"version_id":"820960385","version_name":"5.1.0","version_date":"2017-02-20 19:00:50.000 +0800","version_description":"\"The Big One\" ist wieder da – Real Racing 3 kehrt zurück zum DAYTONA 500! Starte dieses actiongeladene Update mit einem Spezial-Event, in dem du an der Seite des Stewart-Haas Racing Teams fährst, um dir Danica Patricks Ford Fusion zu verdienen! Außerdem in diesem Update:<br>• Verdiene dir den Centenario LP 770-4, der mit einem brandneuen 8-tägigen Spezial-Event Einzug in Real Racing hält<br>• Fahre um die Chance, den neuen Porsche Cayman S zu gewinnen, wenn Die Prüfung zu ihrer 12. Staffel mit abwechslungsreicheren Events und anspruchsvolleren Rennen zurückkehrt<br>• Teste dein Können und verdiene dir Gold sowie Jimmie Johnsons Chevrolet SS, den Bugatti Veyron 16.4 Grand Sport Vitesse und den McLaren F1 GTR in drei zeitlich begrenzten Serien"},{"version_id":"821547413","version_name":"5.2.0","version_date":"2017-04-17 20:00:49.000 +0800","version_description":"In diesem Update bahnt sich der Koenigsegg One:1 – eines der exklusivsten Serienfahrzeuge aller Zeiten – mit einem 8-tägigen Spezial-Event seinen Weg in die Garage von Real Racing 3. Erlebe sein einmaliges Verhältnis von Leistung und Gewicht. Außerdem:<br>• Feiere 60 Jahre Nissan Skylines und gewinne den legendären \"Godzilla\", den Skyline GT-R Gruppe A (BNR32), und den \"Hakosuka\", den Skyline Hardtop 2000 GT-R (KPGC10), im packenden 7-tägigen Spezial-Event \"Entfessele das Biest\"<br>• Tritt in zwei zeitlich begrenzten Serien an und gewinne den 2015 Nissan GT-R LM und den BMW Hommage R<br>• Verdiene dir drei Autos und jede Menge Geld mit drei Flashback-Events: Die \"500\", Löwen von Leipzig und Reiter des Sturms<br>• Rüste deinen Ferrari F14 T voll auf und fahre in einer neuen Exklusiv-Serie mit gleichstarken Gegnern um große Belohnungen<br>Starte noch heute durch – Danke fürs Spielen!"},{"version_id":"822100770","version_name":"5.3.0","version_date":"2017-05-30 20:04:50.000 +0800","version_description":"Für ein nie dagewesenes viertes Jahr kehrt Real Racing 3 zum weltweit größten Langstreckenrennen zurück: Le Mans! Begib dich an die Startlinie mit dem glorreichen Mazda 787B, der als einziger Wagen mit Wankelmotor je dieses Rennen gewonnen hat. In diesem umfangreichen Update kannst du außerdem:<br><br>• den neuen und verbesserten Porsche 911 RSR im Spezial-Event „Rennsport neu definiert\" gewinnen<br>• die Rückkehr der Spezial-Evets Scuderia Ferrari Championship, Retro Rivals, und Stingray Evolution genießen<br>• den Jaguar XJR-9, den Porsche 962C und den Caterham Seven in drei zeitlich begrenzten Serien gewinnen<br>• den Koenigsegg One:1 vollständig tunen, um die neue Exclusive Series für mehr Gold und Ruhm freizuschalten<br><br>Wir haben außerdem den Knotenpunkt für sämtliche Neuigkeiten im Spiel eingeführt: Real Racing TV. Sieh es dir heute noch an und leg los!"},{"version_id":"822430982","version_name":"5.3.1","version_date":"2017-06-06 23:26:09.000 +0800","version_description":"Für ein nie dagewesenes viertes Jahr kehrt Real Racing 3 zum weltweit größten Langstreckenrennen zurück: Le Mans! Begib dich an die Startlinie mit dem glorreichen Mazda 787B, der als einziger Wagen mit Wankelmotor je dieses Rennen gewonnen hat. In diesem umfangreichen Update kannst du außerdem:<br><br>• den neuen und verbesserten Porsche 911 RSR im Spezial-Event „Rennsport neu definiert\" gewinnen<br>• die Rückkehr der Spezial-Evets Scuderia Ferrari Championship, Retro Rivals, und Stingray Evolution genießen<br>• den Jaguar XJR-9, den Porsche 962C und den Caterham Seven in drei zeitlich begrenzten Serien gewinnen<br>• den Koenigsegg One:1 vollständig tunen, um die neue Exclusive Series für mehr Gold und Ruhm freizuschalten<br><br>Wir haben außerdem den Knotenpunkt für sämtliche Neuigkeiten im Spiel eingeführt: Real Racing TV. Sieh es dir heute noch an und leg los!"},{"version_id":"822728631","version_name":"5.4.0","version_date":"2017-07-17 19:59:41.000 +0800","version_description":"Fahre zwei ikonische Mazdas, den RX-3 und den RX-7 Spirit R (FD), in zwei zeitlich begrenzten Serien bei Real Racing 3. Verdiene dir diese historischen Wagen in den Rennen und mach dich auf Folgendes gefasst:<br><br>• Starte deine Motoren zur Rückkehr des Mazda Furai in einem brandneuen, 8-tägigen Spezial-Event<br>• Verdiene dir den Jaguar C-X75, der als R3 Spec-Variante mit optischen Modifikationen und verbesserten Werten wiedergeboren wurde, in der zeitlich begrenzten Serie und in der Bonus-Serie<br>• Gewinne den Lamborghini Veneno oder Gold in einer anderen zeitlich begrenzten Serie<br>• Rüste den Mazda RX-7 Spirit R (FD) vollständig auf, um die neue Exklusiv-Serie freizuschalten<br>• Schalte einen Gang hoch mit der Rückkehr der Langstrecken-Challenge, Asterions Angriff, und der Speedrush TV-Challenge: Staffel 3<br><br>All dies und viele weitere Inhalte erwarten dich bei Real Racing TV. Sieh es dir heute noch an und leg los!"},{"version_id":"823358140","version_name":"5.5.0","version_date":"2017-09-05 20:00:38.000 +0800","version_description":"Zwei spannende Wettbewerbe kommen zu Real Racing 3! Zuerst begibt sich der McLaren 720S an die Startlinie. Mach dich bereit, deine Grenzen mit diesem Supersportwagen neu auszuloten. Danach kehrt das Bathurst 1000 zurück – der Gipfel des australischen V8-Supersportwagen-Rennsports! In diesem randvollen Update kannst du außerdem:<br><br>• Die Supersportwagen-Serie mit dem neuen Ford Falcon FG X und dem Holden Commodore VF sowie den McLaren P1 GTR in drei zeitlich begrenzten Serien fahren <br>• Bei der Rückkehr dieser drei Events Autos und Gold verdienen: Exklusiv-Präsentation, Project Impulse und Front Runner<br>• Den Mazda Furai vollständig aufrüsten, um die neue Exklusiv-Serie freizuschalten und dabei Gold und Ruhm abzusahnen <br><br>Außerdem kannst du an der Community-Challenge teilnehmen, bei der du gemeinsam mit anderen Spielern auf  Belohnungen hinarbeitest. Je mehr jeder Spieler beiträgt, desto größer fallen die Belohnungen für alle Teilnehmer aus! Wirf auch einen Blick auf Real Racing TV, um Einblicke ins Spiel sowie Tipps und Tricks zu bekommen. Sieh es dir heute noch an und leg los!"},{"version_id":"823850779","version_name":"5.6.0","version_date":"2017-10-23 19:02:04.000 +0800","version_description":"Der Aston Martin Vantage AMR Pro – der erste einer neuen Generation von Rennwagen – gleitet im 7-tägigen Spezial-Event „Von der Strecke auf den Asphalt\" nach Real Racing 3. Außerdem könnte der unfassbare Aston Martin One-77 bald dir gehören. In diesem vollgepackten Update kannst du:<br><br>• Den Lotus Type 125, den Jaguar XE SV Project 8 und den Lamborghini Huracán Super Trofeo EVO in der jeweiligen zeitlich begrenzten Serie verdienen<br>• Bei der Rückkehr der Flashback-Events Trackday-Beherrschung, Generationen und Speedrush TV 2 die Konkurrenz dominieren<br>• Zwei exklusive Serien freischalten und Gold und Ruhm absahnen, wenn du den Bugatti Veyron 16,4 und the McLaren 720s Coupé vollständig aufrüstest<br><br>Behalte auch Real Racing TV im Auge für weitrere Einblicke ins Spiel, Tipps und Tricks. Sieh es dir heute an und leg los!"},{"version_id":"824441517","version_name":"6.0.0","version_date":"2017-12-04 19:00:47.000 +0800","version_description":"Pünktlich zur Weihnachtssaison rauscht der ikonische, rekordbrechende McLaren MP4/4 mit voller Kraft auf die brandneue Weltmeisterschaftsstrecke, den Red Bull Ring! Schnall dich an, denn in diesem actiongeladenen Update kannst du:<br><br>• die Konkurrenz herausfordern und dir den aufgemotzten Nissan Silvia R3 Spec  - der 200. Wagen in Real Racing 3 – sowie den 2017er Ford GT in zwei zeitlich begrenzten Serien verdienen<br>• dein Können beim Spezial-Event „Der perfekte Sturm“ zur Schau stellen und den Lamborghini Huracán Performante in deine Sammlung aufnehmen<br>• dich beim brandneuen Spezial-Event „Furchtlos“ hinter das Steuer des legendären McLaren MP4/4 setzen<br>• den Beginn der 4. Formel-E-Saison mit einem Zeitfahren-Event feiern<br>• die Rückkehr des Spießrutenlaufs mit dem Porsche 911 RSR Dempsey erleben<br><br>Außerdem warten neue Folgen von Real Racing TV und ein paar weitere Überraschungen auf dich. Sieh es dir heute noch an und leg los!"},{"version_id":"825312008","version_name":"6.0.7","version_date":"2018-01-22 19:00:12.000 +0800","version_description":"Mach dich bereit für drei zeitlich begrenzte Serien, die deinen Puls höher schlagen lassen, und gewinne drei fantastische Wagen von unseren aufregendsten Herstellern! Schlage die Konkurrenz und hol dir den:<br> <br>• Lamborghini Miura<br>• Jaguar CX75<br>• McLaren 570GT<br><br>Sieh sie dir heute an und fahr los!"},{"version_id":"825814683","version_name":"6.1.0","version_date":"2018-02-12 19:00:25.000 +0800","version_description":"Spüre den Nervenkitzel des großartigen amerikanischen Rennens, wenn Real Racing 3 in unserem dritten spannenden NASCAR-Update nach Daytona zurückkehrt. Mach dich auf Action gefasst, wenn du:<br><br>• die Konkurrenz in drei brandneuen zeitlich begrenzten NASCAR-Serien mit dem NASCAR 2018 Chevy Camaro, Toyota Camry und Ford Fusion Staub fressen lässt<br>• im Spezial-Event „Kräftegleichgewicht\" dein Können unter Beweis stellst und den 2017er Aston Martin Vantage GTE in deine Garage stellst<br>• den 2017er Chevrolet Camaro SS und den SPADA Codatronca Barchetta in zwei zeitlich begrenzten Serien verdienst<br>• unseren fünften Geburtstag mit einer besonderen Überraschung feierst<br><br>Außerdem erwarten dich: Ein verbessertes, spielerfreundlicheres Design des Hauptmenüs, neue Episoden von Real Racing TV und ein paar andere Überraschungen. Sieh es dir heute noch an und leg los!"},{"version_id":"826221286","version_name":"6.2.0","version_date":"2018-03-26 18:59:48.000 +0800","version_description":"Real Racing 3 liefert seinen Spielern ein Ferrari-Erlebnis wie kein anderes – von 1984 bis heute! Gib Vollgas, wenn du:<br><br>• Dieses unglaubliche Update mit dem klassischen 1984er Ferrari Testarossa in einem brandneuen Spezial-Event beginnst<br>• Drei zeitlich begrenzte Serien mit dem 2016er Ferrari J50, dem 2013er Ferrari F12berlinetta und dem 2004er Ferrari F430 absolvierst<br>• Dein Können im Spezial-Event „Erbschaft\" unter Beweis stellst und den 2017er Ferrari 812 Superfast in deine Garage holst<br><br>Außerdem warten Flashback-Events, neue Folgen von Real Racing TV und weitere Überraschungen auf dich. Sieh es dir heute noch an und leg los!"},{"version_id":"826807596","version_name":"6.3.1","version_date":"2018-05-14 20:43:03.000 +0800","version_description":"Real Racing 3 kehrt an den Ort des ältesten Langstreckenrennens der Welt zurück: Le Mans! Rolle mit drei nagelneuen Porsches an den Start. Außerdem haben wir Real Racing TV umgestaltet und das Spiel um eine völlig neue Show mit Rennsportlegende Dario Franchitti erweitert. Darüber findest du in diesem gerammelt vollen Update :<br><br>• Drei völlig neue Porsches, die du dir verdienen kannst: den 2018er Porsche&nbsp;911&nbsp;RSR, den 1970er Porsche&nbsp;917 und den 1998er Porsche&nbsp;911&nbsp;GT1<br>• Den schnittigen 1998er Nissan&nbsp;R390&nbsp;GT1, den du mithilfe einer neuen, zeitbegrenzten Rennserie in deine Garage verfrachten kannst<br><br>Und exklusives Filmmaterial, das wir anlässlich des Beginns unserer Feierlichkeiten zu Porsches 70. Geburtstag veröffentlichen. Sieh es dir heute noch an und leg los!"},{"version_id":"827550541","version_name":"6.4.2","version_date":"2018-07-02 19:59:40.000 +0800","version_description":"Real Racing 3 erhält eine Rückblende mit drei kultigen Mercedes aus den 90ern. Bereite dich dann auf authentische Formel E-Fahrer und die neue New York City-Strecke der Formel E vor. Hast du das Zeug dazu, diese Profifahrer auszustechen? Dann beweise es! Auch in diesem riesigen Update: <br><br>• Drei klassische Mercedes für deine Garage: Der 1991er Mercedes C11, 1998er Mercedes CLK LM und der 1990er Mercedes-Benz 190 EVO II<br>• Beweise dich in diesem unglaublichen 9-tägigen Zeitrennen-Wettbewerb auf der neuen New York City Strecke gegen andere Formel E-Fahrer <br>• Fahre die neuen 2017er und 2018er Formel E-Autos auf dieser Strecke<br>• Verdiene dir den 1986er Porsche 959 Sport und setze die 70-Jahres-Feier von Porsche fort<br><br>Real Racing TV bringt dir außerdem neue Folgen von Game Team und Real Cars With Dario Franchitti – neben ein paar Überraschungen. Sieh es dir heute noch an und leg los!"},{"version_id":"828116091","version_name":"6.5.1","version_date":"2018-08-21 18:28:59.000 +0800","version_description":"In diesem unglaublichen Real Racing 3 Update feiert der brandneue McLaren 600LT sein Debüt in einem Mobile-Spiel und ist eines von sechs neuen Autos. Außerdem geht  Australias’s Bathurst 1000 in sein drittes Jahr und die Spieler erhalten neue Möglichkeiten, sich mit der Konkurrenz zu messen.  Lade dieses riesige Update jetzt herunter und tue Folgendes: <br><br>• Nimm an einem neuen Spezial-Event teil, um den 2017er Pagani Huayra BC deiner Garage hinzuzufügen<br>• Verdiene dir den 2018er Holden Commodore ZB, den 2018er Ford Falcon FG X und den 2018er Nissan Altima, indem du an drei unterschiedlichen, zeitlich begrenzten „Bathurst 1000“-Serien teilnimmst <br>• Stelle dich McLarens Shadow Project und nimm mit dem McLaren 600LT an 2 Zeitrennen teil<br>• Besiege deine Konkurrenten im aktualisierten und verbesserten Online-Mehrspieler<br>• Setzte die Feierlichkeiten zum 70-jährigen Jubiläum von Porsche fort, indem du dir den 1977er Porsche 936 verdienst<br><br>Außerdem strahlt Real Racing TV&nbsp;– neben einigen weiteren Überraschungen&nbsp;– neue Folgen von Game Team und Real Cars With Dario Franchitti aus. Sieh es dir heute noch an und leg los!"},{"version_id":"828273880","version_name":"7.6.0","version_date":"2019-10-14 18:29:22.000 +0800","version_description":"Der neue Hochleistungssportwagen Lamborghini Aventador SVJ und der ikonische Lamborghini Diablo SV heizen in diesem aufregenden Update durch Real Racing 3:\n<br>•Dieses Update bringt drei neue GT-Wagen: den 2018er Ferrari 488 GTE Evo (AF Corse), den 2019er Ford GT Le Mans und den 2018er Aston Martin Vantage GTE! Alle drei Wagen gibt es in der 2019er Saison der Ausdauer GT!\n<br>•Wähle zwischen dem Ford GT Le Mans und dem Ferrari 488 GTE Evo (AF Corse) in einem brandneuen Spezial-Event! Führe deine Seite zum Sieg und bringe das Auto mit nach Hause! Keine Sorge – egal, für welches Auto du dich nicht entscheidest, du kannst es in einer zeitlich begrenzten Serie verdienen.\n<br>•Hol dir den Lamborghini Countach und all diese neuen Wagen in eine brandneuen zeitlich begrenzten Serie\n<br>•Verbessere den Pagani Zonda R und den Ferrari F8 Tributo vollständig, um neue exklusive Serien freizuschalten!\n<br>Schau außerdem bei Real Racing TV für neue Folgen von Real Cars With Dario Franchitti, Game Team und den Real Racing Challenges vorbei. Mach dich für das Rennen bereit und gib Gas!"},{"version_id":"828273880","version_name":"8.0.0","version_date":"2019-11-25 19:01:23.000 +0800","version_description":"Das größte Update von Real Racing 3 ist hier. Wir heißen die Formel 1 willkommen! Erlebe den Gipfel des Motorsports mit vielen neuen Inhalten, darunter Große Preise 2019, tägliche Rennen, Invitationals, Championship Series und:\n<br>• Wähle dein Team und führe es in fünf Großer-Preis-Events zum Sieg. Den Anfang macht der Formel 1 Etihad Airways Abu Dhabi Großer Preis 2019 auf der brandneuen Yas-Marina-Strecke\n<br>• Genieße auch vier aktualisierte Klassiker der Formel 1 2019: Monza, Silverstone, Circuit of the Americas und Suzuka\n<br>• Alle zehn Formel-1-Teams und alle 20 Formel-1-Fahrer geben ihr Debüt in Real Racing 3 und sind alle spielbar\n<br>• Schließe alle fünf Großer-Preis-Events 2019 ab, um das Mercedes-AMG GT R F1 Safety Car zu erhalten\n<br>\n<br>Zusätzlich zum unglaublichen Formel-1-Inhalt bekommst du auch:\n<br>• Bereise die Welt mit Ahmad, nimm am größten Hypercar-Rennen aller Zeiten teil und verdiene dir den Koenigsegg Agera RS in einem neuen 7-tägigen Spezialevent namens „Aggressive Ambition“\n<br>• Zwei klassische Hondas – der Civic Type-R und der Integra Type-R – kommen aus der Vergangenheit zu Real Racing 3\n<br>• Hol dir die neuen Hondas, den unglaublich schnellen Bugatti Chiron, den rekordverdächtigen Porsche 919 Hybrid Evo und Goldbelohnungen in vier zeitlich begrenzte Serien\n<br>• Verbessere den Lamborghini Aventador SVJ und den Jaguar XJ220 vollständig und schalte die neuen Exklusiv-Serien frei\n<br>\n<br>Außerdem wurde das Spiel ordentlich aufgemotzt, darunter mit dem brandneuen Formel1-Motorsport-Hub! Halte außerdem Ausschau nach neuen Episoden von Game Team und Real Racing Challenges so viel weiteren aufregenden Inhalten von Real Racing 3 und der Formel 1. Begib dich an den Start und gib Gas!"},{"version_id":"828273880","version_name":"7.5.0","version_date":"2019-09-02 20:00:34.000 +0800","version_description":"Fünf fantastische Ferraris fahren in dein Real Racing 3 mit diesem rot blitzenden Update, mit dem du Folgendes kannst:\n<br>•Zeige deiner Konkurrenz aus welchem Holz du geschnitzt bist, indem du dir Ferraris wunderschönen F8 Tributo in einem brandneuen Track Day Spezial-Event verdienst.\n<br>•Besiege den legendären Ferrari 250 GTO und den unglaublichen Ferrari F40 LM in den Ausdauer-GT-Saison 1962 &amp; 1989\n<br>•Hol dir den Ferrari 360 Modena, Ferrari 250 GTO, Ferrari 500 TRC, Ferrari F40 LM und Lamborghini Aventador LP 700-4 in fünf zeitlich begrenzten Serien\n<br>•Verbessere deine Porsche 911 GT2 RS Clubsport und den McLaren 650S GT3 vollständig, um neue exklusive Serien freizuschalten\n<br>\n<br>Schau außerdem bei Real Racing TV für neue Folgen von Real Cars With Dario Franchitti, Game Team und den Real Racing Challenges vorbei. Mach dich für das Rennen bereit und gib Gas!"},{"version_id":"828273880","version_name":"7.4.6","version_date":"2019-08-05 20:04:06.000 +0800","version_description":"Drei brandneue Porsche-Wagen rasen auf die Strecke von Real Racing 3 mit diesem aufregenden Update:\n<br>•Schau dir den renntauglichen 2018er Porsche 911 GT3 RS, den legendären 1979er Porsche 935 sowie den coolen Mercedes-Benz SLR McLaren 722 an\n<br>•Beweise dein fahrerisches Talent beim Debüt der brandneuen, zeitlich begrenzten Renntag-Eventserie und verdiene dir den wegweisenden Porsche 911 GT2 RS Clubsport \n<br>•Fahre historische Langstrecken-Prototypen der Gruppe-5-Prototypen-Saison 1979\n<br>•Verdiene dir den Lamborghini Miura und den Lotus 3-Eleven in zwei zeitlich begrenzten Serien\n<br>•Rüste sowohl den Lamborghini Veneno als auch den Enzo Ferrari vollständig auf, um neue exklusive Serien freizuschalten!\n<br>\n<br>Schau außerdem bei Real Racing TV für neue Folgen von Real Cars With Dario Franchitti, Game Team und den Real Racing Challenges vorbei. Mach dich für das Rennen bereit und gib Gas!"},{"version_id":"828273880","version_name":"7.4.0","version_date":"2019-07-01 20:00:35.000 +0800","version_description":"Es ist das Debüt unserer GT4 Motorsport Gruppe in diesem aktionsgeladenen Real Racing 3 Update! Schnall dich an und bereite dich darauf vor:\n<br>•Teste dich in der neuen GT4 Motorsport Gruppe mit fünf zeitlich begrenzten Serien und fünf brandneuen Autos: 2019er Porsche 718 Cayman GT4 Clubsport, 2019er Aston Martin Vantage GT4, 2018er Chevrolet Camaro GT4.R, 2018er Mercedes-AMG GT4, 2018er Audi R8 LMS GT4\n<br>•Erhalte eine weitere Chance, ein Auto aus einer früheren Veranstaltung zu gewinnen. Nehme zetlich begrenzte Serien und Spezial-Events von früheren Updates an\n<br>•Vervollständige Upgrades des Porsche 919 Hybrid Evo und des Renault R.S 01, um eine neue Exclusiv-Serie freizuschalten.\n<br>•Erlebe eine brandneue Episode von Real Cars mit Dario Franchitti im Real Racing TV, danach stelle dich einer neuen zeitlich begrenzten Serie, um dir den Lamborghini Sesto Elemento zu verdienen.\n<br>\n<br>Außerdem präsentieren wir Real Racing Herausforderungen in RRTV, eine neue Episode Game Team und ein paar weitere Überraschungen. Dreh die Motoren auf und starte das Rennen!"},{"version_id":"828273880","version_name":"7.3.0","version_date":"2019-05-06 20:00:59.000 +0800","version_description":"Schnall dich an, Rennfan! Bugatti kommt mit einem der größten Updates des Jahres zu Real Racing 3! Sieh dir dieses unglaubliche Update an, das Folgendes zu bieten hat:<br>•Das Debüt des Circuit Bugatti auf dem Circuit des 24 Heures<br>•Die lang erwartete 4. Saison von Speedrush. Beweise dein Können und verdiene dir eines der begehrtesten Autos in der Geschichte von Real Racing 3 – den Bugatti Chiron Sport<br>•Verdiene dir den Bugatti Chiron, Bugatti EB 110 Super Sport, 2019er Audi TT RS Coupé, Lamborghini Huracán Performante und Ferrari F50 in fünf neuen, zeitlich begrenzten Serien<br>•Zwei deiner liebsten Spezial-Events kehren als Flashback-Events zurück: One On 1 und Furai Rising<br>Und wenn dir das noch nicht reicht, kannst du auf dem Formel-E-Circuit Berlin über den Flughafen Berlin-Tempelhof rasen. Sieh dir außerdem auf RRTV die neuesten Episoden von Game Team sowie ein paar Überraschungen an. Starte noch heute durch!"},{"version_id":"828273880","version_name":"7.3.6","version_date":"2019-06-03 20:02:24.000 +0800","version_description":"Real Racing 3 kehrt an den Ort des ältesten Langstreckenrennens der Welt zurück: Die 24 Stunden von Le Mans. Außerdem in diesem Update:<br>•Nimm in einem spannenden, zeitlich begrenzten „Renntag“-Event an den 24 Stunden von Le Mans 2019 teil! Gewinne das Event und verdiene deinen eigenen 2019er Porsche 911 RSR<br>•Verdiene in vier neuen, zeitlich begrenzten Serien den Aston Martin Vantage 59, Lancia LC2, Porsche 919 Hybrid Evo und Lamborghini Veneno<br>•Tritt in zwei brandneuen Motorsport-Serien an, inspiriert von der 2019er Saison des GT Racing und der 1984er Saison des Gruppe C Prototype-Racing<br>•Noch mehr deiner Lieblings-Spezialevents sind zurück: Rennsport neu definiert und Spitzenreiter<br>•Rüste den Bugatti Chiron Sport und den Bugatti Veyron 16.4 Grand Sport Vitesse vollständig auf, um zwei neue Exklusiv-Serien freizuschalten<br><br>Schau dir neben einigen Überraschungen auch im RRTV neue Episoden vom Game Team und \"Real Cars with Dario Franchitti\" an. Lass den Motor aufheulen und gib Gas!"},{"version_id":"828273880","version_name":"7.1.5","version_date":"2019-03-04 19:00:10.000 +0800","version_description":"De grootste sportwagenorganisatie van Noord-Amerika, IMSA, racet naar Real Racing 3 in een spannende gloednieuwe update, waarin je het volgende kunt doen:<br>•Speel vier geweldige tijdelijke WeatherTech SportsCar Championship-series en ervaar zelf de Grand Tour Daytona-klasse met de Lamborghini Huracán GT3, Ferrari 488 GT3, Acura NSX GT3 en BMW M6 GT3<br>•Voer een volledige upgrade uit van de 1988 Mercedes CLK-LM en 2015 Hennessey Venom GT en krijg toegang tot hun nieuwe exclusieve series<br>•Bekijk nieuwe tips en trucs in RRTV<br><br>Domineer het veld op een van de spannendste evenementen van het seizoen achter het stuur van de snelste wagens in de industrie! Ga vandaag nog kijken. De race begint!"},{"version_id":"828273880","version_name":"6.5.1","version_date":"2018-08-21 18:28:59.000 +0800","version_description":"In diesem unglaublichen Real Racing 3 Update feiert der brandneue McLaren 600LT sein Debüt in einem Mobile-Spiel und ist eines von sechs neuen Autos. Außerdem geht  Australias’s Bathurst 1000 in sein drittes Jahr und die Spieler erhalten neue Möglichkeiten, sich mit der Konkurrenz zu messen.  Lade dieses riesige Update jetzt herunter und tue Folgendes: <br><br>• Nimm an einem neuen Spezial-Event teil, um den 2017er Pagani Huayra BC deiner Garage hinzuzufügen<br>• Verdiene dir den 2018er Holden Commodore ZB, den 2018er Ford Falcon FG X und den 2018er Nissan Altima, indem du an drei unterschiedlichen, zeitlich begrenzten „Bathurst 1000“-Serien teilnimmst <br>• Stelle dich McLarens Shadow Project und nimm mit dem McLaren 600LT an 2 Zeitrennen teil<br>• Besiege deine Konkurrenten im aktualisierten und verbesserten Online-Mehrspieler<br>• Setzte die Feierlichkeiten zum 70-jährigen Jubiläum von Porsche fort, indem du dir den 1977er Porsche 936 verdienst<br><br>Außerdem strahlt Real Racing TV&nbsp;– neben einigen weiteren Überraschungen&nbsp;– neue Folgen von Game Team und Real Cars With Dario Franchitti aus. Sieh es dir heute noch an und leg los!"},{"version_id":"828273880","version_name":"7.1.0","version_date":"2019-02-11 19:00:52.000 +0800","version_description":"Spüre das Adrenalin von The Great American Race in Real Racing 3 erneut. In unserem fünften NASCAR-Update in unserem vierten Jahr kehren wir nach Daytona zurück. Schnall dich an für all die Action:<br><br>•Verheize deine Konkurrenten in drei brandneuen, zeitlich begrenzten Serien mit dem NASCAR 2019 Chevy NASCAR, Toyota NASCAR und Ford Mustang NASCAR<br>•Hol dir den 2017er Ferrari 812 Superfast mit einer zeitlich begrenzten Serie<br>•Stelle dich Rennteam-Events, Wöchentlichen Zeitrennen und Online-Mehrspielerevents in diesem Update<br>•Feier den 6. Geburtstag von Real Racing 3 mit einem brandneuen Zeitrennen-Wettbewerb und dem Dodge Challenger SRT Hellcat<br><br>All das, neue Folgen Game Team in RRTV und weitere Überraschungen warten auf dich. Sieh es dir heute noch an und leg los!"},{"version_id":"828273880","version_name":"6.6.3","version_date":"2018-10-24 17:12:29.000 +0800","version_description":"Es ist ein Update voll Bayrischer Boni zur Feier der deutschen Automobilhersteller mit Porsche, BMW und Mercedes. Lade dieses massive Update für Folgendes herunter: <br><br>•Drei brandneue BMW-Autos für deine Garage: der klassische 1980er BMW M1, der 2017er BMW M4 Driving Experience und der 2018er BMW M8 GTE<br>•Verdiene dir das 2016er Mercedes AMG C63 Touring Car in einer aufregenden, zeitlich begrenzten Serie<br>•Versuch dein Glück beim neuen Spezialevent „König des Rings“ und verdiene dir den 2018er Porsche 911 GT2 Rs<br>•Setze die Feier des 70-jährigen Jubiläums von Porsche fort, indem du dir den 1968er Porsche 909 Bergspyder verdienst<br>•Und verpasse nicht deine Chance, beim McLaren Shadow Project in unserem spannenden Zeitrennen-Wettbewerb mitzumachen<br><br>Sieh dir Real Racing TV mit neuen Folgen von Game Team, Real Cars With Dario Franchitti und ein paar weiteren Überraschungen an. Schalte heute ein und fahre los!"},{"version_id":"828309023","version_name":"6.6.1","version_date":"2018-10-08 19:01:21.000 +0800","version_description":"Es ist ein Update voll Bayrischer Boni zur Feier der deutschen Automobilhersteller mit Porsche, BMW und Mercedes. Lade dieses massive Update für Folgendes herunter: <br><br>•Drei brandneue BMW-Autos für deine Garage: der klassische 1980er BMW M1, der 2017er BMW M4 Driving Experience und der 2018er BMW M8 GTE<br>•Verdiene dir das 2016er Mercedes AMG C63 Touring Car in einer aufregenden, zeitlich begrenzten Serie<br>•Versuch dein Glück beim neuen Spezialevent „König des Rings“ und verdiene dir den 2018er Porsche 911 GT2 Rs<br>•Setze die Feier des 70-jährigen Jubiläums von Porsche fort, indem du dir den 1968er Porsche 909 Bergspyder verdienst<br>•Und verpasse nicht deine Chance, beim McLaren Shadow Project in unserem spannenden Zeitrennen-Wettbewerb mitzumachen<br><br>Sieh dir Real Racing TV mit neuen Folgen von Game Team, Real Cars With Dario Franchitti und ein paar weiteren Überraschungen an. Schalte heute ein und fahre los!"},{"version_id":"828886761","version_name":"6.6.2","version_date":"2018-10-11 23:11:59.000 +0800","version_description":"Es ist ein Update voll Bayrischer Boni zur Feier der deutschen Automobilhersteller mit Porsche, BMW und Mercedes. Lade dieses massive Update für Folgendes herunter: <br><br>•Drei brandneue BMW-Autos für deine Garage: der klassische 1980er BMW M1, der 2017er BMW M4 Driving Experience und der 2018er BMW M8 GTE<br>•Verdiene dir das 2016er Mercedes AMG C63 Touring Car in einer aufregenden, zeitlich begrenzten Serie<br>•Versuch dein Glück beim neuen Spezialevent „König des Rings“ und verdiene dir den 2018er Porsche 911 GT2 Rs<br>•Setze die Feier des 70-jährigen Jubiläums von Porsche fort, indem du dir den 1968er Porsche 909 Bergspyder verdienst<br>•Und verpasse nicht deine Chance, beim McLaren Shadow Project in unserem spannenden Zeitrennen-Wettbewerb mitzumachen<br><br>Sieh dir Real Racing TV mit neuen Folgen von Game Team, Real Cars With Dario Franchitti und ein paar weiteren Überraschungen an. Schalte heute ein und fahre los!"},{"version_id":"828982514","version_name":"6.6.3","version_date":"2018-10-24 17:12:29.000 +0800","version_description":"Es ist ein Update voll Bayrischer Boni zur Feier der deutschen Automobilhersteller mit Porsche, BMW und Mercedes. Lade dieses massive Update für Folgendes herunter: <br><br>•Drei brandneue BMW-Autos für deine Garage: der klassische 1980er BMW M1, der 2017er BMW M4 Driving Experience und der 2018er BMW M8 GTE<br>•Verdiene dir das 2016er Mercedes AMG C63 Touring Car in einer aufregenden, zeitlich begrenzten Serie<br>•Versuch dein Glück beim neuen Spezialevent „König des Rings“ und verdiene dir den 2018er Porsche 911 GT2 Rs<br>•Setze die Feier des 70-jährigen Jubiläums von Porsche fort, indem du dir den 1968er Porsche 909 Bergspyder verdienst<br>•Und verpasse nicht deine Chance, beim McLaren Shadow Project in unserem spannenden Zeitrennen-Wettbewerb mitzumachen<br><br>Sieh dir Real Racing TV mit neuen Folgen von Game Team, Real Cars With Dario Franchitti und ein paar weiteren Überraschungen an. Schalte heute ein und fahre los!"},{"version_id":"829311758","version_name":"7.0.0","version_date":"2018-11-26 19:02:21.000 +0800","version_description":"Die brandneue Circuit of the Americas-Strecke in Austin, Texas, gibt ihr Debüt in Real Racing 3. Zusätzlich warten 7 neue Autos und eine Menge aufregender Events auf dich. In diesem Update: <br><br>•Fünf neue Nissan für deine Garage: 1969 240z, 1992 300ZX, 1997 Skyline GT-R V-spec, 2018 370z Nismo und 2018 GT-R Nismo<br>•Ferrari FXXK EVO in einer spannenden, zeitlich begrenzten Serie<br>•Feiere 70 Jahre Porsche mit dem 1958er Porsche 178<br><br>Nimm außerdem an unserem tollen Feiertag-Vinyl-Wettbewerb teil. Schau auch bei Real Racing TV rein mit weiteren Folgen von Game Team und Real Cars With Dario Franchitti – natürlich gibt es noch einige Überraschungen. Schalte heute ein und fahre los!"},{"version_id":"829595212","version_name":"7.0.5","version_date":"2019-01-14 18:56:58.000 +0800","version_description":"Wir läuten das neue Jahr ein und erhöhen die Begeisterung mit diesem Real Racing 3 Update und 4 neuen R3 Spec Nissans! Besiege die Konkurrenz und erhalte den:<br> <br>•Nissan 240z R3 Spec<br>•Nissan 370z R3 Spec<br>•Nissan Skyline GT-R (R34) R3 Spec<br>•Nissan GT-R (R35) R3 Spec<br><br>Außerdem neue Inhalte von RRTV. Sieh es dir heute noch an und leg los!"},{"version_id":"830174487","version_name":"7.1.0","version_date":"2019-02-11 19:00:52.000 +0800","version_description":"Spüre das Adrenalin von The Great American Race in Real Racing 3 erneut. In unserem fünften NASCAR-Update in unserem vierten Jahr kehren wir nach Daytona zurück. Schnall dich an für all die Action:<br><br>•Verheize deine Konkurrenten in drei brandneuen, zeitlich begrenzten Serien mit dem NASCAR 2019 Chevy NASCAR, Toyota NASCAR und Ford Mustang NASCAR<br>•Hol dir den 2017er Ferrari 812 Superfast mit einer zeitlich begrenzten Serie<br>•Stelle dich Rennteam-Events, Wöchentlichen Zeitrennen und Online-Mehrspielerevents in diesem Update<br>•Feier den 6. Geburtstag von Real Racing 3 mit einem brandneuen Zeitrennen-Wettbewerb und dem Dodge Challenger SRT Hellcat<br><br>All das, neue Folgen Game Team in RRTV und weitere Überraschungen warten auf dich. Sieh es dir heute noch an und leg los!"},{"version_id":"830257170","version_name":"7.1.5","version_date":"2019-03-04 19:00:10.000 +0800","version_description":"De grootste sportwagenorganisatie van Noord-Amerika, IMSA, racet naar Real Racing 3 in een spannende gloednieuwe update, waarin je het volgende kunt doen:<br>•Speel vier geweldige tijdelijke WeatherTech SportsCar Championship-series en ervaar zelf de Grand Tour Daytona-klasse met de Lamborghini Huracán GT3, Ferrari 488 GT3, Acura NSX GT3 en BMW M6 GT3<br>•Voer een volledige upgrade uit van de 1988 Mercedes CLK-LM en 2015 Hennessey Venom GT en krijg toegang tot hun nieuwe exclusieve series<br>•Bekijk nieuwe tips en trucs in RRTV<br><br>Domineer het veld op een van de spannendste evenementen van het seizoen achter het stuur van de snelste wagens in de industrie! Ga vandaag nog kijken. De race begint!"},{"version_id":"830715572","version_name":"7.2.0","version_date":"2019-04-01 19:04:37.000 +0800","version_description":"Die Action von IMSA WeatherTech SportsCar geht in diesem aufregenden Update weiter. Es kommt ein Vorgeschmack auf die neue, mächtige internationale Daytona Protoype-Klasse! Folgendes ist zum ersten Mal möglich: <br><br>• Verdiene dir den Ferrari FXXK und Porsche 918 Spyder während der Flashback-Events. Sie sind für die gesamte Dauer des Updates verfügbar. <br>• Vergleiche das Fahrverhalten der DPi-Klasse mit Autos wie dem 2018er Acura DPi, 2018er Cadillac DPi-V.R und 2018er Mazda DPi<br>• Setze dich hinter das Steuer von zwei Ikonen aus Hondas Vergangenheit – dem zeitlosen Honda S2000 GT und dem vorzüglichen Honda NSX-R<br><br>Außerdem gibt es neue Tipps und Tricks in der neuesten Episode von Real Racing TV. Kämpfe dich aufs Podium mit den IMSA DPi-Autos – Fahre noch heute!"},{"version_id":"831111135","version_name":"7.3.0","version_date":"2019-05-06 20:00:59.000 +0800","version_description":"Schnall dich an, Rennfan! Bugatti kommt mit einem der größten Updates des Jahres zu Real Racing 3! Sieh dir dieses unglaubliche Update an, das Folgendes zu bieten hat:<br>•Das Debüt des Circuit Bugatti auf dem Circuit des 24 Heures<br>•Die lang erwartete 4. Saison von Speedrush. Beweise dein Können und verdiene dir eines der begehrtesten Autos in der Geschichte von Real Racing 3 – den Bugatti Chiron Sport<br>•Verdiene dir den Bugatti Chiron, Bugatti EB 110 Super Sport, 2019er Audi TT RS Coupé, Lamborghini Huracán Performante und Ferrari F50 in fünf neuen, zeitlich begrenzten Serien<br>•Zwei deiner liebsten Spezial-Events kehren als Flashback-Events zurück: One On 1 und Furai Rising<br>Und wenn dir das noch nicht reicht, kannst du auf dem Formel-E-Circuit Berlin über den Flughafen Berlin-Tempelhof rasen. Sieh dir außerdem auf RRTV die neuesten Episoden von Game Team sowie ein paar Überraschungen an. Starte noch heute durch!"},{"version_id":"831390672","version_name":"7.3.6","version_date":"2019-06-03 20:02:24.000 +0800","version_description":"Real Racing 3 kehrt an den Ort des ältesten Langstreckenrennens der Welt zurück: Die 24 Stunden von Le Mans. Außerdem in diesem Update:<br>•Nimm in einem spannenden, zeitlich begrenzten „Renntag“-Event an den 24 Stunden von Le Mans 2019 teil! Gewinne das Event und verdiene deinen eigenen 2019er Porsche 911 RSR<br>•Verdiene in vier neuen, zeitlich begrenzten Serien den Aston Martin Vantage 59, Lancia LC2, Porsche 919 Hybrid Evo und Lamborghini Veneno<br>•Tritt in zwei brandneuen Motorsport-Serien an, inspiriert von der 2019er Saison des GT Racing und der 1984er Saison des Gruppe C Prototype-Racing<br>•Noch mehr deiner Lieblings-Spezialevents sind zurück: Rennsport neu definiert und Spitzenreiter<br>•Rüste den Bugatti Chiron Sport und den Bugatti Veyron 16.4 Grand Sport Vitesse vollständig auf, um zwei neue Exklusiv-Serien freizuschalten<br><br>Schau dir neben einigen Überraschungen auch im RRTV neue Episoden vom Game Team und \"Real Cars with Dario Franchitti\" an. Lass den Motor aufheulen und gib Gas!"},{"version_id":"831755590","version_name":"7.4.0","version_date":"2019-07-01 20:00:35.000 +0800","version_description":"Es ist das Debüt unserer GT4 Motorsport Gruppe in diesem aktionsgeladenen Real Racing 3 Update! Schnall dich an und bereite dich darauf vor:\n<br>•Teste dich in der neuen GT4 Motorsport Gruppe mit fünf zeitlich begrenzten Serien und fünf brandneuen Autos: 2019er Porsche 718 Cayman GT4 Clubsport, 2019er Aston Martin Vantage GT4, 2018er Chevrolet Camaro GT4.R, 2018er Mercedes-AMG GT4, 2018er Audi R8 LMS GT4\n<br>•Erhalte eine weitere Chance, ein Auto aus einer früheren Veranstaltung zu gewinnen. Nehme zetlich begrenzte Serien und Spezial-Events von früheren Updates an\n<br>•Vervollständige Upgrades des Porsche 919 Hybrid Evo und des Renault R.S 01, um eine neue Exclusiv-Serie freizuschalten.\n<br>•Erlebe eine brandneue Episode von Real Cars mit Dario Franchitti im Real Racing TV, danach stelle dich einer neuen zeitlich begrenzten Serie, um dir den Lamborghini Sesto Elemento zu verdienen.\n<br>\n<br>Außerdem präsentieren wir Real Racing Herausforderungen in RRTV, eine neue Episode Game Team und ein paar weitere Überraschungen. Dreh die Motoren auf und starte das Rennen!"},{"version_id":"832149335","version_name":"7.4.6","version_date":"2019-08-05 20:04:06.000 +0800","version_description":"Drei brandneue Porsche-Wagen rasen auf die Strecke von Real Racing 3 mit diesem aufregenden Update:\n<br>•Schau dir den renntauglichen 2018er Porsche 911 GT3 RS, den legendären 1979er Porsche 935 sowie den coolen Mercedes-Benz SLR McLaren 722 an\n<br>•Beweise dein fahrerisches Talent beim Debüt der brandneuen, zeitlich begrenzten Renntag-Eventserie und verdiene dir den wegweisenden Porsche 911 GT2 RS Clubsport \n<br>•Fahre historische Langstrecken-Prototypen der Gruppe-5-Prototypen-Saison 1979\n<br>•Verdiene dir den Lamborghini Miura und den Lotus 3-Eleven in zwei zeitlich begrenzten Serien\n<br>•Rüste sowohl den Lamborghini Veneno als auch den Enzo Ferrari vollständig auf, um neue exklusive Serien freizuschalten!\n<br>\n<br>Schau außerdem bei Real Racing TV für neue Folgen von Real Cars With Dario Franchitti, Game Team und den Real Racing Challenges vorbei. Mach dich für das Rennen bereit und gib Gas!"},{"version_id":"832414654","version_name":"7.5.0","version_date":"2019-09-02 20:00:34.000 +0800","version_description":"Fünf fantastische Ferraris fahren in dein Real Racing 3 mit diesem rot blitzenden Update, mit dem du Folgendes kannst:\n<br>•Zeige deiner Konkurrenz aus welchem Holz du geschnitzt bist, indem du dir Ferraris wunderschönen F8 Tributo in einem brandneuen Track Day Spezial-Event verdienst.\n<br>•Besiege den legendären Ferrari 250 GTO und den unglaublichen Ferrari F40 LM in den Ausdauer-GT-Saison 1962 &amp; 1989\n<br>•Hol dir den Ferrari 360 Modena, Ferrari 250 GTO, Ferrari 500 TRC, Ferrari F40 LM und Lamborghini Aventador LP 700-4 in fünf zeitlich begrenzten Serien\n<br>•Verbessere deine Porsche 911 GT2 RS Clubsport und den McLaren 650S GT3 vollständig, um neue exklusive Serien freizuschalten\n<br>\n<br>Schau außerdem bei Real Racing TV für neue Folgen von Real Cars With Dario Franchitti, Game Team und den Real Racing Challenges vorbei. Mach dich für das Rennen bereit und gib Gas!"},{"version_id":"832684427","version_name":"7.6.0","version_date":"2019-10-14 18:29:22.000 +0800","version_description":"Der neue Hochleistungssportwagen Lamborghini Aventador SVJ und der ikonische Lamborghini Diablo SV heizen in diesem aufregenden Update durch Real Racing 3:\n<br>•Dieses Update bringt drei neue GT-Wagen: den 2018er Ferrari 488 GTE Evo (AF Corse), den 2019er Ford GT Le Mans und den 2018er Aston Martin Vantage GTE! Alle drei Wagen gibt es in der 2019er Saison der Ausdauer GT!\n<br>•Wähle zwischen dem Ford GT Le Mans und dem Ferrari 488 GTE Evo (AF Corse) in einem brandneuen Spezial-Event! Führe deine Seite zum Sieg und bringe das Auto mit nach Hause! Keine Sorge – egal, für welches Auto du dich nicht entscheidest, du kannst es in einer zeitlich begrenzten Serie verdienen.\n<br>•Hol dir den Lamborghini Countach und all diese neuen Wagen in eine brandneuen zeitlich begrenzten Serie\n<br>•Verbessere den Pagani Zonda R und den Ferrari F8 Tributo vollständig, um neue exklusive Serien freizuschalten!\n<br>Schau außerdem bei Real Racing TV für neue Folgen von Real Cars With Dario Franchitti, Game Team und den Real Racing Challenges vorbei. Mach dich für das Rennen bereit und gib Gas!"},{"version_id":"833659314","version_name":"8.0.0","version_date":"2019-11-25 19:01:23.000 +0800","version_description":"Das größte Update von Real Racing 3 ist hier. Wir heißen die Formel 1 willkommen! Erlebe den Gipfel des Motorsports mit vielen neuen Inhalten, darunter Große Preise 2019, tägliche Rennen, Invitationals, Championship Series und:\n<br>• Wähle dein Team und führe es in fünf Großer-Preis-Events zum Sieg. Den Anfang macht der Formel 1 Etihad Airways Abu Dhabi Großer Preis 2019 auf der brandneuen Yas-Marina-Strecke\n<br>• Genieße auch vier aktualisierte Klassiker der Formel 1 2019: Monza, Silverstone, Circuit of the Americas und Suzuka\n<br>• Alle zehn Formel-1-Teams und alle 20 Formel-1-Fahrer geben ihr Debüt in Real Racing 3 und sind alle spielbar\n<br>• Schließe alle fünf Großer-Preis-Events 2019 ab, um das Mercedes-AMG GT R F1 Safety Car zu erhalten\n<br>\n<br>Zusätzlich zum unglaublichen Formel-1-Inhalt bekommst du auch:\n<br>• Bereise die Welt mit Ahmad, nimm am größten Hypercar-Rennen aller Zeiten teil und verdiene dir den Koenigsegg Agera RS in einem neuen 7-tägigen Spezialevent namens „Aggressive Ambition“\n<br>• Zwei klassische Hondas – der Civic Type-R und der Integra Type-R – kommen aus der Vergangenheit zu Real Racing 3\n<br>• Hol dir die neuen Hondas, den unglaublich schnellen Bugatti Chiron, den rekordverdächtigen Porsche 919 Hybrid Evo und Goldbelohnungen in vier zeitlich begrenzte Serien\n<br>• Verbessere den Lamborghini Aventador SVJ und den Jaguar XJ220 vollständig und schalte die neuen Exklusiv-Serien frei\n<br>\n<br>Außerdem wurde das Spiel ordentlich aufgemotzt, darunter mit dem brandneuen Formel1-Motorsport-Hub! Halte außerdem Ausschau nach neuen Episoden von Game Team und Real Racing Challenges so viel weiteren aufregenden Inhalten von Real Racing 3 und der Formel 1. Begib dich an den Start und gib Gas!"},{"version_id":"833972826","version_name":"8.1.0","version_date":"2020-01-06 19:00:53.000 +0800","version_description":"Zwei weitere Großer-Preis-Events erwarten dich in der Formel-1-Saison 2019: der GROSSE PREIS VON JAPAN auf dem Suzuka Circuit und der EMIRATES GROSSER PREIS DER USA auf dem Circuit of the Americas. Das neue Jahr startet mit drei neuen BMWs – und das ist noch nicht alles:\n<br>\n<br>•Schlage die Konkurrenz im BMW M4 GT4-Spezial-Event in Brands Hatch und Hockenheim  \n<br>•Hol dir den BMW M5, den BMW M2 Competition, den Aston Martin Vantage AMR Pro, den Jaguar F-Type SVR und einen Haufen Gold in vier neuen, zeitlich begrenzten Serien\n<br>•Rüste den Koenigsegg Agera RS und den Aston Martin Vulcan vollständig auf, um neue Exklusiv-Serien freizuschalten\n<br>\n<br>In Kürze findest du bei RRTV neue Folgen von Game Team und ein paar zusätzliche Überraschungen. Also ab an die Startlinie und los geht‘s!"},{"version_id":"834541769","version_name":"8.2.0","version_date":"2020-02-17 18:57:42.000 +0800","version_description":"O Romeo, Romeo, warum bist du Alfa Romeo? Falls du dich fragst, wo der Alfa Romeo war, wirst du jetzt staunen! 3 brandneue Alfa Romeos kommen in diesem fantastischen Update zu Real Racing 3. Das erwartet dich: \n<br>\n<br>• Feiere beim Renntag: Vintage die ereignisreiche Geschichte des Motorsports am Steuer des legendären Alfa Romeo 155 V6 TI. Schließe dieses neue Spezial-Event ab, um das Auto zu erhalten. \n<br>• Nehme an 4 zeitlich begrenzten Serien-Events teil, unter anderem mit dem Alfa Romeo 4C und dem Alfa Romeo Giulietta TCR.\n<br>• Rüste den Honda Civic Type-R und den BMW M5 vollständig auf, um neue Exklusiv-Serien freizuschalten.\n<br>\n<br>Und wenn dir das noch nicht reicht – Real Racing 3 wird 7! Nimm zur Geburtstagsfeier an einem Zeitrennen-Wettbewerb teil und verdiene dir eine exklusive Geburtstagslackierung für den R3 Spec NISSAN 240Z (S30). In RRTV warten noch weitere Überraschungen auf dich. \n<br>\n<br>Mach dich für das Rennen bereit und gib Gas!"},{"version_id":"834865493","version_name":"8.2.1","version_date":"2020-02-26 22:10:32.000 +0800","version_description":"O Romeo, Romeo, warum bist du Alfa Romeo? Falls du dich fragst, wo der Alfa Romeo war, wirst du jetzt staunen! 3 brandneue Alfa Romeos kommen in diesem fantastischen Update zu Real Racing 3. Das erwartet dich: \n<br>\n<br>• Feiere beim Renntag: Vintage die ereignisreiche Geschichte des Motorsports am Steuer des legendären Alfa Romeo 155 V6 TI. Schließe dieses neue Spezial-Event ab, um das Auto zu erhalten. \n<br>• Nehme an 4 zeitlich begrenzten Serien-Events teil, unter anderem mit dem Alfa Romeo 4C und dem Alfa Romeo Giulietta TCR.\n<br>• Rüste den Honda Civic Type-R und den BMW M5 vollständig auf, um neue Exklusiv-Serien freizuschalten.\n<br>\n<br>Und wenn dir das noch nicht reicht – Real Racing 3 wird 7! Nimm zur Geburtstagsfeier an einem Zeitrennen-Wettbewerb teil und verdiene dir eine exklusive Geburtstagslackierung für den R3 Spec NISSAN 240Z (S30). In RRTV warten noch weitere Überraschungen auf dich. \n<br>\n<br>Mach dich für das Rennen bereit und gib Gas!"},{"version_id":"835108510","version_name":"8.3.2","version_date":"2020-03-30 18:58:39.000 +0800","version_description":"Zwei unglaubliche Hypersportwagen kommen zu Real Racing! Sammle den auffälligen McLaren Senna und sein beängstigend leistungsstarkes Gegenstück nur für die Rennstrecke, den McLaren Senna GTR, in diesem großartigen Update, mit welchem du: \n<br>\n<br>• Den McLaren Senna GTR auf eine große Tour um die ikonischsten Rennstrecken Europas mit einer Spitzenperformance führst! Schließe dieses neue 7-tägige Spezialevent ab, damit du den Rennwagen behalten darfst\n<br>Zeige in drei Zeitrennen-Wettbewerben in Monza, auf dem Circuit of the Americas und in Yas Marina, was du draufhast.\n<br>Verdiene dir in drei neuen zeitlich begrenzten Serien den McLaren 570GT, den McLaren F1 GTR, den Mercedes SLR McLaren 722 und eine Menge Gold!\n<br>Rüste den Alfa Romeo 155 V6 TI und den McLaren P1 vollständig auf, um neue Exklusiv-Serien freizuschalten!\n<br>\n<br>Halte auch Ausschau nach neuen Episoden von Game Team und weiteren Überraschungen auf RRTV. \n<br>\n<br>Mach dich für das Rennen bereit und gib Gas!"},{"version_id":"835656331","version_name":"8.4.2","version_date":"2020-05-11 19:59:16.000 +0800","version_description":"Bei Real Racing 3 erwartet dich brandneuer GT3-Content! Verdiene dir in diesem hochkarätigen Update den aggressiven McLaren 720S GT3 und sein deutsches Gegenstück – den Porsche 911 GT3 R. Das erwartet dich:\n<br>\n<br>• Übernimm das Steuer des McLaren 720S GT3 und fahre zum Sieg. Schließe dieses neue Spezial-Event ab und verdiene dir dieses fantastische Auto. \n<br>• Begleite einen Shootingstar bei seinem professionellen Debüt in Bathurst. Schließe „Renntag: 911 GT3 R“ ab, um dir den unglaublichen Porsche&nbsp;911&nbsp;GT3&nbsp;R zu sichern.\n<br>• Verdiene dir in zwei neuen zeitlich begrenzten Serien den Chevrolet Camaro GT4.R und den Aston Martin Vantage GT4.\n<br>\n<br>Feiere den phänomenalen Porsche 911 RSR in einem Zeitrennen-Wettbewerb auf der Porsche-Teststrecke. 7 Porsche 911 RSR stehen zum Testen bereit!\n<br>\n<br>Mach dich für das Rennen bereit und gib Gas!"},{"version_id":"836144592","version_name":"8.5.0","version_date":"2020-06-08 19:57:37.000 +0800","version_description":"Erlebe die 24 Stunden von Le Mans 2020 auf einzigartige Art und Weise – in einem virtuellen Ingame-Renn-Event. Wähle dein Team und deinen Fahrer aus und dominiere die ABB Formel E-Saison wie nie zuvor. Das erwartet dich in diesem Update:\n<br>\n<br>• In zwei neuen Renntag-Events kannst du richtig Gas geben. Tune deinen Wagen und nutze die Werte beim Renntag. Verbessere deinen Fahrer und steigere seine Leistung. Zeige mit deinem Auto und deinem Fahrer in zukünftigen Spezial-Events, was du drauf hast!\n<br>• Entscheide dich zwischen dem 2019er Aston Martin Vantage GTE, dem 2020er Porsche 911 RSR oder der Chevrolet Corvette C8.R. Wähle deinen Fahrer und stürze dich in die legendären 24 Stunden von Le Mans\n<br>• Wähle dein Team und deinen Fahrer aus und erobere den ABB Formel E Berlin E-Prix in einem neuen Spezial-Event. Schließe das Event ab und verdiene dir einen von zwölf neuen Formel-E-Wagen\n<br>• Verdiene dir in zwei neuen zeitlich begrenzten Serie den 2018er Ferrari 488 GTE Evo (AF Corse) und Ingame-Währung\n<br>• Verbessere den 2019er McLaren 720S GT3 und den 2019er Ford GT Le Mans vollständig, um neue exklusive Serien freizuschalten\n<br>\n<br>Feiere im ersten Pride-BMW-Zeitrennen den Pride Month! Kämpfe um Goldpreise und eine besondere Pride-Lackierung.\n<br>\n<br>Mach dich für das Rennen bereit und gib Gas!"},{"version_id":"836667442","version_name":"8.6.0","version_date":"2020-07-13 20:01:58.000 +0800","version_description":"Brabham – ein brandneuer Hersteller startet bei Real Racing 3. Fahre mit deinem Lieblingsfahrer und dominiere die Langstrecken- und Formel-E-Saisons. Außerdem in diesem Update:\n<br>\n<br>• Übernimm das Steuer des unglaublichen Brabham BT62! Schließe dieses brandneue 7-tägige Spezial-Event ab und du kannst den Wagen behalten. \n<br>• Fahre den 2019er Aston Martin Vantage GTE, den 2020er Portsche 911 oder die 2020er Chevrolet Corvette C8.R. Wähle deinen Fahrer und stelle dich der GTE Endurance Championship 2020. Gewinne das Event und erhalte eines dieser Autos als Preis.\n<br>• Meistere das Spezial-Event „Renntag: Formel E New York City E-Prix 2020“ mit deinem Lieblingsteam und -fahrer. Schließe das Event ab und verdiene dir einen der zwölf Formel-E-Wagen der Saison 2020.\n<br>• Verbessere deine Motorsportwagen mithilfe deines Teamchefs. Verdiene durch Tuning bei Spezial-Events XP für deinen Teamchef. Verbessere deine Fahrzeugwerte dauerhaft, wenn der Teamchef sich verbessert.\n<br>• Verdiene dir in einer neuen zeitlich begrenzten Serie den Lamborghini Diablo SV und Gold für Ingame-Käufe.\n<br>• Rüste den Porsche 911 GT3 R vollständig auf, um neue exklusive Serien freizuschalten.\n<br>\n<br>Wenn du deine Solidarität für die Gleichberechtigung aller ethnischen Gruppen zeigen möchtest, kannst du die neuen Black Lives Matter-Vinyls an deinem Auto anbringen.\n<br>\n<br>Mach dich für das Rennen bereit und gib Gas!"},{"version_id":"837562912","version_name":"8.7.0","version_date":"2020-09-07 19:59:34.000 +0800","version_description":"In der brandneuen Saison von Real Racing 3 feiern wir 70 Jahre Formel 1! Die Königsklasse des Motorsports kehrt zurück – mit neuen Wagen, Fahrern, Events und neuen Remixes von Dim Mak Records. Zum Start der Saison gibt es ein massives Update. Das erwartet dich:\n<br>\n<br>• Wähle ein Team und einen Fahrer aus und führe sie in neun Großer-Preis-Events zum Sieg. Die Saison 2020 startet mit dem 5-tägigen Spezial-Event „Großer Preis von Belgien“ und dem 7-tägigen Spezial-Event „Großer Preis von Großbritannien“.\n<br>• In der F1-Saison 2020 erwarten dich außerdem brandneue Invitational Series und eine Champion Series 2020!\n<br>• Mit einem individuellen Tuning-Setup kannst du deine Motorsportwagen verbessern. Schließe Spezial-Events ab, um Tuning-Setups zu verdienen, und nutze diese in der gleichen Motorsport-Saison an deinem Wagen, um die LW zu verbessern.\n<br>• Neue Fahrer starten ihre Reise mit einer brandneuen Jubiläumslackierung für ihr F1 Academy Car.\n<br>• Werde schneller und verdiene in einem ganz besonderen Zeitrennen eine exklusive Dim Mak Records-Lackierung für dein F1 Academy Car.\n<br>\n<br>Die unglaublichen Formel-1-Inhalte sind aber noch nicht alles:\n<br>• Porsches Hommage an den 935, die Legende aus Le Mans, kommt zu Real Racing 3!\n<br>• In zwei neuen zeitlich begrenzten Serien kannst du den 2019er Porsche 935, den 2016er Koenigsegg Agera RS und eine Menge Gold verdienen!\n<br>• Rüste den Brabham BT62 vollständig auf, um neue exklusive Serien freizuschalten!\n<br>\n<br>Bei Real Racing TV findest du exklusive Interviews mit Formel-1-Fahrern und Künstlern von Dim Mak Records.\n<br>\n<br>Wähle dein Team. Wähle deinen Fahrer. Deine Gegner erwarten dich!"},{"version_id":"838046653","version_name":"8.8.1","version_date":"2020-10-12 19:00:59.000 +0800","version_description":"Mach dich bereit für den ultimativen Test für deine Fahrkünste auf den engen Straßen und scharfen Kurven des legendären Circuit de Monaco! Die Formel 1®-Saison 2020 geht weiter – mit drei neuen Großer Preis Spezial-Events: Monaco, Monza und Red Bull Ring. Außerdem: NASCAR kehrt für die Saison 2020 zurück! Wähle dein Lieblingsteam und deinen Fahrer aus und stelle dich dem Coke Zero Sugar 400 in Daytona! Außerdem in diesem Update:\n<br>\n<br>• Nimm am Spezial-Event FORMEL 1 GROSSER PREIS VON MONACO 2020 teil und verdiene eine neue von Dim Mak Records inspirierte Lackierung.\n<br>• Der 2020er Ford Shelby GT500 kommt zu Real Racing. Hol dir diesen Monsterwagen und eine exklusive Tag der Toten-Lackierung in einer neuen zeitlich begrenzten Serie.\n<br>• Die Halloween-Saison und die Feierlichkeiten zum Tag der Toten gehen weiter: mit einer zweiten Lackierung für den 2020er Ford Shelby GT500 – exklusiv und kostenlos für Spieler, die dieses Update herunterladen.\n<br>• Der unglaubliche Bentley Continental GT3 ist bei der GT3-Saison 2020 dabei. In einer neuen zeitlich begrenzten Serie kannst du den Wagen und Gold verdienen.\n<br>• Rüste den 2019er Porsche 935 und den McLaren Senna vollständig auf, um zwei neue Exklusiv-Serien freizuschalten!\n<br>\n<br>Außerdem haben wir einen neuen Soundtrack-Remix von Dim Mak Records sowie exklusive Interviews mit Dim Mak Records-Künstler RICCI und NASCAR-Fahrern bei Real Racing TV.\n<br>\n<br>Steige in den Fahrersitz und mache dich bereit für dein nächstes Rennen!"},{"version_id":"838283463","version_name":"8.8.2","version_date":"2020-10-21 23:43:42.000 +0800","version_description":"Mach dich bereit für den ultimativen Test für deine Fahrkünste auf den engen Straßen und scharfen Kurven des legendären Circuit de Monaco! Die Formel 1®-Saison 2020 geht weiter – mit drei neuen Großer Preis Spezial-Events: Monaco, Monza und Red Bull Ring. Außerdem: NASCAR kehrt für die Saison 2020 zurück! Wähle dein Lieblingsteam und deinen Fahrer aus und stelle dich dem Coke Zero Sugar 400 in Daytona! Außerdem in diesem Update:\n<br>\n<br>• Nimm am Spezial-Event FORMEL 1 GROSSER PREIS VON MONACO 2020 teil und verdiene eine neue von Dim Mak Records inspirierte Lackierung.\n<br>• Der 2020er Ford Shelby GT500 kommt zu Real Racing. Hol dir diesen Monsterwagen und eine exklusive Tag der Toten-Lackierung in einer neuen zeitlich begrenzten Serie.\n<br>• Die Halloween-Saison und die Feierlichkeiten zum Tag der Toten gehen weiter: mit einer zweiten Lackierung für den 2020er Ford Shelby GT500 – exklusiv und kostenlos für Spieler, die dieses Update herunterladen.\n<br>• Der unglaubliche Bentley Continental GT3 ist bei der GT3-Saison 2020 dabei. In einer neuen zeitlich begrenzten Serie kannst du den Wagen und Gold verdienen.\n<br>• Rüste den 2019er Porsche 935 und den McLaren Senna vollständig auf, um zwei neue Exklusiv-Serien freizuschalten!\n<br>\n<br>Außerdem haben wir einen neuen Soundtrack-Remix von Dim Mak Records sowie exklusive Interviews mit Dim Mak Records-Künstler RICCI und NASCAR-Fahrern bei Real Racing TV.\n<br>\n<br>Steige in den Fahrersitz und mache dich bereit für dein nächstes Rennen!"},{"version_id":"839056250","version_name":"9.0.1","version_date":"2020-11-23 19:00:47.000 +0800","version_description":"Wir beenden das Jahr 2020 mit großem Getöse, denn der Aston Martin Valkyrie, das schnellste Straßenauto der Real Racing 3 Geschichte, kommt mit quietschenden Reifen auf die Strecke. Setze zusätzlich deine Formel 1® Saison fort und beherrsche den Wettbewerb im abschließenden Abschnitt unser NASCAR Cup-Serie in diesem riesigen Update zum Jahresende mit dem du das Folgende unternehmen kannst:\n<br>\n<br>• Nimm am Erstflug teil, einem neuen, speziellen 7-Tage-Event, und verdiene dir den Valkyrie\n<br>• Tritt in zwei neuen F1 Grand Prix™ Special Events in Yas Marina und Catalunya an\n<br>• Wähle dein Team und kehre auf die Rennstrecke zurück für ein weiteres NASCAR Special Event auf der Richmond Raceway\n<br>• Vor 10 Jahren ging Real Racing 2 an den Start – feiere das mit der Rückkehr des legendären Chevrolet Corvette C6.\n<br>• Füge deiner Garage einen weiteren Hypercar hinzu indem du den unbezwingbaren Bugatti Veyron 16.4 Grand Sport Vitesse in einem weiteren nur kurz verfügbaren Ereignis verdienst.\n<br>\n<br>Und genieße wenn das ultimative Remix von Dim Mak Records den Real Racing Soundtrack erreicht - zusammen mit einer neuen von Dim Mak inspirierten Lackierung, die Du im FORMULA 1 ETIHAD AIRWAYS ABU DHABI GRAND PRIX 2020 Special Event. Wir machen außerdem ein exklusives Interview mit dem Künstler Sippy von Dim Mak Records und im Real Racing TV gibt es einige weitere Überraschungen.\n<br>\n<br>Steige ein und fahre weiter!"},{"version_id":"839711961","version_name":"9.1.1","version_date":"2021-01-11 19:02:27.000 +0800","version_description":"Der 765LT, der Neuzugang in McLarens legendärer Longtail-Serie, kommt zu Real Racing! Stelle deine Fahrkünste auf die Probe und stelle dich Singapurs berüchtigtem Marina Bay Street Circuit! Außerdem in diesem Update:\n<br>\n<br>• Übernimm das Steuer des McLaren 765LT und verdiene ihn in einem 5-tägigen Spezial-Event. \n<br>• Steige in den Lamborghini Essenza SCV12, einen hyper-seltenen, hyper-stylishen Hypersportwagen für die Rennstrecke! Weltweit gibt es nur 40 Exemplare. Verpasse also nicht die Chance, dir einen davon bei Real Racing zu sichern!\n<br>• Schließe deine Formel 1®-Saison mit den letzten beiden Großer Preis™-Events ab: dem FORMEL 1 SINGAPORE AIRLINES GROSSEN PREIS VON SINGAPUR 2020 und dem FORMEL 1 GROSSEN PREIS DER USA 2020.\n<br>• Schließe alle neun Großer Preis-Events ab und verdiene den einzigartigen McLaren MP4/4. Nimm ihn mit auf die prestigeträchtigsten Formel 1-Rennstrecken der Welt!\n<br>• Verdiene drei unglaubliche Lamborghinis: den neuen Lamborghini Essenza SCV12, den Veneno und den Huracán Super Trofeo Evo – in drei neuen zeitlich begrenzten Serien!\n<br>• Rüste den Aston Martin Valkyrie und die 2020er Chevrolet Corvette C6.R GT2 vollständig auf, um zwei neue Exklusiv-Serien freizuschalten.\n<br>\n<br>Schließe dich der Formel 1®-Initiative an und fahre für Inklusion und Gleichberechtigung! Verdiene diese exklusive Lackierung für das F1® Academy Car, indem du am „We Race As One“ Zeitrennen-Wettbewerb teilnimmst! Sieh dir auch die neuen Videos auf Real Racing TV an.\n<br>\n<br>Steige ein und fahre weiter!"},{"version_id":"840320820","version_name":"9.2.0","version_date":"2021-02-15 19:00:44.000 +0800","version_description":"Die Zukunft beginnt jetzt: In diesem elektrifizierenden Update gehen drei neue Elektroautos von Audi, Volkswagen und Porsche an den Start. Außerdem:<br><br>• Nimm den elektrischen Volkswagen ID.R mit auf eine rekordverdächtige Tour um die Welt und verdiene ihn in einem neuen Spezialevent: Unter Hochspannung.<br>• Wähle zwischen zwei brandneuen Elektrosportwagen – dem Porsche Taycan Turbo S und dem Audi e-tron GT concept – und begib dich beim Spezial-Event „Trackday: Virtual“ an die Grenzen des Motorsports.<br>• Verdiene den Audi e-tron GT concept, den Porsche Taycan Turbo S, den McLaren Senna GTR und den McLaren 720S GT3 in vier neuen zeitlich begrenzten Serien. <br>• Stelle dich in zwei neuen Zeitrennen-Wettbewerben selbst auf die Probe. Fahre mit einem Formel 1®-Wagen der Saison 2020 in Silverstone und drehe mit dem legendären McLaren MP4/4 eine Runde auf dem Circuit de Monaco. <br>• Rüste den McLaren 765LT und den Lamborghini Essenza SCV12 vollständig auf, um zwei neue exklusive Serien freizuschalten.<br><br>Sieh dir außerdem auch die neuen Videos auf Real Racing TV an.<br><br>Steige ein und fahre weiter!"},{"version_id":"840624873","version_name":"9.2.1","version_date":"2021-03-01 19:01:47.000 +0800","version_description":"Die Zukunft beginnt jetzt: In diesem elektrifizierenden Update gehen drei neue Elektroautos von Audi, Volkswagen und Porsche an den Start. Außerdem:<br><br>• Nimm den elektrischen Volkswagen ID.R mit auf eine rekordverdächtige Tour um die Welt und verdiene ihn in einem neuen Spezialevent: Unter Hochspannung.<br>• Wähle zwischen zwei brandneuen Elektrosportwagen – dem Porsche Taycan Turbo S und dem Audi e-tron GT concept – und begib dich beim Spezial-Event „Trackday: Virtual“ an die Grenzen des Motorsports.<br>• Verdiene den Audi e-tron GT concept, den Porsche Taycan Turbo S, den McLaren Senna GTR und den McLaren 720S GT3 in vier neuen zeitlich begrenzten Serien. <br>• Stelle dich in zwei neuen Zeitrennen-Wettbewerben selbst auf die Probe. Fahre mit einem Formel 1®-Wagen der Saison 2020 in Silverstone und drehe mit dem legendären McLaren MP4/4 eine Runde auf dem Circuit de Monaco. <br>• Rüste den McLaren 765LT und den Lamborghini Essenza SCV12 vollständig auf, um zwei neue exklusive Serien freizuschalten.<br><br>Sieh dir außerdem auch die neuen Videos auf Real Racing TV an.<br><br>Steige ein und fahre weiter!"},{"version_id":"840815823","version_name":"9.3.0","version_date":"2021-03-22 19:00:14.000 +0800","version_description":"Bist du bereit für den schnellsten Wagen bei Real Racing? Der Hennessey Venom F5 wartet schon auf dich! Gehe an den Start und gib in diesem unglaublichen Auto ordentlich Gas. Außerdem in diesem Update:<br><br>• Verdiene den Hennessey Venom F5 beim Spezial-Event „Clubday: Venom F5“ und brich ein paar Rekorde.<br>• Reise mit zwei Le Mans-Prototypen zurück ins Jahr 2009: dem Audi R15 TDI und dem Aston Martin DBR 1-2. Nimm an den Spezial-Events „Renntag: Festival“ und „Renntag: LMP-Tour 2009“ statt und sichere dir die Klassiker.<br>• Reise mit einem weiteren Le Mans-Prototypen weiter in die Vergangenheit: dem Porsche RS Spyder Evo. Setze dich ans Steuer des überarbeiteten Honda-Klassikers Acura NSX 2017.<br>• Verdiene den Porsche RS Spyder Evo, den Acura NSX und den Hennessey Venom GT in drei neuen zeitlich begrenzten Serien.<br>• Teste dein Können in zwei neuen Formel 1®-Zeitrennen-Wettbewerben am Red Bull Ring und in Monza.<br><br>Sieh dir außerdem auch die neuen Videos auf Real Racing TV an.<br><br>Steige ein und fahre weiter!"},{"version_id":"841662594","version_name":"9.4.0","version_date":"2021-05-03 20:03:06.000 +0800","version_description":"Bist du bereit für die NASCAR-Saison 2021? Mach dich bereit für die Konkurrenz und fahre mit deinem Team zum Sieg! Außerdem wird der Hype Wirklichkeit. Wir führen in diesem Update den Bugatti Divo ein: ein hyper-exklusives, hyper-schickes Hypercar, mit dem du:\n<br>\n<br>• Ein NASCAR-Team auswählen und in zwei Renntag-Events in Daytona und Richmond deine Runden drehen kannst.\n<br>• Da es weltweit nur 40 Bugatti Divos gibt, solltest du dir die Chance nicht entgehen lassen, deiner Garage einen davon hinzuzufügen, indem du an \"Clubday: Divo\" teilnimmst.\n<br>• Erlebe die Krönung einer fast 60 Jahre umspannenden amerikanischen Legende – die Chevrolet Corvette Stingray C8!\n<br>• Hol dir die neue Chevrolet Corvette Stingray C8, den Bugatti Chiron Sport, den Bugatti Chiron und den Bugatti EB 110 Super Sport in vier befristeten Serien-Events!\n<br>• Teste dein Können in zwei neuen Formel 1®-Zeitrennen-Wettbewerben auf dem Circuit de Catalunya und dem Circuit of the Americas!\n<br>• Rüste den Hennessey Venom F5 und den Volkswagen ID.R vollständig auf, um zwei neue Exklusiv-Serien freizuschalten!\n<br>\n<br>Sieh dir außerdem auch die neuen Videos auf Real Racing TV an.\n<br>\n<br>Steige ein und fahre weiter!"},{"version_id":"842490078","version_name":"9.5.0","version_date":"2021-06-14 20:11:41.000 +0800","version_description":"Die Formel E kehrt mit Saison 7 zurück Außerdem erwartet dich der unbezähmbare Lotus Evija, eine elektrische Bestie mit mehr als 2.000 PS in diesem Update, in dem du all das machen kannst:\n<br>\n<br>• Wähle ein Team und einen Fahrer, um zwei aufregende Formel-E-Renntag-Events in New York und Berlin zu bestreiten.\n<br>• Sichere dir in sechs befristeten Serien den Lotus Evija, den Brabham BT62, den Lamborghini Essenza SCV12, den Porsche 911 GT3 R, den Bentley Continental GT3 und den Aston Martin Valkyrie.\n<br>• Beweise bei drei Formel-E-Zeitrennen auf den Formel-E-Strecken in Berlin und New York City dein fahrerisches Können!\n<br>• Rüste den Bugatti Divo, den Bugatti Chiron und den Audi TT RS Coupé (2019) vollständig auf, um drei neue Exklusiv-Serien freizuschalten!\n<br>\n<br>Sieh dir außerdem auch die neuen Videos auf Real Racing TV an.\n<br>\n<br>Steige ein und fahre weiter!"}]