[{"version_id":"815404492","version_name":"1.2","version_date":"2015-12-18 07:33:06.000 +0800","version_description":"APPLE PENCIL SUPPORT WITH IPAD PRO<br>On iPad Pro, make the most of the Apple Pencil’s sensitivity to pressure and tilt for better precision and control in selective edits. <br><br>Now available in 15 additional languages. <br><br>Bug Fixes"},{"version_id":"816430290","version_name":"1.2.1","version_date":"2016-02-23 17:21:53.000 +0800","version_description":"Bug fix"},{"version_id":"817240967","version_name":"benötigt 500 MB an freiem Speicherplatz","version_date":"","version_description":""},{"version_id":"817240967","version_name":"1.3","version_date":"2016-05-03 02:53:46.000 +0800","version_description":"SAVE SPACE ON YOUR DEVICES<br>Photoshop Fix intelligently manages the amount of space your projects take up, and it allows you to reclaim space when you’re running low on storage. <br><br>FIND RECENT PHOTOS FAST<br>Save time with an option that makes it easy to browse and select photos you’ve recently imported. <br><br>WORK WITH TRANSPARENCY<br>Fix respects transparency in your imported images, so Photoshop Mix cutouts and other transparent images import as you would expect them to.<br><br>FULL RESOLUTION PHOTOS FROM LIGHTROOM<br>Go beyond 2,000x2,000 pixels and import the full-resolution versions of your images from Lightroom.<br><br>PUT THE FOCUS ON FACES<br>Photoshop Fix’s Vignette feature can now tell if your main subject is a face and then automatically adjust the vignette around it for emphasis.<br><br>EASILY FIND PHOTO SPECS<br>Want to know a photo’s size or the date it was taken? See all the details in the Overview Metadata panel.<br><br>MAKE HOW-TO VIDEOS<br>A new “show touches” preference makes dots appear wherever your finger touches the screen, so it’s easy to demo Fix and even make instructional YouTube videos.<br><br>KEEP METADATA INTACT<br>Never lose metadata. Fix now preserves meta data of images used in projects."},{"version_id":"818715514","version_name":"1.4","version_date":"2016-09-01 19:09:46.000 +0800","version_description":"BETTER CONTROL WITH FACE-AWARE LIQUIFY<br>New controls enable finer modulation of cheeks, chins, and noses, and you get better range of modulation for all other face point controls.      <br><br>LESS SPACE NEEDED TO RUN<br>Fix no longer needs 500MB of free space to run, so you can continue retouching photos even when your iPhone or iPad is low on space.<br><br>OPTIMIZED FOR 3D TOUCH (IPHONE 6s/+ ONLY)<br>Use shortcuts like long-pressing the app icon to open to the last project you worked on or start a new one."},{"version_id":"818759553","version_name":"1.5","version_date":"2016-09-30 21:46:21.000 +0800","version_description":"DISPLAY P3 SUPPORT:<br>View and edit cinema quality wide color images (iPhone 7, iPad Pro 9.7 with iOS 10).<br><br>METAL SUPPORT:<br>Improved performance using Apple’s Metal technology."},{"version_id":"819139518","version_name":"1.6","version_date":"2016-11-02 01:17:47.000 +0800","version_description":"SKIN SMOOTHING <br>Smooth out those wrinkles and rough edges automatically with this Face-Aware tool.<br><br>WARMTH ADJUSTMENT <br>Control color temperature using the new Warmth slider in the Adjust task.<br><br>GOOGLE PHOTOS <br>Import images from your Google Photos account to edit in Fix."},{"version_id":"819666973","version_name":"1.6.1","version_date":"2016-11-11 22:39:50.000 +0800","version_description":"Bug fixes"},{"version_id":"821435635","version_name":"1.7","version_date":"2017-07-19 23:25:14.000 +0800","version_description":"SIGN-IN WITH GOOGLE AND FACEBOOK<br>Use your Facebook or Google ID to sign into Adobe Photoshop Fix and Creative Cloud."},{"version_id":"823933220","version_name":"1.7.1","version_date":"2018-09-14 21:33:27.000 +0800","version_description":"iPHONE X SUPPORT<br><br>Edge-to-edge UI on iPhone X screen, with respect to the safe area.<br><br>BUG FIX<br><br>Fix the crashes on iOS 12."},{"version_id":"828626064","version_name":"1.7.2","version_date":"2018-09-24 18:00:36.000 +0800","version_description":"iPHONE X SUPPORT<br><br>Edge-to-edge UI on iPhone X screen, with respect to the safe area.<br><br>BUG FIX<br><br>Fix the crashes on iOS 12."},{"version_id":"828823855","version_name":"1.7.3","version_date":"2018-10-05 16:47:05.000 +0800","version_description":"iPHONE X SUPPORT<br>Edge-to-edge UI on iPhone X screen, with respect to the safe area.<br><br>BUG FIX<br>Fix the crashes on iOS 12."}]