[{"version_id":"823227671","version_name":"1.0","version_date":"2017-10-01 14:29:23.000 +0800","version_description":""},{"version_id":"823887838","version_name":"1.1","version_date":"2017-10-04 16:19:28.000 +0800","version_description":"Performance improvements and minor bug fixes<br>تحسينات للأداء، وتصليح بعض الأخطاء البسيطة."},{"version_id":"824026484","version_name":"1.2","version_date":"2017-10-23 19:01:16.000 +0800","version_description":"- We're now accepting easy and secure payments with Apple Pay!<br>- We've added a payment card scanner! You can now scan your payment card while checking out for an improved checkout experience. <br>- Performance improvements and minor bug fixes.<br><br>Apple Pay نقبل الآن الدفع بطريقة سهلة وآمنة عبر <br>.قمنا بإضافة قارئ لبطاقات الدفع. يمكنك الآن مسح بطاقة الدفع الخاصة بك أثناء عملية الدفع الآمن لتتمكن من إتمام عملية الشراء والطلب بسهولة أكثر<br>.تحسينات للأداء، وتصليح بعض الأخطاء البسيطة"},{"version_id":"824174623","version_name":"1.3","version_date":"2017-11-06 12:58:30.000 +0800","version_description":"- Say hello to 'noon now'. Experience speedy deliveries, a huge selection of products and a smooth checkout experience with 'noon now' products.<br>- A few tweaks were made to make the app super silky smooth for smaller screens.<br>- Performance improvements and minor bug fixes.<br><br>.توصيل بسرعة فائقة، تشكيلة واسعة مع المنتجات وإتمام الشراء بمنتهى السهولة، كل هذا وغيره المزيد مع \"نون المميز\"، حينما تجد هذه العلامة بجوار المنتج على موقعنا، تأكد من أنك ستحصل على الأفضل<br>.تم إجراء مزيد من التحسينات على التطبيق ليمنحك أعلى أداء على الشاشات الصغيرة<br>.تحسينات على الأداء وإصلاح بعض العيوب البسيطة"},{"version_id":"824350727","version_name":"1.4","version_date":"2017-11-13 07:18:15.000 +0800","version_description":"- Rejoice iPhone X users, our app is now iPhone X optimized!<br>- Share your favorite products with your friends and family right from the product display page!<br>- Select your shipping city right from the cart and product display page to get a clearer shipping estimate.<br>- Performance improvements and minor bug fixes.<br><br>تطبيق نون الآن متوافق مع أحدث إصدارات الآيفون<br>شارك منتجاتك المفضلة مع الأصدقاء والعائلة مباشرة من صفحة عرض المنتج<br>يمكنك الآن تحديد المدينة التي ترغب الشحن إليها من عربة التسوق ومن صفحة عرض المنتج لمعرفة موعد التوصيل المُقدر<br>تحسينات في الأداء وإصلاح بعض الأخطاء الصغيرة"},{"version_id":"825180924","version_name":"1.5","version_date":"2017-12-06 08:21:28.000 +0800","version_description":"Performance improvements and minor bug fixes<br><br>تحسينات للأداء، وتصليح بعض الأخطاء البسيطة"},{"version_id":"825239690","version_name":"1.6","version_date":"2017-12-11 21:08:29.000 +0800","version_description":"- We’re live in Saudi Arabia! You can now shop in the Kingdom and enjoy exclusive deals! <br>- This update also has an epic sale which you wouldn’t want to miss out on.<br>- Performance improvements and minor bug fixes.<br><br>.تم إطلاق خدمتنا في السعودية! يمكنك الآن التسوق والحصول على عروض حصرية داخل المملكة -<br>.يأتي مع هذا التحديث تنزيلات غير مسبوقة.. لا تفوتك -<br>.تحسينات في الأداء وإصلاح بعض الأخطاء البسيطة -"},{"version_id":"825281310","version_name":"1.7","version_date":"2017-12-13 08:35:18.000 +0800","version_description":"- Performance improvement and minor bugs fixes.<br>تحسينات في الأداء وإصلاح بعض الأخطاء البسيطة"},{"version_id":"825360077","version_name":"1.8","version_date":"2017-12-20 07:41:28.000 +0800","version_description":"Keeping your best interests at heart, we will be reminding you of COD fees. We know some of you like carry huge wads of cash but that's so 2000 and late, let us make your life easier and better.<br><br>And as always, our awesome-sauce tech team have squashed a few naughty bugs that were hiding across the app. <br>Hi to a better experience.<br><br>.لا تقلق بشأن رسوم الدفع نقداً عند الاستلام، فسنقوم دائماً بتذكيرك بها، وذلك لتسهيل الشراء والتسوق لدينا<br>.وكالعادة قمنا ببعض التحسينات في أداء التطبيق وإصلاح بعض الأخطاء البسيطة، لتستمتع باستخدام التطبيق<br>.هلا بتسوق أحلى وأسهل"},{"version_id":"825612518","version_name":"1.9","version_date":"2018-01-16 07:48:24.000 +0800","version_description":"- Want to return an item? It's now speedier than ever! Simply complete your return request from within the app.<br>- Change your password and secure your account in few clicks. Simple.<br>- We've made searching for what you need even easier with sleek auto-suggest options to help you find what you’re looking for.<br>- Our clever engineering team have fixed all bugs on the app. Halla to a better shopping experience.<br><br>.هل تريد إرجاع منتج؟ أصبح الأمر الآن أسرع من قبل! فقط املأ طلب الإرجاع من داخل التطبيق -<br>.قم بتغيير كلمة السر وأمّن حسابك ببضع نقرات. الأمر غاية بالسهولة -<br>.جعلنا البحث عما تريد أسهل الآن مع خيارات الاقتراح التلقائية لمساعدتك في العثور على ما تريد -<br>.تمكّن فريق المهندسين الذكي لدينا من إصلاح كافة أخطاء التطبيق. هلا بيك في تجربة تسوق أفضل -"},{"version_id":"825693260","version_name":"1.10","version_date":"2018-01-24 07:48:03.000 +0800","version_description":"To make life smoother, we've tidied up our returns section. Just for you.<br>Big thanks to our clever team of engineers for their hard work. Shukran!<br><br>قمنا بتحديث قسم الإرجاع لتحصل على تجربة سهلة، مميزة وبلا مشاكل.<br>كالعادة نوجه الشكر لفريق المُطورين لدينا الذين قاموا بهذا الجهد الرائع.. شكراً!"},{"version_id":"825774950","version_name":"2.22","version_date":"2019-11-10 13:24:12.000 +0800","version_description":"Enjoy exciting features, improved performance and special deals with our app for Yellow Friday. Download the app today to make sure you are ready!<br><br>!قم بتحميل تطبيق سيفي و استمتع بميزات رائعة وأداء محسن وعروض خاصة في الجمعة الصفراء و كن مستعدا لمفاجآت كبيرة"},{"version_id":"825774950","version_name":"2.24","version_date":"2019-12-02 08:32:43.000 +0800","version_description":"Performance improvements and minor bug fixes.<br><br>تحسينات في الأداء وإصلاح بعض الأخطاء الصغيرة"},{"version_id":"825774950","version_name":"2.21","version_date":"2019-10-23 12:03:37.000 +0800","version_description":"Performance improvements and minor bug fixes.<br><br>تحسينات في الأداء وإصلاح بعض الأخطاء الصغيرة"},{"version_id":"825774950","version_name":"2.17","version_date":"2019-07-14 06:58:54.000 +0800","version_description":"With Spiderman far away from home, our engineers took up the title of your friendly neighbourhood heroes and cleaned up the bugs in your app! Turns out Mr Stark may have left a gift or two for us as well and we used them to improve your experience. Happy Shopping!<br><br>مادام سبايدرمان في إجازة في أوروبا مهندسون نون تولوا مسؤولية حماية التطبيق و قاموا بإزالة جميع المشاكل! تبين أيضا أن السيّد ستارك قد ترك هدية أو اثنتين لنا وقد استخدمناها لتحسين تجربتك. نوّنها وشوف!"},{"version_id":"825774950","version_name":"2.19","version_date":"2019-09-18 07:32:21.000 +0800","version_description":"Performance improvements and minor bug fixes.<br><br>تحسينات في الأداء وإصلاح بعض الأخطاء الصغيرة"},{"version_id":"825774950","version_name":"2.18","version_date":"2019-08-27 13:31:08.000 +0800","version_description":"We've made some exciting design changes, fixed a few bugs and improved performance so that you can shop with ease. Happy shopping!<br><br>!سوينا تغيرات في التصميم وصلحنا بعض المشكلات وبتلقى تحسينات كبيرة في الأداء بتظبط تجربتك لما تتسوق معنا. يلا نوّنها"},{"version_id":"825774950","version_name":"2.16","version_date":"2019-06-08 10:08:26.000 +0800","version_description":"We've made new and exciting improvements so that you can shop with ease. Happy Shopping!<br><br>قمنا ببعض التحديثات والتحسينات عشان تتسوق بسهولة وراحة، حيّاكم من نون"},{"version_id":"825774950","version_name":"2.14","version_date":"2019-04-14 07:11:55.000 +0800","version_description":"Navigation was dark and full of terrors but we embarked on a new journey, with a completely refined navigation flow. There are a bunch of secrets and fun improvements that will show up when the time is right. Hint: Ramadan is coming!<br><br>تحديثات جديدة في الانتقال وتغييرات تسّهل عليك كل شي داخل التطبيق، وكثير من التحسينات عشان تنوّنها على كيفك.<br>انتظرونا في رمضان"},{"version_id":"825774950","version_name":"2.13","version_date":"2019-03-12 10:42:52.000 +0800","version_description":"We've made some exciting changes to ensure you have an enjoyable shopping experience. Happy shopping!<br><br>قمنا بإجراء بعض التعديلات لنضمن لك أفضل تجربة تسوق على الإطلاق. يلا نوّنها!"},{"version_id":"825774950","version_name":"1.12","version_date":"2018-02-27 10:41:19.000 +0800","version_description":"Introducing the new and shiny wallet section, now easily track your noon Credits.<br><br>Forgot to verify your order? Go to your order and verify it there! Simple, right?<br><br>Lazy typing FTW! We’ve enabled auto suggest on most of the address form.<br><br>Selected the wrong address? Don’t worry shipping address aren’t set in stone, change them even after placing an order.<br><br>And lastly, huge round of applause to our awesome-sauce engineers for slaying bugs, improving performance and making all of this happen!<br><br>يأتيك هذا التحديث بقسم جديد \"المحفظة\"، حيث يمكنك معرفة رصيدك على نون بسهولة.<br><br>حتى إذا لم تقم بتأكيد طلبيتك، يمكنك الانتقال إلى الطلبيات وتأكيدها الآن ببساطة.<br><br>هل تَمل من إدخال البيانات المطلوبة؟ لا تقلق أضفنا اقتراحات في معظم حقول العناوين.<br><br>اخترت عنوان غير صحيح؟ بسيطة.. قم بتغيره حتى بعد تأكيد طلبيتك.<br><br>شكر كبير لكل فريق التطوير على إصلاح المشكلات وتحسين أداء التطبيق."},{"version_id":"825774950","version_name":"1.11","version_date":"2018-02-07 07:34:32.000 +0800","version_description":"- Brand new reset filter, for the smoothest search experience.<br>- We have also tidied up the search function making it even easier to shop.<br>- Adding a new address is easy with a much smoother flow during the checkout process.<br>- Thanks to our amazing customers, UI team and little bug fixers. Shukran guys!<br><br>.خيار الفلترة بشكله الجديد: قمنا بتعديل خيار الفلترة للحصول على نتائج أفضل وأسرع أثناء عملية البحث عن خيارات محددة. وأصبح بإمكانكم الآن إعادة تحديد الفلتر بكل سهولة -<br>.تحديث خدمة البحث: خيار البحث أصبح أكثر تنظيماً ودقة للتسوق بسهولة أكبر وبلا أي مشاكل -<br>.عملية إتمام الشراء: أصبح خيار إضافة عنوان جديد لحسابك أثناء إتمام الدفع والشراء أكثر مرونة -<br>.عرض المستندات: يمكنك الآن عرض مستنداتك المهمة بسهولة من حسابك مباشرةً -<br>.شكراً لجميع عملائنا الرائعين، ولفريق التطوير وتجربة المستخدم -"},{"version_id":"826058339","version_name":"1.12","version_date":"2018-02-27 10:41:19.000 +0800","version_description":"Introducing the new and shiny wallet section, now easily track your noon Credits.<br><br>Forgot to verify your order? Go to your order and verify it there! Simple, right?<br><br>Lazy typing FTW! We’ve enabled auto suggest on most of the address form.<br><br>Selected the wrong address? Don’t worry shipping address aren’t set in stone, change them even after placing an order.<br><br>And lastly, huge round of applause to our awesome-sauce engineers for slaying bugs, improving performance and making all of this happen!<br><br>يأتيك هذا التحديث بقسم جديد \"المحفظة\"، حيث يمكنك معرفة رصيدك على نون بسهولة.<br><br>حتى إذا لم تقم بتأكيد طلبيتك، يمكنك الانتقال إلى الطلبيات وتأكيدها الآن ببساطة.<br><br>هل تَمل من إدخال البيانات المطلوبة؟ لا تقلق أضفنا اقتراحات في معظم حقول العناوين.<br><br>اخترت عنوان غير صحيح؟ بسيطة.. قم بتغيره حتى بعد تأكيد طلبيتك.<br><br>شكر كبير لكل فريق التطوير على إصلاح المشكلات وتحسين أداء التطبيق."},{"version_id":"826569524","version_name":"1.13","version_date":"2018-04-09 08:57:50.000 +0800","version_description":"- You can now select your delivery location on the map by dragging the pointer to wherever you are. No more long addresses and zip codes!<br>- You can now easily view which items are returnable in your shopping cart during checkout. <br>- Want to see your entire search history on noon? Now you can. <br>- Filter your search to see only noon Now items, products sold exclusively by noon with a faster delivery time.<br><br>•    يمكنك الآن تحديد عنوان توصيل الشحنات من الخريطة مباشرة من خلال سحب المؤشر إلى الموقع المطلوب على الخريطة. لا داعِ للرموز البريدية والوصف المطول لعنوانك بعد الآن!<br>•    مع هذا التحديث، يمكنك معرفة أي البضائع قابلة للإرجاع مباشرةً من عربة التسوق الخاصة بك خلال مرحلة الدفع والخروج.<br>•    الآن، يمكنك تصفح تاريخ البحث الذي قمت به مسبقاً على نون.<br>•    يمكنك الآن فلترة نتائج البحث على نون لرؤية فقط منتجات \"نون المميز\"، وهي المنتجات المباعة حصراً عبر نون وتتميز بأسرع وقتٍ للتوصيل."},{"version_id":"826797699","version_name":"1.14","version_date":"2018-04-29 07:22:09.000 +0800","version_description":"Sleek new banners, widgets and pages are now up and running<br>Our clever tech team have fixed bugs and improved the overall performance of noon to create a seamless shopping experience! Shukran<br><br>أضفنا مجموعة لافتات، وأدوات، وصفحات مميزة وجديدة على الموقع<br>قام فريق عملنا التقني المجتهد على تصحيح بعض الأخطاء البرمجية في التطبيق ورفعوا من الأداء الكلي لموقع نون لتحقيق تجربة تسوّق سلسة وفريدة من نوعها! شكراً"},{"version_id":"826955339","version_name":"1.15","version_date":"2018-05-08 15:20:37.000 +0800","version_description":"Performance improvements and minor bug fixes.<br>تحسينات في الأداء وإصلاح بعض الأخطاء الصغيرة"},{"version_id":"827148526","version_name":"1.16","version_date":"2018-05-16 07:51:20.000 +0800","version_description":"Performance improvements and minor bug fixes.<br>تحسينات في الأداء وإصلاح بعض الأخطاء الصغيرة"},{"version_id":"827787077","version_name":"1.17","version_date":"2018-07-11 09:25:27.000 +0800","version_description":"Minor tweaks to our checkout flow, making it even safer for you. <br>Sharpened up the returns section; everything should be even smoother now. <br>Our amazing tech team have fixed bugs and improved the overall performance to create a seamless shopping experience! Shukran.<br><br>تعديلات بسيطة في عملية إتمام الشراء لجعلها أكثر أماناً.<br>قسم الإرجاع أصبح أفضل الآن، لمنحك تجربة سلسلة وسهلة.<br>قام فريق المطوّرين الرائع لدينا بإصلاح بعض الأخطاء البسيطة لتحسين تجربة التسوق على التطبيق بشكل عام! شكرًا."},{"version_id":"827807876","version_name":"1.17","version_date":"2018-07-11 09:25:27.000 +0800","version_description":"Minor tweaks to our checkout flow, making it even safer for you. <br>Sharpened up the returns section; everything should be even smoother now. <br>Our amazing tech team have fixed bugs and improved the overall performance to create a seamless shopping experience! Shukran.<br><br>تعديلات بسيطة في عملية إتمام الشراء لجعلها أكثر أماناً.<br>قسم الإرجاع أصبح أفضل الآن، لمنحك تجربة سلسلة وسهلة.<br>قام فريق المطوّرين الرائع لدينا بإصلاح بعض الأخطاء البسيطة لتحسين تجربة التسوق على التطبيق بشكل عام! شكرًا."},{"version_id":"828015867","version_name":"1.18","version_date":"2018-08-06 11:07:05.000 +0800","version_description":"You can now combine the items of your order into fewer shipments with just a click of a button.<br>Easily redeem gift cards straight from the noon app.<br>Our amazing tech team have fixed bugs and improved the overall performance to create a seamless shopping experience! Shukran.<br><br>الحين تقدر بضغطة زر واحدة تجمع كل طلبياتك في أقل عدد ممكن من الشحنات<br>يمكنك بسهولة استخدام بطاقات الهدايا من تطبيق نون<br>قام فريق المطوّرين الرائع لدينا بإصلاح بعض الأخطاء البسيطة لتحسين تجربة التسوق على التطبيق بشكل عام! شكراً"},{"version_id":"828451985","version_name":"2.0","version_date":"2018-09-05 08:12:02.000 +0800","version_description":"The noon app has undergone a makeover. We’ve fixed and improved almost everything while ensuring the app now runs at the speed of lightning and looks sleek. Enjoy the new noon app and have!<br><br>جدّدنا تطبيق نون بالكامل، وعملنا تحسينات وتحديثات في كل شيء، عشان نقدم لك سرعة رهيبة في التطبيق وتجربة استخدام  رائعة، استمتع بتطبيق نون الجديد ونوّنها على هواك"},{"version_id":"828562389","version_name":"2.1","version_date":"2018-09-19 07:07:24.000 +0800","version_description":"You can now add products to your cart straight from the product landing page!<br>Our amazing tech team have fixed bugs and refined the overall performance and UI to create a seamless shopping experience!&nbsp;Shukran!<br><br>يمكنك الآن إضافة المنتجات إلى عربة التسوق من صفحة عرض المنتج مباشرة<br>قام فريق المطوّرين الرائع لدينا بإصلاح بعض الأخطاء البسيطة لتحسين تجربة التسوق على التطبيق بشكل عام! شكرًا"},{"version_id":"828648624","version_name":"2.2","version_date":"2018-09-24 07:04:30.000 +0800","version_description":"Performance improvements and minor bug fixes.<br><br>تحسينات في الأداء وإصلاح بعض الأخطاء الصغيرة"},{"version_id":"828868100","version_name":"2.3","version_date":"2018-10-14 08:40:08.000 +0800","version_description":"Homepage banners now move on their own; no more swiping!<br>Like or dislike the noon app? Let us know via our in-app review.<br>An iPad user? We've got you. We're now live on all iPad devices.<br><br>كل بانر موجود على الصفحة الرئيسية يتحرك تلقائياً الآن، بدون تبديل يدوي<br>يمكنك تقييم تطبيق نون عن طريق ميزة التقييم داخل التطبيق<br>يعمل تطبيقنا الآن بشكل أفضل على كل أجهزة الآيباد"},{"version_id":"828951735","version_name":"2.4","version_date":"2018-10-22 07:19:58.000 +0800","version_description":"Performance improvements and minor bug fixes.<br>تحسينات في الأداء وإصلاح بعض الأخطاء الصغيرة"},{"version_id":"829065137","version_name":"2.5","version_date":"2018-10-28 10:35:58.000 +0800","version_description":"A few enhancements that'll make your shopping experience on noon even more smooth.<br>تعديلات بسيطة ستجعل تجربة تسوقك على نون أسرع وأسهل"},{"version_id":"829133622","version_name":"2.6","version_date":"2018-11-02 07:54:32.000 +0800","version_description":"Performance improvements and minor bug fixes.<br>تحسينات في الأداء وإصلاح بعض الأخطاء الصغيرة"},{"version_id":"829227873","version_name":"2.7","version_date":"2018-11-13 07:00:13.000 +0800","version_description":"Performance enhancement and minor bug fixes. Update the app for the best experience of our Yellow Friday sale!<br><br>تحسينات في الأداء وإصلاح بعض الأخطاء الصغيرة. قم بتحديث التطبيق للحصول على أفضل تجربة في تخفيضات الجمعة الصفراء"},{"version_id":"829603897","version_name":"2.8","version_date":"2018-12-16 07:37:04.000 +0800","version_description":"Performance improvements and minor bug fixes.<br>تحسينات في الأداء وإصلاح بعض الأخطاء الصغيرة"},{"version_id":"829817879","version_name":"2.9","version_date":"2019-01-06 06:41:42.000 +0800","version_description":"Performance improvements and minor bug fixes.<br>تحسينات في الأداء وإصلاح بعض الأخطاء الصغيرة"},{"version_id":"830075214","version_name":"2.10","version_date":"2019-01-27 08:06:03.000 +0800","version_description":"Performance improvements and minor bug fixes.<br>تحسينات في الأداء وإصلاح بعض الأخطاء الصغيرة"},{"version_id":"830277463","version_name":"2.11","version_date":"2019-02-19 09:56:18.000 +0800","version_description":"We've made some exciting changes to ensure you have an enjoyable shopping experience. Happy shopping!<br><br>قمنا بإجراء بعض التعديلات لنضمن لك أفضل تجربة تسوق على الإطلاق. يلا نوّنها!"},{"version_id":"830347139","version_name":"2.12","version_date":"2019-02-21 07:48:46.000 +0800","version_description":"Performance improvements and minor bug fixes.<br><br>تحسينات في الأداء وإصلاح بعض الأخطاء الصغيرة"},{"version_id":"830560509","version_name":"2.13","version_date":"2019-03-12 10:42:52.000 +0800","version_description":"We've made some exciting changes to ensure you have an enjoyable shopping experience. Happy shopping!<br><br>قمنا بإجراء بعض التعديلات لنضمن لك أفضل تجربة تسوق على الإطلاق. يلا نوّنها!"},{"version_id":"830948724","version_name":"2.14","version_date":"2019-04-14 07:11:55.000 +0800","version_description":"Navigation was dark and full of terrors but we embarked on a new journey, with a completely refined navigation flow. There are a bunch of secrets and fun improvements that will show up when the time is right. Hint: Ramadan is coming!<br><br>تحديثات جديدة في الانتقال وتغييرات تسّهل عليك كل شي داخل التطبيق، وكثير من التحسينات عشان تنوّنها على كيفك.<br>انتظرونا في رمضان"},{"version_id":"831109809","version_name":"2.15","version_date":"2019-05-01 08:33:09.000 +0800","version_description":"Stark industries after giving Peter his suit decided to give our app a new credit section as well.<br>Nanotech was used on the product page to give it a fresher look.<br>And we donned the gauntlet and snapped away all lurking bugs.<br>#DontSpoilTheEndgame<br><br>بعد مساعدة أيرون مان لبيتر باركر في الحصول على بدلة خارقة جديدة، ساعد نون بتطوير قسم جديد للرصيد<br>استخدمنا تقنية النانو لتجديد شكل صفحات المنتجات<br>وبقبضة ثانوس أزلنا كل المشكلات في التطبيق"},{"version_id":"831446367","version_name":"2.16","version_date":"2019-06-08 10:08:26.000 +0800","version_description":"We've made new and exciting improvements so that you can shop with ease. Happy Shopping!<br><br>قمنا ببعض التحديثات والتحسينات عشان تتسوق بسهولة وراحة، حيّاكم من نون"},{"version_id":"831925244","version_name":"2.17","version_date":"2019-07-14 06:58:54.000 +0800","version_description":"With Spiderman far away from home, our engineers took up the title of your friendly neighbourhood heroes and cleaned up the bugs in your app! Turns out Mr Stark may have left a gift or two for us as well and we used them to improve your experience. Happy Shopping!<br><br>مادام سبايدرمان في إجازة في أوروبا مهندسون نون تولوا مسؤولية حماية التطبيق و قاموا بإزالة جميع المشاكل! تبين أيضا أن السيّد ستارك قد ترك هدية أو اثنتين لنا وقد استخدمناها لتحسين تجربتك. نوّنها وشوف!"},{"version_id":"832513479","version_name":"2.18","version_date":"2019-08-27 13:31:08.000 +0800","version_description":"We've made some exciting design changes, fixed a few bugs and improved performance so that you can shop with ease. Happy shopping!<br><br>!سوينا تغيرات في التصميم وصلحنا بعض المشكلات وبتلقى تحسينات كبيرة في الأداء بتظبط تجربتك لما تتسوق معنا. يلا نوّنها"},{"version_id":"832776811","version_name":"2.19","version_date":"2019-09-18 07:32:21.000 +0800","version_description":"Performance improvements and minor bug fixes.<br><br>تحسينات في الأداء وإصلاح بعض الأخطاء الصغيرة"},{"version_id":"833081424","version_name":"2.20","version_date":"2019-10-13 12:38:26.000 +0800","version_description":"We've made some exciting changes to ensure you have an enjoyable shopping experience. Happy shopping!<br><br>!قمنا بإجراء بعض التعديلات لنضمن لك أفضل تجربة تسوق على الإطلاق. يلا نوّنها"},{"version_id":"833267381","version_name":"2.21","version_date":"2019-10-23 12:03:37.000 +0800","version_description":"Performance improvements and minor bug fixes.<br><br>تحسينات في الأداء وإصلاح بعض الأخطاء الصغيرة"},{"version_id":"833519526","version_name":"2.22","version_date":"2019-11-10 13:24:12.000 +0800","version_description":"Enjoy exciting features, improved performance and special deals with our app for Yellow Friday. Download the app today to make sure you are ready!<br><br>!قم بتحميل تطبيق سيفي و استمتع بميزات رائعة وأداء محسن وعروض خاصة في الجمعة الصفراء و كن مستعدا لمفاجآت كبيرة"},{"version_id":"833547870","version_name":"2.23","version_date":"2019-11-20 06:38:47.000 +0800","version_description":"We've made some exciting design changes, fixed a few bugs and improved performance so that you can shop with ease during our Yellow Friday sale. Happy shopping!<br><br><br>لقد أجرينا بعض التغييرات الرائعة في التصميم، وقمنا بتحسين الأداء بحيث يمكنك التسوق بسهولة أثناء عروض الجمعة الصفراء. كن مستعدا لمفاجآت كبيرة!"},{"version_id":"833784808","version_name":"2.24","version_date":"2019-12-02 08:32:43.000 +0800","version_description":"Performance improvements and minor bug fixes.<br><br>تحسينات في الأداء وإصلاح بعض الأخطاء الصغيرة"},{"version_id":"834017168","version_name":"2.25","version_date":"2020-01-20 08:29:49.000 +0800","version_description":"A few enhancements that'll make your shopping experience on noon even more smooth.<br>تعديلات بسيطة ستجعل تجربة تسوقك على نون أسرع وأسهل"},{"version_id":"834538210","version_name":"2.26","version_date":"2020-02-02 09:13:00.000 +0800","version_description":"Now find out how close you are to getting free shipping, because everyone loves free shipping! <br>Get your location as accurately as possible courtesy of an improved map experience. <br>In the background we've made a host of changes cause new year, new us but same delightful experience.<br><br><br>لأننا نعلم أنك تحب الشحن المجاني, أضفنا لك خاصية لتتبع المبلغ المتبقي للحصول على شحن مجاني<br>تجربة خريطة جديدة لتحدد عنوانك بدقة حتى نتمكن من تسليم طلبيتك بكفاءة<br> بالإضافة إلى الكثير من التحسينات لتجربة تسوق ممتعة"},{"version_id":"834707544","version_name":"2.27","version_date":"2020-02-18 07:09:26.000 +0800","version_description":"A few enhancements that'll make your shopping experience on noon even more smooth.<br>تعديلات بسيطة ستجعل تجربة تسوقك على نون أسرع وأسهل"},{"version_id":"834892410","version_name":"2.28","version_date":"2020-03-19 10:25:06.000 +0800","version_description":"The orders view has undergone a makeover and now you can even filter them based on years; making things easy and convenient for you.<br>A couple more design changes to make sure you have a pleasant shopping experience.<br><br>غيرّنا طريقة عرض طلبياتك وتقدر الحين تشوفهم حسب السنة، وصار التصفح أسهل وأسرع. <br>والتصميم الحين أحلى عشان تنوّنها وأنت مستأنس."},{"version_id":"835209666","version_name":"2.29","version_date":"2020-03-24 07:08:20.000 +0800","version_description":"Introducing contactless deliveries, choose the \"Leave At My Door\" option on your checkout page for a safer delivery experience. <br>We're also providing you with more delivery options by setting up pickup points around favorite locations across your city.<br><br>نقدم لك خدمة التسليم الجديدة، حدد خيار \"اتركها عند الباب\" عند تأكيد الطلب، وراح نضمن لك تجربة توصيل آمنة.<br>كما يمكنك الإطلاع على خيارات التوصيل المختلفة، مثل نقاط نون، اختر نقطة الاستلام المناسبة لك في مدينتك!"},{"version_id":"835245297","version_name":"3.0","version_date":"2020-04-07 08:17:55.000 +0800","version_description":"Hala noon Daily: a safer, easier and fresher way to fulfil all your grocery needs with guaranteed delivery by next-morning! Just build your cart throughout the day and receive the delivery at your door step the next morning. No calls, no bells, no hassle! <br><br>هلا معاك يومي من نون! منصة جديدة وسهلة وأكثر أمانًا فيها كل اللي تحتاجه من منتجات غذائية وأساسية لبيتك مع توصيل مضمون في صباح كل يوم! كل المطلوب منك هو إضافة المنتجات إلى السلة يومياً للاستلام طلبيتك في كل يوم صباحاً. بدون أي تواصل لتوصيل آمن ومريح."},{"version_id":"835444235","version_name":"3.1","version_date":"2020-04-07 17:37:39.000 +0800","version_description":"A few enhancements that'll make your shopping experience on noon even more smooth.<br>تعديلات بسيطة ستجعل تجربة تسوقك على نون أسرع وأسهل"},{"version_id":"835698003","version_name":"3.2","version_date":"2020-04-29 12:14:03.000 +0800","version_description":"We've made some exciting new changes to ensure you have an enjoyable shopping experience. Happy shopping!<br><br>!قمنا بإجراء بعض التعديلات لنضمن لك أفضل تجربة تسوق على الإطلاق. يلا نوّنها"},{"version_id":"835810656","version_name":"3.3","version_date":"2020-05-04 19:35:26.000 +0800","version_description":"Performance improvements and minor bug fixes.<br>تحسينات في الأداء وإصلاح بعض الأخطاء الصغيرة"},{"version_id":"836090710","version_name":"3.4","version_date":"2020-05-26 15:22:01.000 +0800","version_description":"Hala noon Daily: a safer, easier and fresher way to fulfil all your grocery needs with guaranteed delivery by next-morning! Enjoy auto-checkout as you build your cart throughout the day and receive delivery at your door step the next morning.<br><br>لا نون يومي: أسهل طريقة لطلب كل احتياجات البيت والتوصيل ثاني يوم مضمون! اختر المنتجات وضيفها لسلة التسوق وسيتم إتمام الشراء تلقائياً وبتوصلك صباح باكر."},{"version_id":"836281122","version_name":"3.5","version_date":"2020-06-10 12:55:18.000 +0800","version_description":"Like or love your purchase? Tell us all about it. Start reviewing your products and purchases straight from your account section.<br>Worried about buying from a seller? You will now be able to see our most reliable sellers by checking their ratings from the product page.<br>Want to search inside categories? Well be our guest, our search has leveled up.<br><br>الحين تقدر تقييم كيف كانت تجربتك؟ من حسابك على التطبيق<br>يمكنك مشاهدة أكثر البائعين المعتمدين لدينا عن طريق معرفة تقييماتهم في صفحة وصف المنتج<br>لتحسين تجربة البحث لدينا، يمكنك الحين البحث داخل فئات المنتجات عن كل اللي تحتاجه"},{"version_id":"836357309","version_name":"3.6","version_date":"2020-07-06 07:21:57.000 +0800","version_description":"Introducing hassle free claiming, you can now easily claim for warranty from the app.<br>Your grocery shopping experience on noon Daily just got a whole lot better with a faster checkout and the ability to reorder.<br><br>الآن يمكنك المطالبة بالضمان بسهولة عن طريق التطبيق<br>الكثير من الميزات والتحسينات الجديدة على نون يومي لجعل تجربة التسوق أفضل وأسهل"},{"version_id":"836859085","version_name":"3.7","version_date":"2020-08-03 07:22:27.000 +0800","version_description":"We've made some exciting new changes to ensure you have an enjoyable shopping experience. Happy shopping!"},{"version_id":"837492882","version_name":"3.8","version_date":"2020-08-26 15:32:14.000 +0800","version_description":"A few enhancements that'll make your shopping experience on noon even more smooth."},{"version_id":"837640791","version_name":"3.9","version_date":"2020-09-09 08:59:45.000 +0800","version_description":"Performance improvements and minor bug fixes."},{"version_id":"837920564","version_name":"3.10","version_date":"2020-10-01 07:20:47.000 +0800","version_description":"We've made some exciting new changes to ensure you have an enjoyable shopping experience. Happy shopping!"},{"version_id":"838090252","version_name":"3.11","version_date":"2020-10-08 14:20:36.000 +0800","version_description":"Performance improvements and minor bug fixes."},{"version_id":"838231762","version_name":"3.12","version_date":"2020-10-20 14:20:56.000 +0800","version_description":"Performance improvements and minor bug fixes."},{"version_id":"838405024","version_name":"3.13","version_date":"2020-11-15 13:49:12.000 +0800","version_description":"Performance improvements and minor bug fixes."},{"version_id":"839268419","version_name":"3.14","version_date":"2020-12-01 09:09:37.000 +0800","version_description":"Performance improvements and minor bug fixes."},{"version_id":"839469316","version_name":"3.15","version_date":"2021-01-05 09:51:54.000 +0800","version_description":"We've made some exciting new changes to ensure you have an enjoyable shopping experience. Happy shopping!"},{"version_id":"840163605","version_name":"3.16","version_date":"2021-01-25 11:58:59.000 +0800","version_description":"We've made some exciting new changes to ensure you have an enjoyable shopping experience. Happy shopping!"},{"version_id":"840286003","version_name":"3.17","version_date":"2021-02-03 11:55:24.000 +0800","version_description":"Enjoy a new and shiny looking cart within noon Daily, your grocery shopping just got fancier!<br>We've also squashed a few bugs lurking around inside the app."},{"version_id":"840693357","version_name":"3.18","version_date":"2021-03-02 10:48:37.000 +0800","version_description":"Performance improvements and minor bug fixes."},{"version_id":"840981482","version_name":"3.19","version_date":"2021-03-21 15:13:30.000 +0800","version_description":"Performance improvements and minor bug fixes."},{"version_id":"841217610","version_name":"3.21","version_date":"2021-04-07 10:12:32.000 +0800","version_description":"We've made some exciting new changes to ensure you have an enjoyable shopping experience. Happy shopping!"},{"version_id":"841310092","version_name":"3.22","version_date":"2021-04-14 07:59:18.000 +0800","version_description":"We've made some exciting new changes to ensure you have an enjoyable shopping experience. Happy shopping!"},{"version_id":"842132489","version_name":"3.23","version_date":"2021-05-10 12:59:12.000 +0800","version_description":"Introducing new payments modes to shop on noon daily, your grocery shopping just got easier!"},{"version_id":"842339149","version_name":"3.24","version_date":"2021-05-25 07:25:17.000 +0800","version_description":"We've made some exciting new changes to ensure you have an enjoyable shopping experience. Happy shopping!"},{"version_id":"842524058","version_name":"3.25","version_date":"2021-06-07 07:20:01.000 +0800","version_description":"Ever wanted a quick glance at a product's rating? You can know easily see product ratings from the listing page!<br>Not happy with your recent purchase? Well, you'll be easily able to return items with our new and improved returns process.<br>We also managed to sneak in some necessary performance improvements and minor bug fixes."},{"version_id":"842765055","version_name":"3.26","version_date":"2021-06-23 07:56:18.000 +0800","version_description":"We've made some exciting new changes to ensure you have an enjoyable shopping experience. Happy shopping!"},{"version_id":"842943182","version_name":"3.27","version_date":"2021-07-06 08:49:52.000 +0800","version_description":"We've made some exciting new changes to ensure you have an enjoyable shopping experience. Happy shopping!"},{"version_id":"842977468","version_name":"3.28","version_date":"2021-07-07 09:19:12.000 +0800","version_description":"Performance improvements and minor bug fixes."}]