[{"version_id":"832471994","version_name":"1.0.0","version_date":"2020-03-17 14:03:38.000 +0800","version_description":""},{"version_id":"835168401","version_name":"1.0.1","version_date":"2020-03-20 19:58:11.000 +0800","version_description":"We heard your feedback and squashed some bugs in this release! Be sure to send us your feedback on how you're using GitHub for iOS.<br><br>• FIXED Navigating to a pull request or issue from within the context of another pull request or issue now renders correctly<br>• FIXED The bottom half of the triage sheet now renders correctly when dragging up quickly<br>• FIXED Caches from the previously logged in account are now cleared when logging out<br>• FIXED User profiles now have the correct number of repositories owned by that user<br>• FIXED Lists of user-/organization-owned repositories now render correctly<br>• FIXED Issue/Pull Request navigation headers now have an appropriate accessibility title<br>• NEW Improved accessibility of issue and pull request timeline events"},{"version_id":"835443178","version_name":"1.1.0","version_date":"2020-04-13 15:29:53.000 +0800","version_description":"We are listening to all of your wonderful feedback, and this update includes some of the most-requested features as well as improves the overall experience. Here's just the highlights of this update:<br><br>• Typing \"@\" in a comment, issue, or review will autocomplete a list of most-relevant users that you can select from<br>• Switch branches when browsing repositories<br>• View a list of commits in pull requests or repositories<br>• A new, native commit details view accessible from commit lists or pull request timelines<br>• Totally redesigned issue creation flow with templates<br><br>Please let us know how you are enjoying the app by leaving us a review or submitting feedback in app settings. Thank you!"},{"version_id":"835688456","version_name":"1.1.1","version_date":"2020-04-28 15:18:25.000 +0800","version_description":"We are listening to all of your wonderful feedback, and this update includes some new features and workflow improvements. Here's just the highlights of this update:<br><br>• New preference to open links in external browsers<br>• Text rendering now supports any formatting that works on web<br>• Pull Requests got some UI polish. Merge status is now moved to the feed.<br>• Edit Issue &amp; Pull Requests titles<br>• Pull Requests now show if they are a draft<br>• Improved keyboard shortcuts<br>• Autocomplete user names now lets you search for any GitHub user<br>• Files changed now shows more concice line numbers<br>• Renamed files now appear as renamed<br>• Other bug fixes and performance improvements<br><br>Please let us know how you are enjoying the app by leaving us a review or submitting feedback in app settings. Thank you!"},{"version_id":"835773553","version_name":"1.1.2","version_date":"2020-05-12 21:06:39.000 +0800","version_description":"We are listening to all of your wonderful feedback, and this update includes some new features and workflow improvements. Here's just the highlights of this update:<br><br>• Improved code review flow on iPad<br>• Improved comment scrolling performance<br>• Fixed quoting issues<br>• Fixed opening external links from comments<br>• Other bug fixes and performance improvements<br><br>Please let us know how you are enjoying the app by leaving us a review or submitting feedback in app settings. Thank you!"},{"version_id":"836181564","version_name":"1.2.0","version_date":"2020-06-09 09:51:37.000 +0800","version_description":"• Improved pull request review experience — support for marking files as viewed, collapsing files, deleted files, and more. <br>• Markdown, image, and PDF files now render when clicked on while browsing code<br>• Organization badges on user profiles link to the mentioned organization.<br>• View multiple author avatars for commits on pull request timelines.<br>• New \"Metaphorical Technology\" custom app icon!<br>• New fork badge on repository profile that links to the parent repository. <br>• Fixed an iPad bug where keyboard dismisses while typing a review.<br>• Typing new comments are now smoother than ever, rather than jumpy or flickering.<br>• Labels, user statuses, and commit messages that render emoji shortcodes now properly render emojis.<br>• New support for iPad pointer effects.<br>• Fixed voice-over bugs in the inbox filter view"},{"version_id":"836341875","version_name":"1.2.1","version_date":"2020-06-25 19:18:36.000 +0800","version_description":"New Features:<br>• Delete a branch after merging a pull request! Keep that repo tidy and prune branches as your merge your pull requests<br>• Introducing line numbers on Browse Files! Make it easier to discuss a line of code by referencing the exact line number it lives on<br>• Long-press on an emoji reaction to view the list of users who reacted with that reaction<br>• View commits lists and commit details in split view on iPad<br>• Repository Admins can override branch protections on merge, if enabled<br><br>Bug fixes<br>• Inbox fetches new notifications consistently on app start<br>• User profile photo updates consistently after changing on GitHub.com"},{"version_id":"836745660","version_name":"1.2.2","version_date":"2020-07-10 18:20:34.000 +0800","version_description":"New Features:<br>• Introducing Explore! Find new trending repositories, recommended just for you.<br>• Introducing a new editor for new Issues and comments with Markdown highlighting!<br>• Introducing code display settings! Tweak font sizes, show line numbers, or set all of your code to display in Dark Mode from Settings.<br>• Accidentally swiped a notification as Done before you were ready? Undo notification actions with just a tap <br>• Navigate back with a keyboard using ⌘-← (cmd-left)<br>• Code within comments and other Markdown use the system's monospace font<br>• Emoji autocomplete has been added to most text inputs for all your emoji needs<br>• Improved iPad pointer and trackpad support, including dismissing the triage sheet in Issues and Pull Requests with a simple swipe<br>• Commit lists now show in split view, allowing you to view your list of commits right next to it's details, like commit messages, diffs, and more<br>• New in Feature Previews: Open GitHub URLs you've copy-pasted to jump directly to the view that you want to see<br><br>Bug Fixes:<br>• Users who do not have write access to a repository no longer see a button to merge pull requests that they are not allowed to merge<br>• Linked URLs within rendered Markdown that point to non https URLs no longer crash the app<br>• Empty state for branches on a repo have the appropriate message<br>• Usernames in user lists render at the correct height<br>• Reaction user list view nav bars render at the correct height<br>• Unstarring a repository while browsing your starred repositories removes it from the list view<br>• Tapping \"See more pull requests\" in search navigates to the appropriate search view<br>• User statuses with custom GitHub emojis render appropriately<br>• Merging a pull request no longer changes the footer height while loading/merging"},{"version_id":"837046062","version_name":"1.2.3","version_date":"2020-08-03 18:45:45.000 +0800","version_description":"Improvements: <br>- The search bar always appears on Explore to make it easier to find what you’re looking for.<br>- Improved color contrast for icons throughout the app<br>- Improved accessibility for VoiceOver users.<br>- Enabled support for multiple windows on iPad.<br>- Deleted users display with a ghost placeholder within issues and pull requests<br><br>Bug  Fixes: <br>- READMEs views renders correctly without being cut off.<br>- App start without network errors.<br>- No more overlap between navigation title and content when navigating to a file using deep link.<br>- Fast clicking on star/unstar has accurate results. <br>- User profile renders correctly state is correct after changing username."},{"version_id":"837225393","version_name":"1.2.4","version_date":"2020-08-11 21:25:00.000 +0800","version_description":"Improvements:<br>• Updated design of repositories on the Home tab.<br>• Introducing a new sidebar-style layout for iPad. To enable it, go to settings under Feature Preview. <br>• New \"marked as draft\" timeline event for pull requests<br>• Buy a GitHub Pro membership directly from the application<br><br>Bug  Fixes:<br>• Link in comments now correctly word wrap"},{"version_id":"837338422","version_name":"1.2.5","version_date":"2020-09-02 21:04:16.000 +0800","version_description":"What is New:<br>- You can now view markdown files as a raw file.<br>- User avatars are now rendered as circles and organizations are rounded rectangles, helping to distinguish them more easily.<br>- We introduced a beautiful button for adding your review to pull request files changes, which is easier to find and interact with.<br>- Trade restricted users will no longer see the GitHub Pro option in settings.<br>- You can toggle detecting copied URLs in settings.<br><br>Bug fixes:<br>- Tapping on a link in a markdown file to a section heading will now jump to that section correctly.<br>- Links in comments are now styled correctly.<br>- If a repo uses issue templates, we always pushed the template selection view, even if the user had chosen a comment to be used for a new issue. This has now been fixed for faster issue creation.<br>- If you use the Sidebar experimental feature on iPad, we fixed some issues with its rendering when the device is rotated.<br>- If you use the Sidebar experimental feature on iPad, there's a new quick entry button to navigate directly to your settings screen from the sidebar footer."},{"version_id":"837700299","version_name":"1.2.6","version_date":"2020-09-09 18:50:02.000 +0800","version_description":"What's new:<br><br>- We added a new sidebar to the iPad app, making it easier to navigate the app and faster to browse your stuff. If it's ever in the way, you can collapse the sidebar.<br>- We improved the pull request merge flow by fixing several icon, color, and copy inconsistencies with GitHub.com.<br><br>Bug fixes:<br><br>- We fixed the layout of empty state indictors.<br>- The ability to update a pull request has been fixed so that it's only visible to users with permissions on that pull request.<br>- We fixed minor UI glitches with the borders of the pinned repo section on the Explore tab."},{"version_id":"837890156","version_name":"1.2.7","version_date":"2020-09-22 12:48:29.000 +0800","version_description":"What's new:<br>- View Readmes on people's profiles<br>- Enable the new \"Multiline Comments\" Feature Preview and long-press (or two-finger drag) to leave a comment on multiple lines of code.<br><br>Bug fixes:<br>- Several iPad side bar loading bugs and crashes were fixed<br>- Fixed an issue where editing reviewers could remove or reset already selected reviewers."},{"version_id":"837903907","version_name":"1.2.8","version_date":"2020-09-23 16:34:10.000 +0800","version_description":"What's New:<br>• View Readmes on people's profiles<br>• Enable the new \"Multiline Comments\" Feature Preview and long-press (or two-finger drag) to leave a comment on multiple lines of code.<br><br>Bug Fixes:<br>• Several iPad sidebar loading bugs and crashes were fixed<br>• Fixed an issue where editing reviewers could remove or reset already selected reviewers.<br>• Comments on lines of code within a pull request appear on the correct line, without causing an error upon submitting"},{"version_id":"837926290","version_name":"1.2.9","version_date":"2020-09-29 12:00:08.000 +0800","version_description":"# What's New<br><br>• Introducing a localized experience with GitHub for iOS! Enjoy using the app in Spanish, Japanese, Chinese and Brazilian Portuguese<br>• Introducing merge options for merge commits, squash and merge, and rebase and merge commits! Customize your email and commit message before merging pull request, putting you in full control of your merge commits.<br>• Introducing the Midnight Matte icon, for all your dark mode homescreen needs!<br><br># Bug Fixes<br><br>• Details for CI statuses, check runs, and other status checks match the copy and iconography shown on GitHub.com<br>• Fonts scaled to larger/smaller sizes display at the context-appropriate size throughout the app<br>• Repository advisory and vulnerability notifications no longer a show an Unsubscribe action for a single notification<br>• iPad sidebar layout shows cells and empty states with context appropriate background colors"},{"version_id":"838100237","version_name":"1.3.0","version_date":"2020-10-14 10:55:52.000 +0800","version_description":"What's New<br><br>• Introducing horizontal scrolling for code within pull requests, commits, and browsing code! Don't want to see your code line wrapped? Set your preferred line wrapping setting in Profile &gt; Settings &gt; Code Settings.<br>• Introducing multiline comments! Long-press on a line of code within a pull request, and begin selecting multiple lines of code to leave a comment on. Use a two-finger swipe to select multiple lines of code without a long press. Leave suggestions for multiple lines, or comment on a whole function at once.<br>• Introducing a redesigned comment experience for pull request comments! See the line context that a comment relates to, and view comments in a more readable UI on Files Changed.<br>• Introducing merge options! Pick the right merge method for your pull requests, change the email associated with a merge commit, or write a custom commit message before merging your work on the main branch.<br>• Introducing jump-to-file within pull requests! Jump directly to a changed file within a pull request from list of all files, with a split-view on iPad to make your pull requests even easier to walk through.<br><br>Bug Fixes<br><br>•&nbsp;Paginating files within the jump-to list renders files in the appropriate collapsed state.<br>• Midnight Matte custom app icon is able to be configured for iPad devices.<br>• Fixed several leaks and retain cycles so the app uses less memory.<br>• Setting a custom browser on iOS 14 opens URLs without an error.<br>• Lines of code collapsed in a new comment view render with a dark mode compatible background<br>• Pull requests show the exact number of reviews needed before the pull request is mergeable.<br>• Localized code settings no longer overlap over their switches<br>• Blank lines in pull requests and commits render their contents appropriately<br>• Navigating notifications with keyboard shortcuts opens notifications automatically if the content can be viewed in app<br>• Collapsing or marking files as viewed no longer resets the state of the collapsed section when scrolling the file offscreen<br>• Fixed a crash when attempting to edit Markdown autolinks within comments<br>• \"Merge\" call-to-action on pull requests prevents compression when text may cause it to overflow<br>• Update Branch button on out-of-date pull requests always presents at a reasonable size<br>• Deleting a comment on a pending pull request review no longer causes the review to error on submission"},{"version_id":"838308170","version_name":"1.3.1","version_date":"2020-10-26 13:24:44.000 +0800","version_description":"## What's New<br><br>• Introducing suggested changes within comments! Create suggestions on pull requests after selecting lines, and apply them with the tap of a button.<br>• Introducing ability to edit commit message for the merge commits.<br>• Trigger haptic feedback to the user on Multiline selection.<br>• Introducing ability to copy file path in the Jump to files into pasteboard by long press on the cell.<br>• Swiping triage sheet will save the new selected options instead of discarding them.<br>• Merge options maintains collapsed/expanded state across pull requests.<br>• Viewing text documents will now always line wrap.<br><br>## Bug Fixes<br><br>• Keyboard shortcuts fixes and improvements. Now escape key will dismiss the New issue view.<br>• Preventing creating new issues for archived repositories.<br>• The launch screen now properly respects light and dark modes.<br>• Tapping on a file link in-app will no longer push all parts of the file path onto the navigation stack.<br>• Fixed Random error on attempting to switch into other branch.<br>• Expanding and collapsing checks no longer collapses merge options."},{"version_id":"838505455","version_name":"1.3.2","version_date":"2020-11-10 10:15:21.000 +0800","version_description":"What's new<br><br>• Cross-referenced issues and commits have an updated design in pull requests and issues.<br>• Copy file paths and browse specific files within pull requests by tapping the ••• button when browsing diffs.<br>• Check-run badges now show whether or not they are required before merging.<br>• Navigate to authors and contributors from the commit details page.<br><br>Bug fixes<br><br>• Empty list items no longer appear when holding down Back buttons in navigation stacks.<br>• Fixed a bug in multi-select that can cause portions of a range to become deselected."},{"version_id":"839259000","version_name":"1.3.3","version_date":"2020-11-24 12:11:56.000 +0800","version_description":"What's new<br><br>- Search has moved from the Explore tab to the Home tab, allowing you to quickly search for issues, pull requests, repositories and more.<br>- A new Profile tab makes it easier to get to your profile from anywhere in the app.<br>- Long-press on notifications to save, unsubscribe, mark as read, or mark as done.<br>- Labels got a quick redesign to give them a bit more visual clarity.<br>- Easily blockquote text by tapping on the blockquote button in the Markdown bar when composing a comment or issue.<br><br>Bug fixes<br><br>- Fixed a crash that occurred when the device was rotated in certain places.<br>- Fixed a crash that occurred when navigating files and long-pressing the back button.<br>- Fixed the UI becoming unresponsive on rare occasions after performing actions on comments.<br><br>We release a lot of new changes to the GitHub app every couple weeks. These updates happen automatically and in the background, so it's easy to miss out on new features.<br>We love nerding out over release notes for new and exciting features. It's like candy! Especially for software that ships often.<br><br>We're experimenting with in-app release notes that appear occasionally when new features ship in GitHub for iOS. We hope that this will be a fun way for developers everywhere to keep up with what's new and be the first to try out new features."},{"version_id":"839448190","version_name":"1.3.4","version_date":"2020-12-08 15:22:39.000 +0800","version_description":"What's new<br><br>- Introducing bulk actions for your Notifications! Select multiple notifications to mark them as done or save them for later with just a few taps. <br>- Get through your notifications faster with the right swipe actions for your workflow. Haven't customized your swipe actions for Notifications yet? Configure swipe actions for Notifications right from the Notifications tab, or learn more in Settings &gt; Swipe Actions. <br>- Quickly determine if filters are active for your Notifications view with new iconography and messaging in the navigation bar.<br>- Introducing a shiny new set of app icons to celebrate GitHub Universe 2020! Customize your app icon and be sure to tune in on December 8-10 on https://githubuniverse.com !<br>- Send us feedback, bug reports or get support for your GitHub account with the improved support workflow. Get routed to the best place to help solve your problems from Settings &gt; Share Feedback.<br>- Long press on a notification to view all actions available to take, like mark as read, mark as done, save for later, or unsubscribe.<br>- Quickly create list items from the Markdown bar while writing comments or issues.<br>- See what percentage of your status checks have passed, failed or are pending with the new donut graph when merging pull requests.<br><br>Bug fixes<br><br>- Key commands for modally presented views override their contents underneath.<br>- Emoji autocomplete for emojis composed of multiple characters place the cursor at the correct position.<br>- User profile READMEs with expandable content render correctly in light and dark mode.<br>- Usernames displayed in issue timelines display the correct username for the current user.<br>- Tap targets for marking files as viewed and other file actions in pull requests render at consistently tappable sizes.<br>- Fixed a bug when editing issue comments that would leave the app in an unresponsive state.<br>- Navigating back while browsing code using the iOS 14 back button long press&nbsp;no longer crashes the app."},{"version_id":"839560462","version_name":"1.4","version_date":"2021-01-12 14:03:50.000 +0800","version_description":"What's new<br><br>- Introducing Discussions, a new way to connect with your community, team, and collaborators on GitHub! Share new ideas, ask questions, and find inspiration within your repository.<br>- Have a new feature request for GitHub for mobile? Use the Feedback button in Settings to start a new Discussion for your feature request!<br>- Updated the interface for mentioning people and writing emoji shortcodes to display inline, with a more minimal footprint.<br>- Viewing a list of repositories on iPad shows the list and repository details in a split view.<br><br>Bug fixes<br><br>- Fixed a crash on app launch for some users.<br>- mailto: links within in Markdown open with your default email app.<br>- Placeholder for new comments, issues, discussions, etc. render without truncation.<br>- Star buttons for repos in Explore are reliably tappable.<br>- Autocomplete menu within comments is no longer visible if there are no results.<br>- Fixed a bug with cursor placement after autocompleting an emoji.<br>- Periods are correctly recognized in repository search.<br>- Increased the tap area for the ··· overflow button in comments.<br>- Submitting a bug report from Settings no longer errors out for some users<br>- Selecting a user from autocomplete search appends the at-symbol ahead of the username.<br>- Hunk context lines cannot be selected as part of pull request review comments.<br>- Improved logic around push notification registration to reduce push notification failure rate.<br>- Navigating to a universal link containing a username ending with a file type or other path no longer routes to the user profile.<br>- Networking errors report more actionable information.<br>- Deleting a commit body from a merge commit prevents the default commit message from being used on the merge commit.<br>- Toasts and error messages use the correct border colors when transitioning from light to dark mode and vice versa.<br>- Cell separators on repository profiles render at content width on iPad.<br>- Star button for repositories on Explore appear without squashing title, contents.<br>- Creating a new issue from a template respects the template's labels.<br>- Allow all text to be selected in Code View.<br>- Nested task list indent properly within issues, comments."},{"version_id":"840235470","version_name":"1.4.2","version_date":"2021-02-02 11:05:50.000 +0800","version_description":"What's New <br>• Introducing the first GitHub widget: contribution graphs!<br>• Uploading an image ensures a complete upload before publishing an issue or comment.<br>• Support for more emojis!<br>• Use two-finger pan gestures in inbox to select multiple notifications.<br>• View pinned discussions in discussions lists.<br>• Support for auto merging pull requests.<br>• View discussions directly from the home tab.<br><br>Bug Fixes<br>• Spanish Localization fixes.<br>• Fixes some animation jank when toggling multi-line comments in code reviews.<br>• Polished the category-selection UI when creating a new discussion.<br>• Improved dark mode colors when suggesting answers in discussions.<br>• Merge options are now hidden when the user does not have permission to merge the pull request.<br>• Starring a repository on the Explore tab animates a proper transition.<br>• Pinned repository descriptions are no longer truncated in user profiles.<br>• Usernames and avatar in inline replies within discussions no longer prevent navigation when tapped. <br>• The … button is no longer available on deleted discussion comments. <br>• Timestamps now correctly update themselves as time passes by. <br>• Starring repositories in the explore page no longer triggers reload animations."},{"version_id":"840421556","version_name":"1.4.3","version_date":"2021-02-16 09:36:37.000 +0800","version_description":"Bug Fixes and Improvements:<br>• Creating a discussion from the Home screen transitions to the category selection view correctly<br>• Emojis for discussion categories render at the correct size<br>• Switching branches within a repository profile consistently switches to the selected branch<br>• Marking a discussion comment as answer will animate the indicator nicely<br>• Pinned repositories in the Explore screen render correctly"},{"version_id":"840550495","version_name":"1.4.4","version_date":"2021-02-23 10:41:41.000 +0800","version_description":"Bug Fixes:<br>• The cursor when writing or editing a comment is no longer obscured by the Markdown bar<br>• Tapping on an image in Markdown text opens the image properly"},{"version_id":"840608394","version_name":"1.4.5","version_date":"2021-03-01 22:59:30.000 +0800","version_description":"Bug Fixes:<br>• Comments in pull request reviews now render as expected.<br>• Dates are now render as expected."},{"version_id":"840697022","version_name":"1.4.6","version_date":"2021-03-03 16:57:21.000 +0800","version_description":"Bug Fixes<br>•&nbsp;Text fields no longer appear blank when creating or editing a comment on a line of code within a pull request review."},{"version_id":"840768056","version_name":"1.5","version_date":"2021-03-11 10:38:21.000 +0800","version_description":"This is an iterative release of the app with some improvements and bug fixes. <br>Amongst several improvements, the following are worth calling out:<br><br>- Adding a border around the white badges so that they are visible against a white background!<br>- Restoring cell selection states in the Repository Profile."},{"version_id":"840868251","version_name":"1.6.0","version_date":"2021-03-16 16:16:46.000 +0800","version_description":"What's new:<br><br>• Introducing releases! Navigate through all releases in a repository, browse the release notes, and download release assets<br>• Introducing deployment review notifications! Review and approve deployments from your iPhone or iPad to unblock your team and keep the deployment pipeline moving<br>• You can easily check if the user is a GitHub Star or not through the newly added GitHub Star badge"},{"version_id":"840976817","version_name":"1.7.0","version_date":"2021-03-23 07:13:21.000 +0800","version_description":"# Bug Fixes:<br><br>- Viewing the details page for issues, pull requests, and files changed, should render correctly on GitHub Enterprise.<br>- Fixed errors that would occur when creating or editing comments on GitHub Enterprise."},{"version_id":"841067662","version_name":"1.8.0","version_date":"2021-03-30 14:16:07.000 +0800","version_description":"What's new:<br><br>• Keep your work moving forward with new real-time push notifications for assignments, pull request reviews, and deployment approval requests.<br>• Customize the types of notifications you receive when watching an individual repository with the new Watch button.<br>• Working hours gives you control of the days and times when you want to receive push notifications from GitHub.<br>• Profiles have GitHub Star badge.<br><br>Bug fixes:<br><br>• Number of commits in a branch should render correctly.<br>• Fixed visual errors in user profile README."},{"version_id":"841180305","version_name":"1.9.0","version_date":"2021-04-06 18:59:02.000 +0800","version_description":"Bug fixes<br><br>• Improved VoiceOver and accessibility for releases.<br>• Releases no longer show an empty section for assets when no release assets exist.<br>• Expanding user profile READMEs or release descriptions no longer result in incorrectly collapsed states.<br>• Searching via the search bar on Home deselects the selected row when returning from a search.<br>• Using a two-finger gesture to select many notifications selects a closed range of rows rather than all rows touched by the gesture."},{"version_id":"841296468","version_name":"1.10.0","version_date":"2021-04-12 18:16:55.000 +0800","version_description":"What's New<br>• Gather feedback and build a community around your project by enabling Discussions on a release.<br><br>Bug Fixes<br>• Releases no longer crashes under some localizations.<br>• Tapping inline replies in discussions now correctly navigates users to discussion threads."},{"version_id":"841342731","version_name":"1.11.0","version_date":"2021-04-19 09:30:48.000 +0800","version_description":"Bug Fixes<br><br>• Pull requests blocked from merging indicate when a review is missing.<br>• Improved pull request widget layout with varying font and widget sizes."},{"version_id":"841821529","version_name":"1.12.0","version_date":"2021-04-26 07:33:33.000 +0800","version_description":"Bug Fixes<br><br>• Fixed a crash that occurred when typing certain emoji shortcuts<br>• The contribution graph widget no longer uses a pure-black background<br>• Tapping on the back button from the notification schedule stores the selected schedule correctly"},{"version_id":"842007263","version_name":"1.13.0","version_date":"2021-05-03 11:46:40.000 +0800","version_description":"Bug Fixes<br><br>• Tapping on a discussion reply preview will always navigate to the reply list"},{"version_id":"842109701","version_name":"1.14.0","version_date":"2021-05-10 11:51:42.000 +0800","version_description":"Introducing new pull request experiences on mobile. Reviewing and merging pull requests are now much easier on the go!<br><br>• The pull request description has moved up on the pull request detail view, providing quick context about the changes without having to scroll to the timeline. Expand longer inline descriptions with a tap.<br>• The new merge box mirrors the experience you're familiar with from GitHub.com. With clear colors and iconography, scanning through the overall status of a pull request to understand the current state of reviews, checks, and overall mergeability has never been easier.<br>• The Files Changed cell now has a contextual call to action that will tell you when a pull request requires your review, or when a pull request has changes since your last review.<br>• With passing reviews and checks, a pull request can be directly merged from the view without having to enter a modal.<br>• New merge animations!<br>• Introducing video uploads on issues and pull requests to share reproduction steps, design ideas, and experience details with your team.<br><br>Bug fixes<br><br>• Tapping on a discussion reply preview will always navigate to the reply list."},{"version_id":"842148911","version_name":"1.14.1","version_date":"2021-05-12 23:24:19.000 +0800","version_description":"Bug fixes<br><br>• Fixes a crash when merging a pull request on iPad"},{"version_id":"842205692","version_name":"1.15.0","version_date":"2021-05-17 18:13:47.000 +0800","version_description":"What's new<br><br>• See upvotes and comment counts for discussions right from the discussion list<br>• Mark draft pull requests as ready for review to get pull request reviews where ever you are<br><br>Bug fixes<br><br>• Reduced the chance of seeing \"merge status unknown\" when viewing pull requests<br>• Pull request review text fields render within safe area bounds<br>• Fixed a crash when merging a pull request on iPad<br>• Mirroring the display to an external display correctly updates the display<br>• Expected checks for pull requests appear consistently<br>• Dismiss the list of users who reacted to a comment with a button, rather than only swiping"},{"version_id":"842297390","version_name":"1.16.0","version_date":"2021-05-25 13:01:04.000 +0800","version_description":"What's new<br>• Introducing an all new filtering experience. No matter what issue, pull request, or discussion you're looking for, finding it just got a whole lot easier!<br>• We've added new metadata to issues and pull request list items so that it's easier to see assignees, checks status, review states, and comment counts.<br><br>Bug Fixes<br> • Check runs are no longer duplicated within a pull request."},{"version_id":"842382881","version_name":"1.17.0","version_date":"2021-06-01 20:16:08.000 +0800","version_description":"What's new<br>• See what pull requests are pending reviews at a glance when viewing lists of pull requests.<br>• For open-source maintainers, approve workflow runs from first-time contributors with tap. Prevent abusive actors from running untrusted Actions on your pull requests.<br>• See required pull request reviews from code owners separate from other teams or users with the new code owners badge.<br><br>Bug Fixes<br>• Improved accessibility of dismissing the release notes banner on the Home screen.<br>• Improved accessibility on the repository and user profile.<br>• Fixed an issue where the settings button for auto-merge was unresponsive."}]