[{"version_id":"14963533","version_name":"3.7.1","version_date":"2021-01-20 18:23:59.000 +0800","version_description":"With every release we aim to polish up the Mobily app experience. <br>What’s in this update:<br><br>- See both your add-ons and Neqaty redemption benefits in the dashboard<br>- Get a more detailed breakdown of your prepaid balance<br>- Add data and fiber lines using your ID number<br>- Access Rahati settings via a quick link<br>- Buy data and prepaid bundles directly with your credit card<br>- A new look and feel for the Mobily Store<br>- General bug fixes and improvements<br><br>Thanks for using the Mobily app!"},{"version_id":"14963533","version_name":"3.1.20","version_date":"2018-09-18 16:14:53.000 +0800","version_description":"- We made it more simple to register a new user account in the App.<br>- قمنا بتسهيل وتحسين عملية انشاء الحسابات الجديدة لمستخدمي التطبيق"},{"version_id":"14963533","version_name":"3.2.1","version_date":"2019-08-12 16:32:45.000 +0800","version_description":"Our Tech team have been working super hard to squash some bugs and fine tune the app performance. <br>You may also notice we have made it even easier to communicate with our Customer Care team through our helpful new feature Whatsapp Support.<br><br>يعمل فريقنا التقني على حل بعض المشاكل و تحسين أداء التطبيق حتى يحوز على رضاكم.<br>قمنا أيضاً بتسهيل عملية التواصل مع فريق موبايلي للدعم عن طريق إضافة محادثات الواتساب."},{"version_id":"14963533","version_name":"3.2.3","version_date":"2019-10-05 02:28:03.000 +0800","version_description":"General performance improvements and bug fixes.<br>قمنا بعمل تحسينات عامة للأداء وإصلاحات لبعض الأخطاء."},{"version_id":"14963533","version_name":"3.1.23","version_date":"2018-12-02 21:47:20.000 +0800","version_description":"Fixed a major crash that was happening when users try to register<br><br>حل مشكلة كانت توجه بعض العملاء عند محاولة التسجيل."},{"version_id":"14963533","version_name":"3.0.79","version_date":"2018-03-20 12:58:35.000 +0800","version_description":"We fixed some bugs that were causing stability and dependability issues in the app.<br><br>.لقد قمنا باصلاح بعض الأخطاء التي كانت تسبب مشاكل في استقرارية التطبيق، كما أجرينا تحسينات عامة لتحسين الاداء"},{"version_id":"14963533","version_name":"3.0.71","version_date":"2018-02-15 03:18:50.000 +0800","version_description":"We've added a new feature for prepaid users. Now they will be able to view and track their usage history, and we fixed some bugs to enhance performance.<br><br>.لقد قمنا باضافة خاصية جديدة في هذه النسخة لعملاء الدفع المسبق وهي معرفة وتتبع الاستهلاك، بالاضافة الى إصلاح لبعض الأخطاء لتحسين الاداء"},{"version_id":"14963533","version_name":"3.0.38","version_date":"2017-08-08 17:28:01.000 +0800","version_description":"- General Enhancements.<br>- Bug Fixes.<br><br>تحسينات عامة - <br>إصلاح اخطاء -"},{"version_id":"15093670","version_name":"2","version_date":"","version_description":""}]